{"1": "Robert Bell and Yehuda Koren. Scalable collaborative filtering with jointly derived neighborhood  interpolation weights. In ICDM, pages 43-52, 2007. doi: 10.1109/ICDM.2007.90.  Rajendra Bhatia. Matrix Analysis. Springer, 1997.  Srinadh Bhojanapalli and Prateek Jain. Universal matrix completion. In ICML, 2014.  Emmanuel J. Cand`es and Benjamin Recht. Exact matrix completion via convex optimization. Foun-  dations of Computational Mathematics, 9(6):717-772, December 2009.  Emmanuel J. Cand`es and Terence Tao. The power of convex relaxation: Near-optimal matrix com-  pletion. IEEE Trans. Inform. Theory, 56(5):2053-2080, 2009.  Yudong Chen, Srinadh Bhojanapalli, Sujay Sanghavi, and Rachel Ward. Coherent matrix comple- tion. In Proceedings of The 31st International Conference on Machine Learning, pages 674-682, 2014.  L´aszl´o Erdos, Antti Knowles, Horng-Tzer Yau, and Jun Yin. Spectral statistics of Erdos-R´enyi  graphs I: Local semicircle law. The Annals of Probability, 41(3B):2279-2375, 2013.  David F. Gleich and Lek-Heng Lim. Rank aggregation via nuclear norm minimization. In KDD,  pages 60-68, 2011.  2014.  Moritz Hardt. Understanding alternating minimization for matrix completion. In FOCS, 2014.  Moritz Hardt and May Wootters. Fast matrix completion without the condition number. In COLT,  Moritz Hardt, Raghu Meka, Prasad Raghavendra, and Benjamin Weitz. Computational limits for  matrix completion. In COLT, pages 703-725, 2014.  Cho-Jui Hsieh, Kai-Yang Chiang, and Inderjit S. Dhillon. Low rank modeling of signed networks.  In KDD, pages 507-515, 2012.  Prateek Jain, Raghu Meka, and Inderjit S. Dhillon. Guaranteed rank minimization via singular value  projection. In NIPS, pages 937-945, 2010.  Prateek Jain, Praneeth Netrapalli, and Sujay Sanghavi. Low-rank matrix completion using alternat- ing minimization. In Proceedings of the 45th annual ACM Symposium on theory of computing, pages 665-674. ACM, 2013.  Raghunandan H. Keshavan. Efficient algorithms for collaborative filtering. Phd Thesis, Stanford  University, 2012.  Raghunandan H. Keshavan, Andrea Montanari, and Sewoong Oh. Matrix completion from a few  entries. IEEE Transactions on Information Theory, 56(6):2980-2998, 2010.  Raghu Meka, Prateek Jain, and Inderjit S. Dhillon. Matrix completion from power-law distributed  samples. In NIPS, 2009.  13   FAST EXACT MATRIX COMPLETION WITH FINITE SAMPLES  References  Robert Bell and Yehuda Koren. Scalable collaborative filtering with jointly derived neighborhood  interpolation weights. In ICDM, pages 43-52, 2007. doi: 10.1109/ICDM.2007.90.  Rajendra Bhatia. Matrix Analysis. Springer, 1997.  Srinadh Bhojanapalli and Prateek Jain. Universal matrix completion. In ICML, 2014.  Emmanuel J. Cand`es and Benjamin Recht. Exact matrix completion via convex optimization. Foun-  dations of Computational Mathematics, 9(6):717-772, December 2009.  Emmanuel J. Cand`es and Terence Tao. The power of convex relaxation: Near-optimal matrix com-  pletion. IEEE Trans. Inform. Theory, 56(5):2053-2080, 2009.  Yudong Chen, Srinadh Bhojanapalli, Sujay Sanghavi, and Rachel Ward. Coherent matrix comple- tion. In Proceedings of The 31st International Conference on Machine Learning, pages 674-682, 2014.  L´aszl´o Erdos, Antti Knowles, Horng-Tzer Yau, and Jun Yin. Spectral statistics of Erdos-R´enyi  graphs I: Local semicircle law. The Annals of Probability, 41(3B):2279-2375, 2013.  David F. Gleich and Lek-Heng Lim. Rank aggregation via nuclear norm minimization. In KDD,  pages 60-68, 2011.  2014.  Moritz Hardt. Understanding alternating minimization for matrix completion. In FOCS, 2014.  Moritz Hardt and May Wootters. Fast matrix completion without the condition number. In COLT,  Moritz Hardt, Raghu Meka, Prasad Raghavendra, and Benjamin Weitz. Computational limits for  matrix completion. In COLT, pages 703-725, 2014.  Cho-Jui Hsieh, Kai-Yang Chiang, and Inderjit S. Dhillon. Low rank modeling of signed networks.  In KDD, pages 507-515, 2012.  Prateek Jain, Raghu Meka, and Inderjit S. Dhillon. Guaranteed rank minimization via singular value  projection. In NIPS, pages 937-945, 2010.  Prateek Jain, Praneeth Netrapalli, and Sujay Sanghavi. Low-rank matrix completion using alternat- ing minimization. In Proceedings of the 45th annual ACM Symposium on theory of computing, pages 665-674. ACM, 2013.  Raghunandan H. Keshavan. Efficient algorithms for collaborative filtering. Phd Thesis, Stanford  University, 2012.  Raghunandan H. Keshavan, Andrea Montanari, and Sewoong Oh. Matrix completion from a few  entries. IEEE Transactions on Information Theory, 56(6):2980-2998, 2010.  Raghu Meka, Prateek Jain, and Inderjit S. Dhillon. Matrix completion from power-law distributed  samples. In NIPS, 2009. JAIN NETRAPALLI  Benjamin Recht. A simple approach to matrix completion. JMLR, 2009.  Benjamin Recht and Christopher R´e. Parallel stochastic gradient algorithms for large-scale matrix  completion. Mathematical Programming Computation, 5(2):201-226, 2013.  Joel A. Tropp. User-friendly tail bounds for sums of random matrices. Foundations of Computa-  tional Mathematics, 12(4):389-434, 2012. FAST EXACT MATRIX COMPLETION WITH FINITE SAMPLES"}