{"1": "199-201, 1942.  L. Kantorovitch. On the translocation of masses. C. R. (Doklady) Acad. Sci. URSS (N.S.), 37:  Gaspard Monge. M´emoire sur la th´eorie des d´eblais et des remblais. Histoire de l’Acad´emie royale  des sciences, 1:666-704, 1781.  Gabriel Peyr´e and Marco Cuturi. Computational optimal transport. Technical report, 2017.  C´edric Villani. Optimal transport: old and new, volume 338. Springer Science & Business Media,  2008.  2   ESTIMATION OF SMOOTH DENSITIES IN WASSERSTEIN DISTANCE  away from 0. Indeed, we show that the optimal rate for general densities is strictly worse than the corresponding rate for densities bounded below, no matter the smoothness. Our bounds are obtained via a new technical result, which shows that if two probability measures on [0, 1]d have densities bounded away from zero, then the Wasserstein distance between them can be controlled by a Besov norm of negative smoothness.  Algorithmic aspects are an important part of optimal transport problems. For practical appli- cations, the proposed estimators must therefore also be computationally tractable. We describe a method to produce computationally tractable atomic estimators via resampling from any estimator that outperforms the empirical distribution, under minimal assumptions. We study the computa- tional cost of this method, compared to the cost of using the empirical distribution with n atoms, and exhibit a trade-off between computational cost and statistical precision.  References  199-201, 1942.  L. Kantorovitch. On the translocation of masses. C. R. (Doklady) Acad. Sci. URSS (N.S.), 37:  Gaspard Monge. M´emoire sur la th´eorie des d´eblais et des remblais. Histoire de l’Acad´emie royale  des sciences, 1:666-704, 1781.  Gabriel Peyr´e and Marco Cuturi. Computational optimal transport. Technical report, 2017.  C´edric Villani. Optimal transport: old and new, volume 338. Springer Science & Business Media,  2008."}