{"1": "Jacob Abernethy and Elad Hazan. Faster convex optimization: Simulated annealing with an ef- ficient universal barrier. In Proceedings of the 33rd International Conference on International Conference on Machine Learning - Volume 48, ICML’16, pages 2520-2528. JMLR.org, 2016. URL http://dl.acm.org/citation.cfm?id=3045390.3045656.  P.-A. Absil, R. Mahony, and R. Sepulchre. Optimization algorithms on matrix manifolds. Princeton University Press, Princeton, NJ, 2008. ISBN 978-0-691-13298-3. doi: 10.1515/9781400830244. URL https://doi.org/10.1515/9781400830244. With a foreword by Paul Van Dooren.  Zeyuan Allen-Zhu, Ankit Garg, Yuanzhi Li, Rafael Oliveira, and Avi Wigderson. Operator scaling via geodesically convex optimization, invariant theory and polynomial identity testing. In Pro- ceedings of the 50th Annual ACM SIGACT Symposium on Theory of Computing, pages 172-181. ACM, 2018.  Luigi Ambrosio, Nicola Gigli, and Giuseppe Savar´e. Bakry- ´Emery curvature-dimension condition and Riemannian Ricci curvature bounds. Ann. Probab., 43(1):339-404, 2015. ISSN 0091-1798. doi: 10.1214/14-AOP907. URL https://doi.org/10.1214/14-AOP907.  Dominique Bakry, Ivan Gentil, and Michel Ledoux. Analysis and geometry of Markov diffu- sion operators, volume 348 of Grundlehren der Mathematischen Wissenschaften [Fundamental Principles of Mathematical Sciences]. Springer, Cham, 2014. ISBN 978-3-319-00226-2; 978- 3-319-00227-9. doi: 10.1007/978-3-319-00227-9. URL https://doi.org/10.1007/ 978-3-319-00227-9.  Alexandre Belloni, Tengyuan Liang, Hariharan Narayanan, and Alexander Rakhlin. Escaping the local minima via simulated annealing: Optimization of approximately convex functions. In Con- ference on Learning Theory, pages 240-265, 2015.  Dimitris Bertsimas and Santosh Vempala. Solving convex programs by random walks. Journal of  the ACM (JACM), 51(4):540-556, 2004.  Michael Betancourt. A conceptual introduction to Hamiltonian Monte Carlo. arXiv preprint  arXiv:1701.02434, 2017.  Isaac Chavel. Riemannian geometry, volume 98 of Cambridge Studies in Advanced Mathemat- ics. Cambridge University Press, Cambridge, second edition, 2006. ISBN 978-0-521-61954-7; 0-521-61954-8. doi: 10.1017/CBO9780511616822. URL https://doi.org/10.1017/ CBO9780511616822. A modern introduction.  Jeff Cheeger and Detlef Gromoll. On the structure of complete manifolds of nonnegative curvature. Ann. of Math. (2), 96:413-443, 1972. ISSN 0003-486X. doi: 10.2307/1970819. URL https: //doi.org/10.2307/1970819.  Dario Cordero-Erausquin, Robert J. McCann, and Michael Schmuckenschl¨ager. Pr´ekopa-Leindler type inequalities on Riemannian manifolds, Jacobi fields, and optimal transport. Ann. Fac. Sci. Toulouse Math. (6), 15(4):613-635, 2006. ISSN 0240-2963. URL http://afst.cedram. org/item?id=AFST_2006_6_15_4_613_0.  13   SAMPLING AND OPTIMIZATION ON MANIFOLDS  References  Jacob Abernethy and Elad Hazan. Faster convex optimization: Simulated annealing with an ef- ficient universal barrier. In Proceedings of the 33rd International Conference on International Conference on Machine Learning - Volume 48, ICML’16, pages 2520-2528. JMLR.org, 2016. URL http://dl.acm.org/citation.cfm?id=3045390.3045656.  P.-A. Absil, R. Mahony, and R. Sepulchre. Optimization algorithms on matrix manifolds. Princeton University Press, Princeton, NJ, 2008. ISBN 978-0-691-13298-3. doi: 10.1515/9781400830244. URL https://doi.org/10.1515/9781400830244. With a foreword by Paul Van Dooren.  Zeyuan Allen-Zhu, Ankit Garg, Yuanzhi Li, Rafael Oliveira, and Avi Wigderson. Operator scaling via geodesically convex optimization, invariant theory and polynomial identity testing. In Pro- ceedings of the 50th Annual ACM SIGACT Symposium on Theory of Computing, pages 172-181. ACM, 2018.  Luigi Ambrosio, Nicola Gigli, and Giuseppe Savar´e. Bakry- ´Emery curvature-dimension condition and Riemannian Ricci curvature bounds. Ann. Probab., 43(1):339-404, 2015. ISSN 0091-1798. doi: 10.1214/14-AOP907. URL https://doi.org/10.1214/14-AOP907.  Dominique Bakry, Ivan Gentil, and Michel Ledoux. Analysis and geometry of Markov diffu- sion operators, volume 348 of Grundlehren der Mathematischen Wissenschaften [Fundamental Principles of Mathematical Sciences]. Springer, Cham, 2014. ISBN 978-3-319-00226-2; 978- 3-319-00227-9. doi: 10.1007/978-3-319-00227-9. URL https://doi.org/10.1007/ 978-3-319-00227-9.  Alexandre Belloni, Tengyuan Liang, Hariharan Narayanan, and Alexander Rakhlin. Escaping the local minima via simulated annealing: Optimization of approximately convex functions. In Con- ference on Learning Theory, pages 240-265, 2015.  Dimitris Bertsimas and Santosh Vempala. Solving convex programs by random walks. Journal of  the ACM (JACM), 51(4):540-556, 2004.  Michael Betancourt. A conceptual introduction to Hamiltonian Monte Carlo. arXiv preprint  arXiv:1701.02434, 2017.  Isaac Chavel. Riemannian geometry, volume 98 of Cambridge Studies in Advanced Mathemat- ics. Cambridge University Press, Cambridge, second edition, 2006. ISBN 978-0-521-61954-7; 0-521-61954-8. doi: 10.1017/CBO9780511616822. URL https://doi.org/10.1017/ CBO9780511616822. A modern introduction.  Jeff Cheeger and Detlef Gromoll. On the structure of complete manifolds of nonnegative curvature. Ann. of Math. (2), 96:413-443, 1972. ISSN 0003-486X. doi: 10.2307/1970819. URL https: //doi.org/10.2307/1970819.  Dario Cordero-Erausquin, Robert J. McCann, and Michael Schmuckenschl¨ager. Pr´ekopa-Leindler type inequalities on Riemannian manifolds, Jacobi fields, and optimal transport. Ann. Fac. Sci. Toulouse Math. (6), 15(4):613-635, 2006. ISSN 0240-2963. URL http://afst.cedram. org/item?id=AFST_2006_6_15_4_613_0. SAMPLING AND OPTIMIZATION ON MANIFOLDS  Persi Diaconis, Susan Holmes, and Mehrdad Shahshahani. Sampling from a manifold. In Advances in modern statistical theory and applications: a Festschrift in honor of Morris L. Eaton, vol- ume 10 of Inst. Math. Stat. (IMS) Collect., pages 102-125. Inst. Math. Statist., Beachwood, OH, 2013.  Simon Duane, Anthony D Kennedy, Brian J Pendleton, and Duncan Roweth. Hybrid Monte Carlo.  Physics letters B, 195(2):216-222, 1987.  Martin Dyer, Alan Frieze, and Ravi Kannan. A random polynomial-time algorithm for approximat- ing the volume of convex bodies. J. ACM, 38(1):1-17, January 1991. ISSN 0004-5411. doi: 10.1145/102782.102783. URL http://doi.acm.org/10.1145/102782.102783.  Matthieu Fradelizi and Olivier Gu´edon. The extreme points of subsets of s-concave probabil- ities and a geometric localization theorem. Discrete Comput. Geom., 31(2):327-335, 2004. ISSN 0179-5376. doi: 10.1007/s00454-003-2868-y. URL https://doi.org/10.1007/ s00454-003-2868-y.  Mark Girolami and Ben Calderhead. Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. Ser. B Stat. Methodol., 73(2):123-214, 2011. ISSN 1369-7412. doi: 10.1111/j.1467-9868.2010.00765.x. URL https://doi.org/10.1111/j.1467-9868. 2010.00765.x. With discussion and a reply by the authors.  Adam Tauman Kalai and Santosh Vempala. Simulated annealing for convex optimization. Mathe-  matics of Operations Research, 31(2):253-266, 2006.  Ravi Kannan, L´aszl´o Lov´asz, and Mikl´os Simonovits. Isoperimetric problems for convex bodies  and a localization lemma. Discrete & Computational Geometry, 13(3-4):541-559, 1995.  Bo’az Klartag. Needle decompositions in Riemannian geometry. Mem. Amer. Math. Soc., 249 (1180):v + 77, 2017. ISSN 0065-9266. doi: 10.1090/memo/1180. URL https://doi.org/ 10.1090/memo/1180.  Gilles Lebeau and Laurent Michel. Semi-classical analysis of a random walk on a manifold. Ann. ISSN 0091-1798. doi: 10.1214/09-AOP483. URL https:  Probab., 38(1):277-315, 2010. //doi.org/10.1214/09-AOP483.  Yin Tat Lee and Santosh S Vempala. Geodesic walks in polytopes.  In Proceedings of the 49th  Annual ACM SIGACT Symposium on Theory of Computing, pages 927-940. ACM, 2017.  Yin Tat Lee and Santosh S Vempala. Convergence rate of Riemannian Hamiltonian Monte Carlo and faster polytope volume computation. In Proceedings of the 50th Annual ACM SIGACT Sym- posium on Theory of Computing, pages 1115-1121. ACM, 2018.  Yin Tat Lee, Zhao Song, and Santosh S Vempala. Algorithmic theory of ODEs and sampling from  well-conditioned logconcave densities. arXiv preprint arXiv:1812.06243, 2018.  L´aszl´o Lov´asz. Hit-and-run mixes fast. Mathematical Programming, 86(3):443-461, 1999. SAMPLING AND OPTIMIZATION ON MANIFOLDS  L´aszl´o Lov´asz and Mikl´os Simonovits. The mixing rate of Markov chains, an isoperimetric inequal- ity, and computing the volume. In 31st Annual Symposium on Foundations of Computer Science, Vol. I, II (St. Louis, MO, 1990), pages 346-354. IEEE Comput. Soc. Press, Los Alamitos, CA, 1990. doi: 10.1109/FSCS.1990.89553. URL https://doi.org/10.1109/FSCS.1990. 89553.  L´aszl´o Lov´asz and Mikl´os Simonovits. Random walks in a convex body and an improved volume  algorithm. Random structures & algorithms, 4(4):359-412, 1993.  L´aszl´o Lov´asz and Santosh Vempala. Simulated annealing in convex bodies and an O∗(n4) volume algorithm. J. Comput. System Sci., 72(2):392-417, 2006. ISSN 0022-0000. doi: 10.1016/j.jcss. 2005.08.004. URL https://doi.org/10.1016/j.jcss.2005.08.004.  L´aszl´o Lov´asz and Santosh Vempala. Hit-and-run from a corner. SIAM Journal on Computing, 35  (4):985-1005, 2006.  L´aszl´o Lov´asz and Santosh Vempala. The geometry of logconcave functions and sampling algo-  rithms. Random Structures & Algorithms, 30(3):307-358, 2007.  Oren Mangoubi and Aaron Smith. Rapid mixing of hamiltonian monte carlo on strongly log-  concave distributions. arXiv preprint arXiv:1708.07114, 2017.  Oren Mangoubi and Aaron Smith. Rapid mixing of geodesic walks on manifolds with positive curvature. Ann. Appl. Probab., 28(4):2501-2543, 08 2018. doi: 10.1214/17-AAP1365. URL https://doi.org/10.1214/17-AAP1365.  Oren Mangoubi and Nisheeth Vishnoi. Dimensionally tight bounds for second-order hamilto- In S. Bengio, H. Wallach, H. Larochelle, K. Grauman, N. Cesa-Bianchi, nian monte carlo. and R. Garnett, editors, Advances in Neural Information Processing Systems 31, pages 6030-6040. Curran Associates, Inc., 2018. URL http://papers.nips.cc/paper/ 7842-dimensionally-tight-bounds-for-second-order-hamiltonian-monte-carlo. pdf.  Emanuel Milman. Isoperimetric bounds on convex manifolds. Concentration, functional inequali-  ties and isoperimetry, 545:195-208, 2011.  Radford M. Neal. MCMC using Hamiltonian dynamics.  In Handbook of Markov chain Monte Carlo, Chapman & Hall/CRC Handb. Mod. Stat. Methods, pages 113-162. CRC Press, Boca Raton, FL, 2011.  Yu. E. Nesterov and M. J. Todd. On the Riemannian geometry defined by self-concordant barriers and interior-point methods. Found. Comput. Math., 2(4):333-361, 2002. ISSN 1615-3375. doi: 10.1007/s102080010032. URL https://doi.org/10.1007/s102080010032.  Liviu I Nicolaescu. Lectures on the Geometry of Manifolds. World Scientific, 2007.  Mark D. Plumbley. Lie group methods for optimization with orthogonality constraints.  In Car- los G. Puntonet and Alberto Prieto, editors, Independent Component Analysis and Blind Signal Separation, pages 1245-1252, Berlin, Heidelberg, 2004. Springer Berlin Heidelberg. ISBN 978- 3-540-30110-3. SAMPLING AND OPTIMIZATION ON MANIFOLDS  Tam´as Rapcs´ak. Smooth nonlinear optimization in Rn, volume 19 of Nonconvex Optimization and its Applications. Kluwer Academic Publishers, Dordrecht, 1997. ISBN 0-7923-4680-7. doi: 10. 1007/978-1-4615-6357-0. URL https://doi.org/10.1007/978-1-4615-6357-0.  Alexander Rusciano. A Riemannian corollary of Helly’s theorem. arXiv preprint arXiv:1804.10738,  2018.  Suvrit Sra, Nisheeth K. Vishnoi, and Ozan Yildiz. On Geodesically Convex Formulations for the In Eric Blais, Klaus Jansen, Jos´e D. P. Rolim, and David Steurer, Brascamp-Lieb Constant. editors, Approximation, Randomization, and Combinatorial Optimization. Algorithms and Tech- niques (APPROX/RANDOM 2018), volume 116 of Leibniz International Proceedings in In- formatics (LIPIcs), pages 25:1-25:15, Dagstuhl, Germany, 2018. Schloss Dagstuhl-Leibniz- Zentrum fuer Informatik. ISBN 978-3-95977-085-9. doi: 10.4230/LIPIcs.APPROX-RANDOM. 2018.25. URL http://drops.dagstuhl.de/opus/volltexte/2018/9429.  Constantin Udris¸te. Convex functions and optimization methods on Riemannian manifolds, vol- ume 297 of Mathematics and its Applications. Kluwer Academic Publishers Group, Dordrecht, 1994. ISBN 0-7923-3002-1. doi: 10.1007/978-94-015-8390-9. URL https://doi.org/ 10.1007/978-94-015-8390-9.  Santosh Vempala. Geometric random walks: a survey. Combinatorial and computational geometry,  52(573-612):2, 2005.  Santosh S Vempala. Recent progress and open problems in algorithmic convex geometry. In LIPIcs- Leibniz International Proceedings in Informatics, volume 8. Schloss Dagstuhl-Leibniz-Zentrum fuer Informatik, 2010.  Nisheeth K Vishnoi. Geodesic Convex Optimization: Differentiation on Manifolds, Geodesics, and  Convexity. arXiv preprint arXiv:1806.06373, 2018.  Shing Tung Yau. Non-existence of continuous convex functions on certain Riemannian manifolds. Math. Ann., 207:269-270, 1974. ISSN 0025-5831. doi: 10.1007/BF01351342. URL https: //doi.org/10.1007/BF01351342.  Hongyi Zhang and Suvrit Sra. First-order methods for geodesically convex optimization. In Con-  ference on Learning Theory, pages 1617-1638, 2016.  Hongyi Zhang and Suvrit Sra. Towards Riemannian Accelerated Gradient Methods. arXiv preprint  arXiv:1806.02812, 2018.  Jingzhao Zhang, Hongyi Zhang, and Suvrit Sra. R-SPIDER: A Fast Riemannian Stochastic Opti- mization Algorithm with Curvature Independent Rate. arXiv preprint arXiv:1811.04194, 2018.  Junyu Zhang and Shuzhong Zhang. A cubic regularized Newton’s method over Riemannian mani-  folds. arXiv preprint arXiv:1805.05565, 2018. SAMPLING AND OPTIMIZATION ON MANIFOLDS"}