{"1": "Louigi Addario-Berry, Nicolas Broutin, Luc Devroye, and G´abor Lugosi. On combinatorial testing  problems. The Annals of Statistics, 38(5):3063-3092, 2010.  Noga Alon, Alexandr Andoni, Tali Kaufman, Kevin Matulef, Ronitt Rubinfeld, and Ning Xie. Test- In Proceedings of the thirty-ninth annual ACM  ing k-wise and almost k-wise independence. symposium on Theory of computing, pages 496-505. ACM, 2007.  Brendan PW Ames and Stephen A Vavasis. Nuclear norm minimization for the planted clique and  biclique problems. Mathematical programming, 129(1):69-89, 2011.  Ery Arias-Castro, Nicolas Verzelen, et al. Community detection in dense random networks. The  Annals of Statistics, 42(3):940-969, 2014.  Sivaraman Balakrishnan, Mladen Kolar, Alessandro Rinaldo, Aarti Singh, and Larry Wasserman. Statistical and computational tradeoffs in biclustering. In NIPS 2011 workshop on computational trade-offs in statistical learning, volume 4, 2011.  Quentin Berthet and Philippe Rigollet. Complexity theoretic lower bounds for sparse principal  component detection. In COLT, pages 1046-1066, 2013a.  Quentin Berthet and Philippe Rigollet. Optimal detection of sparse principal components in high  dimension. The Annals of Statistics, 41(4):1780-1815, 2013b.  Aditya Bhaskara, Moses Charikar, Eden Chlamtac, Uriel Feige, and Aravindan Vijayaraghavan. Detecting high log-densities: an o(n1/4) approximation for densest k-subgraph. Proceedings of the forty-second ACM symposium on Theory of computing, pages 201-210, 2010.  Matthew Brennan and Guy Bresler. Optimal average-case reductions to sparse pca: From weak  assumptions to strong hardness. arXiv preprint arXiv:1902.07380, 2019.  Matthew Brennan, Guy Bresler, and Wasim Huleihel. Reducibility and computational lower bounds  for problems with planted sparse structure. In COLT, pages 48-166, 2018.  Cristina Butucea and Yuri I Ingster. Detection of a sparse submatrix of a high-dimensional noisy  matrix. Bernoulli, 19(5B):2652-2688, 2013.  T Tony Cai, Tengyuan Liang, Alexander Rakhlin, et al. Computational and statistical boundaries for submatrix localization in a large noisy matrix. The Annals of Statistics, 45(4):1403-1430, 2017.  Utkan Onur Candogan and Venkat Chandrasekaran. Finding planted subgraphs with few eigenval-  ues using the schur-horn relaxation. SIAM Journal on Optimization, 28(1):735-759, 2018.  Yudong Chen. Incoherence-optimal matrix completion. IEEE Transactions on Information Theory,  61(5):2909-2923, 2015.  Yudong Chen and Jiaming Xu. Statistical-computational tradeoffs in planted problems and subma- trix localization with a growing number of clusters and submatrices. Journal of Machine Learning Research, 17(27):1-57, 2016.  13   UNIVERSAL REDUCTIONS TO SUBMATRIX DETECTION  References  Louigi Addario-Berry, Nicolas Broutin, Luc Devroye, and G´abor Lugosi. On combinatorial testing  problems. The Annals of Statistics, 38(5):3063-3092, 2010.  Noga Alon, Alexandr Andoni, Tali Kaufman, Kevin Matulef, Ronitt Rubinfeld, and Ning Xie. Test- In Proceedings of the thirty-ninth annual ACM  ing k-wise and almost k-wise independence. symposium on Theory of computing, pages 496-505. ACM, 2007.  Brendan PW Ames and Stephen A Vavasis. Nuclear norm minimization for the planted clique and  biclique problems. Mathematical programming, 129(1):69-89, 2011.  Ery Arias-Castro, Nicolas Verzelen, et al. Community detection in dense random networks. The  Annals of Statistics, 42(3):940-969, 2014.  Sivaraman Balakrishnan, Mladen Kolar, Alessandro Rinaldo, Aarti Singh, and Larry Wasserman. Statistical and computational tradeoffs in biclustering. In NIPS 2011 workshop on computational trade-offs in statistical learning, volume 4, 2011.  Quentin Berthet and Philippe Rigollet. Complexity theoretic lower bounds for sparse principal  component detection. In COLT, pages 1046-1066, 2013a.  Quentin Berthet and Philippe Rigollet. Optimal detection of sparse principal components in high  dimension. The Annals of Statistics, 41(4):1780-1815, 2013b.  Aditya Bhaskara, Moses Charikar, Eden Chlamtac, Uriel Feige, and Aravindan Vijayaraghavan. Detecting high log-densities: an o(n1/4) approximation for densest k-subgraph. Proceedings of the forty-second ACM symposium on Theory of computing, pages 201-210, 2010.  Matthew Brennan and Guy Bresler. Optimal average-case reductions to sparse pca: From weak  assumptions to strong hardness. arXiv preprint arXiv:1902.07380, 2019.  Matthew Brennan, Guy Bresler, and Wasim Huleihel. Reducibility and computational lower bounds  for problems with planted sparse structure. In COLT, pages 48-166, 2018.  Cristina Butucea and Yuri I Ingster. Detection of a sparse submatrix of a high-dimensional noisy  matrix. Bernoulli, 19(5B):2652-2688, 2013.  T Tony Cai, Tengyuan Liang, Alexander Rakhlin, et al. Computational and statistical boundaries for submatrix localization in a large noisy matrix. The Annals of Statistics, 45(4):1403-1430, 2017.  Utkan Onur Candogan and Venkat Chandrasekaran. Finding planted subgraphs with few eigenval-  ues using the schur-horn relaxation. SIAM Journal on Optimization, 28(1):735-759, 2018.  Yudong Chen. Incoherence-optimal matrix completion. IEEE Transactions on Information Theory,  61(5):2909-2923, 2015.  Yudong Chen and Jiaming Xu. Statistical-computational tradeoffs in planted problems and subma- trix localization with a growing number of clusters and submatrices. Journal of Machine Learning Research, 17(27):1-57, 2016. UNIVERSAL REDUCTIONS TO SUBMATRIX DETECTION  Eden Chlamtac, Michael Dinitz, and Robert Krauthgamer. Everywhere-sparse spanners via dense subgraphs. In Foundations of Computer Science (FOCS), 2012 IEEE 53rd Annual Symposium on, pages 758-767. IEEE, 2012.  Eden Chlamt´aˇc, Michael Dinitz, and Yury Makarychev. Minimizing the union: Tight approxi- mations for small set bipartite vertex expansion. In Proceedings of the Twenty-Eighth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 881-899. SIAM, 2017.  E. Chlamt´aˇc and P. Manurangsi. Sherali-adams integrality gaps matching the log-density threshold.  arXiv preprint arXiv:1804.07842, 2018.  Yael Dekel, Ori Gurel-Gurevich, and Yuval Peres. Finding hidden cliques in linear time with high  probability. Combinatorics, Probability and Computing, 23(1):29-49, 2014.  Yash Deshpande and Andrea Montanari. Finding hidden cliques of size(cid:112)N/e in nearly linear time.  Foundations of Computational Mathematics, 15(4):1069-1128, 2015.  Yash Deshpande, Emmanuel Abbe, and Andrea Montanari. Asymptotic mutual information for the  two-groups stochastic block model. arXiv preprint arXiv:1507.08685, 2015.  Uriel Feige and Robert Krauthgamer. Finding and certifying a large hidden clique in a semirandom  graph. Random Structures and Algorithms, 16(2):195-208, 2000.  Uriel Feige and Dorit Ron. Finding hidden cliques in linear time. In 21st International Meeting on Probabilistic, Combinatorial, and Asymptotic Methods in the Analysis of Algorithms (AofA’10), pages 189-204. Discrete Mathematics and Theoretical Computer Science, 2010.  Chao Gao, Zongming Ma, and Harrison H Zhou. Sparse cca: Adaptive estimation and computa-  tional barriers. The Annals of Statistics, 45(5):2074-2101, 2017.  Bruce Hajek, Yihong Wu, and Jiaming Xu. Achieving exact cluster recovery threshold via semidef-  inite programming. IEEE Transactions on Information Theory, 62(5):2788-2797, 2016a.  Bruce Hajek, Yihong Wu, and Jiaming Xu. Semidefinite programs for exact recovery of a hidden  community. In Conference on Learning Theory, pages 1051-1095, 2016b.  Bruce Hajek, Yihong Wu, and Jiaming Xu. Information limits for recovering a hidden community.  IEEE Transactions on Information Theory, 63(8):4729-4745, 2017.  Bruce E Hajek, Yihong Wu, and Jiaming Xu. Computational lower bounds for community detection  on random graphs. In COLT, pages 899-928, 2015.  Kumar Joag-Dev and Frank Proschan. Negative association of random variables with applications.  The Annals of Statistics, pages 286-295, 1983.  Pascal Koiran and Anastasios Zouzias. Hidden cliques and the certification of the restricted isometry  property. IEEE Transactions on Information Theory, 60(8):4999-5006, 2014.  Mladen Kolar, Sivaraman Balakrishnan, Alessandro Rinaldo, and Aarti Singh. Minimax localization of structural information in large noisy matrices. In Advances in Neural Information Processing Systems, pages 909-917, 2011. UNIVERSAL REDUCTIONS TO SUBMATRIX DETECTION  Florent Krzakala, Jiaming Xu, and Lenka Zdeborov´a. Mutual information in rank-one matrix esti-  mation. In 2016 IEEE Information Theory Workshop (ITW), pages 71-75. IEEE, 2016.  Thibault Lesieur, Florent Krzakala, and Lenka Zdeborov´a. Mmse of probabilistic low-rank ma- trix estimation: Universality with respect to the output channel. In 2015 53rd Annual Allerton Conference on Communication, Control, and Computing (Allerton), pages 680-687. IEEE, 2015.  Zongming Ma and Yihong Wu. Computational barriers in minimax submatrix detection. The Annals  of Statistics, 43(3):1089-1116, 2015.  Frank McSherry. Spectral partitioning of random graphs.  In Foundations of Computer Science,  2001. Proceedings. 42nd IEEE Symposium on, pages 529-537. IEEE, 2001.  Andrea Montanari. Finding one community in a sparse graph. Journal of Statistical Physics, 161  (2):273-299, 2015.  Andrea Montanari, Daniel Reichman, and Ofer Zeitouni. On the limitation of spectral methods: From the gaussian hidden clique problem to rank-one perturbations of gaussian tensors. In Ad- vances in Neural Information Processing Systems, pages 217-225, 2015.  Andrey A Shabalin, Victor J Weigman, Charles M Perou, Andrew B Nobel, et al. Finding large average submatrices in high dimensional data. The Annals of Applied Statistics, 3(3):985-1012, 2009.  Nicolas Verzelen, Ery Arias-Castro, et al. Community detection in sparse random networks. The  Annals of Applied Probability, 25(6):3465-3510, 2015.  Tengyao Wang, Quentin Berthet, and Yaniv Plan. Average-case hardness of rip certification. In  Advances in Neural Information Processing Systems, pages 3819-3827, 2016a.  Tengyao Wang, Quentin Berthet, and Richard J Samworth. Statistical and computational trade-offs in estimation of sparse principal components. The Annals of Statistics, 44(5):1896-1930, 2016b.  Yihong Wu and Jiaming Xu. Statistical problems with planted structures: Information-theoretical  and computational limits. arXiv preprint arXiv:1806.00118, 2018. UNIVERSAL REDUCTIONS TO SUBMATRIX DETECTION  ContentsIntroduction  2 Submatrix Problems and Conditions for Universality  3 Summary of Results  4 Overview of Average-Case Reduction Techniques  A Notation  B Average-Case Reductions in Total Variation  C Multivariate Rejection Kernels  D Average-Case Reduction to Submatrix Detection  E Computational Barriers in Submatrix Detection  F Statistical Limit of Submatrix Detection  G The Universality Classes UC-A, UC-B and UC-C  H Further Questions41017264451 UNIVERSAL REDUCTIONS TO SUBMATRIX DETECTION"}