{"1": "M. Alekhnovich, M. Braverman, V. Feldman, A. Klivans, and T. Pitassi. The complexity of properly  learning simple classes. Journal of Computer and System Sciences, 74(1):16-34, 2008.  D. Angluin. Queries and concept learning. Machine Learning, 2:319-342, 1988.  J. Aslam and S. Decatur. General bounds on statistical query learning and pac learning with noise  via hypothesis boosting. Information and Computation, 141(2):85-118, 1998.  J. Balc´azar, J. Castro, D. Guijarro, J. K¨obler, and W. Lindner. A general dimension for query  learning. Journal of Computer and System Sciences, 73(6):924-940, 2007.  N. Bansal, A. Blum, and S. Chawla. Correlation clustering. In Proceedings of FOCS, pages 238-  S. Ben-David, A. Itai, and E. Kushilevitz. Learning by distances. In Proceedings of COLT, pages  247, 2002.  232-245, 1990.  A. Blum, M. Furst, J. Jackson, M. Kearns, Y. Mansour, and S. Rudich. Weakly learning DNF and characterizing statistical query learning using Fourier analysis. In Proceedings of STOC, pages 253-262, 1994.  A. Blum, A. Frieze, R. Kannan, and S. Vempala. A polynomial time algorithm for learning noisy  linear threshold functions. Algorithmica, 22(1/2):35-52, 1997.  A. Blum, A. Kalai, and H. Wasserman. Noise-tolerant learning, the parity problem, and the statisti-  cal query model. Journal of the ACM, 50(4):506-519, 2003.  A. Blum, C. Dwork, F. McSherry, and K. Nissim. Practical privacy: the SuLQ framework.  In  Proceedings of PODS, pages 128-138, 2005.  N. Bshouty and V. Feldman. On using extended statistical queries to avoid membership queries.  Journal of Machine Learning Research, 2:359-395, 2002. ISSN 1533-7928.  N. Bshouty, R. Cleve, R. Gavald`a, S. Kannan, and C. Tamon. Oracles and queries that are sufficient  for exact learning. J. Comput. Syst. Sci., 52(3):421-433, 1996.  16.12   FELDMAN KANADE  a string of the form (φ, ζ(φ)), it is not possible to verify that ζ(φ) is indeed the lexicographically first satisfying assignment to φ unless P = NP. We note however that even then these classes can be learned with access to an NP-oracle because C1, C2, C3 ∈ PNP, i.e. with access to an NP-oracle, the lexicographically first satisfying assignments can be constructed (one bit at a time).  Remark 11 Under stronger cryptographic assumptions, we can construct classes C(cid:48) 3 ∈ P that are also not efficiently learnable in the respective statistical query models. The functions constructed can be of the form (s(z), z), where s(z) is easy to find information and s is a one-way permutation (that is cannot be inverted efficiently). An additional implication of such constructions is average-case computational hardness: learning is hard for most functions in C(cid:48)  2, C(cid:48)  1, C(cid:48)  1/C(cid:48)  2/C(cid:48) 3.  References  M. Alekhnovich, M. Braverman, V. Feldman, A. Klivans, and T. Pitassi. The complexity of properly  learning simple classes. Journal of Computer and System Sciences, 74(1):16-34, 2008.  D. Angluin. Queries and concept learning. Machine Learning, 2:319-342, 1988.  J. Aslam and S. Decatur. General bounds on statistical query learning and pac learning with noise  via hypothesis boosting. Information and Computation, 141(2):85-118, 1998.  J. Balc´azar, J. Castro, D. Guijarro, J. K¨obler, and W. Lindner. A general dimension for query  learning. Journal of Computer and System Sciences, 73(6):924-940, 2007.  N. Bansal, A. Blum, and S. Chawla. Correlation clustering. In Proceedings of FOCS, pages 238-  S. Ben-David, A. Itai, and E. Kushilevitz. Learning by distances. In Proceedings of COLT, pages  247, 2002.  232-245, 1990.  A. Blum, M. Furst, J. Jackson, M. Kearns, Y. Mansour, and S. Rudich. Weakly learning DNF and characterizing statistical query learning using Fourier analysis. In Proceedings of STOC, pages 253-262, 1994.  A. Blum, A. Frieze, R. Kannan, and S. Vempala. A polynomial time algorithm for learning noisy  linear threshold functions. Algorithmica, 22(1/2):35-52, 1997.  A. Blum, A. Kalai, and H. Wasserman. Noise-tolerant learning, the parity problem, and the statisti-  cal query model. Journal of the ACM, 50(4):506-519, 2003.  A. Blum, C. Dwork, F. McSherry, and K. Nissim. Practical privacy: the SuLQ framework.  In  Proceedings of PODS, pages 128-138, 2005.  N. Bshouty and V. Feldman. On using extended statistical queries to avoid membership queries.  Journal of Machine Learning Research, 2:359-395, 2002. ISSN 1533-7928.  N. Bshouty, R. Cleve, R. Gavald`a, S. Kannan, and C. Tamon. Oracles and queries that are sufficient  for exact learning. J. Comput. Syst. Sci., 52(3):421-433, 1996.  16.12   COMPUTATIONAL BOUNDS ON STATISTICAL QUERY LEARNING  T. Bylander. Learning linear threshold functions in the presence of classification noise. In Proceed-  ings of COLT, pages 340-347, 1994.  C. Chu, S. Kim, Y. Lin, Y. Yu, G. Bradski, A. Ng, and K. Olukotun. Map-reduce for machine  learning on multicore. In Proceedings of NIPS, pages 281-288, 2006.  S. Decatur. Statistical queries and faulty pac oracles.  In Proceedings of the Sixth Workshop on  Computational Learning Theory, pages 262-268, 1993.  Rod G. Downey and Michael R. Fellows. Fixed-parameter tractability and completeness i: Basic  results. SIAM J. Comput., 24:873-921, August 1995. ISSN 0097-5397.  J. Dunagan and S. Vempala. A simple polynomial-time rescaling algorithm for solving linear pro-  grams. In Proceedings of STOC, pages 315-320, 2004.  V. Feldman. Evolvability from learning algorithms. In Proceedings of STOC, pages 619-628, 2008.  V. Feldman. Robustness of evolvability. In Proceedings of COLT, pages 277-292, 2009a.  V. Feldman. A complete characterization of statistical query learning with applications to evolv-  ability. In Proceedings of FOCS, pages 375-384, 2009b.  V. Feldman. Distribution-independent evolvability of linear threshold functions. Journal of Machine  Learning Research - COLT Proceedings, 19:253-272, 2011.  V. Feldman, H. Lee, and R. Servedio. Lower bounds and hardness amplification for learning shallow monotone formulas. Journal of Machine Learning Research - COLT Proceedings, 19:273-292, 2011.  A. Gupta, M. Hardt, A. Roth, and J. Ullman. Privately releasing conjunctions and the statistical  query barrier. In STOC, pages 803-812, 2011.  J. Jackson, E. Shamir, and C. Shwartzman. Learning with queries corrupted by classification noise. In Proceedings of the Fifth Israel Symposium on the Theory of Computing Systems, pages 45-53, 1997.  M. Kallweit and H. Simon. A close look to margin complexity and related parameters. Journal of  Machine Learning Research - COLT Proceedings, 19:437-456, 2011.  S. Kasiviswanathan, H. Lee, K. Nissim, S. Raskhodnikova, and A. Smith. What can we learn  privately? In Proceedings of FOCS, pages 531-540, 2008.  M. Kearns and L. Valiant. Cryptographic limitations on learning boolean formulae and finite au-  tomata. Journal of the ACM, 41(1):67-95, 1994.  M. Kearns and U. Vazirani. An introduction to computational learning theory. MIT Press, Cam-  Michael Kearns. Efficient noise-tolerant learning from statistical queries. Journal of the ACM, 45  bridge, MA, 1994.  (6):983-1006, 1998.  16.13   FELDMAN KANADE  M. Kharitonov. Cryptographic lower bounds for learnability of boolean functions on the uniform  distribution. Journal of Computer and System Sciences, 50:600-610, 1995.  A. Klivans and A. Sherstov. Unconditional lower bounds for learning intersections of halfspaces.  Machine Learning, 69(2-3):97-114, 2007.  E. Kushilevitz and Y. Mansour. Learning decision trees using the Fourier spectrum. SIAM Journal  on Computing, 22(6):1331-1348, 1993.  Y. Mansour. Learning boolean functions via the fourier transform. In V. P. Roychodhury, K. Y. Siu, and A. Orlitsky, editors, Theoretical Advances in Neural Computation and Learning, pages 391-424. Kluwer, 1994.  R. O’Donnell. Computational Applications of Noise Sensitivity. PhD thesis, MIT, 2003. URL  citeseer.ist.psu.edu/630676.html.  R. Servedio. Computational sample complexity and attribute-efficient learning. Journal of Com-  puter and System Sciences, 60(1):161-178, 2000.  A. A. Sherstov. Halfspace matrices. In Proceedings of Conference on Computational Complexity,  pages 83-95, 2007.  H. Simon. Spectral norm in learning theory: Some selected topics. In Proceedings of Algorithmic  Learning Theory, pages 13-27, 2006.  H. Simon. A characterization of strong learnability in the statistical query model. In Proceedings  of Symposium on Theoretical Aspects of Computer Science, pages 393-404, 2007.  B. Sz¨or´enyi. Characterizing statistical query learning:simplified notions and proofs. In Proceedings  of ALT, pages 186-200, 2009.  L. G. Valiant. A theory of the learnable. Communications of the ACM, 27(11):1134-1142, 1984.  L. G. Valiant. Evolvability. Journal of the ACM, 56(1):3.1-3.21, 2009. Earlier version in ECCC,  2006.  ences, 70(4):485-509, 2005.  Ke Yang. New lower bounds for statistical query learning. Journal of Computer and System Sci-  16.14   COMPUTATIONAL BOUNDS ON STATISTICAL QUERY LEARNING"}