{"1": "Zeyuan Allen-Zhu, Yuanzhi Li, Aarti Singh, and Yining Wang. Near-optimal design of experiments via regret minimization. In Doina Precup and Yee Whye Teh, editors, Proceedings of the 34th In- ternational Conference on Machine Learning, ICML 2017, Sydney, NSW, Australia, 6-11 August 2017, volume 70 of Proceedings of Machine Learning Research, pages 126-135. PMLR, 2017.  Anthony Atkinson, Alexander Donev, and Randall Tobias. Optimum experimental designs, with  SAS, volume 34. Oxford University Press, 2007.  Haim Avron and Christos Boutsidis. Faster subset selection for matrices and applications. SIAM  Journal on Matrix Analysis and Applications, 34(4):1464-1499, 2013.  Dennis S Bernstein. Matrix mathematics: Theory, facts, and formulas with application to linear  systems theory, volume 41. Princeton university press Princeton, 2005.  Mustapha Bouhtou, Stephane Gaubert, and Guillaume Sagnol. Submodularity and randomized rounding techniques for optimal experimental design. Electronic Notes in Discrete Mathematics, 36:679-686, 2010.  Stephen Boyd and Lieven Vandenberghe. Convex optimization. Cambridge university press, 2004.  Ali C¸ ivril and Malik Magdon-Ismail. On selecting a maximum volume sub-matrix of a matrix and  related problems. Theoretical Computer Science, 410(47-49):4801-4811, 2009.  R Dennis Cook and Christopher J Nachtrheim. A comparison of algorithms for constructing exact  D-optimal designs. Technometrics, 22(3):315-324, 1980.  Michał Derezi´nski and Manfred K Warmuth. Subsampling for ridge regression via regularized  volume sampling. arXiv preprint arXiv:1710.05110, 2017.  Petros Drineas, Malik Magdon-Ismail, Michael W Mahoney, and David P Woodruff. Fast approx- imation of matrix coherence and statistical leverage. Journal of Machine Learning Research, 13 (Dec):3475-3506, 2012.  Walter Theodore Federer et al. Experimental design. Macmillan Co., New York and London, 1955.  Valerii Vadimovich Fedorov. Theory of optimal experiments. Elsevier, 1972.  David A Harville. Matrix algebra from a statistician’s perspective, volume 1. Springer, 1997.  Carl D Meyer, Jr. Generalized inversion of modified matrices.  SIAM Journal on Applied Mathe-  matics, 24(3):315-323, 1973.  Alan J Miller and Nam-Ky Nguyen. Algorithm as 295: A fedorov exchange algorithm for D-optimal design. Journal of the royal statistical society. series c (applied statistics), 43(4):669-677, 1994.  Toby J Mitchell and FL Miller Jr. Use of design repair to construct designs for special linear models.  Math. Div. Ann. Progr. Rept.(ORNL-4661), 13, 1970.  Nam-Ky Nguyen and Alan J Miller. A review of some exchange algorithms for constructing discrete  D-optimal designs. Computational Statistics & Data Analysis, 14(4):489-498, 1992.  13   COMBINATORIAL ALGORITHMS FOR OPTIMAL DESIGN  References  Zeyuan Allen-Zhu, Yuanzhi Li, Aarti Singh, and Yining Wang. Near-optimal design of experiments via regret minimization. In Doina Precup and Yee Whye Teh, editors, Proceedings of the 34th In- ternational Conference on Machine Learning, ICML 2017, Sydney, NSW, Australia, 6-11 August 2017, volume 70 of Proceedings of Machine Learning Research, pages 126-135. PMLR, 2017.  Anthony Atkinson, Alexander Donev, and Randall Tobias. Optimum experimental designs, with  SAS, volume 34. Oxford University Press, 2007.  Haim Avron and Christos Boutsidis. Faster subset selection for matrices and applications. SIAM  Journal on Matrix Analysis and Applications, 34(4):1464-1499, 2013.  Dennis S Bernstein. Matrix mathematics: Theory, facts, and formulas with application to linear  systems theory, volume 41. Princeton university press Princeton, 2005.  Mustapha Bouhtou, Stephane Gaubert, and Guillaume Sagnol. Submodularity and randomized rounding techniques for optimal experimental design. Electronic Notes in Discrete Mathematics, 36:679-686, 2010.  Stephen Boyd and Lieven Vandenberghe. Convex optimization. Cambridge university press, 2004.  Ali C¸ ivril and Malik Magdon-Ismail. On selecting a maximum volume sub-matrix of a matrix and  related problems. Theoretical Computer Science, 410(47-49):4801-4811, 2009.  R Dennis Cook and Christopher J Nachtrheim. A comparison of algorithms for constructing exact  D-optimal designs. Technometrics, 22(3):315-324, 1980.  Michał Derezi´nski and Manfred K Warmuth. Subsampling for ridge regression via regularized  volume sampling. arXiv preprint arXiv:1710.05110, 2017.  Petros Drineas, Malik Magdon-Ismail, Michael W Mahoney, and David P Woodruff. Fast approx- imation of matrix coherence and statistical leverage. Journal of Machine Learning Research, 13 (Dec):3475-3506, 2012.  Walter Theodore Federer et al. Experimental design. Macmillan Co., New York and London, 1955.  Valerii Vadimovich Fedorov. Theory of optimal experiments. Elsevier, 1972.  David A Harville. Matrix algebra from a statistician’s perspective, volume 1. Springer, 1997.  Carl D Meyer, Jr. Generalized inversion of modified matrices.  SIAM Journal on Applied Mathe-  matics, 24(3):315-323, 1973.  Alan J Miller and Nam-Ky Nguyen. Algorithm as 295: A fedorov exchange algorithm for D-optimal design. Journal of the royal statistical society. series c (applied statistics), 43(4):669-677, 1994.  Toby J Mitchell and FL Miller Jr. Use of design repair to construct designs for special linear models.  Math. Div. Ann. Progr. Rept.(ORNL-4661), 13, 1970.  Nam-Ky Nguyen and Alan J Miller. A review of some exchange algorithms for constructing discrete  D-optimal designs. Computational Statistics & Data Analysis, 14(4):489-498, 1992. COMBINATORIAL ALGORITHMS FOR OPTIMAL DESIGN  Aleksandar Nikolov, Mohit Singh, and Uthaipon Tao Tantipongpipat. Proportional volume sampling In Proceedings of the Thirtieth Annual  and approximation algorithms for A-optimal design. ACM-SIAM Symposium on Discrete Algorithms, pages 1369-1386. SIAM, 2019.  Friedrich Pukelsheim. Optimal design of experiments. SIAM, 2006.  Guillaume Sagnol and Radoslav Harman. Computing exact d-optimal designs by mixed integer  second-order cone programming. The Annals of Statistics, 43(5):2198-2224, 2015.  Alexander Schrijver. Theory of linear and integer programming. John Wiley & Sons, 1998.  Mohit Singh and Weijun Xie. Approximate positive correlated distributions and approximation  algorithms for D-optimal design. To appear in SODA, 2018.  Yining Wang, Adams Wei Yu, and Aarti Singh. On computationally tractable selection of experi-  ments in regression models. arXiv preprint arXiv:1601.02068, 2016.  William J Welch. Algorithmic complexity:  three np-hard problems in computational statistics.  Journal of Statistical Computation and Simulation, 15(1):17-25, 1982."}