{"1": "Zeyuan Allen-Zhu, Yuanzhi Li, Aarti Singh, and Yining Wang. Near-optimal design of experiments In International Conference on Machine Learning, pages 126-135,  via regret minimization. 2017.  Alexandr Andoni, Chengyu Lin, Ying Sheng, Peilin Zhong, and Ruiqi Zhong. Subspace embedding and linear regression with Orlicz norm. In International Conference on Machine Learning, pages 224-233, 2018.  Kurt M Anstreicher. Improved complexity for maximum volume inscribed ellipsoids. SIAM Journal  on Optimization, 13(2):309-320, 2002.  Corwin L Atwood. Optimal and efficient designs of experiments. The Annals of Mathematical  Statistics, pages 1570-1602, 1969.  Christos Boutsidis and David P Woodruff. Optimal CUR matrix decompositions. In Proceedings of the 46th Annual ACM Symposium on Theory of Computing (STOC), pages 353-362. ACM, https://arxiv.org/pdf/1405.7910, 2014.  Stephen Boyd and Lieven Vandenberghe. Convex optimization. Cambridge University Press, Cam-  bridge, 2004.  Sébastien Bubeck, Nicolo Cesa-Bianchi, and Sham Kakade. Towards minimax policies for online linear optimization with bandit feedback. In Annual Conference on Learning Theory, volume 23, pages 41-1. Microtome, 2012.  Michal ˇCern`y and Milan Hladík. Two complexity results on C-optimality in experimental design.  Computational Optimization and Applications, 51(3):1397-1408, 2012.  Yuansi Chen, Raaz Dwivedi, Martin J Wainwright, and Bin Yu. Fast MCMC sampling algorithms  on polytopes. The Journal of Machine Learning Research, 19(1):2146-2231, 2018.  3. However, the reported results in Table 3 are only on 35 of these 39 models. For two of the instances, our algorithm fails due to numerical issues in the Cholesky factorization; this could likely be fixed by padding the matrix B(cid:48) · B with a small multiple of the identity matrix, but we ignored this issue for cleanliness of the code. Two other instances take too long for the other implementations. Thus, all 4 sets of results for Netlib small were run on the same 35 models.  4. However, similar to the Netlib small case, two of the cases fail our method due to numerical issues with the Cholesky  factorization.  11   A NEAR-OPTIMAL ALGORITHM FOR APPROXIMATING THE JOHN ELLIPSOID  with respect to the analytic center in the dual space. 393 of the 109 models in the dataset satisfy these conditions.  7. Netlib large: We consider those Netlib polytopes that satisfy the same conditions as Netlib  small, but have m + n ∈ [104, 5 · 104]. 5 Netlib polytopes satisfy these conditions. 4  We thank Zhao Song for his generous help on this paper.  Acknowledgments  References  Zeyuan Allen-Zhu, Yuanzhi Li, Aarti Singh, and Yining Wang. Near-optimal design of experiments In International Conference on Machine Learning, pages 126-135,  via regret minimization. 2017.  Alexandr Andoni, Chengyu Lin, Ying Sheng, Peilin Zhong, and Ruiqi Zhong. Subspace embedding and linear regression with Orlicz norm. In International Conference on Machine Learning, pages 224-233, 2018.  Kurt M Anstreicher. Improved complexity for maximum volume inscribed ellipsoids. SIAM Journal  on Optimization, 13(2):309-320, 2002.  Corwin L Atwood. Optimal and efficient designs of experiments. The Annals of Mathematical  Statistics, pages 1570-1602, 1969.  Christos Boutsidis and David P Woodruff. Optimal CUR matrix decompositions. In Proceedings of the 46th Annual ACM Symposium on Theory of Computing (STOC), pages 353-362. ACM, https://arxiv.org/pdf/1405.7910, 2014.  Stephen Boyd and Lieven Vandenberghe. Convex optimization. Cambridge University Press, Cam-  bridge, 2004.  Sébastien Bubeck, Nicolo Cesa-Bianchi, and Sham Kakade. Towards minimax policies for online linear optimization with bandit feedback. In Annual Conference on Learning Theory, volume 23, pages 41-1. Microtome, 2012.  Michal ˇCern`y and Milan Hladík. Two complexity results on C-optimality in experimental design.  Computational Optimization and Applications, 51(3):1397-1408, 2012.  Yuansi Chen, Raaz Dwivedi, Martin J Wainwright, and Bin Yu. Fast MCMC sampling algorithms  on polytopes. The Journal of Machine Learning Research, 19(1):2146-2231, 2018.  3. However, the reported results in Table 3 are only on 35 of these 39 models. For two of the instances, our algorithm fails due to numerical issues in the Cholesky factorization; this could likely be fixed by padding the matrix B(cid:48) · B with a small multiple of the identity matrix, but we ignored this issue for cleanliness of the code. Two other instances take too long for the other implementations. Thus, all 4 sets of results for Netlib small were run on the same 35 models.  4. However, similar to the Netlib small case, two of the cases fail our method due to numerical issues with the Cholesky  factorization. A NEAR-OPTIMAL ALGORITHM FOR APPROXIMATING THE JOHN ELLIPSOID  Kenneth L Clarkson and David P Woodruff. Low rank approximation and regression in input spar- sity time. In Proceedings of the forty-fifth annual ACM symposium on Theory of computing, pages 81-90. ACM, 2013.  Kenneth L Clarkson and David P Woodruff. Sketching for M-estimators: A unified approach to robust regression. In Proceedings of the twenty-sixth annual ACM-SIAM symposium on Discrete algorithms, pages 921-939. Society for Industrial and Applied Mathematics, 2015a.  Kenneth L Clarkson and David P Woodruff. Input sparsity and hardness for robust subspace ap- proximation. In 2015 IEEE 56th Annual Symposium on Foundations of Computer Science, pages 310-329. IEEE, 2015b.  Michael B Cohen and Richard Peng. (cid:96)p row sampling by Lewis Weights. In Proceedings of the forty-seventh annual ACM symposium on Theory of computing, pages 183-192. ACM, 2015.  Michael B. Cohen, Rasmus Kyng, Gary L. Miller, Jakub W. Pachocki, Richard Peng, Anup B. Rao, and Shen Chen Xu. Solving SDD linear systems in nearly mlog1/2n time. In Proceedings of the Forty-sixth Annual ACM Symposium on Theory of Computing, STOC ’14, 2014.  Michael B Cohen, Sam Elder, Cameron Musco, Christopher Musco, and Madalina Persu. Dimen- sionality reduction for k-means clustering and low rank approximation. In Proceedings of the forty-seventh annual ACM symposium on Theory of computing, pages 163-172. ACM, 2015a.  Michael B Cohen, Yin Tat Lee, Cameron Musco, Christopher Musco, Richard Peng, and Aaron Sidford. Uniform sampling for matrix approximation. In Proceedings of the 2015 Conference on Innovations in Theoretical Computer Science, pages 181-190. ACM, 2015b.  Samuel I Daitch and Daniel A Spielman. Faster approximate lossy generalized ﬂow via interior point algorithms. In Proceedings of the fortieth annual ACM symposium on Theory of computing, pages 451-460. ACM, 2008.  S Damla Ahipasaoglu, Peng Sun, and Michael J Todd. Linear convergence of a modified Frank- Wolfe algorithm for computing minimum-volume enclosing ellipsoids. Optimisation Methods and Software, 23(1):5-19, 2008.  Huaian Diao, Zhao Song, Wen Sun, and David Woodruff. Sketching for kronecker product regres- sion and p-splines. In International Conference on Artificial Intelligence and Statistics, pages 1299-1308, 2018.  Huaian Diao, Zhao Song, David Woodruff, and Xin Yang. Total least squares regression in input  sparsity time. In Manuscript, 2019.  Petros Drineas, Malik Magdon-Ismail, Michael W Mahoney, and David P Woodruff. Fast approx- imation of matrix coherence and statistical leverage. Journal of Machine Learning Research, 13 (Dec):3475-3506, 2012.  Izrail Solomonovich Gradshteyn and Iosif Moiseevich Ryzhik. Table of integrals, series, and prod-  ucts. Academic press, 2014.  Adam Gustafson and Hariharan Narayanan. John’s walk. arXiv preprint arXiv:1803.02032, 2018. A NEAR-OPTIMAL ALGORITHM FOR APPROXIMATING THE JOHN ELLIPSOID  David H Gutman and Javier F Peña. A unified framework for bregman proximal methods: subgra-  dient, gradient, and accelerated gradient schemes. arXiv preprint arXiv:1812.10198, 2018.  Hulda S. Haraldsdóttir, Ben Cousins, Ines Thiele, Ronan M. T. Fleming, and Santosh Vempala. CHRR: coordinate hit-and-run with rounding for uniform sampling of constraint-based models. Bioinformatics, 33(11), 1 2017.  Elad Hazan and Zohar Karnin. Volumetric spanners: an efficient exploration basis for learning. The  Journal of Machine Learning Research, 17(1):4062-4095, 2016.  GJO Jameson. Inequalities for gamma function ratios. The American Mathematical Monthly, 120  (10):936-940, 2013.  Fritz John. Extremum problems with inequalities as subsidiary conditions. In Studies and Essays Presented to R. Courant on his 60th Birthday, January 8, 1948, pages 187-204. Interscience Publishers, Inc., New York, N. Y., 1948.  Ravi Kannan, László Lovász, and Miklós Simonovits. Random walks and an O∗(n5) volume algo-  rithm for convex bodies. Random Structures Algorithms, 11(1):1-50, 1997.  Jonathan A Kelner, Lorenzo Orecchia, Aaron Sidford, and Zeyuan Allen Zhu. A simple, combina- torial algorithm for solving SDD systems in nearly-linear time. In Proceedings of the forty-fifth annual ACM symposium on Theory of computing, pages 911-920. ACM, 2013.  Leonid G Khachiyan. Rounding of polytopes in the real number model of computation. Mathemat-  ics of Operations Research, 21(2):307-320, 1996.  Leonid G Khachiyan and Michael J Todd. On the complexity of approximating the maximal in-  scribed ellipsoid for a polytope. Mathematical Programming, 61(1):137-159, 1993.  Tarasov S. Khachiyan, L. and I. Ehrlich. The method of inscribed ellipsoids. Soviet Math. Doklady,  1988.  Jack Kiefer and Jacob Wolfowitz. The equivalence of two extremum problems. Canadian Journal  of Mathematics, 12(363-366):234, 1960.  Piyush Kumar and E Alper Yildirim. Minimum-volume enclosing ellipsoids and core sets. Journal  of Optimization Theory and Applications, 126(1):1-21, 2005.  Rasmus Kyng and Sushant Sachdeva. Approximate gaussian elimination for laplacians-fast, sparse, and simple. In 2016 IEEE 57th Annual Symposium on Foundations of Computer Science (FOCS), pages 573-582. IEEE, 2016.  Rasmus Kyng, Yin Tat Lee, Richard Peng, Sushant Sachdeva, and Daniel A Spielman. Sparsified In Proceedings of the forty-eighth  cholesky and multigrid solvers for connection laplacians. annual ACM symposium on Theory of Computing, pages 842-850. ACM, 2016.  Beatrice Laurent and Pascal Massart. Adaptive estimation of a quadratic functional by model selec-  tion. Annals of Statistics, pages 1302-1338, 2000. A NEAR-OPTIMAL ALGORITHM FOR APPROXIMATING THE JOHN ELLIPSOID  Yin Tat Lee and Aaron Sidford. Path finding methods for linear programming: Solving linear rank) iterations and faster algorithms for maximum ﬂow. In Foundations of programs in O( Computer Science (FOCS), 2014 IEEE 55th Annual Symposium on, pages 424-433. IEEE, 2014.  √  Yin Tat Lee, Zhao Song, and Qiuyi Zhang. Solving empirical risk minimization in the current matrix  multiplication time. In COLT, 2019.  Xingguo Li, Jarvis Haupt, and David Woodruff. Near optimal sketching of low-rank tensor regres-  sion. In Advances in Neural Information Processing Systems, pages 3466-3476, 2017.  László Lovász and Santosh Vempala. Hit-and-run from a corner. SIAM J. Comput., 35(4):985-1005,  2006.  Haihao Lu, Robert M Freund, and Yurii Nesterov. Relatively smooth convex optimization by first-  order methods, and applications. SIAM Journal on Optimization, 28(1):333-354, 2018.  Jelani Nelson and Huy L Nguyên. OSNAP: Faster numerical linear algebra algorithms via sparser subspace embeddings. In Foundations of Computer Science (FOCS), 2013 IEEE 54th Annual Symposium on, pages 117-126. IEEE, 2013.  Arkadi Nemirovski. On self-concordant convex-concave functions. Optimization Methods and  Software, 11(1-4):303-384, 1999.  ming, volume 13. Siam, 1994.  Yurii Nesterov and Arkadii Nemirovskii. Interior-point polynomial algorithms in convex program-  Aleksandar Nikolov, Kunal Talwar, and Li Zhang. The geometry of differential privacy: the sparse and approximate cases. In Proceedings of the forty-fifth annual ACM symposium on Theory of computing, pages 351-360. ACM, 2013.  Eric Price, Zhao Song, and David P. Woodruff. Fast regression with an (cid:96)∞ guarantee. In Interna-  tional Colloquium on Automata, Languages, and Programming (ICALP), 2017.  Ilya Razenshteyn, Zhao Song, and David P Woodruff. Weighted low rank approximations with provable guarantees. In Proceedings of the forty-eighth annual ACM symposium on Theory of Computing, pages 250-263. ACM, 2016.  Mohit Singh and Weijun Xie. Approximate positive correlated distributions and approximation al- gorithms for D-optimal design. In Proceedings of the Twenty-Ninth Annual ACM-SIAM Sympo- sium on Discrete Algorithms, pages 2240-2255. Society for Industrial and Applied Mathematics, 2018.  Zhao Song, David P. Woodruff, and Huan Zhang. Sublinear time orthogonal tensor decomposi- tion. In Advances in Neural Information Processing Systems 29: Annual Conference on Neural Information Processing Systems (NIPS) 2016, December 5-10, 2016, Barcelona, Spain, pages 793-801, 2016.  Zhao Song, David P Woodruff, and Peilin Zhong. Low rank approximation with entrywise (cid:96)1-norm error. In Proceedings of the 49th Annual ACM SIGACT Symposium on Theory of Computing, pages 688-701. ACM, 2017. A NEAR-OPTIMAL ALGORITHM FOR APPROXIMATING THE JOHN ELLIPSOID  Zhao Song, Lin F Yang, and Peilin Zhong. Sensitivity sampling over dynamic geometric data  streams with applications to k-clustering. arXiv preprint arXiv:1802.00459, 2018.  Zhao Song, David P Woodruff, and Peilin Zhong. Relative error tensor low rank approximation. In  SODA. https://arxiv.org/pdf/1704.08246, 2019.  Daniel A Spielman and Nikhil Srivastava. Graph sparsification by effective resistances. SIAM  Journal on Computing, 40(6):1913-1926, 2011.  Peng Sun and Robert M Freund. Computation of minimum-volume covering ellipsoids. Operations  Research, 52(5):690-706, 2004.  optimization. Philadelphia, 2016.  Michael J. Todd. Minimum-volume ellipsoids : theory and algorithms. MOS-SIAM series on  Michael J Todd and E Alper Yıldırım. On khachiyan’s algorithm for the computation of minimum-  volume enclosing ellipsoids. Discrete Applied Mathematics, 155(13):1731-1744, 2007.  Santosh Vempala. Geometric random walks: a survey. In Combinatorial and computational geome- try, volume 52 of Math. Sci. Res. Inst. Publ., pages 577-616. Cambridge Univ. Press, Cambridge, 2005.  Yining Wang, Hsiao-Yu Tung, Alexander J Smola, and Anima Anandkumar. Fast and guaranteed In Advances in Neural Information Processing Systems  tensor decomposition via sketching. (NIPS), pages 991-999. https://arxiv.org/pdf/1506.04448, 2015.  Yining Wang, Adams Wei Yu, and Aarti Singh. On computationally tractable selection of ex- periments in measurement-constrained regression models. The Journal of Machine Learning Research, 18(1):5238-5278, 2017.  David P Woodruff. Sketching as a tool for numerical linear algebra. Foundations and Trends® in  Theoretical Computer Science, 10(1-2):1-157, 2014.  Yin Zhang and Liyan Gao. On numerical solution of the maximum volume ellipsoid problem. SIAM  Journal on Optimization, 14(1):53-76, 2003."}