{"1": "task systems. In ALT, 2010.  J. Abernethy, P. L. Bartlett, N. Buchbinder, and I. Stanton. A regularization approach to metrical  Nikhil Bansal, Niv Buchbinder, and Joseph Naor. Towards the randomized k-server conjecture: A  primal-dual approach. In SODA, pages 40-55, 2010.  5.12   BUCHBINDER CHEN NAOR SHAMIR  Note that,  0 =  (wi,T − wi,0) =  η(α−bi,1−  ci,t+  at)  T (cid:80) t=1  T (cid:80) t=1  eηα − 1  − 1  −  eη(α−bi,1) − 1 eηα − 1        n (cid:88)  i=1  n (cid:88)  (cid:18)  i=1  n (cid:88)  (cid:18)  i=1 (cid:18) 1 n  =  ≥  = η        e  n (cid:88)  i=1  (cid:19)     e  wi,0 +  1 eηα − 1  (cid:32) T (cid:80) t=1  η  at−  ci,t  T (cid:80) t=1  (cid:33)       − 1  wi,0 +  1 eηα − 1  (cid:32) T  (cid:88)  (cid:19)  η  t=1  at −  ci,t  T (cid:88)  t=1  (cid:33)  +  1 eηα − 1  (cid:19) (cid:32) T (cid:88)  n (cid:88)  T (cid:88)  n (cid:88)  (cid:33)  ci,t  ,  at −  t=1  i=1  t=1  i=1  where Inequality (11) follows since ex − 1 ≥ x for any x. This implies,  T (cid:88)  n (cid:88)  T (cid:88)  n (cid:88)  at ≤  ci,t.  t=1  i=1  t=1  i=1  We can now bound the service cost:  (cid:104)wt, ct(cid:105) ≤  T (cid:88)  n (cid:88)  (cid:18)  ci,t  wi,t +  T (cid:88)  t=1  (cid:19)  1 eηα − 1  −  1 eηα − 1  T (cid:88)  n (cid:88)  t=1  i=1  at  T (cid:88)  atwi,t =  at  ≤  t=1 T (cid:88)  i=1 n (cid:88)  t=1  i=1 (cid:32)  = D +  α −  t=1 ln( eηα+n−1 n η  (cid:33)  )  ≤ D +  ln(n) η  ,  (11)  (12)  (13)  (14)  where Inequality (13) follows by Inequality (12), Inequality (14) follows by Inequality (10).  Acknowledgments  Niv Buchbinder was supported in part by ISF grant 954/11 and BSF grant 2010426. Seffi Naor was supported in part by the Google Inter-university center for Electronic Markets and Auctions, by ISF grant 954/11, and by BSF grant 2010426.  References  task systems. In ALT, 2010.  J. Abernethy, P. L. Bartlett, N. Buchbinder, and I. Stanton. A regularization approach to metrical  Nikhil Bansal, Niv Buchbinder, and Joseph Naor. Towards the randomized k-server conjecture: A  primal-dual approach. In SODA, pages 40-55, 2010.  5.12   UNIFIED ALGORITHMS FOR ONLINE LEARNING AND COMPETITIVE ANALYSIS  A. Blum and C. Burch. On-line learning and the metrical task system problem. In COLT, 1997.  A. Blum, H. J. Karloff, Y. Rabani, and M. E. Saks. A decomposition theorem and bounds for  randomized server problems. In FOCS, 1992.  A. Blum, C. Burch, and A. Kalai. Finely-competitive paging. In FOCS, 1999.  A. Blum, S. Chawla, and A. Kalai. Static optimality and dynamic search-optimality in lists and  trees. Algorithmica, 36(3):249-260, 2003.  A. Borodin and R. El-Yaniv. Online computation and competitive analysis. Cambridge University  Press, 1998.  ACM, 39(4):745-763, 1992.  A. Borodin, N. Linial, and M. E. Saks. An optimal on-line algorithm for metrical task system. J.  N. Buchbinder and J. Naor. The design of competitive online algorithms via a primal-dual approach.  Foundations and Trends in Theoretical Computer Science, 3(2-3):93-263, 2009.  N. Cesa-Bianchi and G. Lugosi. Prediction, learning, and games. Cambridge University Press,  2006.  2009.  1998.  2003.  Chandra Chekuri and Jan Vondrak. Randomized pipage rounding for matroid polytopes and appli-  cations. CoRR, abs/0909.4348, 2009.  K. Crammer, Y. Mansour, E. Even-Dar, and J. Wortman Vaughan. Regret minimization with concept  E. Even-Dar, R. Kleinberg, S. Mannor, and Y. Mansour. Online learning for global cost functions.  drift. In COLT, 2010.  In COLT, 2009.  Y. Freund and R. E. Schapire. A decision-theoretic generalization of on-line learning and an appli-  cation to boosting. J. Comput. Syst. Sci., 55(1):119-139, 1997.  E. Hazan and C. Seshadhri. Efficient learning algorithms for changing environments. In ICML,  M. Herbster and M. K. Warmuth. Tracking the best expert. Machine Learning, 32(2):151-178,  A. T. Kalai and S. Vempala. Efficient algorithms for online decision problems. J. Comput. Syst.  Sci., 71(3):291-307, 2005.  W. M. Koolen, M. K. Warmuth, and J. Kivinen. Hedging structured concepts. In COLT, 2010.  A. Rakhlin, K. Sridharan, and A. Tewari. Online learning: Beyond regret. In COLT, 2011.  A. Schrijver. Combinatorial Optimization: polyhedra and efficientcy. Springer, 2003.  Mohit Singh.  Iterative Methods in Combinatorial Optimization. PhD thesis, Tepper School of  Business, Carnegie Mellon University, 2008.  M. Zinkevich. Online convex programming and generalized infinitesimal gradient ascent. In ICML,  5.13   BUCHBINDER CHEN NAOR SHAMIR  (P)  min  ce,t · we,t + α ·  ze,t  (D)  max  T (cid:80) t=1  (cid:80) e∈E  T (cid:80) t=1  (cid:80) e∈E  (cid:18)  T (cid:80) t=0  r(E)at − (cid:80)  r(S)aS,t  S⊂E  (cid:19)  ∀t ≥ 0  we,t ≤ r (S)  ∀t ≥ 0 and S ⊂ E (cid:80) e∈S (cid:80) e∈E ze,t ≥ we,t − we,t−1 ze,t, we,t ≥ 0  ∀t ≥ 1 and e ∈ E ∀t and e ∈ E  we,t = r (E)  ∀e ∈ E  ∀t ≥ 1 and e ∈ E  aS,0 + be,1 ≤ 0  a0 − (cid:80) be,t+1 ≤ be,t + ce,t − at + (cid:80)  S|e∈S  aS,t  S|e∈S  ∀t ≥ 1 and e ∈ E ∀t, e ∈ E, S ⊂ E  be,t ≤ α be,t, aS,t ≥ 0  Figure 2: The primal and dual LP formulations for the Matroid problem."}