{"1": "Anima Anandkumar, Dean Foster, Daniel Hsu, Sham Kakade, and Yi-Kai Liu. A spectral algorithm for latent dirichlet allocation. In Advances in Neural Information Processing Systems 25, pages 926-934, 2012a.  Anima Anandkumar, Rong Ge, Daniel Hsu, Sham M. Kakade, and Matus Telgarsky. Tensor de-  compositions for learning latent variable models. CoRR, abs/1210.7559, 2012b.  Joseph Anderson, Mikhail Belkin, Navin Goyal, Luis Rademacher, and James Voss. The more, the merrier: the blessing of dimensionality for learning large gaussian mixtures. arXiv:1311.2891, 2013.  Sanjeev Arora, Rong Ge, Ankur Moitra, and Sushant Sachdeva. Provable ICA with unknown gaus- sian noise, with implications for gaussian mixtures and autoencoders. In NIPS, pages 2384-2392, 2012.  Mikhail Belkin, Luis Rademacher, and James Voss. Blind signal separation in the presence of  Gaussian noise. In Proc. of COLT, 2013.  C. Brubaker. Extensions of principal component analysis. Phd. Thesis, School of CS, Georgia Tech,  J.F. Cardoso. Source separation using higher order moments. In International Conference on Acous-  tics, Speech, and Signal Processing, 1989.  Pierre Comon and Christian Jutten, editors. Handbook of Blind Source Separation. Academic Press,  2009.  2010.  Chandler Davis and William Morton Kahan. The rotation of eigenvectors by a perturbation III.  SIAM Journal on Numerical Analysis, 7(1):1-46, 1970.  Paul Deheuvels. Strong limit theorems for maximal spacings from a general univariate distribution.  The Annals of Probability, pages 1181-1193, 1984.  Paul Deheuvels. The limiting behaviour of the maximal spacing generated by an iid sequence of  gaussian random variables. Journal of applied probability, pages 816-827, 1985.  Paul Deheuvels. On the inﬂuence of the extremes of an iid sequence on the maximal spacings. The  Annals of Probability, pages 194-208, 1986.  William Feller. An Introduction to Probability Theory and its Applications, vol 1. John Wiley and  Alan M. Frieze, Mark Jerrum, and Ravi Kannan. Learning linear transformations. In FOCS, pages  sons, 1968.  359-368, 1996.  Navin Goyal, Santosh Vempala, and Ying Xiao. Fourier PCA and robust tensor decomposition. In Symposium on Theory of Computing, STOC 2014, New York, NY, USA, May 31 - June 03, 2014, pages 584-593, 2014.  13   RECURSIVE EIGEN-DECOMPOSITION  References  Anima Anandkumar, Dean Foster, Daniel Hsu, Sham Kakade, and Yi-Kai Liu. A spectral algorithm for latent dirichlet allocation. In Advances in Neural Information Processing Systems 25, pages 926-934, 2012a.  Anima Anandkumar, Rong Ge, Daniel Hsu, Sham M. Kakade, and Matus Telgarsky. Tensor de-  compositions for learning latent variable models. CoRR, abs/1210.7559, 2012b.  Joseph Anderson, Mikhail Belkin, Navin Goyal, Luis Rademacher, and James Voss. The more, the merrier: the blessing of dimensionality for learning large gaussian mixtures. arXiv:1311.2891, 2013.  Sanjeev Arora, Rong Ge, Ankur Moitra, and Sushant Sachdeva. Provable ICA with unknown gaus- sian noise, with implications for gaussian mixtures and autoencoders. In NIPS, pages 2384-2392, 2012.  Mikhail Belkin, Luis Rademacher, and James Voss. Blind signal separation in the presence of  Gaussian noise. In Proc. of COLT, 2013.  C. Brubaker. Extensions of principal component analysis. Phd. Thesis, School of CS, Georgia Tech,  J.F. Cardoso. Source separation using higher order moments. In International Conference on Acous-  tics, Speech, and Signal Processing, 1989.  Pierre Comon and Christian Jutten, editors. Handbook of Blind Source Separation. Academic Press,  2009.  2010.  Chandler Davis and William Morton Kahan. The rotation of eigenvectors by a perturbation III.  SIAM Journal on Numerical Analysis, 7(1):1-46, 1970.  Paul Deheuvels. Strong limit theorems for maximal spacings from a general univariate distribution.  The Annals of Probability, pages 1181-1193, 1984.  Paul Deheuvels. The limiting behaviour of the maximal spacing generated by an iid sequence of  gaussian random variables. Journal of applied probability, pages 816-827, 1985.  Paul Deheuvels. On the inﬂuence of the extremes of an iid sequence on the maximal spacings. The  Annals of Probability, pages 194-208, 1986.  William Feller. An Introduction to Probability Theory and its Applications, vol 1. John Wiley and  Alan M. Frieze, Mark Jerrum, and Ravi Kannan. Learning linear transformations. In FOCS, pages  sons, 1968.  359-368, 1996.  Navin Goyal, Santosh Vempala, and Ying Xiao. Fourier PCA and robust tensor decomposition. In Symposium on Theory of Computing, STOC 2014, New York, NY, USA, May 31 - June 03, 2014, pages 584-593, 2014. VEMPALA XIAO  Trevor Hastie, Robert Tibshirani, Jerome Friedman, T Hastie, J Friedman, and R Tibshirani. The  elements of statistical learning, volume 2. Springer, 2009.  Christopher Hillar and Lek-Heng Lim. Most tensor problems are NP-hard. Journal of the ACM, 60,  2013.  Daniel Hsu and Sham M. Kakade. Learning mixtures of spherical Gaussians: moment methods and  spectral decompositions. In ITCS, pages 11-20, 2013.  Aapo Hyv¨arinen, Juha Karhunen, and Erkki Oja. Independent Component Analysis. Wiley, 2001.  Jiquan Ngiam, Zhenghao Chen, Daniel Chia, Pang W Koh, Quoc V Le, and Andrew Y Ng. Tiled convolutional neural networks. In Advances in Neural Information Processing Systems, pages 1279-1287, 2010.  Phong Q. Nguyen and Oded Regev. Learning a parallelepiped: Cryptanalysis of GGH and NTRU  signatures. J. Cryptology, 22(2):139-160, 2009.  Gilbert W Stewart and Ji-guang Sun. Matrix perturbation theory. Academic press, 1990.  Santosh Vempala and Grant Wang. A spectral algorithm for learning mixture models. Journal of  Computer and System Sciences, 68(4):841-860, 2004.  Roman Vershynin. Introduction to the non-asymptotic analysis of random matrices. In Y. Eldar and G. Kutyniok, editors, Compressed Sensing, Theory and Applications, pages 210-268. Cambridge University Press, Oxford, 2010.  Ying Xiao. Fourier pca package. GitHuB, 2014. http://github.com/yingusxiaous/libFPCA.  Arie Yeredor. Blind source separation via the second characteristic function. Signal Processing, 80  (5):897-902, 2000.  6."}