{"1": "Scott Aaronson, Russell Impagliazzo, and Dana Moshkovitz. AM with multiple Merlins. In IEEE 29th Conference on Computational Complexity, CCC 2014, Vancouver, BC, Canada, June 11-13, 2014, pages 44-55, 2014. doi: 10.1109/CCC.2014.13. URL http: //dx.doi.org/10.1109/CCC.2014.13.  Sanjeev Arora, Rong Ge, Sushant Sachdeva, and Grant Schoenebeck. Finding overlapping communities in social networks: toward a rigorous approach. In ACM Conference on Electronic Commerce, EC ’12, Valencia, Spain, June 4-8, 2012, pages 37-54, 2012. doi: 10.1145/2229012.2229020. URL http://doi.acm.org/10.1145/2229012.2229020.  Yakov Babichenko, Christos H. Papadimitriou, and Aviad Rubinstein. Can almost everybody In Proceedings of the 2016 ACM Conference on Innovations in be almost happy? Theoretical Computer Science, Cambridge, MA, USA, January 14-16, 2016, pages 1- 9, 2016. doi: 10.1145/2840728.2840731. URL http://doi.acm.org/10.1145/2840728. 2840731.  4. Roughly, self-directed learning is similar to the online learning model corresponding to Littlestone’s dimension, but where the learner chooses the order elements; see Ben-David and Eiron (1998) for details.  25   Inapproximability of VC Dimension and Littlestone’s Dimension  almost matching running time lower bound of nlog1−o(1) n for both problems while ruling out approximation ratios of 1/2 + o(1) and 1 − ε for some ε > 0 for VC Dimension and Littlestone’s Dimension respectively. Even though our results help us gain more insights on approximability of both problems, it is not yet completely resolved. More specifically, we are not aware of any constant factor no(log n)-time approximation algorithm for either problem; it is an intriguing open question whether such algorithm exists and, if not, whether our reduction can be extended to rule out such algorithm. Another potentially interesting research direction is to derandomize our construction; note that the only place in the proof in which the randomness is used is in Lemma 19.  A related question which remains open, originally posed by Ben-David and Eiron Ben-David and Eiron (1998), is that of computing the self-directed learning4 mistake bound. Similarly, it may be interesting to understand the complexity of computing (approximating) the recursive teaching dimension Doliwa et al. (2014); Moran et al. (2015).  Acknowledgement  We thank Shai Ben-David for suggesting the question of approximability of Littlestone’s dimension, and several other fascinating discussions. We also thank Yishay Mansour and COLT anonymous reviewers for their useful comments.  Pasin Manurangsi is supported by NSF Grants No. CCF 1540685 and CCF 1655215.  Aviad Rubinstein was supported by a Microsoft Research PhD Fellowship, as well as NSF grant CCF1408635 and Templeton Foundation grant 3966. This work was done in part at the Simons Institute for the Theory of Computing.  References  Scott Aaronson, Russell Impagliazzo, and Dana Moshkovitz. AM with multiple Merlins. In IEEE 29th Conference on Computational Complexity, CCC 2014, Vancouver, BC, Canada, June 11-13, 2014, pages 44-55, 2014. doi: 10.1109/CCC.2014.13. URL http: //dx.doi.org/10.1109/CCC.2014.13.  Sanjeev Arora, Rong Ge, Sushant Sachdeva, and Grant Schoenebeck. Finding overlapping communities in social networks: toward a rigorous approach. In ACM Conference on Electronic Commerce, EC ’12, Valencia, Spain, June 4-8, 2012, pages 37-54, 2012. doi: 10.1145/2229012.2229020. URL http://doi.acm.org/10.1145/2229012.2229020.  Yakov Babichenko, Christos H. Papadimitriou, and Aviad Rubinstein. Can almost everybody In Proceedings of the 2016 ACM Conference on Innovations in be almost happy? Theoretical Computer Science, Cambridge, MA, USA, January 14-16, 2016, pages 1- 9, 2016. doi: 10.1145/2840728.2840731. URL http://doi.acm.org/10.1145/2840728. 2840731.  4. Roughly, self-directed learning is similar to the online learning model corresponding to Littlestone’s dimension, but where the learner chooses the order elements; see Ben-David and Eiron (1998) for details. Manurangsi Rubinstein  Siddharth Barman. Approximating Nash equilibria and dense bipartite subgraphs via an approximate version of caratheodory’s theorem. In Proceedings of the Forty-Seventh Annual ACM on Symposium on Theory of Computing, STOC 2015, Portland, OR, USA, June 14-17, 2015, pages 361-369, 2015. doi: 10.1145/2746539.2746566. URL http: //doi.acm.org/10.1145/2746539.2746566.  Cristina Bazgan, Florent Foucaud, and Florian Sikora. On the approximability of partial VC dimension. In Combinatorial Optimization and Applications - 10th International Conference, COCOA 2016, Hong Kong, China, December 16-18, 2016, Proceedings, pages 92-106, 2016. doi: 10.1007/978-3-319-48749-6 7. URL http://dx.doi.org/10.1007/ 978-3-319-48749-6_7.  Shai Ben-David and Nadav Eiron. Self-directed learning and its relation to the vc-dimension and to teacher-directed learning. Machine Learning, 33(1):87-104, 1998. doi: 10.1023/A: 1007510732151. URL http://dx.doi.org/10.1023/A:1007510732151.  Shai Ben-David, D´avid P´al, and Shai Shalev-Shwartz. Agnostic online learning. In COLT 2009 - The 22nd Conference on Learning Theory, Montreal, Quebec, Canada, June 18-21, 2009, 2009. URL http://www.cs.mcgill.ca/˜colt2009/papers/032.pdf#page=1.  Umang Bhaskar, Yu Cheng, Young Kun Ko, and Chaitanya Swamy. Hardness results for signaling in Bayesian zero-sum and network routing games. In Proceedings of the 2016 ACM Conference on Economics and Computation, EC ’16, Maastricht, The Netherlands, July 24-28, 2016, pages 479-496, 2016. doi: 10.1145/2940716.2940753. URL http: //doi.acm.org/10.1145/2940716.2940753.  Avrim Blum.  Separating distribution-free and mistake-bound learning models over 10.1137/  the boolean domain. S009753979223455X. URL http://dx.doi.org/10.1137/S009753979223455X.  SIAM J. Comput., 23(5):990-1000, 1994.  doi:  Mark Braverman, Young Kun-Ko, and Omri Weinstein. Approximating the best Nash equilibrium in no(log n)-time breaks the exponential time hypothesis. In Proceedings of the Twenty-Sixth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2015, San Diego, CA, USA, January 4-6, 2015, pages 970-982, 2015. doi: 10.1137/1. 9781611973730.66. URL http://dx.doi.org/10.1137/1.9781611973730.66.  Mark Braverman, Young Kun-Ko, Aviad Rubinstein, and Omri Weinstein. ETH hardness for densest-k-subgraph with perfect completeness. In Proceedings of the Twenty-Eighth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2017, Barcelona, Spain, Hotel Porta Fira, January 16-19, pages 1326-1341, 2017. doi: 10.1137/1.9781611974782.86. URL http://dx.doi.org/10.1137/1.9781611974782.86.  Yu Cheng, Ho Yee Cheung, Shaddin Dughmi, Ehsan Emamjomeh-Zadeh, Li Han, and Shang-Hua Teng. Mixture selection, mechanism design, and signaling. In IEEE 56th Annual Symposium on Foundations of Computer Science, FOCS 2015, Berkeley, CA, USA, 17-20 October, 2015, pages 1426-1445, 2015. doi: 10.1109/FOCS.2015.91. URL http://dx.doi.org/10.1109/FOCS.2015.91. Inapproximability of VC Dimension and Littlestone’s Dimension  Amit Daniely. Complexity theoretic limitations on learning halfspaces. In Proceedings of the 48th Annual ACM SIGACT Symposium on Theory of Computing, STOC 2016, Cambridge, MA, USA, June 18-21, 2016, pages 105-117, 2016. doi: 10.1145/2897518.2897520. URL http://doi.acm.org/10.1145/2897518.2897520.  Amit Daniely and Shai Shalev-Shwartz. Complexity theoretic limitations on learning DNF’s. In Proceedings of the 29th Conference on Learning Theory, COLT 2016, New York, USA, June 23-26, 2016, pages 815-830, 2016. URL http://jmlr.org/proceedings/papers/ v49/daniely16.html.  Argyrios Deligkas, John Fearnley, and Rahul Savani. Inapproximability results for approxi- mate Nash equilibria. CoRR, abs/1608.03574, 2016. URL http://arxiv.org/abs/1608. 03574.  Thorsten Doliwa, Gaojian Fan, Hans Ulrich Simon, and Sandra Zilles. Recursive teaching dimension, vc-dimension and sample compression. Journal of Machine Learning Research, 15(1):3107-3131, 2014. URL http://dl.acm.org/citation.cfm?id=2697064.  Vitaly Feldman, Parikshit Gopalan, Subhash Khot, and Ashok Kumar Ponnuswami. New results for learning noisy parities and halfspaces. In 47th Annual IEEE Symposium on Foundations of Computer Science (FOCS 2006), 21-24 October 2006, Berkeley, California, USA, Proceedings, pages 563-574, 2006. doi: 10.1109/FOCS.2006.51. URL http://dx. doi.org/10.1109/FOCS.2006.51.  Moti Frances and Ami Litman. Optimal mistake bound learning is hard. Inf. Comput., 144 (1):66-82, 1998. doi: 10.1006/inco.1998.2709. URL http://dx.doi.org/10.1006/inco. 1998.2709.  Russell Impagliazzo and Ramamohan Paturi. On the complexity of k-SAT. J. Comput. Syst. Sci., 62(2):367-375, 2001. doi: 10.1006/jcss.2000.1727. URL http://dx.doi.org/ 10.1006/jcss.2000.1727.  Russell Impagliazzo, Ramamohan Paturi, and Francis Zane. Which problems have strongly exponential complexity? J. Comput. Syst. Sci., 63(4):512-530, 2001. doi: 10.1006/jcss. 2001.1774. URL http://dx.doi.org/10.1006/jcss.2001.1774.  Adam Tauman Kalai, Adam R. Klivans, Yishay Mansour, and Rocco A. Servedio. doi:  SIAM J. Comput., 37(6):1777-1805, 2008.  Agnostically learning halfspaces. 10.1137/060649057. URL http://dx.doi.org/10.1137/060649057.  Michael J. Kearns and Leslie G. Valiant. Cryptographic limitations on learning boolean formulae and finite automata. J. ACM, 41(1):67-95, 1994. doi: 10.1145/174644.174647. URL http://doi.acm.org/10.1145/174644.174647.  Michael Kharitonov. Cryptographic hardness of distribution-specific learning. In Proceedings of the Twenty-Fifth Annual ACM Symposium on Theory of Computing, May 16-18, 1993, San Diego, CA, USA, pages 372-381, 1993. doi: 10.1145/167088.167197. URL http://doi.acm.org/10.1145/167088.167197. Manurangsi Rubinstein  Michael Kharitonov. Cryptographic lower bounds for learnability of boolean functions on the uniform distribution. J. Comput. Syst. Sci., 50(3):600-610, 1995. doi: 10.1006/jcss. 1995.1046. URL http://dx.doi.org/10.1006/jcss.1995.1046.  Adam R. Klivans. Cryptographic hardness of learning. In Encyclopedia of Algorithms, pages 475-477. 2016. doi: 10.1007/978-1-4939-2864-4 96. URL http://dx.doi.org/10.1007/ 978-1-4939-2864-4_96.  Adam R. Klivans and Alexander A. Sherstov. Cryptographic hardness for learning intersec- tions of halfspaces. J. Comput. Syst. Sci., 75(1):2-12, 2009. doi: 10.1016/j.jcss.2008.07.008. URL http://dx.doi.org/10.1016/j.jcss.2008.07.008.  Nathan Linial, Yishay Mansour, and Ronald L. Rivest. Results on learnability and the Vapnik- Chervonenkis dimension. Inf. Comput., 90(1):33-49, 1991. doi: 10.1016/0890-5401(91) 90058-A. URL http://dx.doi.org/10.1016/0890-5401(91)90058-A.  Richard J. Lipton, Evangelos Markakis, and Aranyak Mehta. Playing large games using simple strategies. In Proceedings 4th ACM Conference on Electronic Commerce (EC-2003), San Diego, California, USA, June 9-12, 2003, pages 36-41, 2003. doi: 10.1145/779928.779933. URL http://doi.acm.org/10.1145/779928.779933.  Nick Littlestone. Learning quickly when irrelevant attributes abound: A new linear-threshold algorithm. Mach. Learn., 2(4):285-318, April 1988. ISSN 0885-6125. doi: 10.1023/A: 1022869011914. URL http://dx.doi.org/10.1023/A:1022869011914.  Pasin Manurangsi. Almost-polynomial ratio ETH-hardness of approximating densest k- subgraph. In Proceedings of the Fortieth-ninth Annual ACM Symposium on Theory of Computing, STOC ’17, 2017. To appear.  Pasin Manurangsi and Prasad Raghavendra. A birthday repetition theorem and complexity of approximating dense CSPs. CoRR, abs/1607.02986, 2016. URL http://arxiv.org/ abs/1607.02986.  Shay Moran, Amir Shpilka, Avi Wigderson, and Amir Yehudayoﬀ. Compressing and teaching for low vc-dimension. In IEEE 56th Annual Symposium on Foundations of Computer Science, FOCS 2015, Berkeley, CA, USA, 17-20 October, 2015, pages 40-51, 2015. doi: 10.1109/FOCS.2015.12. URL https://doi.org/10.1109/FOCS.2015.12.  Dana Moshkovitz and Ran Raz. Two-query PCP with subconstant error. J. ACM, 57(5): 29:1-29:29, 2010. doi: 10.1145/1754399.1754402. URL http://doi.acm.org/10.1145/ 1754399.1754402.  Elchanan Mossel and Christopher Umans. On the complexity of approximating the VC dimension. J. Comput. Syst. Sci., 65(4):660-671, 2002. doi: 10.1016/S0022-0000(02) 00022-3. URL http://dx.doi.org/10.1016/S0022-0000(02)00022-3.  Christos H. Papadimitriou and Mihalis Yannakakis. On limited nondeterminism and the complexity of the V-C dimension. J. Comput. Syst. Sci., 53(2):161-170, 1996. doi: 10.1006/jcss.1996.0058. URL http://dx.doi.org/10.1006/jcss.1996.0058. Inapproximability of VC Dimension and Littlestone’s Dimension  Aviad Rubinstein. ETH-hardness for signaling in symmetric zero-sum games. CoRR,  abs/1510.04991, 2015. URL http://arxiv.org/abs/1510.04991.  Aviad Rubinstein. Settling the complexity of computing approximate two-player Nash equilibria. In IEEE 57th Annual Symposium on Foundations of Computer Science, FOCS 2016, 9-11 October 2016, Hyatt Regency, New Brunswick, New Jersey, USA, pages 258-265, 2016a. doi: 10.1109/FOCS.2016.35. URL http://dx.doi.org/10.1109/FOCS.2016.35.  Aviad Rubinstein. Detecting communities is hard, and counting them is even harder. CoRR,  abs/1611.08326, 2016b. URL http://arxiv.org/abs/1611.08326.  Marcus Schaefer. Deciding the Vapnik-Cervonenkis dimension in ΣP  3 -complete. J. Comput. Syst. Sci., 58(1):177-182, 1999. doi: 10.1006/jcss.1998.1602. URL http://dx.doi.org/ 10.1006/jcss.1998.1602.  Marcus Schaefer. Deciding the k-dimension is PSPACE-complete. In Proceedings of the 15th Annual IEEE Conference on Computational Complexity, Florence, Italy, July 4-7, 2000, pages 198-203, 2000. doi: 10.1109/CCC.2000.856750. URL http://dx.doi.org/ 10.1109/CCC.2000.856750.  Vladimir N. Vapnik and Alexey Ya. Chervonenkis. On the uniform convergence of relative frequencies of events to their probabilities. Theory of Probability & Its Applications, 16 (2):264-280, 1971. doi: 10.1137/1116025. URL http://dx.doi.org/10.1137/1116025."}