{"1": "Alekh Agarwal, Haipeng Luo, Behnam Neyshabur, and Robert E Schapire. Corralling a band of  bandit algorithms. In Conference on Learning Theory, pages 12-38, 2017.  R Agrawal. The continuum-armed bandit problem. SIAM Journal on Control and Optimization, 33:  1926-1951, 1995.  Jean-Yves Audibert and Alexandre B Tsybakov. Fast learning rates for plug-in classifiers. The  Annals of statistics, 35(2):608-633, 2007.  Peter Auer, Ronald Ortner, and Csaba Szepesvári. Improved rates for the stochastic continuum-armed bandit problem. In International Conference on Computational Learning Theory, pages 454-468. Springer, 2007.  Pierre C Bellec. Adaptive confidence sets in shape restricted regression.  arXiv preprint  arXiv:1601.05766, 2016.  Lucien Birgé and Pascal Massart. From model selection to adaptive estimation. In Festschrift for  lucien le cam, pages 55-87. Springer, 1997.  S. Bubeck, G. Stoltz, and J. Yu. Lipschitz bandits without the lipschitz constant. In Algorithmic  Learning Theory, pages 144-158. Springer, 2011a.  Sébastien Bubeck, Rémi Munos, and Gilles Stoltz. Pure exploration in finitely-armed and continuous-  armed bandits. Theoretical Computer Science, 412(19):1832-1852, 2011b.  Sébastien Bubeck, Rémi Munos, Gilles Stoltz, and Csaba Szepesvari. X-armed bandits. Journal of  Machine Learning Research, 12(May):1655-1695, 2011c.  Sébastien Bubeck, Vianney Perchet, and Philippe Rigollet. Bounded regret in stochastic multi-armed  bandits. In Conference on Learning Theory, pages 122-134, 2013.  Adam D Bull et al. Adaptive-treed bandits. Bernoulli, 21(4):2289-2307, 2015.  T Tony Cai, Mark G Low, et al. Adaptive confidence balls. The Annals of Statistics, 34(1):202-228,  2006.  T Tony Cai, Mark G Low, Yin Xia, et al. Adaptive confidence intervals for regression functions  under shape constraints. The Annals of Statistics, 41(2):722-750, 2013.  13   ADAPTIVITY IN X -ARMED BANDITS  Acknowledgments  The authors would like to thank Samory Kpotufe for many useful discussions. This work is partly funded by the Deutsche Foschungsgemeinschaft (DFG, German Research Foundation) on the Emmy Noether grant for the project MuSyAD (CA 1488/1-1) ‘anomaly detection in complex systems’, on the GK 2297 MathCoRe on “Mathematical Complexity Reduction\" - 314838170, GRK 2297 MathCoRe, and on the SFB 1294 Data Assimilation on “Data Assimilation — The seamless integration of data and models\", Project A03.  References  Alekh Agarwal, Haipeng Luo, Behnam Neyshabur, and Robert E Schapire. Corralling a band of  bandit algorithms. In Conference on Learning Theory, pages 12-38, 2017.  R Agrawal. The continuum-armed bandit problem. SIAM Journal on Control and Optimization, 33:  1926-1951, 1995.  Jean-Yves Audibert and Alexandre B Tsybakov. Fast learning rates for plug-in classifiers. The  Annals of statistics, 35(2):608-633, 2007.  Peter Auer, Ronald Ortner, and Csaba Szepesvári. Improved rates for the stochastic continuum-armed bandit problem. In International Conference on Computational Learning Theory, pages 454-468. Springer, 2007.  Pierre C Bellec. Adaptive confidence sets in shape restricted regression.  arXiv preprint  arXiv:1601.05766, 2016.  Lucien Birgé and Pascal Massart. From model selection to adaptive estimation. In Festschrift for  lucien le cam, pages 55-87. Springer, 1997.  S. Bubeck, G. Stoltz, and J. Yu. Lipschitz bandits without the lipschitz constant. In Algorithmic  Learning Theory, pages 144-158. Springer, 2011a.  Sébastien Bubeck, Rémi Munos, and Gilles Stoltz. Pure exploration in finitely-armed and continuous-  armed bandits. Theoretical Computer Science, 412(19):1832-1852, 2011b.  Sébastien Bubeck, Rémi Munos, Gilles Stoltz, and Csaba Szepesvari. X-armed bandits. Journal of  Machine Learning Research, 12(May):1655-1695, 2011c.  Sébastien Bubeck, Vianney Perchet, and Philippe Rigollet. Bounded regret in stochastic multi-armed  bandits. In Conference on Learning Theory, pages 122-134, 2013.  Adam D Bull et al. Adaptive-treed bandits. Bernoulli, 21(4):2289-2307, 2015.  T Tony Cai, Mark G Low, et al. Adaptive confidence balls. The Annals of Statistics, 34(1):202-228,  2006.  T Tony Cai, Mark G Low, Yin Xia, et al. Adaptive confidence intervals for regression functions  under shape constraints. The Annals of Statistics, 41(2):722-750, 2013. ADAPTIVITY IN X -ARMED BANDITS  Richard Combes and Alexandre Proutiere. Unimodal bandits: Regret lower bounds and optimal  algorithms. In International Conference on Machine Learning, pages 521-529, 2014.  Eric Cope. Regret and convergence bounds for immediate-reward reinforcement learning with continuous action spaces. IEEE Transactions on Automatic Control, 54(6):1243-1253, 2009.  Aurélien Garivier, Pierre Ménard, and Gilles Stoltz. Explore first, exploit next: The true shape of  regret in bandit problems. arXiv preprint arXiv:1602.07182, 2016.  Georgii Ksenofontovich Golubev. Adaptive asymptotically minimax estimators of smooth signals.  Problemy Peredachi Informatsii, 23(1):57-67, 1987.  Jean-Bastien Grill, Michal Valko, and Rémi Munos. Black-box optimization of noisy functions with unknown smoothness. In Advances in Neural Information Processing Systems, pages 667-675, 2015.  S. Hanneke. Adaptive rates of convergence in active learning. Proceedings of the 22nd Annual  Conference on Learning Theory, COLT 2009, pages 353-364.  Marc Hoffmann and Richard Nickl. On adaptive inference and confidence bands. The Annals of  Statistics, pages 2383-2409, 2011.  Anatoli Juditsky and Sophie Lambert-Lacroix. Nonparametric confidence set estimation. 2003.  Emilie Kaufmann, Olivier Cappé, and Aurélien Garivier. On the complexity of best-arm identification in multi-armed bandit models. The Journal of Machine Learning Research, 17(1):1-42, 2016.  Robert Kleinberg. Nearly tight bounds for the continuum-armed bandit problem. In Proceedings of the 17th International Conference on Neural Information Processing Systems, pages 697-704. MIT Press, 2004.  Robert Kleinberg, Aleksandrs Slivkins, and Eli Upfal. Multi-armed bandits in metric spaces. In Proceedings of the fortieth annual ACM symposium on Theory of computing, pages 681-690. ACM, 2008.  Robert Kleinberg, Aleksandrs Slivkins, and Eli Upfal. Bandits and experts in metric spaces. arXiv  preprint arXiv:1312.1277, 2013.  V. Koltchinskii. Rademacher complexities and bounding the excess risk of active learning. Journal  of Machine Learning Research, 11:2457-2485, 2010.  Oleg V Lepski and VG Spokoiny. Optimal pointwise adaptive methods in nonparametric estimation.  The Annals of Statistics, pages 2512-2546, 1997.  Andrea Locatelli, Alexandra Carpentier, and Samory Kpotufe. Adaptivity to noise parameters In Satyen Kale and Ohad Shamir, editors, Proceedings of in nonparametric active learning. the 2017 Conference on Learning Theory, volume 65 of Proceedings of Machine Learning Research, pages 1383-1416, Amsterdam, Netherlands, 07-10 Jul 2017. PMLR. URL http: //proceedings.mlr.press/v65/locatelli-andrea17a.html. ADAPTIVITY IN X -ARMED BANDITS  Stanislav Minsker. Plug-in approach to active learning. Journal of Machine Learning Research, 13  (Jan):67-90, 2012.  Stanislav Minsker. Estimation of extreme values and associated level sets of a regression function  via selective sampling. In Conference on Learning Theory, pages 105-121, 2013.  Rémi Munos. Optimistic Optimization of Deterministic Functions without the Knowledge of its  Smoothness. In Advances in Neural Information Processing Systems, 2011.  Aleksandrs Slivkins. Multi-armed bandits on implicit metric spaces.  In Advances in Neural  Information Processing Systems, pages 1602-1610, 2011.  Alexandre B Tsybakov. Optimal aggregation of classifiers in statistical learning. Annals of Statistics,  pages 135-166, 2004.  Alexandre B Tsybakov. Introduction to nonparametric estimation. revised and extended from the  2004 french original. translated by vladimir zaiats, 2009.  Michal Valko, Alexandra Carpentier, and Rémi Munos. Stochastic simultaneous optimistic optimiza-  tion. In International Conference on Machine Learning, pages 19-27, 2013.  Jia Yuan Yu and Shie Mannor. Unimodal bandits. In Proceedings of the 28th International Conference  on International Conference on Machine Learning, pages 41-48. Omnipress, 2011."}