{"1": "pages 2164-2171, 2016.  235-242, 2005.  In NIPS, 2016.  Dana Angluin. Queries revisited. Theoretical Computer Science, 313(2):175-194, 2004.  Martin Anthony, Graham Brightwell, and John Shawe-Taylor. On specifying Boolean functions by  labelled examples. Discrete Applied Mathematics, 61(1):1-25, 1995.  Anselm Blumer, Andrzej Ehrenfeucht, David Haussler, and Manfred K Warmuth. Learnability and  the Vapnik-Chervonenkis dimension. Journal of the ACM (JACM), 36(4):929-965, 1989.  Xi Chen, Yu Cheng, and Bo Tang. On the recursive teaching dimension of VC classes. In NIPS,  Sanjoy Dasgupta. Coarse sample complexity bounds for active learning. In NIPS, volume 18, pages  Ofir David, Shay Moran, and Amir Yehudayoff. On statistical learning via the lens of compression.  Thorsten Doliwa, Gaojian Fan, Hans Ulrich Simon, and Sandra Zilles. Recursive teaching dimen- sion, VC-dimension and sample compression. Journal of Machine Learning Research, 15(1): 3107-3131, 2014.  Sally A Goldman and Michael J Kearns. On the complexity of teaching. Journal of Computer and  System Sciences, 50(1):20-31, 1995.  Sally A Goldman and H David Mathias. Teaching a smart learner.  In Proceedings of the sixth  annual conference on Computational learning theory, pages 67-76. ACM, 1993.  Steve Hanneke. Teaching dimension and the complexity of active learning. In International Con-  ference on Computational Learning Theory, pages 66-81. Springer, 2007.  Tibor Heged˝us. Generalized teaching dimensions and the query complexity of learning. In Proceed- ings of the eighth annual conference on Computational learning theory, pages 108-117. ACM, 1995.  9   QUADRATIC UPPER BOUND FOR RECURSIVE TEACHING DIMENSION OF FINITE VC CLASSES  Using a similar argument as in the proof of Lemma 7 and optimizing the parameters with respect to the specific case of (3, 5)-classes (choosing x = 2, y = 3, z = 5, k = 1), we can show  max C∈(3,5)  RTD(C) = 2;  And hence for (3, 4)-classes maxC∈(3,4) RTD(C) = 2.  The relationship between RTD and VCD is intriguing. Analyzing special cases and sub-classes  with specific structure may provide insights for finally solving the open problem.  Liwei Wang was partially supported by National Basic Research Program of China (973 Program) (grant no. 2015CB352502) and NSFC (61573026).  Acknowledgments  References  pages 2164-2171, 2016.  235-242, 2005.  In NIPS, 2016.  Dana Angluin. Queries revisited. Theoretical Computer Science, 313(2):175-194, 2004.  Martin Anthony, Graham Brightwell, and John Shawe-Taylor. On specifying Boolean functions by  labelled examples. Discrete Applied Mathematics, 61(1):1-25, 1995.  Anselm Blumer, Andrzej Ehrenfeucht, David Haussler, and Manfred K Warmuth. Learnability and  the Vapnik-Chervonenkis dimension. Journal of the ACM (JACM), 36(4):929-965, 1989.  Xi Chen, Yu Cheng, and Bo Tang. On the recursive teaching dimension of VC classes. In NIPS,  Sanjoy Dasgupta. Coarse sample complexity bounds for active learning. In NIPS, volume 18, pages  Ofir David, Shay Moran, and Amir Yehudayoff. On statistical learning via the lens of compression.  Thorsten Doliwa, Gaojian Fan, Hans Ulrich Simon, and Sandra Zilles. Recursive teaching dimen- sion, VC-dimension and sample compression. Journal of Machine Learning Research, 15(1): 3107-3131, 2014.  Sally A Goldman and Michael J Kearns. On the complexity of teaching. Journal of Computer and  System Sciences, 50(1):20-31, 1995.  Sally A Goldman and H David Mathias. Teaching a smart learner.  In Proceedings of the sixth  annual conference on Computational learning theory, pages 67-76. ACM, 1993.  Steve Hanneke. Teaching dimension and the complexity of active learning. In International Con-  ference on Computational Learning Theory, pages 66-81. Springer, 2007.  Tibor Heged˝us. Generalized teaching dimensions and the query complexity of learning. In Proceed- ings of the eighth annual conference on Computational learning theory, pages 108-117. ACM, 1995. HU WU LI WANG  Christian Kuhlmann. On teaching and learning intersection-closed concept classes. In European  Conference on Computational Learning Theory, pages 168-182. Springer, 1999.  Nick Littlestone and Manfred Warmuth. Relating data compression and learnability. Technical  report, Technical report, University of California, Santa Cruz, 1986.  Shay Moran, Amir Shpilka, Avi Wigderson, and Amir Yehudayoff. Compressing and teaching for low VC-dimension. In Foundations of Computer Science (FOCS), 2015 IEEE 56th Annual Symposium on, pages 40-51. IEEE, 2015.  Norbert Sauer. On the density of families of sets. Journal of Combinatorial Theory, Series A, 13  (1):145-147, 1972.  Saharon Shelah. A combinatorial problem; stability and order for models and theories in infinitary  languages. Pacific Journal of Mathematics, 41(1):247-261, 1972.  Ayumi Shinohara and Satoru Miyano. Teachability in computational learning. New Generation  Computing, 8(4):337-347, 1991.  Hans Ulrich Simon and Sandra Zilles. Open problem: Recursive teaching dimension versus VC  dimension. In COLT, pages 1770-1772, 2015.  VN Vapnik and A Ya Chervonenkis. On the uniform convergence of relative frequencies of events  to their probabilities. Theory of Probability & Its Applications, 16(2):264-280, 1971.  Manfred K Warmuth. Compressing to VC dimension many points.  In COLT, volume 3, pages  743-744. Springer, 2003.  Sandra Zilles, Steffen Lange, Robert Holte, and Martin Zinkevich. Models of cooperative teaching  and learning. Journal of Machine Learning Research, 12(Feb):349-384, 2011."}