{"1": "Ashwinkumar Badanidiyuru, Shahar Dobzinski, Hu Fu, Robert Kleinberg, Noam Nisan, and Tim Roughgarden. Sketching valuation functions. In Proceedings of the Twenty-third Annual ACM-SIAM Symposium on Discrete Algorithms, SODA ’12, pages 1025-1035. SIAM, 2012.  Maria-Florina Balcan and Nicholas JA Harvey. Learning submodular functions. In Pro- ceedings of the Forty-Third Annual ACM Symposium on Theory of Computing (STOC), pages 793-802. ACM, 2011.  Maria-Florina Balcan, Florin Constantin, Satoru Iwata, and Lei Wang. Learning valuation functions. In The 25th Annual Conference on Learning Theory, pages 4.1-4.24, 2012.  William Barnett. The modern theory of consumer behavior: Ordinal or cardinal? The  Quarterly Journal of Austrian Economics, 6(1):41-65, 2003.  Ralph Allan Bradley and Milton E Terry. Rank analysis of incomplete block designs: I. the  method of paired comparisons. Biometrika, 39(3/4):324-345, 1952.  Xi Chen, Paul N Bennett, Kevyn Collins-Thompson, and Eric Horvitz. Pairwise ranking In Proceedings of the sixth ACM international  aggregation in a crowdsourced setting. conference on Web search and data mining, pages 193-202. ACM, 2013.  David Easley and Jon Kleinberg. Networks, Crowds, and Markets. Cambridge University  Press, 2010.  Vitaly Feldman. Open problem: The statistical query complexity of learning sparse halfs-  paces. In Conference on Learning Theory, pages 1283-1289, 2014.  Vitaly Feldman and Pravesh Kothari. Learning coverage functions and private release of marginals. In Proceedings of The 27th Conference on Learning Theory, pages 679-702, 2014.  22   Balcan Vitercik White  ˜Ω(n1/3) lower bound. Another open question is determining whether the sample complex- ity for the additive error results in Section 4 can be improved. We note, both of these questions are unresolved even in the setting where the sample consists of function values and the goal is to learn an approximate function. Another interesting question is to find nontrivial generalizations of the pairwise comparison model and show corresponding results. For instance, the distribution is over k-tuples and the top k(cid:48) sets in the tuple are ranked.  Acknowledgments  We thank Peter Bartlett for insightful initial discussions which led to the development of this research project.  This work was supported in part by NSF grants CCF-1451177, CCF-1422910, a Sloan Research Fellowship, a Microsoft Research Faculty Fellowship, a Google Research Award, and a National Defense Science & Engineering Graduate (NDSEG) fellowship.  References  Ashwinkumar Badanidiyuru, Shahar Dobzinski, Hu Fu, Robert Kleinberg, Noam Nisan, and Tim Roughgarden. Sketching valuation functions. In Proceedings of the Twenty-third Annual ACM-SIAM Symposium on Discrete Algorithms, SODA ’12, pages 1025-1035. SIAM, 2012.  Maria-Florina Balcan and Nicholas JA Harvey. Learning submodular functions. In Pro- ceedings of the Forty-Third Annual ACM Symposium on Theory of Computing (STOC), pages 793-802. ACM, 2011.  Maria-Florina Balcan, Florin Constantin, Satoru Iwata, and Lei Wang. Learning valuation functions. In The 25th Annual Conference on Learning Theory, pages 4.1-4.24, 2012.  William Barnett. The modern theory of consumer behavior: Ordinal or cardinal? The  Quarterly Journal of Austrian Economics, 6(1):41-65, 2003.  Ralph Allan Bradley and Milton E Terry. Rank analysis of incomplete block designs: I. the  method of paired comparisons. Biometrika, 39(3/4):324-345, 1952.  Xi Chen, Paul N Bennett, Kevyn Collins-Thompson, and Eric Horvitz. Pairwise ranking In Proceedings of the sixth ACM international  aggregation in a crowdsourced setting. conference on Web search and data mining, pages 193-202. ACM, 2013.  David Easley and Jon Kleinberg. Networks, Crowds, and Markets. Cambridge University  Press, 2010.  Vitaly Feldman. Open problem: The statistical query complexity of learning sparse halfs-  paces. In Conference on Learning Theory, pages 1283-1289, 2014.  Vitaly Feldman and Pravesh Kothari. Learning coverage functions and private release of marginals. In Proceedings of The 27th Conference on Learning Theory, pages 679-702, 2014. Learning Combinatorial Functions from Pairwise Comparisons  Vitaly Feldman and Jan Vondrak. Optimal bounds on approximation of submodular and xos functions by juntas. In Proceedings of the 2013 IEEE 54th Annual Symposium on Foundations of Computer Science, FOCS ’13, pages 227-236, 2013.  Vitaly Feldman and Jan Vondr´ak. Tight bounds on low-degree spectral concentration of submodular and XOS functions. In IEEE 56th Annual Symposium on Foundations of Computer Science, FOCS 2015, Berkeley, CA, USA, 17-20 October, 2015, pages 923- 942, 2015.  Michel X Goemans, Nicholas JA Harvey, Satoru Iwata, and Vahab Mirrokni. Approximating submodular functions everywhere. In Proceedings of the twentieth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 535-544. Society for Industrial and Applied Mathematics, 2009.  Anupam Gupta, Moritz Hardt, Aaron Roth, and Jonathan Ullman. Privately releasing conjunctions and the statistical query barrier. SIAM Journal on Computing, 42(4):1494- 1520, 2013.  Sandra Heldsinger and Stephen Humphry. Using the method of pairwise comparison to obtain reliable teacher assessments. The Australian Educational Researcher, 37(2):1-19, 2010.  John C. Hull. Options, Futures, and Other Derivatives. Pearson, 2011.  Rishabh K Iyer, Stefanie Jegelka, and Jeﬀ A Bilmes. Curvature and optimal algorithms for learning and minimizing submodular functions. In Advances in Neural Information Processing Systems, pages 2742-2750, 2013.  Kevin G Jamieson and Robert Nowak. Active ranking using pairwise comparisons.  In  Advances in Neural Information Processing Systems, pages 2240-2248, 2011.  Tyler Neylon. Sparse solutions for linear prediction problems. PhD thesis, New York  University, 2006.  Noam Nisan, Tim Roughgarden, Eva Tardos, and Vijay V. Vazirani. Algorithmic Game  Theory. Cambridge University Press, 2007.  Sofya Raskhodnikova and Grigory Yaroslavtsev. Learning pseudo-boolean k-dnf and sub- modular functions. In Proceedings of the Twenty-Fourth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 1356-1368. SIAM, 2013.  Nihar B. Shah, Sivaraman Balakrishnan, Joseph K. Bradley, Abhay Parekh, Kannan Ram- chandran, and Martin J. Wainwright. Estimation from pairwise comparisons: Sharp minimax bounds with topology dependence. In Proceedings of the Eighteenth Interna- tional Conference on Artificial Intelligence and Statistics, AISTATS 2015, San Diego, California, USA, May 9-12, 2015, 2015.  Neil Stewart, Gordon DA Brown, and Nick Chater. Absolute identification by relative  judgment. Psychological review, 112(4):881, 2005. Balcan Vitercik White  Peter Stobbe and Andreas Krause. Learning fourier sparse set functions. In International  Conference on Artificial Intelligence and Statistics, pages 1125-1133, 2012.  Daniel Vainsencher, Ofer Dekel, and Shie Mannor. Bundle selling by online estimation of valuation functions. In Proceedings of the 28th International Conference on Machine Learning (ICML-11), pages 1137-1144, 2011. Learning Combinatorial Functions from Pairwise Comparisons"}