{"1": "Jacob D. Abernethy and Rafael M. Frongillo. A characterization of scoring rules for linear proper- ties. COLT 2012. Journal of Machine Learning Research — Workshop and Conference Proceed- ings, 23:27.1-27.13, 2012.  Philippe Artzner, Freddy Delbaen, Jean-Marc Eber, and David Heath. Coherent measures of risk.  Mathematical Finance, 9(3):203-228, 1999.  Heinz Bauer. Measure and Integration Theory. De Gruyter, Berlin, 2001.  Fred Alois Behringer. Convexity is equivalent to midpoint convexity combined with strict quasi-  convexity. Optimization, 24:219-228, 1992.  Fabio Bellini and Valeria Bignozzi. Elicitable risk measures. Preprint, RiskLab, Department of  Mathematics, ETH Zurich, December 2013.  Fabio Bellini, Bernhard Klar, Alfred M¨uller, and Emanuela Rosazza Gianin. Generalized quantiles  as risk measures. Insurance: Mathematics and Economics, 54:41-48, 2014.  Vladimir I. Bogachev. Measure Theory, Vol. I. Springer-Verlag, Berlin, 2007a.  Vladimir I. Bogachev. Measure Theory, Vol. II. Springer-Verlag, Berlin, 2007b.  Charles Castaing and Michel Valadier. Convex Analysis and Measurable Multifunctions. Springer,  Berlin, 1977.  P. Laurie Davies. On locally uniformly linearizable high breakdown location and scale functionals.  The Annals of Statistics, 26(3):1103-1125, June 1998.  Nicolae Dinculeanu. Vector Integration and Stochastic Integration in Banach Spaces. John Wiley  & Sons, New York, 2000.  Tilmann Gneiting. Making and evaluating point forecasts. Journal of the American Statistical  Association, 106(494):746-762, 2011.  Jun-ya Gotoh and Stan Uryasev. Support vector machines based on convex risk functionals and general norms. Technical Report 2013-6, Risk Management and Financial Engineering Lab, University of Florida, November 2013.  Jun-ya Gotoh, Akiko Takeda, and Rei Yamamoto. Interaction between financial risk measures and machine learning methods. Computational Management Science, pages 1-38, June 2013. doi: 10.1007/s10287-013-0175-5.  13   ELICITATION AND IDENTIFICATION OF PROPERTIES  Much of the work of this paper was done while Ingo Steinwart and Chlo´e Pasin were visiting ANU and NICTA. The work was supported by the Australian Research Council and NICTA, both funded by the Australian Government. Thanks to the referees for their comments.  Acknowledgments  References  Jacob D. Abernethy and Rafael M. Frongillo. A characterization of scoring rules for linear proper- ties. COLT 2012. Journal of Machine Learning Research — Workshop and Conference Proceed- ings, 23:27.1-27.13, 2012.  Philippe Artzner, Freddy Delbaen, Jean-Marc Eber, and David Heath. Coherent measures of risk.  Mathematical Finance, 9(3):203-228, 1999.  Heinz Bauer. Measure and Integration Theory. De Gruyter, Berlin, 2001.  Fred Alois Behringer. Convexity is equivalent to midpoint convexity combined with strict quasi-  convexity. Optimization, 24:219-228, 1992.  Fabio Bellini and Valeria Bignozzi. Elicitable risk measures. Preprint, RiskLab, Department of  Mathematics, ETH Zurich, December 2013.  Fabio Bellini, Bernhard Klar, Alfred M¨uller, and Emanuela Rosazza Gianin. Generalized quantiles  as risk measures. Insurance: Mathematics and Economics, 54:41-48, 2014.  Vladimir I. Bogachev. Measure Theory, Vol. I. Springer-Verlag, Berlin, 2007a.  Vladimir I. Bogachev. Measure Theory, Vol. II. Springer-Verlag, Berlin, 2007b.  Charles Castaing and Michel Valadier. Convex Analysis and Measurable Multifunctions. Springer,  Berlin, 1977.  P. Laurie Davies. On locally uniformly linearizable high breakdown location and scale functionals.  The Annals of Statistics, 26(3):1103-1125, June 1998.  Nicolae Dinculeanu. Vector Integration and Stochastic Integration in Banach Spaces. John Wiley  & Sons, New York, 2000.  Tilmann Gneiting. Making and evaluating point forecasts. Journal of the American Statistical  Association, 106(494):746-762, 2011.  Jun-ya Gotoh and Stan Uryasev. Support vector machines based on convex risk functionals and general norms. Technical Report 2013-6, Risk Management and Financial Engineering Lab, University of Florida, November 2013.  Jun-ya Gotoh, Akiko Takeda, and Rei Yamamoto. Interaction between financial risk measures and machine learning methods. Computational Management Science, pages 1-38, June 2013. doi: 10.1007/s10287-013-0175-5. STEINWART PASIN WILLIAMSON ZHANG  Kyrill Grant and Tilmann Gneiting. Consistent scoring functions for quantiles. In M. Banerjee, F. Bunea, J. Huang, V. Koltchinskii, and M. H. Maathuis, editors, From Probability to Statistics and Back: High-Dimensional Models and Processes - A Festschrift in Honor of Jon A. Wellner, volume Volume 9, pages 163-173. Institute of Mathematical Statistics, Beachwood, Ohio, 2013.  Xiaolin Huang, Lei Shi, and Johan A.K. Suykens. Asymmetric least squares support vector machine  classifiers. Computational Statistics and Data Analysis, 70:395-405, 2014.  Peter J. Huber. Robust Statistics. Wiley, New York, 1981.  M. Chris Jones. Expectiles and M-quantiles are quantiles. Statistics and Probability Letters, 20:  149-153, 1994.  Shigeo Kusuoka. On law-invariant coherent risk measures.  In Advances in Mathematical Eco-  nomics, volume 3, pages 83-95. Springer, 2001.  Nicolas Lambert, David Pennock, and Yoav Shoham. Eliciting properties of probability distribu- In Proceedings of the 9th ACM Conference on Electronic Commerce, pages 129-138,  tions. 2008.  Nicolas Lambert and Yoav Shoham. Eliciting truthful answers to multiple-choice questions. Proceedings of the 10th ACM Conference on Electronic Commerce, pages 109-118, 2009.  In  Nicolas S. Lambert.  Elicitation and evaluation of statistical forecasts.  Preprint, Stan- ford Graduate School of Business. (This version has been superseded by a version dated June 2013), April 2012. URL http://www.stanford.edu/˜nlambert/papers/ elicitation_ver2012_buggyproof.pdf.  John McCarthy. Measures of the value of information. Proceedings of the National Academy of  Sciences, 42:654-655, 1956.  Robert E. Megginson. An Introduction to Banach Space Theory. Springer, New York, 1998.  Whitney K. Newey and James L. Powell. Asymmetric least squares estimation and testing. Econo-  metrica, 55(4):819-847, July 1987.  Kent Harold Osband. Providing Incentives for Better Cost Forecasting. PhD thesis, University of  California, Berkeley, 1985.  Albrecht Pietsch. Eigenvalues and s-Numbers. Geest & Portig K.-G., Leipzig, 1987.  R. Tyrell Rockafellar. Coherent approaches to risk in optimization under uncertainty. Tutorials in  operations research, pages 38-61, 2007.  R. Tyrell Rockafellar and Stan Uryasev. The fundamental risk quadrangle in risk management, op- timization and statistical estimation. Surveys in Operations Research and Management Science, 18(1):33-53, 2013.  Leonard J. Savage. Elicitation of personal probabilities and expectations. Journal of the American  Statistical Association, 66(336):783-801, 1971. ELICITATION AND IDENTIFICATION OF PROPERTIES  Mark J. Schervish. A general method for comparing probability assessors. The Annals of Statistics,  17(4):1856-1879, 1989.  Mark J. Schervish, Joseph B. Kadane, and Teddy Seidenfeld. Characterization of proper and strictly proper scoring rules for quantiles. Preprint, Carnegie Mellon University, March 2012. URL http://www.hss.cmu.edu/philosophy/seidenfeld/relating% 20to%20scoring%20rules/Scoring%20Rules%20for%20Quantiles.pdf.  Ingo Steinwart and Andreas Christmann. Support Vector Machines. Springer, New York, 2008.  William Thompson. Eliciting production possibilities from a well-informed manager. Journal of  Economic Theory, 20:360-380, 1979.  Peter Tsyarmasto and Stan Uryasev. Advanced risk measures in estimation and classifica- In Proceedings of the International Workshop “Stochastic Programming for Implemen- tion. tation and Advanced Applications”, pages 114-118, Vilnius, July 2012. URL http://www. moksloperiodika.lt/STOPROG_2012/abstract/114-118-Tsyar.pdf.  Johanna F. Ziegel. Coherence and elicitability. Mathematical Finance, 2014. To appear."}