{"1": "Anima Anandkumar, Rong Ge, Daniel Hsu, and Sham M. Kakade. A tensor spectral approach to  learning mixed membership community models. CoRR, abs/1302.2684, 2013.  Anima Anandkumar, Rong Ge, and Majid Janzamin. Analyzing tensor power method dynamics: Applications to learning overcomplete latent variable models. CoRR, abs/1411.1488, 2014a. URL http://arxiv.org/abs/1411.1488.  Animashree Anandkumar, Rong Ge, Daniel Hsu, Sham M. Kakade, and Matus Telgarsky. Tensor decompositions for learning latent variable models. Journal of Machine Learning Research, 15(1): 2773-2832, 2014b. URL http://dl.acm.org/citation.cfm?id=2697055.  Animashree Anandkumar, Rong Ge, and Majid Janzamin. Guaranteed non-orthogonal tensor  decomposition via alternating rank-1 updates. CoRR, abs/1402.5180, 2014c.  Boaz Barak and Ankur Moitra. Tensor prediction, rademacher complexity and random 3-xor. CoRR,  abs/1501.06521, 2015. URL http://arxiv.org/abs/1501.06521.  Boaz Barak and David Steurer. Sum-of-squares proofs and the quest toward optimal algorithms.  CoRR, abs/1404.5236, 2014.  Boaz Barak, Fernando G. S. L. Brandão, Aram Wettroth Harrow, Jonathan A. Kelner, David Steurer, and Yuan Zhou. Hypercontractivity, sum-of-squares proofs, and their applications. In Howard J. Karloff and Toniann Pitassi, editors, STOC, pages 307-326. ACM, 2012. ISBN 978-1-4503-1245-5. URL http://dl.acm.org/citation.cfm?id=2213977.  Boaz Barak, Guy Kindler, and David Steurer. On the optimality of semidefinite relaxations for  average-case and generalized constraint satisfaction. In ITCS, pages 197-214, 2013.  Boaz Barak, Jonathan A. Kelner, and David Steurer. Rounding sum-of-squares relaxations. In David B. Shmoys, editor, Symposium on Theory of Computing, STOC 2014, New York, NY, USA, May 31 - June 03, 2014, pages 31-40. ACM, 2014a. ISBN 978-1-4503-2710-7. doi: 10.1145/2591796.2591886. URL http://doi.acm.org/10.1145/2591796.2591886.  Boaz Barak, Jonathan A. Kelner, and David Steurer. Dictionary learning and tensor decomposition via the sum-of-squares method. CoRR, abs/1407.1543, 2014b. URL http://arxiv.org/ abs/1407.1543.  Quentin Berthet and Philippe Rigollet. Complexity theoretic lower bounds for sparse principal component detection. In COLT 2013 - The 26th Annual Conference on Learning Theory, June 12-14, 2013, Princeton University, NJ, USA, pages 1046-1066, 2013. URL http://jmlr. org/proceedings/papers/v30/Berthet13.html.  13   TENSOR PCA  acknowledges the support of an NSF Graduate Research Fellowship under award no. 1144153. D. S. acknowledges support from the Simons Foundation, the National Science Foundation, a Alread P. Sloan Fellowship, and a Microsoft Research Faculty Fellowship, A large portion of this work was completed while the authors were long-term visitors to the Simons Institute for the Theory of Computing (Berkeley) for the program on Algorithmic Spectral Graph Theory.  References  Anima Anandkumar, Rong Ge, Daniel Hsu, and Sham M. Kakade. A tensor spectral approach to  learning mixed membership community models. CoRR, abs/1302.2684, 2013.  Anima Anandkumar, Rong Ge, and Majid Janzamin. Analyzing tensor power method dynamics: Applications to learning overcomplete latent variable models. CoRR, abs/1411.1488, 2014a. URL http://arxiv.org/abs/1411.1488.  Animashree Anandkumar, Rong Ge, Daniel Hsu, Sham M. Kakade, and Matus Telgarsky. Tensor decompositions for learning latent variable models. Journal of Machine Learning Research, 15(1): 2773-2832, 2014b. URL http://dl.acm.org/citation.cfm?id=2697055.  Animashree Anandkumar, Rong Ge, and Majid Janzamin. Guaranteed non-orthogonal tensor  decomposition via alternating rank-1 updates. CoRR, abs/1402.5180, 2014c.  Boaz Barak and Ankur Moitra. Tensor prediction, rademacher complexity and random 3-xor. CoRR,  abs/1501.06521, 2015. URL http://arxiv.org/abs/1501.06521.  Boaz Barak and David Steurer. Sum-of-squares proofs and the quest toward optimal algorithms.  CoRR, abs/1404.5236, 2014.  Boaz Barak, Fernando G. S. L. Brandão, Aram Wettroth Harrow, Jonathan A. Kelner, David Steurer, and Yuan Zhou. Hypercontractivity, sum-of-squares proofs, and their applications. In Howard J. Karloff and Toniann Pitassi, editors, STOC, pages 307-326. ACM, 2012. ISBN 978-1-4503-1245-5. URL http://dl.acm.org/citation.cfm?id=2213977.  Boaz Barak, Guy Kindler, and David Steurer. On the optimality of semidefinite relaxations for  average-case and generalized constraint satisfaction. In ITCS, pages 197-214, 2013.  Boaz Barak, Jonathan A. Kelner, and David Steurer. Rounding sum-of-squares relaxations. In David B. Shmoys, editor, Symposium on Theory of Computing, STOC 2014, New York, NY, USA, May 31 - June 03, 2014, pages 31-40. ACM, 2014a. ISBN 978-1-4503-2710-7. doi: 10.1145/2591796.2591886. URL http://doi.acm.org/10.1145/2591796.2591886.  Boaz Barak, Jonathan A. Kelner, and David Steurer. Dictionary learning and tensor decomposition via the sum-of-squares method. CoRR, abs/1407.1543, 2014b. URL http://arxiv.org/ abs/1407.1543.  Quentin Berthet and Philippe Rigollet. Complexity theoretic lower bounds for sparse principal component detection. In COLT 2013 - The 26th Annual Conference on Learning Theory, June 12-14, 2013, Princeton University, NJ, USA, pages 1046-1066, 2013. URL http://jmlr. org/proceedings/papers/v30/Berthet13.html. HOPKINS SHI STEURER  Andrew C Doherty and Stephanie Wehner. Convergence of sdp hierarchies for polynomial optimiza-  tion on the hypersphere. arXiv preprint arXiv:1210.5048, 2012.  Uriel Feige and Eran Ofek. Easily refutable subformulas of large random 3cnf formulas. Theory of  Computing, 3(1):25-43, 2007.  Uriel Feige, Jeong Han Kim, and Eran Ofek. Witnesses for non-satisfiability of dense random 3cnf  formulas. In FOCS, pages 497-508, 2006.  Joel Friedman, Andreas Goerdt, and Michael Krivelevich. Recognizing more unsatisfiable ran- doi: 10.1137/  dom k-sat instances efficiently. S009753970444096X. URL http://dx.doi.org/10.1137/S009753970444096X.  SIAM J. Comput., 35(2):408-430, 2005.  Andreas Goerdt and Michael Krivelevich. Efficient recognition of random unsatisfiable k-sat instances by spectral methods. In STACS 2001, 18th Annual Symposium on Theoretical Aspects of Computer Science, Dresden, Germany, February 15-17, 2001, Proceedings, pages 294-304, 2001. doi: 10. 1007/3-540-44693-1_26. URL http://dx.doi.org/10.1007/3-540-44693-1_26.  Andrea Montanari and Emile Richard. A statistical model for tensor pca. In Advances in Neural  Information Processing Systems, pages 2897-2905, 2014.  Andrea Montanari, Daniel Reichman, and Ofer Zeitouni. On the limitation of spectral methods: From the gaussian hidden clique problem to rank one perturbations of gaussian tensors. arXiv preprint arXiv:1411.6149, 2014.  Ryan O’Donnell and Yuan Zhou. Approximability and proof complexity. In Sanjeev Khanna, editor, SODA, pages 1537-1556. SIAM, 2013. ISBN 978-1-61197-251-1. doi: 10.1137/1.9781611973105. URL http://dx.doi.org/10.1137/1.9781611973105.  Terence Tao. Topics in random matrix theory, volume 132. American Mathematical Soc., 2012.  Ryota Tomioka and Taiji Suzuki. Spectral norm of random tensors. arXiv preprint arXiv:1407.1870,  Joel A. Tropp. User-friendly tail bounds for sums of random matrices. Foundations of Computational Mathematics, 12(4):389-434, 2012. doi: 10.1007/s10208-011-9099-z. URL http://dx.doi. org/10.1007/s10208-011-9099-z.  Roman Vershynin. Introduction to the non-asymtotic analysis of random matrices. pages 210-268,  2014.  2011."}