{"1": "Yoav Benjamini and Yosef Hochberg. Controlling the false discovery rate: a practical and powerful approach to multiple testing. Journal of the Royal Statistical Society. Series B (Methodological), 57(1):289-300, 1995.  Dan Boneh and James Shaw. Collusion-secure fingerprinting for digital data. IEEE Transactions  on Information Theory, 44(5):1897-1905, 1998.  Carlo Emilio Bonferroni. Teoria statistica delle classi e calcolo delle probabilita. Pubbl. d. R. Ist.  Super. di Sci. Econom. e Commerciali di Firenze., 8, 1936.  Mark Bun, Jonathan Ullman, and Salil P. Vadhan. Fingerprinting codes and the price of approximate  differential privacy. In STOC, pages 1-10. ACM, May 31 - June 3 2014.  Benny Chor, Amos Fiat, and Moni Naor. Tracing traitors. In CRYPTO, pages 257-270. Springer,  Irit Dinur and Kobbi Nissim. Revealing information while preserving privacy.  In PODS, pages  August 21-25 1994.  202-210. ACM, June 9-12 2003.  ation, 56:52-64, 1961.  Olive Jean Dunn. Multiple comparisons among means. Journal of the American Statistical Associ-  Cynthia Dwork, Frank McSherry, Kobbi Nissim, and Adam Smith. Calibrating noise to sensitivity  in private data analysis. In TCC, pages 265-284. Springer, March 4-7 2006.  Cynthia Dwork, Moni Naor, Omer Reingold, Guy N. Rothblum, and Salil P. Vadhan. On the com- plexity of differentially private data release: efficient algorithms and hardness results. In STOC, pages 381-390. ACM, May 31 - June 2 2009.  Cynthia Dwork, Vitaly Feldman, Moritz Hardt, Toniann Pitassi, Omer Reingold, and Aaron Roth.  Preserving statistical validity in adaptive data analysis. In STOC, 2015.  N. Etemadi. On some classical results in probability theory. Sankhya: The Indian Journal of  Statistics, Series A (1961-2002), 47(2):pp. 215-221, 1985.  Amos Fiat and Tamir Tassa. Dynamic traitor tracing. J. Cryptology, 14(3):211-223, 2001.  Moritz Hardt and Jonathan Ullman. Preventing false discovery in interactive data analysis is hard.  In FOCS. IEEE, October 19-21 2014.  Michael J. Kearns. Efficient noise-tolerant learning from statistical queries. In STOC, pages 392-  401. ACM, May 16-18 1993.  T. Laarhoven, J. Doumen, P. Roelse, B. Skoric, and B. de Weger. Dynamic tardos traitor tracing schemes. Information Theory, IEEE Transactions on, 59(7):4230-4242, July 2013. ISSN 0018- 9448. doi: 10.1109/TIT.2013.2251756.  Ryan O’Donnell. Analysis of Boolean Functions. Cambridge University Press, 2014.  12   STEINKE ULLMAN  References  Yoav Benjamini and Yosef Hochberg. Controlling the false discovery rate: a practical and powerful approach to multiple testing. Journal of the Royal Statistical Society. Series B (Methodological), 57(1):289-300, 1995.  Dan Boneh and James Shaw. Collusion-secure fingerprinting for digital data. IEEE Transactions  on Information Theory, 44(5):1897-1905, 1998.  Carlo Emilio Bonferroni. Teoria statistica delle classi e calcolo delle probabilita. Pubbl. d. R. Ist.  Super. di Sci. Econom. e Commerciali di Firenze., 8, 1936.  Mark Bun, Jonathan Ullman, and Salil P. Vadhan. Fingerprinting codes and the price of approximate  differential privacy. In STOC, pages 1-10. ACM, May 31 - June 3 2014.  Benny Chor, Amos Fiat, and Moni Naor. Tracing traitors. In CRYPTO, pages 257-270. Springer,  Irit Dinur and Kobbi Nissim. Revealing information while preserving privacy.  In PODS, pages  August 21-25 1994.  202-210. ACM, June 9-12 2003.  ation, 56:52-64, 1961.  Olive Jean Dunn. Multiple comparisons among means. Journal of the American Statistical Associ-  Cynthia Dwork, Frank McSherry, Kobbi Nissim, and Adam Smith. Calibrating noise to sensitivity  in private data analysis. In TCC, pages 265-284. Springer, March 4-7 2006.  Cynthia Dwork, Moni Naor, Omer Reingold, Guy N. Rothblum, and Salil P. Vadhan. On the com- plexity of differentially private data release: efficient algorithms and hardness results. In STOC, pages 381-390. ACM, May 31 - June 2 2009.  Cynthia Dwork, Vitaly Feldman, Moritz Hardt, Toniann Pitassi, Omer Reingold, and Aaron Roth.  Preserving statistical validity in adaptive data analysis. In STOC, 2015.  N. Etemadi. On some classical results in probability theory. Sankhya: The Indian Journal of  Statistics, Series A (1961-2002), 47(2):pp. 215-221, 1985.  Amos Fiat and Tamir Tassa. Dynamic traitor tracing. J. Cryptology, 14(3):211-223, 2001.  Moritz Hardt and Jonathan Ullman. Preventing false discovery in interactive data analysis is hard.  In FOCS. IEEE, October 19-21 2014.  Michael J. Kearns. Efficient noise-tolerant learning from statistical queries. In STOC, pages 392-  401. ACM, May 16-18 1993.  T. Laarhoven, J. Doumen, P. Roelse, B. Skoric, and B. de Weger. Dynamic tardos traitor tracing schemes. Information Theory, IEEE Transactions on, 59(7):4230-4242, July 2013. ISSN 0018- 9448. doi: 10.1109/TIT.2013.2251756.  Ryan O’Donnell. Analysis of Boolean Functions. Cambridge University Press, 2014. INTERACTIVE FINGERPRINTING CODES AND THE HARDNESS OF PREVENTING FALSE DISCOVERY  Thomas Steinke and Jonathan Ullman. Between pure and approximate differential privacy. CoRR,  abs/1501.06095, 2015.  G´abor Tardos. Optimal probabilistic fingerprint codes. J. ACM, 55(2), 2008.  Tamir Tassa. Low bandwidth dynamic traitor tracing schemes. J. Cryptology, 18(2):167-183, 2005.  Jonathan Ullman. Answering n2+o(1) counting queries with differential privacy is hard. In STOC,  pages 361-370. ACM, June 1-4 2013.  Jonathan Ullman. Private multiplicative weights beyond linear queries. CoRR, abs/1407.1571,  2014."}