{"1": "Thorsten Doliwa, Gaojian Fan, Hans Ulrich Simon, and Sandra Zilles. Recursive teaching di- mension, VC-dimension and sample compression. Journal of Machine Learning Research, 15: 3107-3131, 2014.  Ziyuan Gao, Hans U. Simon, and Sandra Zilles. On the teaching complexity of linear sets.  In Proceedings of the 26th International Conference on Algorithmic Learning Theory, pages 102- 116, 2015.  13   PREFERENCE-BASED TEACHING  Proof The proof is very simple. Choose the following hierarchical preference relation. With first priority choose a union of as few as possible boxes. With second priority, prefer a concept R (= union of boxes) over all concepts R(cid:48) that are proper subsets of R. Fig. 3 shows how the teaching set for each single box of the target concept should be chosen. If the student gets (up to) k teaching sets of this kind, she will put the largest possible box around each positive example. The negative examples at the border of the box ensure that these boxes do not become too large.  10. Conclusions  Preference-based teaching uses the natural notion of preference relation to extend the classical teaching model. The resulting model is (i) more powerful than the classical one, (ii) resolves dif- ficulties with the recursive teaching model in the case of infinite concept classes, and (iii) is at the same time free of coding tricks even according to the definition by Goldman and Mathias (1996). Our examples of algebraic and geometric concept classes demonstrate that preference-based teach- ing can be achieved very efficiently with naturally defined teaching sets and based on intuitive preference relations such as inclusion. We believe that further studies of the PBTD will provide in- sights into structural properties of concept classes that render them easy or hard to learn in a variety of formal learning models.  We have shown that spanning sets lead to a general-purpose construction for preference-based teaching sets of only positive examples. While this result is fairly obvious, it provides further justification of the model of preference-based teaching, since the teaching sets it yields are often intuitively exactly those a teacher would choose in the classroom (for instance, one would repre- sent convex polygons by their vertices). It should be noted, too, that it can sometimes be difficult to establish whether the upper bound on PBTD obtained this way is tight, or whether the use of negative examples or preference relations other than inclusion yield smaller teaching sets. A further challenge is posed by the study of unions of geometric objects such as axis-aligned boxes. There seems to be no obvious way of combining preference-based teaching sets for a number of objects to a preference-based teaching set for their union, and it is unclear how to choose preference relations in the best possible way. Generally, the choice of preference relation provides a degree of freedom that increases the power of the teacher but also increases the difficulty of establishing lower bounds on the number of examples required for teaching.  Acknowledgements. Sandra Zilles was supported by the Natural Sciences and Engineering Re- search Council of Canada (NSERC), in the Discovery Grant and Canada Research Chairs programs.  References  Thorsten Doliwa, Gaojian Fan, Hans Ulrich Simon, and Sandra Zilles. Recursive teaching di- mension, VC-dimension and sample compression. Journal of Machine Learning Research, 15: 3107-3131, 2014.  Ziyuan Gao, Hans U. Simon, and Sandra Zilles. On the teaching complexity of linear sets.  In Proceedings of the 26th International Conference on Algorithmic Learning Theory, pages 102- 116, 2015. GAO RIES SIMON ZILLES  Sally A. Goldman and Michael J. Kearns. On the complexity of teaching. Journal of Computer and  System Sciences, 50(1):20-31, 1995.  Sally A. Goldman and H. David Mathias. Teaching a smarter learner. Journal of Computer and  System Sciences, 52(2):255-267, 1996.  David Helmbold, Robert Sloan, and Manfred K. Warmuth. Learning nested differences of  intersection-closed concept classes. Machine Learning, 5:165-196, 1990.  Thomas J. Jech. The Axiom of Choice. North-Holland Pub. Co., Amsterdam, 1973.  Zeinab Mazadi, Ziyuan Gao, and Sandra Zilles. Distinguishing pattern languages with membership examples. In Proceedings of the 8th International Conference on Language and Automata Theory and Applications, pages 528-540, 2014.  Shay Moran, Amir Shpilka, Avi Wigderson, and Amir Yehudayoff. Compressing and teaching for low VC-dimension. In Proceedings of the 56’th Annual Symposium on the Foundations of Computer Science, pages 40-51, 2015.  Jos´e C. Rosales and Pedro A. Garc´ıa-S´anchez. Numerical Semigroups. Springer, 2009.  Ayumi Shinohara and Satoru Miyano. Teachability in computational learning. New Generation  Computing, 8(4):337-348, 1991.  Hans U. Simon and Sandra Zilles. Open problem: Recursive teaching dimension versus VC di- mension. In Proceedings of the 28th Annual Conference on Learning Theory, pages 1770-1772, 2015.  Sandra Zilles, Steffen Lange, Robert Holte, and Martin Zinkevich. Models of cooperative teaching  and learning. Journal of Machine Learning Research, 12:349-384, 2011."}