{"1": "K. Amano and A. Maruoka. On learning monotone boolean functions under the uniform distribution. In Proceedings of the 13th International Conference on Algorithmic Learning Theory (ALT), pages 57-68, 2002.  Avrim Blum. Learning a function of r relevant variables.  In Proc. of the 16th Annual Conference on Computational Learning Theory (COLT), volume 2777 of Lecture Notes in Computer Science, pages 731-733. Springer-Verlag, 2003.  Avrim Blum, Merrick L. Furst, Jeﬀrey Jackson, Michael J. Kearns, Yishay Mansour, and Steven Rudich. Weakly learning DNF and characterizing statistical query learning us- ing Fourier analysis. In Proc. 26th Annual ACM Symposium on Theory of Computing (STOC), pages 253-262. ACM Press, 1994.  Avrim Blum, Carl Burch, and John Langford. On learning monotone boolean functions. In Proc. 39th IEEE Symposium on Foundations of Computer Science (FOCS), pages 408-415. IEEE Computer Society Press, 1998.  Avrim Blum, Adam Kalai, and Hal Wasserman. Noise-tolerant learning, the parity problem, and the statistical query model. Journal of the ACM, 50(4):506-519, July 2003. Prelim. ver. in Proc. of STOC’00 .  Avrim Blum, Cynthia Dwork, Frank McSherry, and Kobbi Nissim. Practical privacy: the  SuLQ framework. In PODS, pages 128-138, 2005.  D. Boneh and R. Lipton. Amplification of weak learning over the uniform distribution. In Proceedings of the Sixth Annual Workshop on Computational Learning Theory, pages 347-351, 1993.  Nader H. Bshouty and Vitaly Feldman. On using extended statistical queries to avoid membership queries. Journal of Machine Learning Research, 2:359-395, 2002. Prelim. ver. in Proc. of COLT’01 .  Nader H. Bshouty and Christino Tamon. On the Fourier spectrum of monotone functions.  Journal of the ACM, 43(4):747-770, 2006.  T. Bylander. Learning noisy linear threshold functions. Available at:  http://ringer.cs.utsa.edu/research/AI/bylander/pubs/pubs.html, 1998.  Tom Bylander. Learning linear threshold functions in the presence of classification noise. In Proc. of the 7th Annual Conference on Computational Learning Theory (COLT), pages 340-347, 1994.  D. Dachman-Soled, H. Lee, T. Malkin, R. Servedio, A. Wan, and H. Wee. Optimal crypto- graphic hardness of learning monotone functions. In Proc. 35th International Colloquium on Algorithms, Languages and Programming (ICALP), pages 36-47, 2008.  John Dunagan and Santosh Vempala. A simple polynomial-time rescaling algorithm for solving linear programs. In Proc. 36th Annual ACM Symposium on Theory of Computing (STOC), pages 315-320. ACM Press, 2004.  289   Lower Bounds . . . for Learning Shallow Monotone Formulas  References  K. Amano and A. Maruoka. On learning monotone boolean functions under the uniform distribution. In Proceedings of the 13th International Conference on Algorithmic Learning Theory (ALT), pages 57-68, 2002.  Avrim Blum. Learning a function of r relevant variables.  In Proc. of the 16th Annual Conference on Computational Learning Theory (COLT), volume 2777 of Lecture Notes in Computer Science, pages 731-733. Springer-Verlag, 2003.  Avrim Blum, Merrick L. Furst, Jeﬀrey Jackson, Michael J. Kearns, Yishay Mansour, and Steven Rudich. Weakly learning DNF and characterizing statistical query learning us- ing Fourier analysis. In Proc. 26th Annual ACM Symposium on Theory of Computing (STOC), pages 253-262. ACM Press, 1994.  Avrim Blum, Carl Burch, and John Langford. On learning monotone boolean functions. In Proc. 39th IEEE Symposium on Foundations of Computer Science (FOCS), pages 408-415. IEEE Computer Society Press, 1998.  Avrim Blum, Adam Kalai, and Hal Wasserman. Noise-tolerant learning, the parity problem, and the statistical query model. Journal of the ACM, 50(4):506-519, July 2003. Prelim. ver. in Proc. of STOC’00 .  Avrim Blum, Cynthia Dwork, Frank McSherry, and Kobbi Nissim. Practical privacy: the  SuLQ framework. In PODS, pages 128-138, 2005.  D. Boneh and R. Lipton. Amplification of weak learning over the uniform distribution. In Proceedings of the Sixth Annual Workshop on Computational Learning Theory, pages 347-351, 1993.  Nader H. Bshouty and Vitaly Feldman. On using extended statistical queries to avoid membership queries. Journal of Machine Learning Research, 2:359-395, 2002. Prelim. ver. in Proc. of COLT’01 .  Nader H. Bshouty and Christino Tamon. On the Fourier spectrum of monotone functions.  Journal of the ACM, 43(4):747-770, 2006.  T. Bylander. Learning noisy linear threshold functions. Available at:  http://ringer.cs.utsa.edu/research/AI/bylander/pubs/pubs.html, 1998.  Tom Bylander. Learning linear threshold functions in the presence of classification noise. In Proc. of the 7th Annual Conference on Computational Learning Theory (COLT), pages 340-347, 1994.  D. Dachman-Soled, H. Lee, T. Malkin, R. Servedio, A. Wan, and H. Wee. Optimal crypto- graphic hardness of learning monotone functions. In Proc. 35th International Colloquium on Algorithms, Languages and Programming (ICALP), pages 36-47, 2008.  John Dunagan and Santosh Vempala. A simple polynomial-time rescaling algorithm for solving linear programs. In Proc. 36th Annual ACM Symposium on Theory of Computing (STOC), pages 315-320. ACM Press, 2004. Feldman Lee Servedio  V. Feldman. A complete characterization of statistical query learning with applications to  evolvability. CoRR, abs/1002.3183, 2010. Prelim. ver. in Proc. of FOCS’09 .  Vitaly Feldman. Evolvability from learning algorithms. In Proc. 40th Annual ACM Sym-  posium on Theory of Computing (STOC). ACM Press, 2008.  T. Hancock and Y. Mansour. Learning monotone k-µ DNF formulas on product distri- In Proceedings of the Fourth Annual Conference on Computational Learning  butions. Theory, pages 179-193, 1991.  R. Impagliazzo. Hard-core distributions for somewhat hard problems. In Proceedings of the Thirty-Sixth Annual Symposium on Foundations of Computer Science, pages 538-545, 1995.  Jeﬀrey C. Jackson, Homin K. Lee, Rocco A. Servedio, and Andrew Wan. Learning random monotone DNF. In 11th International Workshop on Approximation Algorithms for Com- binatorial Optimization Problems and 12th International Workshop on Randomization and Computation (RANDOM-APPROX), pages 483-497. Springer-Verlag, 2008.  Shiva Prasad Kasiviswanathan, Homin K. Lee, Kobbi Nissim, Sofya Raskhodnikova, and  Adam Smith. What can we learn privately? In FOCS, pages 531-540, 2008.  Michael J. Kearns. Eﬃcient noise-tolerant learning from statistical queries. Journal of the  ACM, 45(6):983-1006, 1998. Prelim. ver. in Proc. of STOC’93 .  Michael J. Kearns, Ming Li, and Leslie G. Valiant. Learning Boolean formulas. Journal of  the ACM, 41(6):1298-1328, 1994. Prelim. ver. in Proc. of STOC’87 .  Maria M. Klawe, Wolfgang J. Paul, Nicholas Pippenger, and Mihalis Yannakakis. On In Proc. 16th Annual ACM Symposium on  monotone formulae with restricted depth. Theory of Computing (STOC), pages 480-487. ACM Press, 1984.  Adam Klivans and Rocco A. Servedio. Boosting and hard-core sets. Machine Learning, 53  (3):217-238, 2003. Prelim. ver. in Proc. of FOCS’99 .  Adam R. Klivans and Alexander A. Sherstov. Unconditional lower bounds for learning intersections of halfspaces. In Proc. of the 19th Annual Conference on Computational Learning Theory (COLT), 2006.  E. Mossel and R. O’Donnell. On the noise sensitivity of monotone functions. Random  Structures and Algorithms, 23(3):333-350, 2003.  Elchanan Mossel, Ryan O’Donnell, and Rocco A. Servedio. Learning functions of k relevant variables. SIAM Journal on Computing, 37(3):421-434, 2007. Prelim. ver. in Proc. of STOC’03 .  R. O’Donnell and R. Servedio. Learning monotone decision trees in polynomial time. SIAM  J. Comput., 37(3):827-844, 2007.  Ryan O’Donnell. Hardness amplification within NP. Journal of Computer and System  Sciences, 69(1):68-94, 2004. Prelim. ver. in Proc. of STOC’02 . Lower Bounds . . . for Learning Shallow Monotone Formulas  Ryan O’Donnell and Karl Wimmer. KKL, Kruskal-Katona, and monotone nets. In Proc. 50th IEEE Symposium on Foundations of Computer Science (FOCS). IEEE Computer Society Press, 2009.  Y. Sakai and A. Maruoka. Learning monotone log-term DNF formulas under the uniform  distribution. Theory of Computing Systems, 33:17-33, 2000.  Robert E. Schapire. The strength of weak learnability. Machine Learning, 5:197-227, 1990.  Prelim. ver. in Proc. of FOCS’1989 .  Robert E. Schapire. The boosting approach to machine learning: An overview. In MSRI  Workshop on Nonlinear Estimation and Classification, 2001.  R. Servedio. Smooth boosting and learning with malicious noise. Journal of Machine  Learning Research, 4:633-648, 2003.  R. Servedio. On learning monotone DNF under product distributions. Information and  Computation, 193(1):57-74, 2004.  Alexander A. Sherstov. Communication complexity under product and nonproduct distri- butions. Computational Complexity, Annual IEEE Conference on, 0:64-70, 2008. ISSN 1093-0159. doi: http://doi.ieeecomputersociety.org/10.1109/CCC.2008.10.  Hans Ulrich Simon. A characterization of strong learnability in the statistical query model. In Proc. 24th Annual Symposium on Theoretical Aspects of Computer Science (STACS), pages 393-404, 2007.  B. Sz¨or´enyi. Characterizing statistical query learning:simplified notions and proofs. In ALT,  pages 186-200, 2009.  Luca Trevisan. List decoding using the XOR lemma.  In Proc. 44th IEEE Symposium on Foundations of Computer Science (FOCS), pages 126-135. IEEE Computer Society Press, 2003.  Luca Trevisan. On uniform amplification of hardness in NP. In Proc. 37th Annual ACM  Symposium on Theory of Computing (STOC), pages 31-38. ACM Press, 2005.  Luca Trevisan. Personal communication, 2010.  Luca Trevisan, Madhur Tulsiani, and Salil P. Vadhan. Regularity, boosting, and eﬃciently simulating every high-entropy distribution. In Proc. 24th Annual IEEE Conference on Computational Complexity (CCC), pages 126-136. IEEE Computer Society Press, 2009.  Leslie G. Valiant. Evolvability. Journal of the ACM, 56(1):3.1-3.21, 2009.  Ke Yang. New lower bounds for statistical query learning. Journal of Computer and System  Sciences, 70(4):485-509, 2005. Prelim. ver. in Proc. of COLT’02 ."}