{"1": "Emmanuel Abbe and Colin Sandon. Detection in the stochastic block model with multiple clusters: proof of the achievability conjectures, acyclic bp, and the information-computation gap. arXiv preprint arXiv:1512.09080, 2015.  Emmanuel Abbe, Afonso S Bandeira, and Georgina Hall. Exact recovery in the stochastic block  model. Information Theory, IEEE Transactions on, 62(1):471-487, 2016.  Benny Applebaum. Cryptographic hardness of random local functions-survey. In Theory of Cryp-  tography, pages 599-599. Springer, 2013.  Florent Benaych-Georges and Raj Rao Nadakuditi. The singular values and vectors of low rank perturbations of large rectangular random matrices. Journal of Multivariate Analysis, 111:120- 135, 2012.  Rajendra Bhatia. Matrix analysis, volume 169. Springer Science & Business Media, 1997.  Peter J. Bickel and Aiyou Chen. A nonparametric view of network models and newmangirvan and other modularities. Proceedings of the National Academy of Sciences, 106(50):21068-21073, 2009.  Andrej Bogdanov and Youming Qiao. On the security of goldreich’s one-way function. In Approx- imation, Randomization, and Combinatorial Optimization. Algorithms and Techniques, pages 392-405. Springer, 2009.  Charles Bordenave, Marc Lelarge, and Laurent Massouli´e. Non-backtracking spectrum of random graphs: community detection and non-regular ramanujan graphs. In Foundations of Computer Science (FOCS), 2015 IEEE 56th Annual Symposium on, pages 1347-1357. IEEE, 2015.  15   SPECTRAL THRESHOLDS IN THE BIPARTITE STOCHASTIC BLOCK MODEL  Now Lemma 4 says that if vi is the ith eigenvector of DV − EDV + B, then there is a vector u in the span of the first r eigenvectors of DV − EDV so that  (cid:107)vi − u(cid:107) ≤ C  n1n2p2 + n1/2 n2p log n1  √  1 n1/2 2 p  (cid:18)  = O  √  (cid:19)  .  1 log n1  The span of the first r eigenvectors of DV − EDV is supported on only r coordinates, so u is  far from σ = σ/  n1:  √  (cid:107)u − σ(cid:107) ≥  (cid:113)  2 − 2(cid:112)r/n1 =  √  2 − O(1/(cid:112)log n1). √  |vi · σ| = O(1/  log n1). This proves  By the triangle inequality, vi must also be far from σ: Theorem 4.  We thank the Institute for Mathematics and its Applications (IMA) in Minneapolis, where part of this work was done, for its support and hospitality.  Acknowledgments  References  Emmanuel Abbe and Colin Sandon. Detection in the stochastic block model with multiple clusters: proof of the achievability conjectures, acyclic bp, and the information-computation gap. arXiv preprint arXiv:1512.09080, 2015.  Emmanuel Abbe, Afonso S Bandeira, and Georgina Hall. Exact recovery in the stochastic block  model. Information Theory, IEEE Transactions on, 62(1):471-487, 2016.  Benny Applebaum. Cryptographic hardness of random local functions-survey. In Theory of Cryp-  tography, pages 599-599. Springer, 2013.  Florent Benaych-Georges and Raj Rao Nadakuditi. The singular values and vectors of low rank perturbations of large rectangular random matrices. Journal of Multivariate Analysis, 111:120- 135, 2012.  Rajendra Bhatia. Matrix analysis, volume 169. Springer Science & Business Media, 1997.  Peter J. Bickel and Aiyou Chen. A nonparametric view of network models and newmangirvan and other modularities. Proceedings of the National Academy of Sciences, 106(50):21068-21073, 2009.  Andrej Bogdanov and Youming Qiao. On the security of goldreich’s one-way function. In Approx- imation, Randomization, and Combinatorial Optimization. Algorithms and Techniques, pages 392-405. Springer, 2009.  Charles Bordenave, Marc Lelarge, and Laurent Massouli´e. Non-backtracking spectrum of random graphs: community detection and non-regular ramanujan graphs. In Foundations of Computer Science (FOCS), 2015 IEEE 56th Annual Symposium on, pages 1347-1357. IEEE, 2015. FLORESCU PERKINS  T.N. Bui, S. Chaudhuri, F.T. Leighton, and M. Sipser. Graph bisection algorithms with good average  case behavior. Combinatorica, 7(2):171-191, 1987.  Cristina Butucea, Yuri I Ingster, and Irina A Suslina. Sharp variable selection of a sparse submatrix  in a high-dimensional noisy matrix. ESAIM: Probability and Statistics, 19:115-134, 2015.  Amin Coja-Oghlan. Graph partitioning via adaptive spectral techniques. Combinatorics, Probability  & Computing, 19(2):227, 2010.  Anne Condon and Richard M. Karp. Algorithms for graph partitioning on the planted partition  model. Random Struct. Algorithms, 18(2):116-140, March 2001.  Chandler Davis and William Morton Kahan. The rotation of eigenvectors by a perturbation. iii.  SIAM Journal on Numerical Analysis, 7(1):1-46, 1970.  Aurelien Decelle, Florent Krzakala, Cristopher Moore, and Lenka Zdeborov´a. Asymptotic analysis of the stochastic block model for modular networks and its algorithmic applications. Physical Review E, 84(6):066106, 2011.  M.E Dyer and A.M Frieze. The solution of some random np-hard problems in polynomial expected  time. Journal of Algorithms, 10(4):451 - 489, 1989.  William Evans, Claire Kenyon, Yuval Peres, and Leonard J Schulman. Broadcasting on trees and  the ising model. Annals of Applied Probability, pages 410-433, 2000.  Vitaly Feldman, Will Perkins, and Santosh Vempala. On the complexity of random satisfiability In STOC 2015: 47th Annual Symposium on the Theory of  problems with planted solutions. Computing, 2015a.  Vitaly Feldman, Will Perkins, and Santosh Vempala. Subsampled power iteration: a new algorithm  for block models and planted csp’s. In NIPS, 2015b.  Oded Goldreich. Candidate one-way functions based on expander graphs. IACR Cryptology ePrint  Archive, 2000:63, 2000.  Bruce Hajek, Yihong Wu, and Jiaming Xu. Achieving exact cluster recovery threshold via semidef- inite programming. In Information Theory (ISIT), 2015 IEEE International Symposium on, pages 1442-1446. IEEE, 2015a.  Bruce Hajek, Yihong Wu, and Jiaming Xu. Submatrix localization via message passing. arXiv  preprint arXiv:1510.09219, 2015b.  Paul W. Holland, Kathryn B. Laskey, and Samuel Leinhardt. Stochastic blockmodels: First steps.  Social Networks, 5(2):109-137, June 1983.  Mark Jerrum and Gregory B. Sorkin. The metropolis algorithm for graph bisection. Discrete Applied  Mathematics, 82(13):155 - 175, 1998.  Florent Krzakala, Marc M´ezard, and Lenka Zdeborov´a. Reweighted belief propagation and quiet planting for random k-sat. Journal on Satisfiability, Boolean Modeling and Computation, 8: 149-171, 2014. SPECTRAL THRESHOLDS IN THE BIPARTITE STOCHASTIC BLOCK MODEL  Daniel B Larremore, Aaron Clauset, and Abigail Z Jacobs. Efficiently inferring community struc-  ture in bipartite networks. Physical Review E, 90(1):012805, 2014.  Marc Lelarge, Laurent Massouli´e, and Jiaming Xu. Reconstruction in the labeled stochastic block  model. In Information Theory Workshop (ITW), 2013 IEEE, pages 1-5. IEEE, 2013.  Russell Lyons. Random walks and percolation on trees. The annals of Probability, pages 931-958,  1990.  Laurent Massouli´e. Community detection thresholds and the weak ramanujan property. In STOC  2014: 46th Annual Symposium on the Theory of Computing, pages 1-10, 2014.  Frank McSherry. Spectral partitioning of random graphs.  In Foundations of Computer Science,  2001. Proceedings. 42nd IEEE Symposium on, pages 529-537. IEEE, 2001.  Elchanan Mossel, Joe Neeman, and Allan Sly. A proof of the block model threshold conjecture.  arXiv preprint arXiv:1311.4115, 2013.  Elchanan Mossel, Joe Neeman, and Allan Sly. Reconstruction and estimation in the planted partition  model. Probability Theory and Related Fields, pages 1-31, 2014.  Elchanan Mossel, Joe Neeman, and Allan Sly. Consistency thresholds for the planted bisection model. In Proceedings of the Forty-Seventh Annual ACM on Symposium on Theory of Computing, pages 69-75. ACM, 2015.  Mark EJ Newman. Scientific collaboration networks. i. network construction and fundamental re-  sults. Physical review E, 64(1):016131, 2001.  Ryan O’Donnell and David Witmer. Goldreich’s prg: Evidence for near-optimal polynomial stretch.  In CCC, 2014.  Robin Pemantle and Yuval Peres. The critical ising model on trees, concave recursions and nonlinear  capacity. The Annals of Probability, 38(1):184-206, 2010.  Tom A. B. Snijders and Krzysztof Nowicki. Estimation and Prediction for Stochastic Blockmodels for Graphs with Latent Block Structure. Journal of Classification, 14(1):75-100, January 1997.  Tao Zhou, Jie Ren, Mat´uˇs Medo, and Yi-Cheng Zhang. Bipartite network projection and personal  recommendation. Physical Review E, 76(4):046115, 2007."}