{"1": "The authors wish to express their thanks to the anonymous referees for several helpful remarks, in particular concerning a simplified proof of Proposition 4.  David M Blei, Andrew Y Ng, and Michael I Jordan. Latent dirichlet allocation. Journal of machine  Learning research, 3(Jan):993-1022, 2003.  Sebastien Bubeck, Ronen Eldan, and Joseph Lehec. Finite-time analysis of projected langevin monte carlo. In Proceedings of the 28th International Conference on Neural Information Pro- cessing Systems, NIPS’15, pages 1243-1251, Cambridge, MA, USA, 2015. MIT Press. URL http://dl.acm.org/citation.cfm?id=2969239.2969378.  Gilles Celeux, Mohammed El Anbari, Jean-Michel Marin, and Christian P. Robert. Regularization in regression: Comparing bayesian and frequentist methods in a poorly informative situation. Bayesian Anal., 7(2):477-502, 06 2012. doi: 10.1214/12-BA716. URL http://dx.doi. org/10.1214/12-BA716.  21   SAMPLING FROM A LOG-CONCAVE DISTRIBUTION WITH COMPACT SUPPORT  Using (cid:0)d i  (cid:1)Γ((3 + i)/2) ≤ (  π/2)di for i ∈ {0, . . . , d}, we have for λ ∈ (cid:0)0, 16−1r2d−2(cid:3),  √  √  √  C2 ≤ 2  πλe4λ(∆2/r)2  ≤ 4  πλe4λ(∆2/r)2  .  √  d (cid:88)  (cid:32)(cid:33)i  λd r  i=0  D defined in (47) is upper bounded by RB where B is defined in Section 6.3-c). Combining the bounds on C1, C2, D gives the result.  6.5. Proof of Proposition 7 Assume that γ ∈ (cid:0)0, (m + L)−1(cid:1). (Durmus and Moulines, 2016, Theorem 5) gives for all n ∈ N(cid:63):  W 2  2 (δxRn  γ , πλ) ≤ 2 (1 − (κγ)/2)n (cid:110)  (cid:107)x − x(cid:63)(cid:107)2 + d/m  + u(γ) ,  (cid:111)  where,  u(γ) = 2κ−1L2dγ(κ−1 + γ)  2 +  (cid:18)  L2γ m  +  (cid:19)  .  L2γ2 6  Noting that κγ ≤ 1 and L2γ2 ≤ 1, it is then sufficient for γ, n to satisfy,  4κ−2L2dγ 2 (1 − (κγ)/2)n (cid:110)  (cid:18)  +  2 +  L2γ 1 6 m (cid:107)x − x(cid:63)(cid:107)2 + d/m  (cid:19)  (cid:111)  ≤ ε2/2 ,  ≤ ε2/2 ,  which concludes the proof.  Acknowledgments  References  The authors wish to express their thanks to the anonymous referees for several helpful remarks, in particular concerning a simplified proof of Proposition 4.  David M Blei, Andrew Y Ng, and Michael I Jordan. Latent dirichlet allocation. Journal of machine  Learning research, 3(Jan):993-1022, 2003.  Sebastien Bubeck, Ronen Eldan, and Joseph Lehec. Finite-time analysis of projected langevin monte carlo. In Proceedings of the 28th International Conference on Neural Information Pro- cessing Systems, NIPS’15, pages 1243-1251, Cambridge, MA, USA, 2015. MIT Press. URL http://dl.acm.org/citation.cfm?id=2969239.2969378.  Gilles Celeux, Mohammed El Anbari, Jean-Michel Marin, and Christian P. Robert. Regularization in regression: Comparing bayesian and frequentist methods in a poorly informative situation. Bayesian Anal., 7(2):477-502, 06 2012. doi: 10.1214/12-BA716. URL http://dx.doi. org/10.1214/12-BA716. BROSSE DURMUS MOULINES PEREYRA  Ming-Hui Chen, Qi-Man Shao, and Joseph G Ibrahim. Monte Carlo methods in Bayesian compu-  tation. Springer Science & Business Media, 2012.  Ben Cousins and Santosh Vempala.  the volume of convex bodies, Jun 2015. URL http://fr.mathworks.com/matlabcentral/fileexchange/ 43596-volume-computation-of-convex-bodies.  Computation of  Arnak S Dalalyan. Theoretical guarantees for approximate sampling from smooth and log-concave densities. Journal of the Royal Statistical Society: Series B (Statistical Methodology), 2016.  A. Durmus and E. Moulines. Non-asymptotic convergence analysis for the Unadjusted Langevin  Algorithm. ArXiv e-prints, July 2015. Accepted for publication in Ann. Appl. Probab.  A. Durmus and E. Moulines. High-dimensional Bayesian inference via the Unadjusted Langevin  Algorithm. ArXiv e-prints, May 2016.  A. Durmus, E. Moulines, and M. Pereyra. Efficient Bayesian computation by proximal Markov chain Monte Carlo: when Langevin meets Moreau. ArXiv e-prints, December 2016. Accepted for publication in SIAM J. Imaging Sciences.  Martin Dyer and Alan Frieze. Computing the volume of convex bodies: a case where randomness  provably helps. Probabilistic combinatorics and its applications, 44:123-170, 1991.  A. E. Gelfand, A. F. Smith, and T.-M. Lee. Bayesian analysis of constrained parameter and truncated data problems using gibbs sampling. Journal of the American Statistical Association, 87(418): 523-532, 1992.  Valen E Johnson and James H Albert. Ordinal data modeling. Springer Science & Business Media,  2006.  Press, 1997.  J¨urgen Kampf. On weighted parallel volumes. Beitr¨age Algebra Geom, 50(2):495-519, 2009.  Daniel A Klain and Gian-Carlo Rota. Introduction to geometric probability. Cambridge University  John P Klein and Melvin L Moeschberger. Survival analysis: techniques for censored and truncated  data. Springer Science & Business Media, 2005.  S. Lan and B. Shahbaba. Sampling constrained probability distributions using Spherical Augmen-  tation. ArXiv e-prints, June 2015.  L´aszl´o Lov´asz and Santosh Vempala. Hit-and-run from a corner. SIAM Journal on Computing, 35 (4):985-1005, 2006. doi: 10.1137/S009753970544727X. URL http://dx.doi.org/10. 1137/S009753970544727X.  L´aszl´o Lov´asz and Santosh Vempala. The geometry of logconcave functions and sampling al- ISSN 1042-9832. doi:  gorithms. Random Struct. Algorithms, 30(3):307-358, May 2007. 10.1002/rsa.v30:3. URL http://dx.doi.org/10.1002/rsa.v30:3. SAMPLING FROM A LOG-CONCAVE DISTRIBUTION WITH COMPACT SUPPORT  Balasubramanian Narasimhan and Steven G. Johnson. cubature: Adaptive Multivariate Integration over Hypercubes, 2016. URL https://CRAN.R-project.org/package=cubature. R package version 1.3-6.  John Paisley, David M Blei, and Michael I Jordan. Bayesian nonnegative matrix factorization In Handbook of Mixed Membership Models and Their  with stochastic variational inference. Applications, pages 205-224. Chapman and Hall/CRC, 2014.  Ari Pakman and Liam Paninski. Exact hamiltonian monte carlo for truncated multivariate gaussians.  Journal of Computational and Graphical Statistics, 23(2):518-542, 2014.  G. Parisi. Correlation functions and computer simulations. Nuclear Physics B, 180:378-384, 1981.  T. Park and G. Casella. The Bayesian lasso. J. Amer. Statist. Assoc., 103(482):681-686, 2008. ISSN 0162-1459. doi: 10.1198/016214508000000337. URL http://dx.doi.org/10. 1198/016214508000000337.  G. O. Roberts and R. L. Tweedie. Exponential convergence of Langevin distributions and their dis- crete approximations. Bernoulli, 2(4):341-363, 1996. ISSN 1350-7265. doi: 10.2307/3318418. URL http://dx.doi.org/10.2307/3318418.  R. T. Rockafellar and R. J.-B. Wets. Variational analysis, volume 317 of Grundlehren der Mathematischen Wissenschaften [Fundamental Principles of Mathematical Sciences]. Springer- Verlag, Berlin, 1998. ISBN 3-540-62772-3. doi: 10.1007/978-3-642-02431-3. URL http: //dx.doi.org/10.1007/978-3-642-02431-3.  Ralph Tyrell Rockafellar. Convex analysis. Princeton university press, 2015.  Gabriel Rodriguez-Yam, Richard A Davis, and Louis L Scharf. Efficient gibbs sampling of truncated multivariate normal with application to constrained linear regression. Unpublished manuscript, 2004.  Rolf Schneider. Convex bodies: the Brunn-Minkowski theory. Number 151. Cambridge University  Press, 2013.  C. Villani. Optimal transport : old and new. Grundlehren der mathematischen Wissenschaften. ISBN 978-3-540-71049-3. URL http://opac.inria.fr/  Springer, Berlin, 2009. record=b1129524."}