{"1": "L. Birg´e. Approximation dans les espaces metriques et theorie de l’estimation. Zeitschrift f¨ur  Wahrscheinlichkeitstheorie und Verwandte Gebiete, 65:181–237, 1983.  L. Birg´e and P. Massart. Rates of convergence for minimum contrast estimators. Probability Theory  and Related Fields, 97:113–150, 1993.  E. M. Bronshtein. (cid:15)-entropy of convex sets and functions. Siberian Mathematical Journal, 17:  393–398, 1976.  12.10   GUNTUBOYINA SEN  Remark 6 The explicit packing subset constructed in the above proof consists of functions that can be viewed as perturbations of the quadratic function f0. Previous lower bounds on the covering numbers of convex functions in (Bronshtein, 1976, Proof of Theorem 6) and (Dryanov, 2009, Section 2) (for d = 1) are based on perturbations of a function whose graph is a subset of a sphere; a more complicated convex function than f0. The perturbations of f0 in the above proof can also be used to simplify the lower bound arguments in those papers.  Remark 7 For functions defined on [0, 1]d, the Lp metric, p > 1, is larger than L1. Thus, when a = 0, b = 1, the conclusion of Theorem 5 also holds for the Lp metric with p > 1. The scaling identity (2) then gives the following inequality for arbitrary a < b: There exist positive constants c and (cid:15)0, depending only on the dimension d, such that for every p ≥ 1, B > 0 and b > a, we have  (cid:16)  log M  C([a, b]d, B), (cid:15); Lp  ≥ c  (cid:17)  (cid:18)  (cid:15) B(b − a)d/p  (cid:19)−d/2  ,  for (cid:15) ≤ (cid:15)0B(b − a)d/p.  4. Concluding remarks  In this paper we have studied the covering numbers of C([a, b]d, B), the class of all uniformly bounded convex functions, defined on the hypercube [a, b]d, under the L1 metric, 1 ≤ p ≤ ∞. Our main result shows that we can forgo the assumption of a uniform Lipschitz norm for the underlying class of convex functions (as was assumed in Bronshtein (1976)) and still show that the logarithm of the (cid:15)-covering number grows at the same order (cid:15)−d/2, under the L1 metric. Specifically, we prove that the logarithm of the (cid:15)-covering number under the L1 metric is bounded from both above and below by a constant multiple of (cid:15)−d/2. Our proof of the upper bound in Theorem 2 is based on Lemma 3 which bounds the L1 distance between two convex functions by a constant multiple of the Hausdorff distance between their epigraphs. Our proof of the lower bound in Theorem 5 is based on an explicit construction of a finite packing subset of the space of uniformly bounded convex functions. In the"}