{"1": "Raef Bassily, Adam Smith, and Abhradeep Thakurta. Private empirical risk minimization, revisited.  arXiv preprint 1405.7085, 2014.  J. Eric Bickel. Some comparisons among quadratic, spherical, and logarithmic scoring rules. Deci-  sion Analysis, 4(2):49-65, June 2007.  Glenn W. Brier. Verification of forecasts expressed in terms of probability. Monthly Weather Review,  78(1), 1950.  Yang Cai, Constantinos Daskalakis, and Christos H. Papadimitriou. Optimum statistical estimation  with strategic data sources. arXiv preprint 1408.2539, 2014.  Kamalika Chaudhuri, Claire Monteleoni, and Anand D. Sarwate. Differentially private empirical  risk minimization. J. Mach. Learn. Res., 12:1069-1109, July 2011.  Yiling Chen, Stephen Chong, Ian A. Kash, Tal Moran, and Salil Vadhan. Truthful mechanisms for agents that value privacy. In Proceedings of the 14th ACM Conference on Electronic Commerce, EC ’13, pages 215-232, 2013.  Rachel Cummings, Katrina Ligett, Aaron Roth, Zhiwei Steven Wu, and Juba Ziani. Accuracy for sale: Aggregating data with a variance constraint. In Proceedings of the 6th Innovations in Theoretical Computer Science, ITCS ’15, 2015.  Ofer Dekel, Felix Fischer, and Ariel D. Procaccia. Incentive compatible regression learning. Journal  of Computer and System Sciences, 76(8):759 - 777, 2010.  Cynthia Dwork, Frank McSherry, Kobbi Nissim, and Adam Smith. Calibrating noise to sensitivity in private data analysis. In Proceedings of the 3rd Conference on Theory of Cryptography, TCC ’06, pages 265-284, 2006.  Cynthia Dwork, Guy N. Rothblum, and Salil Vadhan. Boosting and differential privacy. In Pro- ceedings of the IEEE 51st Annual Symposium on Foundations of Computer Science, FOCS ’10, pages 51-60, 2010.  Lisa K. Fleischer and Yu-Han Lyu. Approximately optimal auctions for selling privacy when costs are correlated with data. In Proceedings of the 13th ACM Conference on Electronic Commerce, EC ’12, pages 568-585, New York, NY, USA, 2012. ACM.  Arpita Ghosh and Aaron Roth. Selling privacy at auction. Games and Economic Behavior, 2013. Preliminary Version appeared un the Proceedings of the Twelfth ACM Conference on Electronic Commerce (EC 2011).  Arpita Ghosh, Katrina Ligett, Aaron Roth, and Grant Schoenebeck. Buying private data without verification. In Proceedings of the Fifteenth ACM Conference on Economics and Computation, EC ’14, pages 931-948, 2014.  Thibaut Horel, Stratis Ioannidis, and S. Muthukrishnan. Budget feasible mechanisms for experimen- tal design. In Alberto Pardo and Alfredo Viola, editors, LATIN 2014: Theoretical Informatics, Lecture Notes in Computer Science, pages 719-730. 2014.  13   TRUTHFUL LINEAR REGRESSION  References  Raef Bassily, Adam Smith, and Abhradeep Thakurta. Private empirical risk minimization, revisited.  arXiv preprint 1405.7085, 2014.  J. Eric Bickel. Some comparisons among quadratic, spherical, and logarithmic scoring rules. Deci-  sion Analysis, 4(2):49-65, June 2007.  Glenn W. Brier. Verification of forecasts expressed in terms of probability. Monthly Weather Review,  78(1), 1950.  Yang Cai, Constantinos Daskalakis, and Christos H. Papadimitriou. Optimum statistical estimation  with strategic data sources. arXiv preprint 1408.2539, 2014.  Kamalika Chaudhuri, Claire Monteleoni, and Anand D. Sarwate. Differentially private empirical  risk minimization. J. Mach. Learn. Res., 12:1069-1109, July 2011.  Yiling Chen, Stephen Chong, Ian A. Kash, Tal Moran, and Salil Vadhan. Truthful mechanisms for agents that value privacy. In Proceedings of the 14th ACM Conference on Electronic Commerce, EC ’13, pages 215-232, 2013.  Rachel Cummings, Katrina Ligett, Aaron Roth, Zhiwei Steven Wu, and Juba Ziani. Accuracy for sale: Aggregating data with a variance constraint. In Proceedings of the 6th Innovations in Theoretical Computer Science, ITCS ’15, 2015.  Ofer Dekel, Felix Fischer, and Ariel D. Procaccia. Incentive compatible regression learning. Journal  of Computer and System Sciences, 76(8):759 - 777, 2010.  Cynthia Dwork, Frank McSherry, Kobbi Nissim, and Adam Smith. Calibrating noise to sensitivity in private data analysis. In Proceedings of the 3rd Conference on Theory of Cryptography, TCC ’06, pages 265-284, 2006.  Cynthia Dwork, Guy N. Rothblum, and Salil Vadhan. Boosting and differential privacy. In Pro- ceedings of the IEEE 51st Annual Symposium on Foundations of Computer Science, FOCS ’10, pages 51-60, 2010.  Lisa K. Fleischer and Yu-Han Lyu. Approximately optimal auctions for selling privacy when costs are correlated with data. In Proceedings of the 13th ACM Conference on Electronic Commerce, EC ’12, pages 568-585, New York, NY, USA, 2012. ACM.  Arpita Ghosh and Aaron Roth. Selling privacy at auction. Games and Economic Behavior, 2013. Preliminary Version appeared un the Proceedings of the Twelfth ACM Conference on Electronic Commerce (EC 2011).  Arpita Ghosh, Katrina Ligett, Aaron Roth, and Grant Schoenebeck. Buying private data without verification. In Proceedings of the Fifteenth ACM Conference on Economics and Computation, EC ’14, pages 931-948, 2014.  Thibaut Horel, Stratis Ioannidis, and S. Muthukrishnan. Budget feasible mechanisms for experimen- tal design. In Alberto Pardo and Alfredo Viola, editors, LATIN 2014: Theoretical Informatics, Lecture Notes in Computer Science, pages 719-730. 2014. CUMMINGS IOANNIDIS LIGETT  Justin Hsu, Zhiyi Huang, Aaron Roth, Tim Roughgarden, and Zhiwei Steven Wu. Private matchings and allocations. In Proceedings of the 46th Annual ACM Symposium on Theory of Computing, STOC ’14, pages 21-30, 2014.  Stratis Ioannidis and Patrick Loiseau. Linear regression as a non-cooperative game. In Yiling Chen and Nicole Immorlica, editors, Web and Internet Economics, Lecture Notes in Computer Science, pages 277-290. 2013.  Michael Kearns, Mallesh Pai, Aaron Roth, and Jonathan Ullman. Mechanism design in large games: Incentives and privacy. In Proceedings of the 5th Conference on Innovations in Theoretical Com- puter Science, ITCS ’14, pages 403-410, 2014.  Donald Knuth. Seminumerical algorithms, volume 2, pages 130-131. Addison-Wesley Publishing  Company, 2 edition, 1981.  Katrina Ligett and Aaron Roth. Take it or leave it: Running a survey when privacy comes at a cost. In Proceedings of the 8th International Conference on Internet and Network Economics, WINE’12, pages 378-391, 2012.  Frank McSherry. Privacy integrated queries: an extensible platform for privacy-preserving data  analysis. In In Proceeding SIGMOD Conference, pages 19-30, 2009.  Nolan Miller, Paul Resnick, and Richard Zeckhauser. Eliciting informative feedback: The peer-  prediction method. Management Science, 51(9):1359-1373, Sept 2005.  Kobbi Nissim, Claudio Orlandi, and Rann Smorodinsky. Privacy-aware mechanism design.  In Proceedings of the 13th ACM Conference on Electronic Commerce, EC ’12, pages 774-789, 2012.  Kobbi Nissim, Salil Vadhan, and David Xiao. Is privacy compatible with truthfulness? In Proceed-  ings of the 4th Innovations in Theoretical Computer Science, ITCS ’14, 2014. To appear.  Javier Perote and Juan Perote-Pena. Strategy-proof estimators for simple regression. In Mathemat-  ical Social Sciences 47, pages 153-176, 2004.  Roman Vershynin. Introduction to the non-asymptotic analysis of random matrices. In Y. Eldar and G. Kutyniok, editors, Compressed Sensing, theory and applications, chapter 5, pages 210-268. Cambridge University Press, 2012."}