{"1": "Scott Aaronson. The complexity of agreement. In ACM Symposium on Theory of Computing, pages  634-643, 2005. doi: 10.1145/1060590.1060686.  Daron Acemoglu and Asuman Ozdaglar. Opinion dynamics and learning in social networks. Dy-  namic Games and Applications, 1(1):3-49, 2011. doi: 10.1007/s13235-010-0004-1.  9   REASONING IN BAYESIAN OPINION EXCHANGE NETWORKS IS PSPACE-HARD  • Ultimately, the hardness will be shown for the computation of agent OBSK. • Agent OBSi directly observes variable agents in blocks xK, . . . , xi+1. It will be useful to think of OBSi as “computing” a logical formula with i − 1 quantifier switches (since from the perspective of this agent blocks xK, . . . , xi+1 are set to fixed values).  • For each i, there is a (slightly more complicated) gadget similar to the “EVAL-gadget” em- ployed in the 3-SAT reduction. This gadget involves OBSi−1 as well as two new agents Bi and Ci and is observed by OBSi. Its purpose is to “ﬂip” relative LLRs of different types of variable assignments to implement a quantifier switch.  4. Conclusion  A natural open question is to make progress on the approximate-case hardness in one of the models. For example, one could try to establish NP-hardness for a worst-case network, but holding for signal configurations arising with non-negligible probability. This might require significant new ideas.  Another interesting problem arises from trying to extend our results to the revealed belief model, as discussed in Section D. Thinking in terms of games, consider a class of “no-mistakes-allowed” games: Games where the player with winning strategy always has exactly one winning move, with all alternative moves in a given position leading to a losing position (and this property holding recursively in all positions reachable from the initial one).  Certainly deciding if a position is winning for the first player in such games is in PSPACE. On the other hand, since such a game with all moves performed by the existential player corresponds to a SAT formula with zero or one satisfying assignments, by the Valiant-Vazirani theorem (Valiant and Vazirani, 1986) it is also (morally) NP-hard. This leaves a large gap between NP and PSPACE. For example, suppose we want to prove Π2-hardness in the revealed belief model. Then it is natural to consider formulas of the form ∀x∃y : φ(x, y), and the question becomes: How hard is it to distinguish between the cases:  • YES: For all x, there exists unique yx such that φ(x, yx) = 1. • NO: There exists unique x0 such that for all y we have φ(x0, y) = 0. For all other x, there  exists unique yx such that φ(x, yx) = 1.  How hard is this problem? In particular, can it be shown to be harder than NP (in some sense)? Hardness of such games can be thought of as a generalization of the Valiant-Vazirani theorem.  We thank Ehsan Emamjomeh-Zadeh for pointing out the PSPACE upper bound. We are also grateful to referees for helpful corrections. This work was partially supported by awards ONR N00014-16- 1-2227, NSF CCF-1665252 and ARO MURI W911NF-12-1-0509 and by a Vannevar Bush Fellow- ship.  Acknowledgments  References  Scott Aaronson. The complexity of agreement. In ACM Symposium on Theory of Computing, pages  634-643, 2005. doi: 10.1145/1060590.1060686.  Daron Acemoglu and Asuman Ozdaglar. Opinion dynamics and learning in social networks. Dy-  namic Games and Applications, 1(1):3-49, 2011. doi: 10.1007/s13235-010-0004-1. REASONING IN BAYESIAN OPINION EXCHANGE NETWORKS IS PSPACE-HARD  Daron Acemoglu, Asuman Ozdaglar, and Ali ParandehGheibi. Spread of (mis)information in social networks. Games and Economic Behavior, 70(2):194-227, 2010. doi: 10.1016/j.geb.2010.01. 005.  Daron Acemoglu, Munther A. Dahleh, Ilan Lobel, and Asuman Ozdaglar. Bayesian learning in social networks. The Review of Economic Studies, 78(4):1201-1236, 2011. doi: 10.1093/restud/ rdr004.  Itai Arieli, Yakov Babichenko, and Manuel Mueller-Frank. Naive learning through probability  matching. SSRN preprint, doi: 10.2139/ssrn.3338015, 2019.  Robert J. Aumann. Agreeing to disagree. The Annals of Statistics, 4(6):1236-1239, 1976. doi:  10.1214/aos/1176343654.  Venkatesh Bala and Sanjeev Goyal. Learning from neighbours. The Review of Economic Studies,  65(3):595-621, 1998. doi: 10.1111/1467-937X.00059.  Abhijit V. Banerjee. A simple model of herd behavior. The Quarterly Journal of Economics, 107  (3):797-817, 1992. doi: 10.2307/2118364.  Sushil Bikhchandani, David Hirshleifer, and Ivo Welch. A theory of fads, fashion, custom, and cultural change as informational cascades. Journal of Political Economy, 100(5):992-1026, 1992. doi: 10.1086/261849.  Vivek Borkar and Pravin P. Varaiya. Asymptotic agreement in distributed estimation. IEEE Trans-  actions on Automatic Control, 27(3):650-655, 1982. doi: 10.1109/TAC.1982.1102982.  Peter Clifford and Aidan Sudbury. A model for spatial conﬂict. Biometrika, 60(3):581-588, 1973.  doi: 10.1093/biomet/60.3.581.  Anne Condon, Joan Feigenbaum, Carsten Lund, and Peter Shor. Probabilistically checkable proof systems and nonapproximability of PSPACE-hard functions. Chicago Journal of Theoretical Computer Science, 1995(4), 1995.  Anne Condon, Joan Feigenbaum, Carsten Lund, and Peter Shor. Random debaters and the hardness of approximating stochastic functions. SIAM Journal on Computing, 26(2):369-400, 1997. doi: 10.1137/S0097539793260738.  Tyler Cowen and Robin Hanson. Are disagreements honest? Technical report, George Mason  University Economics, 2002.  Morris H. DeGroot. Reaching a consensus. Journal of the American Statistical Association, 69  (345):118-121, 1974. doi: 10.1080/01621459.1974.10480137.  Douglas Gale and Shachar Kariv. Bayesian learning in social networks. Games and Economic  Behavior, 45(2):329-346, 2003. doi: https://doi.org/10.1016/S0899-8256(03)00144-1.  John Geanakoplos. Common knowledge.  In Handbook of Game Theory with Economic Appli- cations, volume 2, chapter 40, pages 1437-1496. Elsevier, 1st edition, 1994. doi: 10.1016/ S1574-0005(05)80072-4. REASONING IN BAYESIAN OPINION EXCHANGE NETWORKS IS PSPACE-HARD  John D. Geanakoplos and Heraklis M. Polemarchakis. We can’t disagree forever. Journal of Eco-  nomic Theory, 28(1):192-200, 1982. doi: 10.1016/0022-0531(82)90099-0.  Benjamin Golub and Matthew O. Jackson. Naïve learning in social networks and the wisdom of crowds. American Economic Journal: Microeconomics, 2(1):112-149, February 2010. doi: 10.1257/mic.2.1.112.  Robin Hanson. For Bayesian wannabes, are disagreements not about information? Theory and  Decision, 54(2):105-123, 2003. doi: 10.1023/A:1026251404228.  Richard A. Holley and Thomas M. Liggett. Ergodic theorems for weakly interacting infinite sys- tems and the voter model. The Annals of Probability, 3(4):643-663, 1975. doi: 10.1214/aop/ 1176996306.  Harry B. Hunt, Madhav V. Marathe, and Richard E. Stearns. Generalized CNF satisfiability prob- lems and non-efficient approximability. In Complexity Theory Conference (CCC), pages 356- 366, 1994.  Jan H ˛azła, Ali Jadbabaie, Elchanan Mossel, and M. Amin Rahimian. Bayesian decision making in  groups is hard. arXiv:1705.04770v3, 2018.  Peter Jonsson. A nonapproximability result for finite function generation. Information Processing  Letters, 63(3):143-145, 1997. doi: 10.1016/S0020-0190(97)00112-9.  Peter Jonsson. Strong bounds on the approximability of two PSPACE-hard problems in proposi- tional planning. Annals of Mathematics and Artificial Intelligence, 26(1):133-147, 1999. doi: 10.1023/A:1018954827926.  Johan Kwisthout. Approximate inference in Bayesian networks: Parameterized complexity results. International Journal of Approximate Reasoning, 93:119-131, 2018. doi: https://doi.org/10. 1016/j.ijar.2017.10.029.  Madhav V. Marathe, Harry B. Hunt, and S. S. Ravi. The complexity of approximating PSPACE- complete problems for hierarchical specifications. Nordic Journal of Computing, 1(3):275-316, 1994.  Elchanan Mossel and Omer Tamuz. Opinion exchange dynamics. Probability Surveys, 14:155-204,  2017. doi: 10.1214/14-PS230.  Elchanan Mossel, Allan Sly, and Omer Tamuz. Asymptotic learning on Bayesian social networks. Probability Theory and Related Fields, 158(1):127-157, 2014. doi: 10.1007/s00440-013-0479-y.  Elchanan Mossel, Noah Olsman, and Omer Tamuz. Efficient Bayesian learning in social networks with Gaussian estimators. In Allerton Conference on Communication, Control, and Computing (Allerton), pages 425-432, 2016. doi: 10.1109/ALLERTON.2016.7852262.  Christos H. Papadimitriou and John Tsitsiklis. On the complexity of designing distributed protocols.  Information and Control, 53(3):211-218, 1982. doi: 10.1016/S0019-9958(82)91034-8.  Christos H. Papadimitriou and John Tsitsiklis. Intractable problems in control theory. SIAM Journal  on Control and Optimization, 24(4):639-654, 1986. doi: 10.1137/0324038. REASONING IN BAYESIAN OPINION EXCHANGE NETWORKS IS PSPACE-HARD  Christos H. Papadimitriou and John N. Tsitsiklis. The complexity of Markov decision processes.  Mathematics of Operations Research, 12(3):441-450, 1987. doi: 10.1287/moor.12.3.441.  Dinah Rosenberg, Eilon Solan, and Nicolas Vieille. Informational externalities and emergence of consensus. Games and Economic Behavior, 66(2):979-994, 2009. doi: 10.1016/j.geb.2008.09. 027.  Lones Smith and Peter Sørensen. Pathological outcomes of observational learning. Econometrica,  68(2):371-398, 2000. doi: 10.1111/1468-0262.00113.  John N. Tsitsiklis and Michael Athans. Convergence and asymptotic agreement in distributed deci- sion problems. IEEE Transactions on Automatic Control, 29(1):42-50, 1984. doi: 10.1109/TAC. 1984.1103385.  John N. Tsitsiklis and Michael Athans. On the complexity of decentralized decision making and detection problems. IEEE Transactions on Automatic Control, 30(5):440-446, 1985. doi: 10. 1109/TAC.1985.1103988.  Leslie G. Valiant and Vijay V. Vazirani. NP is as easy as detecting unique solutions. Theoretical  Computer Science, 47:85-93, 1986. doi: 10.1016/0304-3975(86)90135-0. REASONING IN BAYESIAN OPINION EXCHANGE NETWORKS IS PSPACE-HARD"}