{"1": "Jayadev Acharya and Constantinos Daskalakis. Testing poisson binomial distributions. In Proceed- ings of the Twenty-Sixth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2015, San Diego, CA, USA, January 4-6, 2015, pages 1829-1840, 2015.  Jayadev Acharya, Hirakendu Das, Ashkan Jafarpour, Alon Orlitsky, Shengjun Pan, and In Proceedings of  Ananda Theertha Suresh. Competitive classification and closeness testing. the 25th Annual Conference on Learning Theory (COLT), pages 22.1-22.18, 2012.  Jayadev Acharya, Cl´ement L. Canonne, and Gautam Kamath. A chasm between identity and equiv-  alence testing with conditional queries. CoRR, abs/1411.7346, 2014a.  Jayadev Acharya, Ashkan Jafarpour, Alon Orlitksy, and Ananda Theertha Suresh. Sublinear algo- rithms for outlier detection and generalized closeness testing. In Proceedings of the 2014 IEEE International Symposium on Information Theory (ISIT), 2014b.  Maria-Florina Balcan, Eric Blais, Avrim Blum, and Liu Yang. Active property testing.  In 53rd Annual IEEE Symposium on Foundations of Computer Science, FOCS 2012, New Brunswick, NJ, USA, October 20-23, 2012, pages 21-30, 2012.  Tugkan Batu, Lance Fortnow, Ronitt Rubinfeld, Warren D. Smith, and Patrick White. Testing that In Annual Symposium on Foundations of Computer Science (FOCS),  distributions are close. pages 259-269, 2000.  Tugkan Batu, Lance Fortnow, Eldar Fischer, Ravi Kumar, Ronitt Rubinfeld, and Patrick White. Testing random variables for independence and identity. In 42nd Annual Symposium on Foun- dations of Computer Science, FOCS 2001, 14-17 October 2001, Las Vegas, Nevada, USA, pages 442-451, 2001.  Tugkan Batu, Ravi Kumar, and Ronitt Rubinfeld. Sublinear algorithms for testing monotone and unimodal distributions. In Proceedings of the 36th Annual ACM Symposium on Theory of Com- puting, Chicago, IL, USA, June 13-16, 2004, pages 381-390, 2004.  Cl´ement L. Canonne, Dana Ron, and Rocco A. Servedio. Testing equivalence between distributions using conditional samples. In Proceedings of the Twenty-Fifth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2014, Portland, Oregon, USA, January 5-7, 2014, pages 1174-1192, 2014.  Sourav Chakraborty, Eldar Fischer, Yonatan Goldhirsh, and Arie Matsliah. On the power of condi- tional samples in distribution testing. In Innovations in Theoretical Computer Science, ITCS ’13, Berkeley, CA, USA, January 9-12, 2013, pages 561-580, 2013.  Siu On Chan, Ilias Diakonikolas, Rocco A. Servedio, and Xiaorui Sun. Efficient density estimation via piecewise polynomial approximation. In Symposium on Theory of Computing, STOC 2014, New York, NY, USA, May 31 - June 03, 2014, pages 604-613, 2014a.  Siu On Chan, Ilias Diakonikolas, Paul Valiant, and Gregory Valiant. Optimal algorithms for testing  closeness of discrete distributions. In Symposium on Discrete Algorithms (SODA), 2014b.  13   FASTER ALGORITHMS FOR TESTING UNDER CONDITIONAL SAMPLING  References  Jayadev Acharya and Constantinos Daskalakis. Testing poisson binomial distributions. In Proceed- ings of the Twenty-Sixth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2015, San Diego, CA, USA, January 4-6, 2015, pages 1829-1840, 2015.  Jayadev Acharya, Hirakendu Das, Ashkan Jafarpour, Alon Orlitsky, Shengjun Pan, and In Proceedings of  Ananda Theertha Suresh. Competitive classification and closeness testing. the 25th Annual Conference on Learning Theory (COLT), pages 22.1-22.18, 2012.  Jayadev Acharya, Cl´ement L. Canonne, and Gautam Kamath. A chasm between identity and equiv-  alence testing with conditional queries. CoRR, abs/1411.7346, 2014a.  Jayadev Acharya, Ashkan Jafarpour, Alon Orlitksy, and Ananda Theertha Suresh. Sublinear algo- rithms for outlier detection and generalized closeness testing. In Proceedings of the 2014 IEEE International Symposium on Information Theory (ISIT), 2014b.  Maria-Florina Balcan, Eric Blais, Avrim Blum, and Liu Yang. Active property testing.  In 53rd Annual IEEE Symposium on Foundations of Computer Science, FOCS 2012, New Brunswick, NJ, USA, October 20-23, 2012, pages 21-30, 2012.  Tugkan Batu, Lance Fortnow, Ronitt Rubinfeld, Warren D. Smith, and Patrick White. Testing that In Annual Symposium on Foundations of Computer Science (FOCS),  distributions are close. pages 259-269, 2000.  Tugkan Batu, Lance Fortnow, Eldar Fischer, Ravi Kumar, Ronitt Rubinfeld, and Patrick White. Testing random variables for independence and identity. In 42nd Annual Symposium on Foun- dations of Computer Science, FOCS 2001, 14-17 October 2001, Las Vegas, Nevada, USA, pages 442-451, 2001.  Tugkan Batu, Ravi Kumar, and Ronitt Rubinfeld. Sublinear algorithms for testing monotone and unimodal distributions. In Proceedings of the 36th Annual ACM Symposium on Theory of Com- puting, Chicago, IL, USA, June 13-16, 2004, pages 381-390, 2004.  Cl´ement L. Canonne, Dana Ron, and Rocco A. Servedio. Testing equivalence between distributions using conditional samples. In Proceedings of the Twenty-Fifth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2014, Portland, Oregon, USA, January 5-7, 2014, pages 1174-1192, 2014.  Sourav Chakraborty, Eldar Fischer, Yonatan Goldhirsh, and Arie Matsliah. On the power of condi- tional samples in distribution testing. In Innovations in Theoretical Computer Science, ITCS ’13, Berkeley, CA, USA, January 9-12, 2013, pages 561-580, 2013.  Siu On Chan, Ilias Diakonikolas, Rocco A. Servedio, and Xiaorui Sun. Efficient density estimation via piecewise polynomial approximation. In Symposium on Theory of Computing, STOC 2014, New York, NY, USA, May 31 - June 03, 2014, pages 604-613, 2014a.  Siu On Chan, Ilias Diakonikolas, Paul Valiant, and Gregory Valiant. Optimal algorithms for testing  closeness of discrete distributions. In Symposium on Discrete Algorithms (SODA), 2014b. FALAHATGAR JAFARPOUR ORLITSKY PICHAPATI SURESH  Constantinos Daskalakis, Ilias Diakonikolas, Rocco A. Servedio, Gregory Valiant, and Paul Valiant. Testing k-modal distributions: Optimal algorithms via reductions. In Proceedings of the Twenty- Fourth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2013, New Orleans, Louisiana, USA, January 6-8, 2013, pages 1833-1852, 2013.  Ilias Diakonikolas, Daniel M. Kane, and Vladimir Nikishkin. Testing identity of structured distribu- tions. In Proceedings of the Twenty-Sixth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2015, San Diego, CA, USA, January 4-6, 2015, pages 1841-1854, 2015.  Eldar Fisher. Distinguishing distributions with conditional samples. Bertinoro 2014, 2014. URL  http://sublinear.info/66.  Oded Goldreich and Dana Ron. On testing expansion in bounded-degree graphs. Electronic Collo-  quium on Computational Complexity (ECCC), 7(20), 2000.  Sudipto Guha, Andrew McGregor, and Suresh Venkatasubramanian. Sublinear estimation of en-  tropy and information distances. ACM Transactions on Algorithms, 5(4), 2009.  Reut Levi, Dana Ron, and Ronitt Rubinfeld. Testing properties of collections of distributions.  Theory of Computing, 9:295-347, 2013.  Liam Paninski. A coincidence-based test for uniformity given very sparsely sampled discrete data.  IEEE Transactions on Information Theory, 54(10):4750-4755, 2008.  Ronitt Rubinfeld and Rocco A. Servedio. Testing monotone high-dimensional distributions. Ran-  dom Struct. Algorithms, 34(1):24-44, 2009.  Jayakrishnan Unnikrishnan. On optimal two sample homogeneity tests for finite alphabets.  In Proceedings of the 2012 IEEE International Symposium on Information Theory (ISIT), pages 2027-2031, 2012.  Gregory Valiant and Paul Valiant. Instance-by-instance optimal identity testing. Electronic Collo-  quium on Computational Complexity (ECCC), 20:111, 2013.  Paul Valiant. Testing symmetric properties of distributions. SIAM Journal on Computing, 40(6):  1927-1968, December 2011. ISSN 0097-5397.  Bo Waggoner. Lp testing and learning of discrete distributions. In Proceedings of the 2015 Con- ference on Innovations in Theoretical Computer Science, ITCS 2015, Rehovot, Israel, January 11-13, 2015, pages 347-356, 2015.  Jacob Ziv. On classification with empirically observed statistics and universal data compression.  IEEE Transactions on Information Theory, 34(2):278-286, 1988."}