{"1": "Society, 68, 1950.  N. Aronszajn. Theory of reproducing kernels. Transactions of the American Mathematical  Frank Bauer, Sergei Pereverzev, and Lorenzo Rosasco. On regularization algorithms in learning theory. J. Complex., 23(1):52-72, February 2007. ISSN 0885-064X. doi: 10. 1016/j.jco.2006.07.001. URL http://dx.doi.org/10.1016/j.jco.2006.07.001.  Andrea Caponnetto and Ernesto De Vito. Optimal rates for the regularized least-squares  algorithm. Foundations of Computational Mathematics, 7(3):331-368, 2007.  P. Deheuvels. Uniform limit laws for kernel density estimators on possibly unbounded interval. In Recent Advances in Reliability Theory, pages 477-492. Birkh¨auser, 2000.  L. Devroye and G. Lugosi. Combinatorial Methods in Density Estimation. Springer, New  York, 2001.  U. Einmahl and D. Mason. An empirical process approach to the uniform consistency of  kernel-type function estimators. J. Theoret. Probab., 13:1-37, 2000.  23   Consistency of Robust Kernel Density Estimators  Returning to the original notation, this means, for suﬃciently small σ  (cid:107)A(cid:107)Hσ  ≤  Φσ (x) dµn (x)  4 (cid:107)g − h(cid:107)Hσ  1 −  (cid:90)  (cid:13) (cid:13) (cid:13) (cid:13)  (cid:13) (cid:13) (cid:13) (cid:13)Hσ  (cid:32)  (cid:33)−3  (cid:114) 9 10  (cid:107)Φσ(cid:107)−3 Hσ  .  From our proof of the consistency of the KDE we know that (cid:13) p (cid:82) Φσ(x)dµn(x) − ¯fσ → 0 (cid:13) and from Lemma 8 (cid:13) is bounded by some constant with probability going to one. Note that this is the only probabilistic step, which does not depend on g or h, so the result holds over the whole ball in Hσ. So there exists CA > 0 such that  (cid:82) Φσ(x)dµn(x)(cid:13) ≤ (cid:107)f (cid:107)2 so (cid:13) (cid:13)  (cid:13) (cid:13)Hσ  (cid:13) (cid:13)Hσ  (cid:13) ¯fσ  (cid:13)Hσ  with probability going to one (we can omit “for suﬃciently small σ” since σ → 0 as n → ∞). Finally we get with probability going to one as nσd → ∞  (cid:107)A(cid:107)Hσ  ≤ (cid:107)g − h(cid:107)Hσ  (cid:107)Φσ(cid:107)−3 Hσ  CA  (cid:13) (cid:13) (cid:13) (cid:13)  A B  (cid:13) (cid:13) (cid:13) (cid:13)Hσ  =  (cid:107)A(cid:107)Hσ B  ≤ (cid:107)g − h(cid:107)Hσ  = (cid:107)g − h(cid:107)Hσ  CA (cid:107)Φσ(cid:107)−3 Hσ CB (cid:107)Φσ(cid:107)−2 Hσ CR (cid:107)Φσ(cid:107)−1 Hσ  .  References  Society, 68, 1950.  N. Aronszajn. Theory of reproducing kernels. Transactions of the American Mathematical  Frank Bauer, Sergei Pereverzev, and Lorenzo Rosasco. On regularization algorithms in learning theory. J. Complex., 23(1):52-72, February 2007. ISSN 0885-064X. doi: 10. 1016/j.jco.2006.07.001. URL http://dx.doi.org/10.1016/j.jco.2006.07.001.  Andrea Caponnetto and Ernesto De Vito. Optimal rates for the regularized least-squares  algorithm. Foundations of Computational Mathematics, 7(3):331-368, 2007.  P. Deheuvels. Uniform limit laws for kernel density estimators on possibly unbounded interval. In Recent Advances in Reliability Theory, pages 477-492. Birkh¨auser, 2000.  L. Devroye and G. Lugosi. Combinatorial Methods in Density Estimation. Springer, New  York, 2001.  U. Einmahl and D. Mason. An empirical process approach to the uniform consistency of  kernel-type function estimators. J. Theoret. Probab., 13:1-37, 2000. Vandermeulen Scott  E. Gine, V. Koltchinskii, and J. Zinn. Weighted uniform consistency of kernel density  estimators. Ann. Probab., 32:2570-2605, 2004.  Evarist Gin´e and Armelle Guillou. Rates of strong uniform consistency for multivariate ker- nel density estimators. Annales de l’Institut Henri Poincare (B) Probability and Statistics, 38(6):907 - 921, 2002. ISSN 0246-0203. doi: 10.1016/S0246-0203(02)01128-7.  J. Kim and C. Scott. Robust kernel density estimation. J. Machine Learning Res., 13:  2529-2565, 2012.  Iosif Pinelis. Optimum bounds for the distributions of martingales in banach spaces. The  Annals of Probability, 22(4):pp. 1679-1706, 1994.  D. W. Scott. Multivariate Density Estimation. Wiley, New York, 1992.  Clint Scovel, Don Hush, Ingo Steinwart, and James Theiler. Radial kernels and their reproducing kernel Hilbert spaces. Journal of Complexity, 26(6):641 - 660, 2010. ISSN 0885-064X. doi: 10.1016/j.jco.2010.03.002.  B W Silverman. Weak and strong uniform consistency of the kernel estimate of a density  and its derivatives. The Annals of Statistics, 6(1), 1978.  B. W. Silverman. Density Estimation for Statistics and Data Analysis. Chapman and Hall,  London, 1986.  Steve Smale and Ding-Xuan Zhou. Learning theory estimates via integral operators and their approximations. Constructive Approximation, 26:153-172, 2007. ISSN 0176-4276. 10.1007/s00365-006-0659-y.  I. Steinwart and A. Christmann. Support Vector Machines. Springer, 2008.  W. Stute. A law of the logarithm for kernel density estimators. Ann. Probab., 10:414-422,  1982.  Papers, 53:1-21, 2012.  D. Wied and R. Weissbach. Consistency of the kernel density estimator: a survey. Statistical"}