{"1": "Arpit Agarwal, Shivani Agarwal, Sepehr Assadi, and Sanjeev Khanna. Learning with limited rounds of adaptivity: Coin tossing, multi-armed bandits, and ranking from pairwise comparisons. In Pro- ceedings of the 30th Conference on Learning Theory, COLT 2017, Amsterdam, The Netherlands, 7-10 July 2017, pages 39-75, 2017.  N. Ailon. Active learning ranking from pairwise preferences with almost optimal query complexity.  In Advances in Neural Information Processing Systems, 2011.  N Ailon, M. Charikar, and A. Newman. Aggregating inconsistent information: ranking and cluster-  ing. Journal of the ACM, 55(5):23:1-23:27, 2008.  M Ajtai, J Komlos, W L Steiger, and E Szemeredi. Deterministic selection in o(loglog n) parallel time. In Proceedings of the Eighteenth Annual ACM Symposium on Theory of Computing, STOC ’86, pages 188-195, New York, NY, USA, 1986. ACM. ISBN 0-89791-193-8. doi: 10.1145/ 12130.12149. URL http://doi.acm.org/10.1145/12130.12149.  12   SORTED TOP-k IN ROUNDS  the blow up in the sample complexity when we transition from the noiseless case to the noisy case. Interestingly, for r = 1 or 2, this blow up is different in different rank aggregation problems: Θ(1) in top-k, Θ(log(k)) in sorted top-k and Θ(log(n)) in sorting.  There are mainly two obstacles to getting tighter bounds for top-k, sorting and sorted top-k when we have more than 2 rounds. We list them as open problems here. The first one is that we don’t have tight (up to a constant factor) sample complexity bounds even in the noiseless case.  Open Problem 6 Get tight (up to a constant factor) sample complexity bounds for the noiseless case when r > 2.  In particular, the first step is to consider 3-round top-k in the noiseless case. Braverman et al. (2016) shows its sample complexity is O(n · polylog(n)). Bollob´as and Brightwell (1990) shows that no 3-round algorithm with Θ(n) comparisons can find top-k correctly with probability 1 − o(1). If we only want to succeed with constant probability (for example 2/3), the best lower bound is the trivial one: Ω(n).  Once we have a good understanding of the noiseless case, we can start to think about the noisy  case for r > 2.  Open Problem 7 Extend our techniques for r = 1 or 2 in the noisy case to the case when we have more than 2 rounds.  In the noisy case, our 2-round bounds are very different and more complicated compared to 1-round bounds. Even if we have tight bounds in the noiseless case, getting tight bounds for more than 2 rounds could be more difficult and might require new techniques.  We would like to thank Claire Mathieu for earlier discussions of this problem.  Acknowledgments  References  Arpit Agarwal, Shivani Agarwal, Sepehr Assadi, and Sanjeev Khanna. Learning with limited rounds of adaptivity: Coin tossing, multi-armed bandits, and ranking from pairwise comparisons. In Pro- ceedings of the 30th Conference on Learning Theory, COLT 2017, Amsterdam, The Netherlands, 7-10 July 2017, pages 39-75, 2017.  N. Ailon. Active learning ranking from pairwise preferences with almost optimal query complexity.  In Advances in Neural Information Processing Systems, 2011.  N Ailon, M. Charikar, and A. Newman. Aggregating inconsistent information: ranking and cluster-  ing. Journal of the ACM, 55(5):23:1-23:27, 2008.  M Ajtai, J Komlos, W L Steiger, and E Szemeredi. Deterministic selection in o(loglog n) parallel time. In Proceedings of the Eighteenth Annual ACM Symposium on Theory of Computing, STOC ’86, pages 188-195, New York, NY, USA, 1986. ACM. ISBN 0-89791-193-8. doi: 10.1145/ 12130.12149. URL http://doi.acm.org/10.1145/12130.12149. SORTED TOP-k IN ROUNDS  Mikl´os Ajtai, J´anos Koml´os, and Endre Szemer´edi. An o(n log n) sorting network.  In Pro- ceedings of the 15th Annual ACM Symposium on Theory of Computing, 25-27 April, 1983, Boston, Massachusetts, USA, pages 1-9, 1983. doi: 10.1145/800061.808726. URL http: //doi.acm.org/10.1145/800061.808726.  Selim G. Akl. Parallel Sorting Algorithms. Academic Press, Inc., Orlando, FL, USA, 1990. ISBN  0120476800.  Noga Alon. Expanders, sorting in rounds and superconcentrators of limited depth. In Proceedings of the 17th Annual ACM Symposium on Theory of Computing, May 6-8, 1985, Providence, Rhode Island, USA, pages 98-102, 1985. doi: 10.1145/22145.22156. URL http://doi.acm.org/ 10.1145/22145.22156.  Noga Alon and Yossi Azar. Sorting, approximate sorting, and searching in rounds. SIAM J. Dis- crete Math., 1(3):269-280, 1988a. doi: 10.1137/0401028. URL http://dx.doi.org/10. 1137/0401028.  Noga Alon and Yossi Azar. The average complexity of deterministic and randomized parallel comparison-sorting algorithms. SIAM J. Comput., 17(6):1178-1192, 1988b. doi: 10.1137/ 0217074. URL http://dx.doi.org/10.1137/0217074.  Noga Alon, Yossi Azar, and Uzi Vishkin. Tight complexity bounds for parallel comparison sorting. In 27th Annual Symposium on Foundations of Computer Science, Toronto, Canada, 27-29 Octo- ber 1986, pages 502-510, 1986. doi: 10.1109/SFCS.1986.57. URL http://dx.doi.org/ 10.1109/SFCS.1986.57.  Yossi Azar and Nicholas Pippenger. Parallel selection. Discrete Applied Mathematics, 27(1-2): 49-58, 1990. doi: 10.1016/0166-218X(90)90128-Y. URL https://doi.org/10.1016/ 0166-218X(90)90128-Y.  Yossi Azar and Uzi Vishkin. Tight comparison bounds on the complexity of parallel sorting. SIAM J. Comput., 16(3):458-464, 1987. doi: 10.1137/0216032. URL https://doi.org/10. 1137/0216032.  B´ela Bollob´as and Graham Brightwell. Parallel selection with high probability. SIAM J. Discrete Math., 3(1):21-31, 1990. doi: 10.1137/0403003. URL http://dx.doi.org/10.1137/ 0403003.  B´ela Bollob´as and Pavol Hell. Sorting and graphs.  In Ivan Rival, editor, Graphs and Order, volume 147 of NATO ASI Series, pages 169-184. Springer Netherlands, 1985. ISBN 978-94- 010-8848-0. doi: 10.1007/978-94-009-5315-4 5. URL http://dx.doi.org/10.1007/ 978-94-009-5315-4_5.  B´ela Bollob´as and Andrew Thomason. Parallel sorting. Discrete Applied Mathematics, 6(1):1 - 11, 1983. ISSN 0166-218X. doi: http://dx.doi.org/10.1016/0166-218X(83)90095-1. URL http: //www.sciencedirect.com/science/article/pii/0166218X83900951.  Mark Braverman and Elchanan Mossel. Noisy sorting without resampling. In Proceedings of the Nineteenth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA ’08, pages 268-276, SORTED TOP-k IN ROUNDS  Philadelphia, PA, USA, 2008. Society for Industrial and Applied Mathematics. URL http: //dl.acm.org/citation.cfm?id=1347082.1347112.  Mark Braverman and Elchanan Mossel. Sorting from noisy information. CoRR, abs/0910.1191,  2009. URL http://arxiv.org/abs/0910.1191.  Mark Braverman, Jieming Mao, and S. Matthew Weinberg. Parallel algorithms for select and par- tition with noisy comparisons. In Proceedings of the Forty-eighth Annual ACM Symposium on Theory of Computing, STOC ’16, pages 851-862, New York, NY, USA, 2016. ACM. ISBN 978- 1-4503-4132-5. doi: 10.1145/2897518.2897642. URL http://doi.acm.org/10.1145/ 2897518.2897642.  J. M. Chambers. Algorithm 410: Partial sorting. Commun. ACM, 14(5):357-358, May 1971. ISSN 0001-0782. doi: 10.1145/362588.362602. URL http://doi.acm.org/10.1145/ 362588.362602.  X. Chen, S. Gopi, J. Mao, and J. Schneider. Competitive analysis of the top-k ranking problem. In  Proceedings of ACM-SIAM Symposium on Discrete Algorithms (SODA), 2017.  Xi Chen, Yuanzhi Li, and Jieming Mao. A nearly instance optimal algorithm for top-k ranking In Proceedings of the Twenty-Eighth Annual ACM-SIAM  under the multinomial logit model. Symposium on Discrete Algorithms, SODA, 2018.  Yuxin Chen and Changho Suh. Spectral MLE: top-k rank aggregation from pairwise comparisons. In Proceedings of the 32nd International Conference on Machine Learning, ICML 2015, Lille, France, 6-11 July 2015, pages 371-380, 2015. URL http://jmlr.org/proceedings/ papers/v37/chena15.html.  Vincent Cohen-Addad, Frederik Mallmann-Trenn, and Claire Mathieu. Instance-optimality in the noisy value-and comparison-model — accept, accept, strong accept: Which papers get in? arXiv preprint arXiv:1806.08182, 2018.  Uriel Feige, Prabhakar Raghavan, David Peleg, and Eli Upfal. Computing with noisy information. SIAM J. Comput., 23(5):1001-1018, 1994. doi: 10.1137/S0097539791195877. URL https: //doi.org/10.1137/S0097539791195877.  Roland H¨aggkvist and Pavol Hell. Parallel sorting with constant time for comparisons. SIAM J. Comput., 10(3):465-472, 1981. doi: 10.1137/0210034. URL http://dx.doi.org/10. 1137/0210034.  K. Jamieson and R. Nowak. Active ranking using pairwise comparisons. In Advances in Neural  Information Processing Systems, 2011.  C. Kenyon-Mathieu and W. Schudy. How to rank with few errors. In Proceedings of the Symposium  on Theory of computing (STOC), 2007.  Clyde P. Kruskal. Searching, merging, and sorting in parallel computation. IEEE Trans. Comput- ers, 32(10):942-946, 1983. doi: 10.1109/TC.1983.1676138. URL https://doi.org/10. 1109/TC.1983.1676138. SORTED TOP-k IN ROUNDS  Frank Thomson Leighton. Tight bounds on the complexity of parallel sorting. In Proceedings of the 16th Annual ACM Symposium on Theory of Computing, April 30 - May 2, 1984, Washington, DC, USA, pages 71-80, 1984. doi: 10.1145/800057.808667. URL http://doi.acm.org/ 10.1145/800057.808667.  T. Lu and C. Boutilier. Learning mallows models with pairwise preferences. In Proceedings of the  International Conference on Machine Learning (ICML), 2011.  Konstantin Makarychev, Yury Makarychev, and Aravindan Vijayaraghavan. Sorting noisy data with partial information. In Proceedings of the 4th Conference on Innovations in Theoretical Computer Science, ITCS ’13, pages 515-528, New York, NY, USA, 2013. ACM. ISBN 978-1-4503-1859- 4. doi: 10.1145/2422436.2422492. URL http://doi.acm.org/10.1145/2422436. 2422492.  S. Mohajer and C. Suh. Active top-k ranking from noisy comparisons. In Proceedings of the 54th  Annual Allerton Conference on Communication, Control, and Computing (Allerton), 2016.  S. Negahban, S. Oh, and D. Shah. Rank centrality: Ranking from pair-wise comparisons. Opera-  tions Research, 65(1):266-287, 2017.  Alessandro Panconesi and Aravind Srinivasan. Randomized distributed edge coloring via an extension of the chernoff-hoeffding bounds. SIAM J. Comput., 26(2):350-368, April 1997. ISSN 0097-5397. doi: 10.1137/S0097539793250767. URL https://doi.org/10.1137/ S0097539793250767.  Nicholas Pippenger. Sorting and selecting in rounds. SIAM J. Comput., 16(6):1032-1038, 1987.  doi: 10.1137/0216066. URL https://doi.org/10.1137/0216066.  A. Rajkumar and S. Agarwal. A statistical convergence perspective of algorithms for rank aggre- gation from pairwise data. In Proceedings of the International Conference on Machine Learning (ICML), 2014.  R¨udiger Reischuk. A fast probabilistic parallel sorting algorithm.  In 22nd Annual Symposium on Foundations of Computer Science, Nashville, Tennessee, USA, 28-30 October 1981, pages 212-219, 1981. doi: 10.1109/SFCS.1981.6. URL http://dx.doi.org/10.1109/SFCS. 1981.6.  N. B. Shah and M. Wainwright. Simple, robust and optimal ranking from pairwise comparisons.  arXiv preprint arXiv:1512.08949, 2015.  N. B. Shah, S. Balakrishnan, A. Guntuboyina, and M. J. Wainright. Stochastically transitive models for pairwise comparisons: Statistical and computational issues. IEEE Transactions on Informa- tion Theory, 63(2):934-959, 2017.  C. Suh, V. Tan, and R. Zhao. Adversarial top-k ranking. IEEE Transactions on Information Theory,  63(4):2201-2225, 2017.  Leslie G. Valiant. Parallelism in comparison problems. SIAM J. Comput., 4(3):348-355, 1975. doi:  10.1137/0204030. URL http://dx.doi.org/10.1137/0204030. SORTED TOP-k IN ROUNDS  F. Wauthier, M.Jordan, and N. Jojic. Efficient ranking from pairwise comparisons. In Proceedings  of the International Conference on Machine Learning (ICML), 2013."}