{"1": "Luigi Ambrosio, Nicola Gigli, and Guiseppe Savar´e. Gradient Flows in Metric Spaces and in the  Space of Probability Measures. Birkh¨auser Verlag AG, Basel, second edition, 2005.  Luigi Ambrosio, Giuseppe Savar´e, and Lorenzo Zambotti. Existence and stability for Fokker- Planck equations with log-concave reference measure. Probability theory and related fields, 145 (3):517-564, 2009.  Jean-David Benamou, Guillaume Carlier, Quentin M´erigot, and Edouard Oudet. Discretization of functionals involving the Monge-Amp`ere operator. Numerische mathematik, 134(3):611-636, 2016.  Adrien Blanchet and J´erˆome Bolte. A family of functional inequalities: Lojasiewicz inequalities  and displacement convex functions. arXiv preprint arXiv:1612.02619, 2016.  Malcolm Bowles and Martial Agueh. Weak solutions to a fractional Fokker-Planck equation via  splitting and Wasserstein gradient ﬂow. Applied Mathematics Letters, 42:30-35, 2015.  Martin Burger, Marzena Franek, and Carola-Bibiane Sch¨onlieb. Regularized regression and density estimation based on optimal transport. Applied Mathematics Research eXpress, 2012(2):209- 253, 2012.  Jos´e A Carrillo, Alina Chertock, and Yanghong Huang. A finite-volume method for nonlinear nonlocal equations with a gradient ﬂow structure. Communications in Computational Physics, 17(1):233-258, 2015a.  Jose Antonio Carrillo, Yanghong Huang, Francesco Saverio Patacchini, and Gershon Wolansky. Numerical study of a particle method for gradient ﬂows. arXiv preprint arXiv:1512.03029, 2015b.  Jos´e Antonio Carrillo, Katy Craig, and Francesco S Patacchini. A blob method for diffusion. arXiv  preprint arXiv:1709.09195, 2017.  Emmanuel C´epa. Probl`eme de Skorohod multivoque. The Annals of Probability, 26(2):500-532,  1998.  11   LMC AND JKO SPLITTING  first-order convergence. Recently, Plazotta (2018) developed a variational formulation of the BDF2 scheme applicable to the estimation of gradient ﬂows. It is also likely that the growing literature on Langevin Monte Carlo and its variations can lead to new time discretization schemes that are of both practical and theoretical interest to the gradient ﬂow community.  Acknowledgments  I’m greatly indebted to Nicolas Chopin and Marco Cuturi for hosting my visit to ENSAE ParisTech and CREST, where the material in this paper was developed. I’d also like to thank L´ena¨ıc Chizat, Arnak Dalalyan, Jeremy Heng, Pierre E. Jacob, Boris Muzellec and Gabriel Peyr´e for interesting conversations about optimal transport, gradient ﬂows, and Monte Carlo sampling. This material is based upon research supported by the Chateaubriand Fellowship of the Office for Science & Technology of the Embassy of France in the United States.  References  Luigi Ambrosio, Nicola Gigli, and Guiseppe Savar´e. Gradient Flows in Metric Spaces and in the  Space of Probability Measures. Birkh¨auser Verlag AG, Basel, second edition, 2005.  Luigi Ambrosio, Giuseppe Savar´e, and Lorenzo Zambotti. Existence and stability for Fokker- Planck equations with log-concave reference measure. Probability theory and related fields, 145 (3):517-564, 2009.  Jean-David Benamou, Guillaume Carlier, Quentin M´erigot, and Edouard Oudet. Discretization of functionals involving the Monge-Amp`ere operator. Numerische mathematik, 134(3):611-636, 2016.  Adrien Blanchet and J´erˆome Bolte. A family of functional inequalities: Lojasiewicz inequalities  and displacement convex functions. arXiv preprint arXiv:1612.02619, 2016.  Malcolm Bowles and Martial Agueh. Weak solutions to a fractional Fokker-Planck equation via  splitting and Wasserstein gradient ﬂow. Applied Mathematics Letters, 42:30-35, 2015.  Martin Burger, Marzena Franek, and Carola-Bibiane Sch¨onlieb. Regularized regression and density estimation based on optimal transport. Applied Mathematics Research eXpress, 2012(2):209- 253, 2012.  Jos´e A Carrillo, Alina Chertock, and Yanghong Huang. A finite-volume method for nonlinear nonlocal equations with a gradient ﬂow structure. Communications in Computational Physics, 17(1):233-258, 2015a.  Jose Antonio Carrillo, Yanghong Huang, Francesco Saverio Patacchini, and Gershon Wolansky. Numerical study of a particle method for gradient ﬂows. arXiv preprint arXiv:1512.03029, 2015b.  Jos´e Antonio Carrillo, Katy Craig, and Francesco S Patacchini. A blob method for diffusion. arXiv  preprint arXiv:1709.09195, 2017.  Emmanuel C´epa. Probl`eme de Skorohod multivoque. The Annals of Probability, 26(2):500-532,  1998. LMC AND JKO SPLITTING  Xiang Cheng and Peter Bartlett. Convergence of Langevin MCMC in KL-divergence. arXiv preprint  arXiv:1705.09048, 2017.  Philippe Cl´ement and Jan Maas. A Trotter product formula for gradient ﬂows in metric spaces.  Journal of Evolution Equations, 11(2):405-427, 2011.  Arnak S. Dalalyan. Theoretical guarantees for approximate sampling from smooth and log-concave  densities. arXiv preprint arXiv:1412.7392, 2014.  Arnak S. Dalalyan. Further and stronger analogy between sampling and optimization: Langevin  Monte Carlo and gradient descent. arXiv preprint arXiv:1704.04752, 2017.  Arnak S. Dalalyan and Avetik G. Karagulyan. User-friendly guarantees for the Langevin Monte  Carlo with inaccurate gradient. arXiv preprint arXiv:1710.00095, 2017.  Alain Durmus and Eric Moulines. High-dimensional Bayesian inference via the Unadjusted  Langevin Algorithm. arXiv preprint arXiv:1605.01559, 2016a.  Alain Durmus and Eric Moulines. Sampling from strongly log-concave distributions with the Un-  adjusted Langevin Algorithm. arXiv preprint arXiv:1605.01559, 2016b.  Alain Durmus and Eric Moulines. Nonasymptotic convergence analysis for the unadjusted Langevin  algorithm. The Annals of Applied Probability, 27(3):1551-1587, 2017.  Alain Durmus, Eric Moulines, and Marcelo Pereyra. Efficient Bayesian computation by proximal Markov chain Monte Carlo: when Langevin meets Moreau. arXiv preprint arXiv:1612.07471, 2016.  Edwin Grappin. Model Averaging in Large Scale Learning. PhD thesis, Universit´e Paris-Saclay,  2018.  Helge Holden, Kenneth H Karlsen, Knut-Andreas Lie, and Nils Henrik Risebro. Splitting Methods for Partial Differential Equations with Rough Solutions. European Mathematical Society, 2010.  Søren F. Jarner and Ernst Hansen. Geometric ergodicity of Metropolis algorithms. Stochastic  processes and their applications, 85(2):341-361, 2000.  Richard Jordan, David Kinderlehrer, and Felix Otto. The variational formulation of the Fokker-  Planck equation. SIAM journal on mathematical analysis, 29(1):1-17, 1998.  Guillaume Legendre and Gabriel Turinici. Second-order in time schemes for gradient ﬂows in Wasserstein and geodesic metric spaces. Comptes Rendus Mathematique, 355(3):345-353, 2017.  Robert J. McCann. A convexity principle for interacting gases. Advances in Mathematics, 128(1):  153-179, 1997.  Yurii Nesterov. Introductory lectures on convex optimization: A basic course, volume 87. Springer  Science & Business Media, 2013.  Neal Parikh and Stephen Boyd. Proximal algorithms. Foundations and Trends in Optimization, 1  (3):127-239, 2014. LMC AND JKO SPLITTING  Grigorios A. Pavliotis. Stochastic processes and applications. Springer, 2014.  Marcelo Pereyra. Proximal Markov chain Monte Carlo algorithms. Statistics and Computing, 26  (4):745-760, 2016.  Sciences, 8(4):2323-2351, 2015.  Gabriel Peyr´e. Entropic approximation of Wasserstein gradient ﬂows. SIAM Journal on Imaging  Natesh S. Pillai, Andrew M. Stuart, and Alexandre H. Thi´ery. Optimal scaling and diffusion limits for the Langevin algorithm in high dimensions. The Annals of Applied Probability, 22(6):2320- 2356, 2012.  Simon Plazotta. A BDF2-approach for the non-linear Fokker-Planck equation. arXiv preprint  arXiv:1801.09603, 2018.  Gareth O. Roberts and Osnat Stramer. Langevin diffusions and Metropolis-Hastings algorithms.  Methodology and computing in applied probability, 4(4):337-357, 2002.  Gareth O. Roberts and Richard L. Tweedie. Exponential convergence of Langevin distributions and  their discrete approximations. Bernoulli, 2(4):341-363, 1996.  Filippo Santambrogio. {Euclidean, Metric, and Wasserstein} Gradient Flows: an overview. arXiv  preprint arXiv:1609.03890, 2016.  Igor Stojkovi´c. Geometric approach to evolution problems in metric spaces. PhD thesis, Mathe-  matical Institute, Faculty of Science, Leiden University, 2011.  C´edric Villani. Optimal transport, old and new. Springer-Verlag New York, 2008.  Tatiana Xifara, Chris Sherlock, Samuel Livingstone, Simon Byrne, and Mark Girolami. Langevin diffusions and the Metropolis-adjusted Langevin algorithm. Statistics & Probability Letters, 91: 14-19, 2014."}