{"1": "J. Acharya and C. Daskalakis. Testing poisson binomial distributions. In Proceedings of the Twenty- Sixth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA, pages 1829-1840, 2015.  J. Acharya, C. Daskalakis, and G. Kamath. Optimal testing for properties of distributions. CoRR,  abs/1507.05952, 2015a.  J. Acharya, I. Diakonikolas, J. Li, and L. Schmidt. Sample-optimal density estimation in nearly-  linear time. CoRR, abs/1506.00671, 2015b.  S. Arora and R. Kannan. Learning mixtures of arbitrary Gaussians. In Proceedings of the 33rd  Symposium on Theory of Computing, pages 247-257, 2001.  F. Balabdaoui and C. R. Doss.  Inference for a Mixture of Symmetric Distributions under Log-  Concavity. Available at http://arxiv.org/abs/1411.4708, 2014.  R.E. Barlow, D.J. Bartholomew, J.M. Bremner, and H.D. Brunk. Statistical Inference under Order  Restrictions. Wiley, New York, 1972.  M. Belkin and K. Sinha. Polynomial learning of distribution families. In FOCS, pages 103-112,  2010.  A. Bhaskara, D. Desai, and S. Srinivasan. Optimal hitting sets for combinatorial shapes. In 15th In- ternational Workshop, APPROX 2012, and 16th International Workshop, RANDOM 2012, pages 423-434, 2012.  C. Canonne, I. Diakonikolas, T. Gouleakis, and R. Rubinfeld. Testing shape restrictions of discrete  distributions. CoRR, abs/1507.03558, 2015.  S. Chan, I. Diakonikolas, R. Servedio, and X. Sun. Learning mixtures of structured distributions  over discrete domains. In SODA, pages 1380-1394, 2013.  S. Chan, I. Diakonikolas, R. Servedio, and X. Sun. Efficient density estimation via piecewise  polynomial approximation. In STOC, pages 604-613, 2014a.  S. Chan, I. Diakonikolas, R. Servedio, and X. Sun. Near-optimal density estimation in near-linear  time using variable-width histograms. In NIPS, pages 1844-1852, 2014b.  S.X. Chen and J.S. Liu. Statistical applications of the Poisson-Binomial and Conditional Bernoulli  Distributions. Statistica Sinica, 7:875-892, 1997.  Y. Chen and R. J. Samworth. Smoothed log-concave maximum likelihood estimation with applica-  tions. Statist. Sinica, 23:1373-1398, 2013.  14   DIAKONIKOLAS KANE STEWART  Acknowledgements. Part of this work was performed while I.D. and A.S. were at the University of Edinburgh, supported in part by EPSRC grant EP/L021749/1 and a Marie Curie Career Inte- gration Grant (CIG). The research of D.K. was supported in part by NSF Award CCF-1553288 (CAREER).  References  J. Acharya and C. Daskalakis. Testing poisson binomial distributions. In Proceedings of the Twenty- Sixth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA, pages 1829-1840, 2015.  J. Acharya, C. Daskalakis, and G. Kamath. Optimal testing for properties of distributions. CoRR,  abs/1507.05952, 2015a.  J. Acharya, I. Diakonikolas, J. Li, and L. Schmidt. Sample-optimal density estimation in nearly-  linear time. CoRR, abs/1506.00671, 2015b.  S. Arora and R. Kannan. Learning mixtures of arbitrary Gaussians. In Proceedings of the 33rd  Symposium on Theory of Computing, pages 247-257, 2001.  F. Balabdaoui and C. R. Doss.  Inference for a Mixture of Symmetric Distributions under Log-  Concavity. Available at http://arxiv.org/abs/1411.4708, 2014.  R.E. Barlow, D.J. Bartholomew, J.M. Bremner, and H.D. Brunk. Statistical Inference under Order  Restrictions. Wiley, New York, 1972.  M. Belkin and K. Sinha. Polynomial learning of distribution families. In FOCS, pages 103-112,  2010.  A. Bhaskara, D. Desai, and S. Srinivasan. Optimal hitting sets for combinatorial shapes. In 15th In- ternational Workshop, APPROX 2012, and 16th International Workshop, RANDOM 2012, pages 423-434, 2012.  C. Canonne, I. Diakonikolas, T. Gouleakis, and R. Rubinfeld. Testing shape restrictions of discrete  distributions. CoRR, abs/1507.03558, 2015.  S. Chan, I. Diakonikolas, R. Servedio, and X. Sun. Learning mixtures of structured distributions  over discrete domains. In SODA, pages 1380-1394, 2013.  S. Chan, I. Diakonikolas, R. Servedio, and X. Sun. Efficient density estimation via piecewise  polynomial approximation. In STOC, pages 604-613, 2014a.  S. Chan, I. Diakonikolas, R. Servedio, and X. Sun. Near-optimal density estimation in near-linear  time using variable-width histograms. In NIPS, pages 1844-1852, 2014b.  S.X. Chen and J.S. Liu. Statistical applications of the Poisson-Binomial and Conditional Bernoulli  Distributions. Statistica Sinica, 7:875-892, 1997.  Y. Chen and R. J. Samworth. Smoothed log-concave maximum likelihood estimation with applica-  tions. Statist. Sinica, 23:1373-1398, 2013. PROPER LEARNING OF PBDS  H. Chernoff. A measure of asymptotic efficiency for tests of a hypothesis based on the sum of  observations. Ann. Math. Statist., 23:493-507, 1952.  M. Cryan, L. Goldberg, and P. Goldberg. Evolutionary trees can be learned in polynomial time in  the two state general Markov model. SIAM Journal on Computing, 31(2):375-397, 2002.  C. Daskalakis and G. Kamath. Faster and sample near-optimal algorithms for proper learning mix- In Proceedings of The 27th Conference on Learning Theory, COLT 2014,  tures of gaussians. pages 1183-1213, 2014.  75-84, 2009.  C. Daskalakis and C. Papadimitriou. On Oblivious PTAS’s for Nash Equilibrium. In STOC, pages  C. Daskalakis and C. Papadimitriou. Sparse covers for sums of indicators. Probability Theory and  Related Fields, pages 1-27, 2014a.  C. Daskalakis and C. H. Papadimitriou. Computing equilibria in anonymous games.  In FOCS,  C. Daskalakis and C. H. Papadimitriou. Approximate nash equilibria in anonymous games. Journal  C. Daskalakis, I. Diakonikolas, and R.A. Servedio. Learning k-modal distributions via testing. In  pages 83-93, 2007.  of Economic Theory, 2014b.  SODA, pages 1371-1385, 2012a.  STOC, pages 709-728, 2012b.  C. Daskalakis, I. Diakonikolas, and R.A. Servedio. Learning Poisson Binomial Distributions. In  C. Daskalakis, I. Diakonikolas, R. O’Donnell, R.A. Servedio, and L. Tan. Learning Sums of Inde-  pendent Integer Random Variables. In FOCS, pages 217-226, 2013.  C. Daskalakis, I. Diakonikolas, and R. A. Servedio. Learning poisson binomial distributions. Algo-  rithmica, 72(1):316-357, 2015a.  C. Daskalakis, G. Kamath, and C. Tzamos. On the structure, covering, and learning of poisson  multinomial distributions. In FOCS, 2015b.  A. De. Beyond the central limit theorem: asymptotic expansions and pseudorandomness for com-  binatorial sums. In FOCS, 2015.  L. Devroye and L. Gy¨orfi. Nonparametric Density Estimation: The L1 View. John Wiley & Sons,  L. Devroye and G. Lugosi. Combinatorial methods in density estimation. Springer Series in Statis-  1985.  tics, Springer, 2001.  I. Diakonikolas, D. M. Kane, and A. Stewart. Optimal learning via the fourier transform for sums  of independent integer random variables. CoRR, abs/1505.00662, 2015a.  I. Diakonikolas, D. M. Kane, and A. Stewart. The fourier transform of poisson multinomial distri-  butions and its algorithmic applications. CoRR, abs/1511.03592, 2015b. DIAKONIKOLAS KANE STEWART  C. R. Doss and J. A. Wellner. Global Rates of Convergence of the MLEs of Log-concave and  s-concave Densities. Available at http://arxiv.org/abs/1306.1438, 2013.  D. Dubhashi and A. Panconesi. Concentration of measure for the analysis of randomized algo-  rithms. Cambridge University Press, Cambridge, 2009.  L. D umbgen and K. Rufibach. Maximum likelihood estimation of a log-concave density and its distribution function: Basic properties and uniform consistency. Bernoulli, 15(1):40-68, 2009.  J. Feldman, R. O’Donnell, and R. Servedio. Learning mixtures of product distributions over discrete  domains. In Proc. 46th IEEE FOCS, pages 501-510, 2005.  V. Feldman. Hardness of proper learning (1988; pitt, valiant). In Encyclopedia of Algorithms. 2015.  Y. Freund and Y. Mansour. Estimating a mixture of two product distributions. In Proceedings of the  12th Annual COLT, pages 183-192, 1999.  F. Gao and J. A. Wellner. On the rate of convergence of the maximum likelihood estimator of a  k-monotone density. Science in China Series A: Mathematics, 52:1525-1538, 2009.  P. W. Goldberg and S. Turchetta. Query complexity of approximate equilibria in anonymous games.  CoRR, abs/1412.6455, 2014.  P. Gopalan, R. Meka, O. Reingold, and D. Zuckerman. Pseudorandom generators for combinatorial  shapes. In STOC, pages 253-262, 2011.  P. Gopalan, D. M. Kane, and R. Meka. Pseudorandomness via the discrete fourier transform. In  FOCS, 2015.  W. Hoeffding. Probability inequalities for sums of bounded random variables. Journal of the  American Statistical Association, 58:13-30, 1963.  A. T. Kalai, A. Moitra, and G. Valiant. Efficiently learning mixtures of two Gaussians. In STOC,  M. Kearns and U. Vazirani. An Introduction to Computational Learning Theory. MIT Press, Cam-  pages 553-562, 2010.  bridge, MA, 1994.  M. Kearns, Y. Mansour, D. Ron, R. Rubinfeld, R. Schapire, and L. Sellie. On the learnability of  discrete distributions. In Proc. 26th STOC, pages 273-282, 1994.  A. K. H. Kim and R. J. Samworth. Global rates of convergence in log-concave density estimation.  Available at http://arxiv.org/abs/1404.2298, 2014.  J. Li and L. Schmidt. A nearly optimal and agnostic algorithm for properly learning a mixture of k  gaussians, for any constant k. CoRR, abs/1506.01367, 2015.  S.D. Poisson. Recherches sur la Probabilit`e des jugements en mati´e criminelle et en mati´ere civile.  Bachelier, Paris, 1837.  J. Renegar. On the computational complexity and geometry of the first-order theory of the reals. J.  Symb. Comput., 13(3):255-352, 1992a. PROPER LEARNING OF PBDS  J. Renegar. On the computational complexity of approximating solutions for real algebraic formulae.  SIAM J. Comput., 21(6):1008-1025, 1992b.  C. Riener. Symmetries in Semidefinite and Polynomial Optimization. PhD thesis, Johann Wolfgang  Goethe-Universitat, 2011.  1992.  D.W. Scott. Multivariate Density Estimation: Theory, Practice and Visualization. Wiley, New York,  B. W. Silverman. Density Estimation. Chapman and Hall, London, 1986.  A. T. Suresh, A. Orlitsky, J. Acharya, and A. Jafarpour. Near-optimal-sample estimators for spher- ical gaussian mixtures. In Advances in Neural Information Processing Systems (NIPS), pages 1395-1403, 2014.  S. Vempala and G. Wang. A spectral algorithm for learning mixtures of distributions. In Proceedings of the 43rd Annual Symposium on Foundations of Computer Science, pages 113-122, 2002.  G. Walther.  Inference and modeling with log-concave distributions. Statistical Science, 24(3):  319-327, 2009."}