{"1": "Louigi Addario-Berry, Nicolas Broutin, Luc Devroye, and G´abor Lugosi. On combinatorial  testing problems. Annals of Statistics, 38(5):3063-3092, 08 2010.  Noga Alon, Michael Krivelevich, and Benny Sudakov. Finding a large hidden clique in a random graph. In Proceedings of the ninth annual ACM-SIAM symposium on Discrete algorithms, SODA ’98, pages 594-598, Philadelphia, PA, USA, 1998. Society for Industrial and Applied Mathematics.  Noga Alon, Alexandr Andoni, Tali Kaufman, Kevin Matulef, Ronitt Rubinfeld, and Ning Xie. Testing k-wise and almost k-wise independence. In STOC’07—Proceedings of the 39th Annual ACM Symposium on Theory of Computing, pages 496-505. ACM, New York, 2007.  Noga Alon, Sanjeev Arora, Rajsekar Manokaran, Dana Moshkovitz, and Omri Weinstein. On the inapproximability of the densest κ-subgraph problem. Unpublished, April 2011.  Brendan P.W. Ames and Stephen A. Vavasis. Nuclear norm minimization for the planted  clique and biclique problems. Mathematical Programming, 129:69-89, 2011.  Arash A. Amini and Martin J. Wainwright. High-dimensional analysis of semidefinite re- laxations for sparse principal components. Annals of Statistics, 37(5B):2877-2921, 03 2009.  E. Arias-Castro, S. Bubeck, and G. Lugosi. Detecting positive correlations in a multivariate  sample. Arxiv Preprint, 2013. arXiv:1202.5536.  Ery Arias-Castro and Nicolas Verzelen. Community detection in random networks. Arxiv  Preprint, 02 2013. URL http://arxiv.org/abs/1302.7099.  Ery Arias-Castro, Emmanuel J. Cand`es, and Arnaud Durand. Detection of an anomalous  cluster in a network. Annals of Statistics, 39, 01 2011a.  Ery Arias-Castro, Emmanuel J. Cand`es, and Yaniv Plan.  Global testing under sparse alternatives: ANOVA, multiple comparisons and the higher criticism. Ann. Statist., 39(5):2533-2556, 2011b. ISSN 0090-5364. doi: 10.1214/11-AOS910. URL http://dx.doi.org/10.1214/11-AOS910.  Ery Arias-Castro, S´ebastien Bubeck, and G´abor Lugosi. Detection of correlations. Ann.  Statist., 40(1):412-435, 2012.  13   Complexity Theoretic Lower Bounds  Philippe Rigollet is partially supported by the National Science Foundation grants DMS- 0906424 and DMS-1053987. Quentin Berthet is partially supported by a Gordon S. Wu fellowship.  Acknowledgments  References  Louigi Addario-Berry, Nicolas Broutin, Luc Devroye, and G´abor Lugosi. On combinatorial  testing problems. Annals of Statistics, 38(5):3063-3092, 08 2010.  Noga Alon, Michael Krivelevich, and Benny Sudakov. Finding a large hidden clique in a random graph. In Proceedings of the ninth annual ACM-SIAM symposium on Discrete algorithms, SODA ’98, pages 594-598, Philadelphia, PA, USA, 1998. Society for Industrial and Applied Mathematics.  Noga Alon, Alexandr Andoni, Tali Kaufman, Kevin Matulef, Ronitt Rubinfeld, and Ning Xie. Testing k-wise and almost k-wise independence. In STOC’07—Proceedings of the 39th Annual ACM Symposium on Theory of Computing, pages 496-505. ACM, New York, 2007.  Noga Alon, Sanjeev Arora, Rajsekar Manokaran, Dana Moshkovitz, and Omri Weinstein. On the inapproximability of the densest κ-subgraph problem. Unpublished, April 2011.  Brendan P.W. Ames and Stephen A. Vavasis. Nuclear norm minimization for the planted  clique and biclique problems. Mathematical Programming, 129:69-89, 2011.  Arash A. Amini and Martin J. Wainwright. High-dimensional analysis of semidefinite re- laxations for sparse principal components. Annals of Statistics, 37(5B):2877-2921, 03 2009.  E. Arias-Castro, S. Bubeck, and G. Lugosi. Detecting positive correlations in a multivariate  sample. Arxiv Preprint, 2013. arXiv:1202.5536.  Ery Arias-Castro and Nicolas Verzelen. Community detection in random networks. Arxiv  Preprint, 02 2013. URL http://arxiv.org/abs/1302.7099.  Ery Arias-Castro, Emmanuel J. Cand`es, and Arnaud Durand. Detection of an anomalous  cluster in a network. Annals of Statistics, 39, 01 2011a.  Ery Arias-Castro, Emmanuel J. Cand`es, and Yaniv Plan.  Global testing under sparse alternatives: ANOVA, multiple comparisons and the higher criticism. Ann. Statist., 39(5):2533-2556, 2011b. ISSN 0090-5364. doi: 10.1214/11-AOS910. URL http://dx.doi.org/10.1214/11-AOS910.  Ery Arias-Castro, S´ebastien Bubeck, and G´abor Lugosi. Detection of correlations. Ann.  Statist., 40(1):412-435, 2012. Berthet Rigollet  Francis Bach,  Selin Damla Ahipasaoglu,  relaxations  vex for http://arxiv.org/abs/1006.3601v1.  subset  selection.  and Alexandre d’Aspremont. 2010.  Arxiv Preprint,Con- URL  Sivaraman Balakrishnan, Mladen Kolar, Alessandro Rinaldo, Aarti Singh, and Larry Wasserman. Statistical and computational tradeoﬀs in biclustering. NIPS 2011 Workshop on Computational Trade-oﬀs in Statistical Learning, 2011.  Quentin Berthet and Philippe Rigollet. Optimal detection of sparse principal components in high dimension. ArXiv:1202.5070, 02 2012. URL http://arxiv.org/abs/1202.5070.  Ravi B. Boppana. Eigenvalues and graph bisection: An average-case analysis. In Foun- dations of Computer Science, 1987., 28th Annual Symposium on, pages 280 -285, oct. 1987.  Stephen Boyd and Lieven Vandenberghe. Convex optimization. Cambridge University Press,  Cambridge, 2004.  Cristina Butucea and Yuri I. Ingster. Detection of a sparse submatrix of a high-dimensional  noisy matrix. Bernoulli (to appear), 2013.  T. Tony Cai, Zongming Ma, and Yihong Wu. Sparse PCA: Optimal rates and adaptive  estimation. Arxiv Preprint, 11 2012. URL http://arxiv.org/abs/1211.1309.  Venkat Chandrasekaran and Michael I. Jordan. Computational and statistical tradeoﬀs via  convex relaxation. Proceedings of the National Academy of Sciences, 2013.  Alexandre d’Aspremont, Laurent El Ghaoui, Michael I. Jordan, and Gert R. G. Lanckriet. A direct formulation for sparse PCA using semidefinite programming. SIAM Review, 49 (3):434-448, July 2007.  Alexandre d’Aspremont, Francis Bach, and Laurent El Ghaoui. Approximation bounds URL  sparse principal component analysis.  ArXiv:1205.0121, May 2012.  for http://arxiv.org/abs/1205.0121.  Yael Dekel, Ori Gurel-Gurevich, and Yuval Peres. Finding hidden cliques in linear time with high probability. Arxiv Preprint, 2010. URL http://arxiv.org/abs/1010.2997v1.  Persi Diaconis and David Freedman. Finite exchangeable sequences. Ann. Probab., 8(4):  745-764, 1980.  Richard Dudley. Uniform Central Limit Theorems. Cambridge University Press, 1999.  Uriel Feige and Robert Krauthgamer. Finding and certifying a large hidden clique in a  semirandom graph. Random Structures Algorithms, 16(2):195-208, 2000.  Uriel Feige and Robert Krauthgamer. The probable value of the Lov´asz-Schrijver relaxations  for maximum independent set. SIAM J. Comput., 32(2):345-370 (electronic), 2003. Complexity Theoretic Lower Bounds  Uriel Feige and Dorit Ron. Finding hidden cliques in linear time.  In 21st International Meeting on Probabilistic, Combinatorial, and Asymptotic Methods in the Analysis of Al- gorithms (AofA’10), Discrete Math. Theor. Comput. Sci. Proc., AM, pages 189-203. Assoc. Discrete Math. Theor. Comput. Sci., Nancy, 2010.  Vitaly Feldman, Elena Grigorescu, Lev Reyzin, Santosh Vempala, and Ying Xiao. Statistical In Proceedings of the Fourty-Fifth  algorithms and a lower bound for planted clique. Annual ACM Symposium on Theory of Computing, STOC 2013, 2013.  Johan H˚astad. Clique is hard to approximate within n1  ǫ. In 37th Annual Symposium on Foundations of Computer Science (Burlington, VT, 1996), pages 627-636. IEEE Comput. Soc. Press, Los Alamitos, CA, 1996.  −  Johan H˚astad. Clique is hard to approximate within n1  ǫ. Acta Math., 182(1):105-142,  −  1999.  Elad Hazan and Robert Krauthgamer. How hard is it to approximate the best nash equi-  librium? SIAM J. Comput., 40(1):79-91, 2011.  Mark Jerrum. Large cliques elude the Metropolis process. Random Structures Algorithms,  3(4):347-359, 1992.  Iain M. Johnstone and Arthur Yu Lu. On consistency and sparsity for principal components  analysis in high dimensions. J. Amer. Statist. Assoc., 104(486):682-693, 2009.  Ari Juels and Marcus Peinado. Hiding cliques for cryptographic security. Des. Codes  Cryptogr., 20(3):269-280, 2000.  M. Kolar, S. Balakrishnan, A. Rinaldo, and A. Singh. Minimax localization of structural information in large noisy matrices. Advances in Neural Information Processing Systems, 2011.  Michael Krivelevich and Van H. Vu. Approximating the independence number and the chromatic number in expected polynomial time. J. Comb. Optim., 6(2):143-155, 2002.  Ludˇek Kuˇcera. Expected complexity of graph partitioning problems. Discrete Appl. Math.,  57(2-3):193-212, 1995. Combinatorial optimization 1992 (CO92) (Oxford).  Zongming Ma. Sparse principal component analysis and iterative thresholding. Ann. Statist.  (to appear), 2013.  Pascal Massart. Concentration inequalities and model selection, volume 1896 of Lecture Notes in Mathematics. Springer, Berlin, 2007. Lectures from the 33rd Summer School on Probability Theory held in Saint-Flour, July 6-23, 2003, With a foreword by Jean Picard.  Frank McSherry. Spectral partitioning of random graphs. In 42nd IEEE Symposium on Foundations of Computer Science (Las Vegas, NV, 2001), pages 529-537. IEEE Com- puter Soc., Los Alamitos, CA, 2001. Berthet Rigollet  Benjamin Rossman. Average-Case Complexity of Detecting Cliques. ProQuest LLC, Ann  Arbor, MI, 2010. Thesis (Ph.D.)-Massachusetts Institute of Technology.  Shai Shalev-Shwartz, Ohad Shamir, and Eran Tomer. Using more data to speed-up training time. In Proceedings of the Fifteenth International Conference on Artificial Intelligence and Statistics April 21-23, 2012 La Palma, Canary Islands., volume 22 of JMLR W&CP, pages 1019-1027, 2012.  Joel Spencer. Ten lectures on the probabilistic method, volume 64 of CBMS-NSF Regional Conference Series in Applied Mathematics. Society for Industrial and Applied Mathe- matics (SIAM), Philadelphia, PA, second edition, 1994.  Xing Sun and Andrew B. Nobel. On the maximal size of large-average and ANOVA-fit  submatrices in a Gaussian random matrix. Bernoulli, 19(1):275-294, 2013.  Alexandre B. Tsybakov.  Introduction to nonparametric estimation. Springer Series in Statistics. Springer, New York, 2009. Revised and extended from the 2004 French original, Translated by Vladimir Zaiats.  Roman Vershynin. Introduction to the non-asymptotic analysis of random matrices. Arxiv  Preprint, 11 2010. URL http://arxiv.org/abs/1011.3027v7.  Vincent Vu and Jing Lei. Minimax rates of estimation for sparse pca in high dimensions. In Proceedings of the Fifteenth International Conference on Artificial Intelligence and Statistics April 21-23, 2012 La Palma, Canary Islands., volume 22 of JMLR W&CP, pages 1278-1286, 2012.  David Zuckerman. Linear degree extractors and the inapproximability of max clique and chromatic number. In Proceedings of the thirty-eighth annual ACM symposium on Theory of computing, STOC ’06, pages 681-690, New York, NY, USA, 2006. ACM. Complexity Theoretic Lower Bounds"}