{"1": "E. D. Andersen and K. D. Andersen. The MOSEK optimization toolbox for MATLAB manual.  Version 7.0, 2013. http://docs.mosek.com/7.0/toolbox/.  A. Ben-Tal and A. Nemirovski. Lectures on modern convex optimization: analysis, algorithms, and  engineering applications, volume 2. SIAM, 2001.  B.N. Bhaskar, G. Tang, and B. Recht. Atomic norm denoising with applications to line spectral  estimation. Signal Processing, IEEE Transactions on, 61(23):5987-5999, 2013.  L. Birg´e. An alternative point of view on Lepski’s method, volume 36 of Lecture Notes-Monograph  Series, pages 113-133. JSTOR, 2001.  V. Chandrasekaran, B. Recht, P. A. Parrilo, and A. S. Willsky. The convex geometry of linear inverse problems. Foundations of Computational Mathematics, 12(6):805-849, 2012. ISSN 1615-3375. doi: 10.1007/s10208-012-9135-7. URL http://dx.doi.org/10.1007/ s10208-012-9135-7.  D. L. Donoho. Statistical estimation and optimal recovery. Ann. Statist., 22(1):238-270, 03 1994.  D. L. Donoho and I. M. Johnstone. Minimax estimation via wavelet shrinkage. Ann. Statist., 26(3): 879-921, 06 1998. doi: 10.1214/aos/1024691081. URL http://dx.doi.org/10.1214/ aos/1024691081.  D. L. Donoho and M. G. Low. Renormalization exponents and optimal pointwise rates of conver-  gence. Ann. Statist., 20(2):944-970, 06 1992.  D. L. Donoho, I. M. Johnstone, G. Kerkyacharian, and D. Picard. Wavelet shrinkage: asymptopia?  Journal of the Royal Statistical Society. Series B (Methodological), pages 301-369, 1995.  G. K. Golubev. Adaptive asymptotically minimax estimators of smooth signals. Problemy Peredachi  Informatsii, 23(1):57-67, 1987.  S. Haykin. Adaptive Filter Theory (3rd Ed.). Prentice-Hall, Inc., 1996.  I. Ibragimov and R. Khasminskii. On nonparametric estimation of regression. Soviet Math. Dokl.,  21:810-814, 1980.  I. Ibragimov and R. Khasminskii. Nonparametric estimation of the value of a linear functional in  gaussian white noise. Theor. Probab. & Appl., 29:1-32, 1984.  I. A. Ibragimov and R. Z. Hasminskii. Statistical estimation. Asymptotic Theory, volume 16 of  Applications of Mathematics. Springer, 1981.  13   ADAPTIVE RECOVERY BY CONVEX OPTIMIZATION  This work was supported by the LabEx Persyval-Lab (ANR-11-LABX-0025), the project Titan (CNRS-Mastodons), the project Macaron (ANR-14-CE23-0003-01), the MSR-Inria joint centre, and the Moore-Sloan Data Science Environment at NYU.  Acknowledgments  References  E. D. Andersen and K. D. Andersen. The MOSEK optimization toolbox for MATLAB manual.  Version 7.0, 2013. http://docs.mosek.com/7.0/toolbox/.  A. Ben-Tal and A. Nemirovski. Lectures on modern convex optimization: analysis, algorithms, and  engineering applications, volume 2. SIAM, 2001.  B.N. Bhaskar, G. Tang, and B. Recht. Atomic norm denoising with applications to line spectral  estimation. Signal Processing, IEEE Transactions on, 61(23):5987-5999, 2013.  L. Birg´e. An alternative point of view on Lepski’s method, volume 36 of Lecture Notes-Monograph  Series, pages 113-133. JSTOR, 2001.  V. Chandrasekaran, B. Recht, P. A. Parrilo, and A. S. Willsky. The convex geometry of linear inverse problems. Foundations of Computational Mathematics, 12(6):805-849, 2012. ISSN 1615-3375. doi: 10.1007/s10208-012-9135-7. URL http://dx.doi.org/10.1007/ s10208-012-9135-7.  D. L. Donoho. Statistical estimation and optimal recovery. Ann. Statist., 22(1):238-270, 03 1994.  D. L. Donoho and I. M. Johnstone. Minimax estimation via wavelet shrinkage. Ann. Statist., 26(3): 879-921, 06 1998. doi: 10.1214/aos/1024691081. URL http://dx.doi.org/10.1214/ aos/1024691081.  D. L. Donoho and M. G. Low. Renormalization exponents and optimal pointwise rates of conver-  gence. Ann. Statist., 20(2):944-970, 06 1992.  D. L. Donoho, I. M. Johnstone, G. Kerkyacharian, and D. Picard. Wavelet shrinkage: asymptopia?  Journal of the Royal Statistical Society. Series B (Methodological), pages 301-369, 1995.  G. K. Golubev. Adaptive asymptotically minimax estimators of smooth signals. Problemy Peredachi  Informatsii, 23(1):57-67, 1987.  S. Haykin. Adaptive Filter Theory (3rd Ed.). Prentice-Hall, Inc., 1996.  I. Ibragimov and R. Khasminskii. On nonparametric estimation of regression. Soviet Math. Dokl.,  21:810-814, 1980.  I. Ibragimov and R. Khasminskii. Nonparametric estimation of the value of a linear functional in  gaussian white noise. Theor. Probab. & Appl., 29:1-32, 1984.  I. A. Ibragimov and R. Z. Hasminskii. Statistical estimation. Asymptotic Theory, volume 16 of  Applications of Mathematics. Springer, 1981. HARCHAOUI JUDITSKY NEMIROVSKI OSTROVSKY  A. Juditsky and A. Nemirovski. Nonparametric denoising of signals with unknown local structure, i: Oracle inequalities. Applied and Computational Harmonic Analysis, 27(2):157-179, 2009a.  A. Juditsky and A. Nemirovski. Nonparametric estimation by convex programming. The Annals of  Statistics, pages 2278-2300, 2009b.  A. Juditsky and A. Nemirovski. Nonparametric denoising signals of unknown local structure, ii: Nonparametric function recovery. Applied and Computational Harmonic Analysis, 29(3):354- 367, 2010.  A. Juditsky and A. Nemirovski. On detecting harmonic oscillations.  Bernoulli Journal, 2013. URL http://www.bernoulli-society.org/index.php/publications/ bernoulli-journal/bernoulli-journal-papers.  S. M. Kay. Fundamentals of statistical signal processing: estimation theory. Prentice-Hall, Inc.,  1993.  O. V. Lepskii. On a problem of adaptive estimation in gaussian white noise. Theory of Probability  & Its Applications, 35(3):454-466, 1991.  A. Nemirovski. Topics in non-parametric statistics. Lectures on Probability Theory and Statistics:  Ecole d’Et´e de Probabilit´es de Saint-Flour XXVIII-1998, 28:85, 2000.  M. S. Pinsker. Optimal filtering of square-integrable signals in gaussian noise. Problemy Peredachi  Informatsii, 16(2):52-68, 1980.  pages 1348-1360, 1980.  C. J. Stone. Optimal rates of convergence for nonparametric estimators. The annals of Statistics,  G. Tang, B.N. Bhaskar, and B. Recht. Near minimax line spectral estimation.  In Information  Sciences and Systems (CISS), 2013 47th Annual Conference on, pages 1-6. IEEE, 2013.  R. Tibshirani. Regression shrinkage and selection via the lasso. Journal of the Royal Statistical  Society. Series B (Methodological), pages 267-288, 1996.  A. B. Tsybakov. Introduction to Nonparametric Estimation. Springer Publishing Company, Incor-  porated, 1st edition, 2008.  L. Wasserman. All of Nonparametric Statistics. Springer Texts in Statistics. Springer, 2006."}