{"1": "D. Achiloptas and F. McSherry. On spectral learning of mixtures of distributions. In Proceedings  of the 18th Annual Conference on Learning Theory, pages 458-469, Bertinoro, Italy, 2005.  S. Arora and R. Kannan. Learning mixtures of arbitrary Gaussians. In Proceedings of the 33rd  Annual Symposium on Theory of Computing, pages 247-257, Heraklion, Greece, 2001.  S. Balakrishnan, M. Xu, A. Krishnamurthy, and A. Singh. Noise thresholds for spectral clustering.  In Advances in Neural Information Processing Systems, 2011.  R. B. Boppana. Eigenvalues and graph bisection: An average-case analysis.  In Proceedings of the 28th Annual Symposium on Foundations of Computer Science, pages 280-285, Los Angeles, California, 1987.  N. H. Bshouty and P. Long. Finding planted partitions in nearly linear time using arrested spectral In Proceedings of the 27th International Conference on Machine Learning, pages  clustering. 135-142, Haifa, Israel, 2010.  K. Chaudhuri and S. Rao. Learning mixtures of product distributions using correlations and in- dependence. In Proceedings of the 21st Annual Conference on Learning Theory, pages 9-20, Helsinki, Finland, 2008.  D. Choi, P. Wolfe, and E. Airoldi. Stochastic blockmodels with growing number of classes.  Biometrika, 2011.  F. Chung. Spectral Graph Theory. American Mathematical Society, Providence, RI, 1997.  F. Chung and L. Lu. Complex Graphs and Networks. American Mathematical Society, Boston,  Massachusetts, 2006.  binatorics, 18(1), 2011.  F. Chung and M. Radcliffe. On the spectra of general random graphs. Electronic Journal of Com-  A. Coja-Oghlan and A. Lanka. Finding planted partitions in random graphs with general degree  distributions. Journal on Discrete Mathematics, 23(4):1682-1714, 2009.  A. Condon and R. M. Karp. Algorithms for graph partitioning on the planted partition model.  Random Structures and Algorithms, 18(2):116-140, 2001.  T. M. Cover and J. A. Thomas. Elements of Information Theory, 2nd Edition. Wiley, New York,  2006.  A. Dasgupta, J. E. Hopcroft, and F. McSherry. Spectral analysis of random graphs with skewed degree distributions. In Proceedings of the 45th Annual Symposium on Foundations of Computer Science, pages 602-610, Rome, Italy, 2004.  W. Hoeffding. Probability inequalities for sums of bounded random variables. Journal of the  American Statistical Association, 58(301):13-30, 1963.  35.13   SPECTRAL CLUSTERING OF GRAPHS WITH GENERAL DEGREES IN THE EXTENDED PLANTED PARTITION MODEL  References  D. Achiloptas and F. McSherry. On spectral learning of mixtures of distributions. In Proceedings  of the 18th Annual Conference on Learning Theory, pages 458-469, Bertinoro, Italy, 2005.  S. Arora and R. Kannan. Learning mixtures of arbitrary Gaussians. In Proceedings of the 33rd  Annual Symposium on Theory of Computing, pages 247-257, Heraklion, Greece, 2001.  S. Balakrishnan, M. Xu, A. Krishnamurthy, and A. Singh. Noise thresholds for spectral clustering.  In Advances in Neural Information Processing Systems, 2011.  R. B. Boppana. Eigenvalues and graph bisection: An average-case analysis.  In Proceedings of the 28th Annual Symposium on Foundations of Computer Science, pages 280-285, Los Angeles, California, 1987.  N. H. Bshouty and P. Long. Finding planted partitions in nearly linear time using arrested spectral In Proceedings of the 27th International Conference on Machine Learning, pages  clustering. 135-142, Haifa, Israel, 2010.  K. Chaudhuri and S. Rao. Learning mixtures of product distributions using correlations and in- dependence. In Proceedings of the 21st Annual Conference on Learning Theory, pages 9-20, Helsinki, Finland, 2008.  D. Choi, P. Wolfe, and E. Airoldi. Stochastic blockmodels with growing number of classes.  Biometrika, 2011.  F. Chung. Spectral Graph Theory. American Mathematical Society, Providence, RI, 1997.  F. Chung and L. Lu. Complex Graphs and Networks. American Mathematical Society, Boston,  Massachusetts, 2006.  binatorics, 18(1), 2011.  F. Chung and M. Radcliffe. On the spectra of general random graphs. Electronic Journal of Com-  A. Coja-Oghlan and A. Lanka. Finding planted partitions in random graphs with general degree  distributions. Journal on Discrete Mathematics, 23(4):1682-1714, 2009.  A. Condon and R. M. Karp. Algorithms for graph partitioning on the planted partition model.  Random Structures and Algorithms, 18(2):116-140, 2001.  T. M. Cover and J. A. Thomas. Elements of Information Theory, 2nd Edition. Wiley, New York,  2006.  A. Dasgupta, J. E. Hopcroft, and F. McSherry. Spectral analysis of random graphs with skewed degree distributions. In Proceedings of the 45th Annual Symposium on Foundations of Computer Science, pages 602-610, Rome, Italy, 2004.  W. Hoeffding. Probability inequalities for sums of bounded random variables. Journal of the  American Statistical Association, 58(301):13-30, 1963.  35.13   CHAUDHURI CHUNG TSIATAS  M. Jerrum and G. B. Sorkin. Simulated annealing for graph bisection. In Proceedings of the 34th Annual Symposium on Foundations of Computer Science, pages 94-103, Washington, DC, 1993.  R. Kannan, H. Salmasian, and S. Vempala. The spectral method for general mixture models. In Proceedings of the 18th Annual Conference on Learning Theory, pages 444-457, Bertinoro, Italy, 2005.  B. Karrer and M. E. J. Newman. Stochastic blockmodels and community structure in networks.  Physical Review E, 83(1):016107, 2011.  A. Kumar and R. Kannan. Clustering with spectral norm and the k-means algorithm. In Proceedings of the 51st Annual Symposium on Foundations of Computer Science, pages 299-308, Las Vegas, Nevada, 2010.  F. McSherry. Spectral partitioning of random graphs. In Proceedings of the 42nd Annual Symposium  on Foundations of Computer Science, pages 529-537, Las Vegas, Nevada, 2001.  M. Mihail and C. H. Papadimitriou. On the eigenvalue power law. In Proceedings of the 6th Intera- tional Workshop on Randomization and Approximation Techniques, pages 254-262, Cambridge, Massachusetts, 2002.  A. Y. Ng, M. I. Jordan, and Y. Weiss. On spectral clustering: analysis and an algorithm. Advances  in Neural Information Processing Systems, 14(2):849-856, 2002.  R. I. Oliviera. Concentration of the adjacency matrix and of the laplacian in random graphs with  independent edges. Available at arXiv:0911.0600, 2010.  K. Rohe, S. Chatterjee, and B. Yu. Spectral clustering and the high-dimensional stochastic block-  model. Annals of Statistics, 39(4):1878-1915, 2011.  J. Shi and J. Malik. Normalized cuts and image segmentation.  IEEE Transactions on Pattern  Analysis and Machine Intelligence, 22(8):888-905, 2000.  J. A. Tropp. User-friendly tail bounds for sums of random matrices. Found. Comput. Math., 2011.  U. von Luxburg. A tutorial on spectral clustering. Statistics and Computing, 17(4):395-416, 2007.  U. von Luxburg, M. Belkin, and O. Bousquet. Consistency of spectral clustering. Ann. Statist., 36  (2):555-586, 2008. ISSN 0090-5364. doi: 10.1214/009053607000000640."}