{"1": "Maria-Florina Balcan, Vandana Kanchanapally, Yingyu Liang, and David Woodruff.  Improved  distributed principal component analysis. In NIPS, 2014.  Akshay Balsubramani, Sanjoy Dasgupta, and Yoav Freund. The fast convergence of incremental  PCA. In NIPS, pages 3174-3182, 2013.  Christos Boutsidis, David Woodruff, and Peilin Zhong. Optimal principal component analysis in  distributed and streaming models. arXiv: 1504.06729, 2015.  Kamalika Chaudhuri, Anand Sarwate, and Kaushik Sinha. Near-optimal algorithms for differen-  tially private principal components. In NIPS, 2012.  Cynthia Dwork, Krishnaram Kenthapadi, Frank McSherry, Ilya Mironov, and Moni Naor. Our data,  ourselves: Privacy via distributed noise generation. In EUROCRYPT, 2006.  Cynthia Dwork, Kunal Talwar, Abhradeep Thakurta, and Li Zhang. Analyze gauss: optimal bounds  for privacy-preserving principal component analysis. In STOC, 2014.  Carl Eckart and Gale Young. The approximation of one matrix by another of lower rank. Psychome-  trika, 1(3):211-218, 1936.  Ming Gu. Subspace iteration randomization and singular value problems. SIAM Journal on Scien-  tific Computing, 37(3):A1139-A1173, 2015.  Nathan Halko, Per-Gunnar Martinsson, and Joel A Tropp. Finding structure with randomness: Probabilistic algorithms for constructing approximate matrix decompositions. SIAM review, 53 (2):217-288, 2011.  Moritz Hardt and Eric Price. The noisy power method: A meta algorithm with applications. In  NIPS, 2014.  In STOC, 2013.  Moritz Hardt and Aaron Roth. Beyond worst-case analysis in private singular vector computation.  Prateek Jain, Chi Jin, Sham M. Kakade, Praneeth Netrapalli, and Aaron Sidford. Matching ma- trix bernstein with little memory: Near-optimal finite sample guarantees for oja’s algorithm. arxiv:1602.06929, 2016.  Chun-Liang Li, Hsuan-Tien Lin, and Chi-Jen Lu. Rivalry of two families of algorithms for memory-  restricted streaming pca. In AISTATS, 2016.  Ziqi Liu, Yu-Xiang Wang, and Alex Smola. Fast differentially private matrix factorization.  In  RecSys, 2015.  14   BALCAN DU WANG YU  We thank Cameron Musco for pointing out an error in the original proof. We also thank an anony- mous reviewer for providing an alternative and elegant proof for Lemma 2.3.  Acknowledgments  References  Maria-Florina Balcan, Vandana Kanchanapally, Yingyu Liang, and David Woodruff.  Improved  distributed principal component analysis. In NIPS, 2014.  Akshay Balsubramani, Sanjoy Dasgupta, and Yoav Freund. The fast convergence of incremental  PCA. In NIPS, pages 3174-3182, 2013.  Christos Boutsidis, David Woodruff, and Peilin Zhong. Optimal principal component analysis in  distributed and streaming models. arXiv: 1504.06729, 2015.  Kamalika Chaudhuri, Anand Sarwate, and Kaushik Sinha. Near-optimal algorithms for differen-  tially private principal components. In NIPS, 2012.  Cynthia Dwork, Krishnaram Kenthapadi, Frank McSherry, Ilya Mironov, and Moni Naor. Our data,  ourselves: Privacy via distributed noise generation. In EUROCRYPT, 2006.  Cynthia Dwork, Kunal Talwar, Abhradeep Thakurta, and Li Zhang. Analyze gauss: optimal bounds  for privacy-preserving principal component analysis. In STOC, 2014.  Carl Eckart and Gale Young. The approximation of one matrix by another of lower rank. Psychome-  trika, 1(3):211-218, 1936.  Ming Gu. Subspace iteration randomization and singular value problems. SIAM Journal on Scien-  tific Computing, 37(3):A1139-A1173, 2015.  Nathan Halko, Per-Gunnar Martinsson, and Joel A Tropp. Finding structure with randomness: Probabilistic algorithms for constructing approximate matrix decompositions. SIAM review, 53 (2):217-288, 2011.  Moritz Hardt and Eric Price. The noisy power method: A meta algorithm with applications. In  NIPS, 2014.  In STOC, 2013.  Moritz Hardt and Aaron Roth. Beyond worst-case analysis in private singular vector computation.  Prateek Jain, Chi Jin, Sham M. Kakade, Praneeth Netrapalli, and Aaron Sidford. Matching ma- trix bernstein with little memory: Near-optimal finite sample guarantees for oja’s algorithm. arxiv:1602.06929, 2016.  Chun-Liang Li, Hsuan-Tien Lin, and Chi-Jen Lu. Rivalry of two families of algorithms for memory-  restricted streaming pca. In AISTATS, 2016.  Ziqi Liu, Yu-Xiang Wang, and Alex Smola. Fast differentially private matrix factorization.  In  RecSys, 2015. IMPROVED ANALYSIS OF THE NOISY POWER METHOD  Ioannis Mitliagkas, Constantine Caramanis, and Prateek Jain. Memory limited, streaming pca. In  Advances in Neural Information Processing Systems, pages 2886-2894, 2013.  Cameron Musco and Christopher Musco. Stronger approximate singular value decomposition via  the block lanczos and power methods. In NIPS, 2015.  Christopher De Sa, Christopher Re, and Kunle Olukotun. Global convergence of stochastic gradient  descent for some non-convex matrix problems. In ICML, pages 2332-2341, 2015.  Ohad Shamir. Convergence of stochastic gradient descent for PCA. arxiv:1509.09002, 2015.  Lloyd N Trefethen and David Bau III. Numerical linear algebra, volume 50. Siam, 1997.  Shusen Wang, Zhihua Zhang, and Tong Zhang.  Improved Analyses of the Randomized Power  Method and Block Lanczos Method. ArXiv e-prints: 1508.06429, August 2015."}