{"1": "Alexandr Andoni, Huy L Nguyen, Aleksandar Nikolov, Ilya Razenshteyn, and Erik Waingarten. Approximate near neighbors for general symmetric norms. In Proceedings of the 49th Annual ACM SIGACT Symposium on Theory of Computing, pages 902-913. ACM, 2017.  Alexandr Andoni, Chengyu Lin, Ying Sheng, Peilin Zhong, and Ruiqi Zhong. Subspace embedding  and linear regression with orlicz norm. arXiv preprint arXiv:1806.06430, 2018.  Keith Ball, Eric A. Carlen, and Elliott H. Lieb. Sharp uniform convexity and smoothness in- doi:  equalities for trace norms. 10.1007/BF01231769. URL https://doi.org/10.1007/BF01231769.  Invent. Math., 115(3):463-482, 1994.  ISSN 0020-9910.  Jarosław Błasiok, Vladimir Braverman, Stephen R Chestnut, Robert Krauthgamer, and Lin F Yang. Streaming symmetric norms via measure concentration. In Proceedings of the 49th Annual ACM SIGACT Symposium on Theory of Computing, pages 716-729. ACM, 2017.  S´ebastien Bubeck, Eric Price, and Ilya Razenshteyn. Adversarial examples from computational  constraints. arXiv preprint arXiv:1805.10204, 2018.  Ilias Diakonikolas, Daniel M Kane, and Alistair Stewart. Statistical query lower bounds for robust estimation of high-dimensional gaussians and gaussian mixtures. In Foundations of Computer Science (FOCS), 2017 IEEE 58th Annual Symposium on, pages 73-84. IEEE, 2017.  Ilias Diakonikolas, Weihao Kong, and Alistair Stewart. Efficient algorithms and lower bounds for robust linear regression. In Proceedings of the Thirtieth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 2745-2754. SIAM, 2019.  Vitaly Feldman. A general characterization of the statistical query complexity. arXiv preprint  arXiv:1608.02198, 2016a.  Vitaly Feldman. Statistical query learning.  In Encyclopedia of Algorithms, pages 2090-2095. doi: 10.1007/978-1-4939-2864-4\\ 401. URL https://doi.org/10.1007/  2016b. 978-1-4939-2864-4_401.  Vitaly Feldman, Elena Grigorescu, Lev Reyzin, Santosh Vempala, and Ying Xiao. Statistical al- In Proceedings of the 45th ACM  gorithms and a lower bound for detecting planted cliques. Symposium on the Theory of Computing (STOC ’2013), 2013a.  Vitaly Feldman, Elena Grigorescu, Lev Reyzin, Santosh Vempala, and Ying Xiao. Statistical algo- rithms and a lower bound for detecting planted cliques. In Proceedings of the forty-fifth annual ACM symposium on Theory of computing, pages 655-664. ACM, 2013b.  Vitaly Feldman, Crist´obal Guzm´an, and Santosh Vempala. Statistical query algorithms for mean In Proceedings of the 28th ACM-SIAM  vector estimation and stochastic convex optimization. Symposium on Discrete Algorithms (SODA ’2017), 2017.  Vitaly Feldman, Will Perkins, and Santosh Vempala. On the complexity of random satisfiability  problems with planted solutions. SIAM Journal on Computing, 47(4):1294-1338, 2018.  13   ON MEAN ESTIMATION FOR GENERAL NORMS WITH STATISTICAL QUERIES  References  Alexandr Andoni, Huy L Nguyen, Aleksandar Nikolov, Ilya Razenshteyn, and Erik Waingarten. Approximate near neighbors for general symmetric norms. In Proceedings of the 49th Annual ACM SIGACT Symposium on Theory of Computing, pages 902-913. ACM, 2017.  Alexandr Andoni, Chengyu Lin, Ying Sheng, Peilin Zhong, and Ruiqi Zhong. Subspace embedding  and linear regression with orlicz norm. arXiv preprint arXiv:1806.06430, 2018.  Keith Ball, Eric A. Carlen, and Elliott H. Lieb. Sharp uniform convexity and smoothness in- doi:  equalities for trace norms. 10.1007/BF01231769. URL https://doi.org/10.1007/BF01231769.  Invent. Math., 115(3):463-482, 1994.  ISSN 0020-9910.  Jarosław Błasiok, Vladimir Braverman, Stephen R Chestnut, Robert Krauthgamer, and Lin F Yang. Streaming symmetric norms via measure concentration. In Proceedings of the 49th Annual ACM SIGACT Symposium on Theory of Computing, pages 716-729. ACM, 2017.  S´ebastien Bubeck, Eric Price, and Ilya Razenshteyn. Adversarial examples from computational  constraints. arXiv preprint arXiv:1805.10204, 2018.  Ilias Diakonikolas, Daniel M Kane, and Alistair Stewart. Statistical query lower bounds for robust estimation of high-dimensional gaussians and gaussian mixtures. In Foundations of Computer Science (FOCS), 2017 IEEE 58th Annual Symposium on, pages 73-84. IEEE, 2017.  Ilias Diakonikolas, Weihao Kong, and Alistair Stewart. Efficient algorithms and lower bounds for robust linear regression. In Proceedings of the Thirtieth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 2745-2754. SIAM, 2019.  Vitaly Feldman. A general characterization of the statistical query complexity. arXiv preprint  arXiv:1608.02198, 2016a.  Vitaly Feldman. Statistical query learning.  In Encyclopedia of Algorithms, pages 2090-2095. doi: 10.1007/978-1-4939-2864-4\\ 401. URL https://doi.org/10.1007/  2016b. 978-1-4939-2864-4_401.  Vitaly Feldman, Elena Grigorescu, Lev Reyzin, Santosh Vempala, and Ying Xiao. Statistical al- In Proceedings of the 45th ACM  gorithms and a lower bound for detecting planted cliques. Symposium on the Theory of Computing (STOC ’2013), 2013a.  Vitaly Feldman, Elena Grigorescu, Lev Reyzin, Santosh Vempala, and Ying Xiao. Statistical algo- rithms and a lower bound for detecting planted cliques. In Proceedings of the forty-fifth annual ACM symposium on Theory of computing, pages 655-664. ACM, 2013b.  Vitaly Feldman, Crist´obal Guzm´an, and Santosh Vempala. Statistical query algorithms for mean In Proceedings of the 28th ACM-SIAM  vector estimation and stochastic convex optimization. Symposium on Discrete Algorithms (SODA ’2017), 2017.  Vitaly Feldman, Will Perkins, and Santosh Vempala. On the complexity of random satisfiability  problems with planted solutions. SIAM Journal on Computing, 47(4):1294-1338, 2018. ON MEAN ESTIMATION FOR GENERAL NORMS WITH STATISTICAL QUERIES  Fritz John. Extremum problems with inequalities as subsidiary conditions. In Studies and Essays Presented to R. Courant on his 60th Birthday, January 8, 1948, pages 187-204. Interscience Publishers, Inc., New York, N. Y., 1948.  Shiva Prasad Kasiviswanathan, Homin K Lee, Kobbi Nissim, Sofya Raskhodnikova, and Adam  Smith. What can we learn privately? SIAM Journal on Computing, 40(3):793-826, 2011.  Michael Kearns. Efficient noise-tolerant learning from statistical queries. Journal of the ACM  (JACM), 45(6):983-1006, 1998.  Adam R Klivans and Alexander A Sherstov. Unconditional lower bounds for learning intersections  of halfspaces. Machine Learning, 69(2-3):97-114, 2007.  Michel Ledoux and Michel Talagrand. Probability in Banach spaces. Classics in Mathematics. Springer-Verlag, Berlin, 2011. ISBN 978-3-642-20211-7. Isoperimetry and processes, Reprint of the 1991 edition.  Ryan O’Donnell. Analysis of Boolean Functions. Cambridge University Press, 2014.  Le Song, Santosh Vempala, John Wilmes, and Bo Xie. On the complexity of learning neural net-  works. In Advances in Neural Information Processing Systems, pages 5514-5522, 2017.  Zhao Song, David P Woodruff, and Peilin Zhong. Towards a zero-one law for entrywise low rank  approximation. arXiv preprint arXiv:1811.01442, 2018.  Jacob Steinhardt, Gregory Valiant, and Stefan Wager. Memory, communication, and statistical  queries. In Conference on Learning Theory, pages 1490-1516, 2016.  Przemyslaw Wojtaszczyk. Banach spaces for analysts, volume 25. Cambridge University Press,  1996."}