{"1": "Princeton University Press, 2009.  Gruyter GmbH & Co KG, 2014.  P-A Absil, Robert Mahony, and Rodolphe Sepulchre. Optimization algorithms on matrix manifolds.  Miroslav Bac´ak. Convex analysis and optimization in Hadamard spaces, volume 22. Walter de  Louis J Billera, Susan P Holmes, and Karen Vogtmann. Geometry of the space of phylogenetic  trees. Advances in Applied Mathematics, 27(4):733-767, 2001.  Dario A Bini and Bruno Iannazzo. Computing the Karcher mean of symmetric positive definite  matrices. Linear Algebra and its Applications, 438(4):1700-1710, 2013.  Richard L Bishop and Barrett O’Neill. Manifolds of negative curvature. Transactions of the Amer-  ican Mathematical Society, 145:1-49, 1969.  Silvere Bonnabel. Stochastic gradient descent on Riemannian manifolds. Automatic Control, IEEE  Transactions on, 58(9):2217-2229, 2013.  Stephen Boyd, Seung-Jean Kim, Lieven Vandenberghe, and Arash Hassibi. A tutorial on geometric  programming. Optimization and engineering, 8(1):67-127, 2007.  Martin R Bridson and Andr´e Haeﬂiger. Metric spaces of non-positive curvature, volume 319.  Springer, 1999.  Dmitri Burago, Yuri Burago, and Sergei Ivanov. A course in metric geometry, volume 33. American  Mathematical Society Providence, 2001.  17   FIRST-ORDER METHODS FOR GEODESICALLY CONVEX OPTIMIZATION  relies on a proximal gradient projection interpretation. In nonlinear space, we have not been able to find an analogy to such a projection. Further study is needed to see if similar anal- ysis can be developed, or a different approach is required, or Nesterov’s algorithms have no nonlinear space counterparts.  • Another interesting direction is variance reduced stochastic gradient methods for geodesically convex functions. For smooth and convex optimization in Euclidean space, these methods have recently drawn great interests and enjoyed remarkable empirical success. We hypoth- esize that similar algorithms can achieve faster convergence over naive incremental gradient methods on Hadamard manifolds.  • Finally, since in applications it is often favorable to replace exponential mapping with com- putationally cheap retractions, it is important to understand the effect of this approximation on convergence rate. Analyzing this effect is of both theoretical and practical interests.  Acknowledgments  We thank the anonymous reviewers for helpful suggestions. HZ is generously supported by the Leventhal Graduate Student Fellowship. SS acknowledges partial support from NSF IIS-1409802.  References  Princeton University Press, 2009.  Gruyter GmbH & Co KG, 2014.  P-A Absil, Robert Mahony, and Rodolphe Sepulchre. Optimization algorithms on matrix manifolds.  Miroslav Bac´ak. Convex analysis and optimization in Hadamard spaces, volume 22. Walter de  Louis J Billera, Susan P Holmes, and Karen Vogtmann. Geometry of the space of phylogenetic  trees. Advances in Applied Mathematics, 27(4):733-767, 2001.  Dario A Bini and Bruno Iannazzo. Computing the Karcher mean of symmetric positive definite  matrices. Linear Algebra and its Applications, 438(4):1700-1710, 2013.  Richard L Bishop and Barrett O’Neill. Manifolds of negative curvature. Transactions of the Amer-  ican Mathematical Society, 145:1-49, 1969.  Silvere Bonnabel. Stochastic gradient descent on Riemannian manifolds. Automatic Control, IEEE  Transactions on, 58(9):2217-2229, 2013.  Stephen Boyd, Seung-Jean Kim, Lieven Vandenberghe, and Arash Hassibi. A tutorial on geometric  programming. Optimization and engineering, 8(1):67-127, 2007.  Martin R Bridson and Andr´e Haeﬂiger. Metric spaces of non-positive curvature, volume 319.  Springer, 1999.  Dmitri Burago, Yuri Burago, and Sergei Ivanov. A course in metric geometry, volume 33. American  Mathematical Society Providence, 2001. ZHANG SRA  Yu Burago, Mikhail Gromov, and Gregory Perel’man. A.D. Alexandrov spaces with curvature  bounded below. Russian mathematical surveys, 47(2):1, 1992.  Dario Cordero-Erausquin, Robert J McCann, and Michael Schmuckenschl¨ager. A Riemannian inter- polation inequality `a la Borell, Brascamp and Lieb. Inventiones mathematicae, 146(2):219-257, 2001.  Stephen C Cowin and Guoyu Yang. Averaging anisotropic elastic constant data. Journal of Elastic-  ity, 46(2):151-180, 1997.  Alan Edelman, Tom´as A Arias, and Steven T Smith. The geometry of algorithms with orthogonality  constraints. SIAM journal on Matrix Analysis and Applications, 20(2):303-353, 1998.  Thomas Fletcher and Sarang Joshi. Riemannian geometry for the statistical analysis of diffusion  tensor data. Signal Processing, 87(2):250-262, 2007.  Mikhail Gromov. Manifolds of negative curvature. J. Differential Geom, 13(2):223-230, 1978.  Mehrtash T Harandi, Conrad Sanderson, Richard Hartley, and Brian C Lovell. Sparse coding and dictionary learning for symmetric positive definite matrices: A kernel approach. In ECCV 2012, pages 216-229. Springer, 2012.  Reshad Hosseini and Suvrit Sra. Matrix manifold optimization for Gaussian mixtures. In Advances  in Neural Information Processing Systems (NIPS), 2015.  Mariya Ishteva, P-A Absil, Sabine Van Huffel, and Lieven De Lathauwer. Best low multilinear rank approximation of higher-order tensors, based on the Riemannian trust-region scheme. SIAM Journal on Matrix Analysis and Applications, 32(1):115-135, 2011.  Simon Lacoste-Julien, Mark Schmidt, and Francis Bach. A simpler approach to obtaining an O(1/t) convergence rate for the projected stochastic subgradient method. arXiv preprint arXiv:1212.2002, 2012.  Bas Lemmens and Roger Nussbaum. Nonlinear Perron-Frobenius Theory, volume 189. Cambridge  University Press, 2012.  Xin-Guo Liu, Xue-Feng Wang, and Wei-Guo Wang. Maximization of matrix trace function of product Stiefel manifolds. SIAM Journal on Matrix Analysis and Applications, 36(4):1489-1506, 2015.  Bamdev Mishra, Gilles Meyer, Francis Bach, and Rodolphe Sepulchre. Low-rank optimization with  trace norm penalty. SIAM Journal on Optimization, 23(4):2124-2149, 2013.  Maher Moakher. Means and averaging in the group of rotations. SIAM journal on matrix analysis  and applications, 24(1):1-16, 2002.  Maher Moakher. A differential geometric approach to the geometric mean of symmetric positive- definite matrices. SIAM Journal on Matrix Analysis and Applications, 26(3):735-747, 2005.  Xavier Pennec, Pierre Fillard, and Nicholas Ayache. A Riemannian framework for tensor comput-  ing. International Journal of Computer Vision, 66(1):41-66, 2006. FIRST-ORDER METHODS FOR GEODESICALLY CONVEX OPTIMIZATION  Hao Shen, Stefanie Jegelka, and Arthur Gretton. Fast kernel-based independent component analysis.  Signal Processing, IEEE Transactions on, 57(9):3498-3511, 2009.  Suvrit Sra and Reshad Hosseini. Conic Geometric Optimization on the Manifold of Positive Definite  Matrices. SIAM J. Optimization (SIOPT), 25(1):713-739, 2015.  Ju Sun, Qing Qu, and John Wright. Complete dictionary recovery over the sphere II: Recovery by  Riemannian trust-region method. arXiv:1511.04777, 2015.  Paul Tseng. On accelerated proximal gradient methods for convex-concave optimization. Submitted  to SIAM J. Optim, 2009.  Constantin Udriste. Convex functions and optimization methods on Riemannian manifolds, volume  297. Springer Science & Business Media, 1994.  Bart Vandereycken. Low-rank matrix completion by Riemannian optimization. SIAM Journal on  Optimization, 23(2):1214-1236, 2013.  Ami Wiesel. Geodesic convexity and covariance estimation. Signal Processing, IEEE Transactions  on, 60(12):6182-6189, 2012.  Teng Zhang, Ami Wiesel, and Maria S Greco. Multivariate generalized Gaussian distribution: Con- vexity and graphical models. Signal Processing, IEEE Transactions on, 61(16):4141-4148, 2013."}