{"1": "Claude JP B´elisle, H Edwin Romeijn, and Robert L Smith. Hit-and-run algorithms for generating  multivariate distributions. Mathematics of Operations Research, 18(2):255-266, 1993.  Nawaf Bou-Rabee and Martin Hairer. Nonasymptotic mixing of the MALA algorithm. IMA Journal  of Numerical Analysis, 33(1):80-110, 2012.  Steve Brooks, Andrew Gelman, Galin L Jones, and Xiao-Li Meng. Handbook of Markov Chain Monte  Carlo. Chapman and Hall/CRC, 2011.  3   MALA  ficient conditions for exponential convergence of the Langevin diffusion and its discretizations, with and without Metropolis-adjustment. However, they considered the distributions with f (x) = (cid:107)x(cid:107)α 2 and proved geometric convergence of ULA and MALA under some specific conditions. In a more general setting, Bou-Rabee and Hairer (2012) and Eberle (2014) derived non-asymptotic mixing time bounds for MALA. However, all these bounds are non-explicit in the case of logconcave sampling, and so makes it difficult to extract an explicit dependence in terms of the dimension d and error tol- erance δ. In particular, Eberle (2014) made significant contribution to establishing the accept-reject rate of MALA by assuming differentiability of the target function to fourth order, but its final mix- ing rate is only explicit when the sampling domain is contained in a ball with constant radius. A precise characterization of this dependence is needed if one wants to make quantitative comparisons with other algorithms, including ULA and other Langevin-type schemes. With this context, one of the main contributions of our paper is to provide an explicit upper bound on the mixing time of the MALA algorithm.  This work contains two main results, both having to do with the mixing times of MCMC methods for sampling. As described above, our first and primary contribution is an explicit analysis of the mixing time of Metropolis adjusted Langevin Algorithm (MALA). A second contribution is to use similar techniques to analyze a zeroth-order method called Metropolized random walk (MRW) and derive a explicit non-asymptotic mixing time bound for it. Unlike the ULA, these methods make use of the Metropolis-hastings accept-reject step and consequently converge to the target distributions in the limit of infinite steps. Here we provide explicit non-asymptotic mixing time bounds for MALA and MRW and show that MALA converges significantly faster than ULA. In particular, we show that if the density is strongly log-concave and smooth, the δ-mixing time for MALA scales as κd log(1/δ) which is significantly faster than ULA’s convergence rate of order κ2d/δ2. We also show that MRW mixes O (κd) slowly when compared to MALA. Furthermore, if the density is weakly log-concave, we show that MALA converges in O (cid:0)d2/δ1.5(cid:1) time in comparison to the O (cid:0)d3/δ4(cid:1) mixing time for ULA. These results are summarized in Table 1.  Acknowledgments  This work was supported by Office of Naval Research grant DOD ONR-N00014 to MJW, and by ARO W911NF1710005, NSF-DMS 1613002 and the Center for Science of Information (CSoI), US NSF Science and Technology Center, under grant agreement CCF-0939370 to BY. In addition, MJW was partially supported by National Science Foundation grant NSF-DMS-1612948, and RD was partially supported by the Berkeley Fellowship.  References  Claude JP B´elisle, H Edwin Romeijn, and Robert L Smith. Hit-and-run algorithms for generating  multivariate distributions. Mathematics of Operations Research, 18(2):255-266, 1993.  Nawaf Bou-Rabee and Martin Hairer. Nonasymptotic mixing of the MALA algorithm. IMA Journal  of Numerical Analysis, 33(1):80-110, 2012.  Steve Brooks, Andrew Gelman, Galin L Jones, and Xiao-Li Meng. Handbook of Markov Chain Monte  Carlo. Chapman and Hall/CRC, 2011. MALA  Random walk  Strongly log-concave  Weakly log-concave  ULA (Cheng and Bartlett, 2017)  O  ULA (Dalalyan, 2016)  MRW  MALA  (cid:19)  (cid:18) dκ2 log((log β)/δ) δ2 (cid:18) dκ2 log2(β/δ) δ2  (cid:19)  O  (cid:18)  O  d2κ2 log  (cid:19)(cid:19)  (cid:18) β δ  (cid:18)  O  max (cid:8)dκ, d0.5κ1.5(cid:9) log  (cid:19)(cid:19)  (cid:18) β δ  ˜O  ˜O  (cid:19)  (cid:19)  (cid:18) dL2 δ6 (cid:18) d3L2 δ4 (cid:18) d4 L2.5 δ1.5 (cid:18) d2 L1.5 δ1.5  (cid:19)  (cid:19)  ˜O  ˜O  Table 1. Scalings of upper bounds on δ-mixing time for different random walks in Rd with target π ∝ e−f . In the second column, we consider smooth and strongly log-concave densities, and report the bounds from a β-warm start for densities such that mId (cid:22) ∇2f (x) (cid:22) LId for any x ∈ Rd and use κ := L/m to denote the condition number of the density. The big-O notation hides universal constants. In the last column, we summarize the scaling for weakly log-concave smooth densities: 0 (cid:22) ∇2f (x) (cid:22) LId for all x ∈ Rd. For this case, the ˜O notation is used to track scaling only with respect to d, δ and L and ignore dependence on the starting distribution and a few other parameters.  S´ebastien Bubeck, Ronen Eldan, and Joseph Lehec. Sampling from a log-concave distribution with  projected Langevin Monte Carlo. arXiv preprint arXiv:1507.02564, 2015.  Xiang Cheng and Peter Bartlett. Convergence of Langevin MCMC in KL-divergence. arXiv preprint  arXiv:1705.09048, 2017.  Xiang Cheng, Niladri S Chatterji, Peter L Bartlett, and Michael I Jordan. Underdamped Langevin  MCMC: A non-asymptotic analysis. arXiv preprint arXiv:1707.03663, 2017.  Arnak S Dalalyan. Theoretical guarantees for approximate sampling from smooth and log-concave  densities. Journal of the Royal Statistical Society: Series B (Statistical Methodology), 2016.  Alain Durmus and Eric Moulines. High-dimensional Bayesian inference via the unadjusted Langevin  algorithm. arXiv preprint arXiv:1605.01559, 2016.  Alain Durmus, Eric Moulines, and Marcelo Pereyra. Efficient Bayesian computation by proximal Markov chain Monte Carlo: when Langevin meets Moreau. arXiv preprint arXiv:1612.07471, 2016.  Martin Dyer, Alan Frieze, and Ravi Kannan. A random polynomial-time algorithm for approximating  the volume of convex bodies. Journal of the ACM (JACM), 38(1):1-17, 1991.  Andreas Eberle. Error bounds for metropolis-hastings algorithms applied to perturbations of gaussian  measures in high dimensions. The Annals of Applied Probability, 24(1):337-377, 2014.  Ulf Grenander and Michael I Miller. Representations of knowledge in complex systems. Journal of  the Royal Statistical Society. Series B (Methodological), pages 549-603, 1994. Ravi Kannan, L´aszl´o Lov´asz, and Mikl´os Simonovits. Isoperimetric problems for convex bodies and  a localization lemma. Discrete & Computational Geometry, 13(1):541-559, 1995.  L´aszl´o Lov´asz. Hit-and-run mixes fast. Mathematical Programming, 86(3):443-461, 1999.  L´aszl´o Lov´asz and Mikl´os Simonovits. The mixing rate of Markov chains, an isoperimetric inequality, and computing the volume. In Proceedings of 31st Annual Symposium on Foundations of Computer Science, 1990, pages 346-354. IEEE, 1990.  L´aszl´o Lov´asz and Mikl´os Simonovits. Random walks in a convex body and an improved volume  algorithm. Random Structures & Algorithms, 4(4):359-412, 1993.  L´aszl´o Lov´asz and Santosh Vempala. Hit-and-run from a corner. SIAM Journal on Computing, 35(4):  985-1005, 2006.  L´aszl´o Lov´asz and Santosh Vempala. The geometry of logconcave functions and sampling algorithms.  Random Structures & Algorithms, 30(3):307-358, 2007.  Kerrie L Mengersen, Richard L Tweedie, et al. Rates of convergence of the Hastings and Metropolis  algorithms. The Annals of Statistics, 24(1):101-121, 1996.  Radford M Neal. MCMC using Hamiltonian dynamics. Handbook of Markov Chain Monte Carlo, 2  G Parisi. Correlation functions and computer simulations. Nuclear Physics B, 180(3):378-384, 1981.  Marcelo Pereyra. Proximal Markov chain Monte Carlo algorithms. Statistics and Computing, 26(4):  (11), 2011.  745-760, 2016.  Gareth O Roberts and Osnat Stramer. Langevin diffusions and Metropolis-Hastings algorithms.  Methodology and computing in applied probability, 4(4):337-357, 2002.  Gareth O Roberts and Richard L Tweedie. Exponential convergence of Langevin distributions and  their discrete approximations. Bernoulli, pages 341-363, 1996a.  Gareth O Roberts and Richard L Tweedie. Geometric convergence and central limit theorems for  multidimensional Hastings and Metropolis algorithms. Biometrika, 83(1):95-110, 1996b.  Gareth O Roberts, Jeffrey S Rosenthal, et al. General state space Markov chains and MCMC algo-  rithms. Probability Surveys, 1:20-71, 2004.  Santosh Vempala. Geometric random walks: a survey. Combinatorial and Computational Geometry,  52(573-612):2, 2005.  Tatiana Xifara, Chris Sherlock, Samuel Livingstone, Simon Byrne, and Mark Girolami. Langevin diffusions and the Metropolis-adjusted Langevin algorithm. Statistics & Probability Letters, 91: 14-19, 2014.  MALA"}