{"1": "N.I Akhiezer. The Classical Moment Problem and Some Related Questions in Analysis. Hanfer  Publishing Co, 1 edition, 1965.  Louay M. J. Bazzi. Polylogarithmic independence can fool DNF formulas. SIAM J. Comput, 38(6):  2220–2272, 2009. URL http://dx.doi.org/10.1137/070691954.  Dimitris Bertsimas and Ioana Popescu. Optimal inequalities in probability theory: A convex  optimization approach. SIAM Journal on Optimization, 15(3):780–804, 2005.  Avrim Blum and John Dunagan. Smoothed analysis of the perceptron algorithm for linear program-  ming. In SODA, pages 905–914, 2002.  Avrim Blum and Ravi Kannan. Learning an intersection of k halfspaces over a uniform distribution.  In FOCS, pages 312–320, 1993.  V.V. Buldygin and I.U.V. Kozachenko. Metric Characterization of Random Variables and Random Processes. Translations of Mathematical Monographs. American Mathematical So- ISBN 9780821805336. URL http://books.google.com/books?id= ciety, 2000. ePDXvIhdEjoC.  Anthony Carbery and James Wright. Distributional and Lq norm inequalities for polynomials over convex bodies in Rn. Mathematical Research Letters, 8(3):233–248, 2001. URL http: //www.mrlonline.org/mrl/2001-008-003/2001-008-003-001.html.  Ilias Diakonikolas, Daniel M. Kane, and Jelani Nelson. Bounded independence fools degree-2  threshold functions. In FOCS, pages 11–20, 2010a.  Ilias Diakonikolas, Rocco A. Servedio, Li-Yang Tan, and Andrew Wan. A regularity lemma, and low-weight approximators, for low-degree polynomial threshold functions. In IEEE Conference on Computational Complexity, pages 211–222, 2010b.  William Feller. An Introduction to Probability Theory and Its Applications, Vol. 2 (Volume 2). Wiley, 2 edition, January 1971. ISBN 0471257095. URL http://www.amazon.com/exec/ obidos/redirect?tag=citeulike07-20&path=ASIN/0471257095.  Yu. R. Gabovich. Stability of the characterization of the multivariate normal distribution in the Skitovich-Darmois theorem. Journal of Mathematical Sciences, 16:1341–1349, 1981. ISSN 1072-3374. URL http://dx.doi.org/10.1007/BF01091625.  13   LEARNING HALFSPACES UNDER LOG-CONCAVE DENSITIES  5. Smoothed Complexity of Learning Functions of Halfspaces  We defer this section to the"}