{"1": "Jacob Abernethy, Elad Hazan, and Alexander Rakhlin. Competing in the dark: An eﬃcient algorithm for bandit linear optimization. In Proceedings of the 21st Annual Conference on Learning Theory (COLT 2008), pages 263-273. Citeseer, 2008.  Alekh Agarwal, Peter Bartlett, and Max Dama. Optimal allocation strategies for the dark pool problem. In 13th International Conference on Artificial Intelligence and Statistics (AISTATS 2010), May 12-15, 2010, Chia Laguna Resort, Sardinia, Italy, 2010.  Andr´as Antos, G´abor Bart´ok, D´avid P´al, and Csaba Szepesv´ari. Toward a classification of  finite partial-monitoring games, 2011. http://arxiv.org/abs/1102.2041.  Jean-Yves Audibert and S´ebastien Bubeck. Minimax policies for adversarial and stochastic  bandits. In Proceedings of the 22nd Annual Conference on Learning Theory, 2009.  Peter Auer, Nicol`o Cesa-Bianchi, Yoav Freund, and Robert E. Schapire. The nonstochastic  multiarmed bandit problem. SIAM Journal on Computing, 32(1):48-77, 2002.  G´abor Bart´ok, D´avid P´al, and Csaba Szepesv´ari. Toward a Classification of Finite Partial- Monitoring Games. In Proceedings of the 21st international conference on Algorithmic Learning Theory (ALT 2010), pages 224-238. Springer, 2010.  Nicol`o Cesa-Bianchi, G´abor Lugosi, and Gilles Stoltz. Minimizing regret with label eﬃcient prediction. IEEE Transactions on Information Theory, 51(6):2152-2162, June 2005.  Nicol´o Cesa-Bianchi, G´abor Lugosi, and Gilles Stoltz. Regret minimization under partial  monitoring. Mathematics of Operations Research, 31(3):562-580, 2006.  149   Minimax Regret of Finite Partial-Monitoring Games in Stochastic Environments  7. Discussion  In this we paper we classified all finite partial-monitoring games under stochastic envi- ronments, based on their minimax regret. We conjecture that our results extend to non- stochastic environments. This is the major open question that remains to be answered.  One question which we did not discuss so far is the computational eﬃciency of our algorithm. The issue is twofold. The first computational question is how to eﬃciently decide which of the four classes a given game (L, H) belongs to. The second question is the computational eﬃciency of Balaton for a fixed easy game. Fortunately, in both cases an eﬃcient implementation is possible, i.e., in polynomial time by using a linear program solver (e.g., the ellipsoid method (Papadimitriou and Steiglitz, 1998)).  Another interesting open question is to investigate the dependence of regret on quantities other than T such as the number of actions, the number of outcomes, and more generally the structure of the loss and feedback matrices.  Finally, let us note that our results can be extended to a more general framework, similar to that of Pallavi et al. (2011), in which a game with N actions and M -dimensional outcome space is defined as a tuple G = (L, S1, . . . , SN ). The loss matrix is L ∈ RN ×M as before, but the outcome and the feedback are defined diﬀerently. The outcome y is an arbitrary vector from a bounded subset of RM and the feedback received by the learner upon choosing action i is Oi = Siy.  References  Jacob Abernethy, Elad Hazan, and Alexander Rakhlin. Competing in the dark: An eﬃcient algorithm for bandit linear optimization. In Proceedings of the 21st Annual Conference on Learning Theory (COLT 2008), pages 263-273. Citeseer, 2008.  Alekh Agarwal, Peter Bartlett, and Max Dama. Optimal allocation strategies for the dark pool problem. In 13th International Conference on Artificial Intelligence and Statistics (AISTATS 2010), May 12-15, 2010, Chia Laguna Resort, Sardinia, Italy, 2010.  Andr´as Antos, G´abor Bart´ok, D´avid P´al, and Csaba Szepesv´ari. Toward a classification of  finite partial-monitoring games, 2011. http://arxiv.org/abs/1102.2041.  Jean-Yves Audibert and S´ebastien Bubeck. Minimax policies for adversarial and stochastic  bandits. In Proceedings of the 22nd Annual Conference on Learning Theory, 2009.  Peter Auer, Nicol`o Cesa-Bianchi, Yoav Freund, and Robert E. Schapire. The nonstochastic  multiarmed bandit problem. SIAM Journal on Computing, 32(1):48-77, 2002.  G´abor Bart´ok, D´avid P´al, and Csaba Szepesv´ari. Toward a Classification of Finite Partial- Monitoring Games. In Proceedings of the 21st international conference on Algorithmic Learning Theory (ALT 2010), pages 224-238. Springer, 2010.  Nicol`o Cesa-Bianchi, G´abor Lugosi, and Gilles Stoltz. Minimizing regret with label eﬃcient prediction. IEEE Transactions on Information Theory, 51(6):2152-2162, June 2005.  Nicol´o Cesa-Bianchi, G´abor Lugosi, and Gilles Stoltz. Regret minimization under partial  monitoring. Mathematics of Operations Research, 31(3):562-580, 2006. Bart´ok P´al Szepesv´ari  Thomas M. Cover and Joy A. Thomas. Elements of Information Theory. Wiley, New York,  second edition, 2006.  Abraham D. Flaxman, Adam Tauman Kalai, and H. Brendan McMahan. Online convex optimization in the bandit setting: gradient descent without a gradient. In Proceedings of the 16th annual ACM-SIAM Symposium on Discrete Algorithms (SODA 2005), page 394. Society for Industrial and Applied Mathematics, 2005.  Robert Kleinberg and Tom Leighton. The value of knowing a demand curve: Bounds on regret for online posted-price auctions. In Proceedings of 44th Annual IEEE Symposium on Foundations of Computer Science 2003 (FOCS 2003), pages 594-605. IEEE, 2003.  Nick Littlestone and Manfred K. Warmuth. The weighted majority algorithm. Information  and Computation, 108:212-261, 1994.  G´abor Lugosi and Nicol`o Cesa-Bianchi. Prediction, Learning, and Games. Cambridge  University Press, 2006.  University of Alberta, 2008.  V. Mnih. Eﬃcient stopping rules. Master’s thesis, Department of Computing Science,  V. Mnih, Cs. Szepesv´ari, and J.-Y. Audibert. Empirical Bernstein stopping.  In W. W. Cohen, A. McCallum, and S. T. Roweis, editors, ICML 2008, pages 672-679. ACM, 2008.  A. Pallavi, R. Zheng, and Cs. Szepesv´ari. Sequential learning for optimal monitoring of  multi-channel wireless networks. In INFOCOMM, 2011.  Christos H. Papadimitriou and Kenneth Steiglitz. Combinatorial optimization: algorithms  and complexity. Courier Dover Publications, New York, 1998.  Antonio Piccolboni and Christian Schindelhauer. Discrete prediction games with arbitrary feedback and loss. In Proceedings of the 14th Annual Conference on Computational Learn- ing Theory (COLT 2001), pages 208-223. Springer-Verlag, 2001.  Martin Zinkevich. Online convex programming and generalized infinitesimal gradient ascent. In Proceedings of Twentieth International Conference on Machine Learning (ICML 2003), 2003. Minimax Regret of Finite Partial-Monitoring Games in Stochastic Environments"}