{"1": "Boaz Barak and Ankur Moitra. Noisy tensor completion via the sum-of-squares hierarchy. In COLT, volume 49 of JMLR Workshop and Conference Proceedings, pages 417-445. JMLR.org, 2016.  Boaz Barak, Jonathan A. Kelner, and David Steurer. Dictionary learning and tensor decom- position via the sum-of-squares method [extended abstract]. In STOC’15—Proceedings of the 2015 ACM Symposium on Theory of Computing, pages 143-151. ACM, New York, 2015.  sistent robust regression.  Kush Bhatia, Prateek Jain, Parameswaran Kamalaruban, and Purushottam Kar. Con- In Advances in Neural Information Processing Systems 30: Annual Conference on Neural Information Processing Systems 2017, 4-9 December 2017, Long Beach, CA, USA, pages 2107-2116, 2017. URL http://papers.nips.cc/paper/ 6806-consistent-robust-regression.  Moses Charikar, Jacob Steinhardt, and Gregory Valiant. Learning from untrusted data. In  Proceedings of the 49th Annual ACM SIGACT Symposium on Theory of Computing, STOC 2017, Montreal, QC, Canada, June 19-23, 2017, pages 47-60, 2017. doi: 10.1145/3055399.3055491. URL http://doi.acm.org/10.1145/3055399.3055491.  Yudong Chen, Constantine Caramanis, and Shie Mannor. Robust sparse regression under adversarial corruption. In ICML, volume 28 of JMLR Workshop and Conference Proceedings, pages 774-782. JMLR.org, 2013. URL http://jmlr.org/proceedings/papers/v28/.  Ilias Diakonikolas, Gautam Kamath, Daniel M. Kane, Jerry Zheng Li, Ankur Moitra, and Alistair Stewart. Robust estimators in high dimensions without the computational intractability. CoRR, abs/1604.06443, 2016.  9   Outlier-Robust Regression  Definition 5 (Certifiable hypercontractivity) For a function C : [k] → (cid:146)+, we say a distri- bution D on (cid:146)d is k-certifiably C-hypercontractive if for every r (cid:54) k/2, there’s a degree k sum of squares proof of the following inequality in variable v:  (cid:18)  (cid:104)x, v(cid:105)2r (cid:54)  (cid:133) D  C(r) (cid:133) D  (cid:104)x, v(cid:105)2(cid:19) r  .  Many natural distribution families satisfy certifiable hypercontractivity with reasonably growing functions C. For instance, Gaussian distributions, uniform distribution on Boolean hypercube satisfy the definitions with C(r) (cid:3) cr for a fixed constant c. More generally, all distributions that are aﬃne transformations of isotropic distributions satisfying the Poincaré inequality (Kothari and Steinhardt, 2017a), are also certifiably hypercontractive. In particular, this includes all strongly log-concave distributions. Certifiable hypercontractivity also satisfies natural closure properties under simple operations such as aﬃne transformations, taking bounded weight mixtures and taking products. We refer the reader to Kothari and Steurer (2017) for a more detailed overview where certifiable hypercontractivity is referred to as certifiable subgaussianity.  References  Boaz Barak and Ankur Moitra. Noisy tensor completion via the sum-of-squares hierarchy. In COLT, volume 49 of JMLR Workshop and Conference Proceedings, pages 417-445. JMLR.org, 2016.  Boaz Barak, Jonathan A. Kelner, and David Steurer. Dictionary learning and tensor decom- position via the sum-of-squares method [extended abstract]. In STOC’15—Proceedings of the 2015 ACM Symposium on Theory of Computing, pages 143-151. ACM, New York, 2015.  sistent robust regression.  Kush Bhatia, Prateek Jain, Parameswaran Kamalaruban, and Purushottam Kar. Con- In Advances in Neural Information Processing Systems 30: Annual Conference on Neural Information Processing Systems 2017, 4-9 December 2017, Long Beach, CA, USA, pages 2107-2116, 2017. URL http://papers.nips.cc/paper/ 6806-consistent-robust-regression.  Moses Charikar, Jacob Steinhardt, and Gregory Valiant. Learning from untrusted data. In  Proceedings of the 49th Annual ACM SIGACT Symposium on Theory of Computing, STOC 2017, Montreal, QC, Canada, June 19-23, 2017, pages 47-60, 2017. doi: 10.1145/3055399.3055491. URL http://doi.acm.org/10.1145/3055399.3055491.  Yudong Chen, Constantine Caramanis, and Shie Mannor. Robust sparse regression under adversarial corruption. In ICML, volume 28 of JMLR Workshop and Conference Proceedings, pages 774-782. JMLR.org, 2013. URL http://jmlr.org/proceedings/papers/v28/.  Ilias Diakonikolas, Gautam Kamath, Daniel M. Kane, Jerry Zheng Li, Ankur Moitra, and Alistair Stewart. Robust estimators in high dimensions without the computational intractability. CoRR, abs/1604.06443, 2016. Outlier-Robust Regression  Ilias Diakonikolas, Daniel M. Kane, and Alistair Stewart. Learning geometric concepts with nasty noise. CoRR, abs/1707.01242, 2017. URL http://arxiv.org/abs/1707.01242.  Ilias Diakonikolas, Gautam Kamath, Daniel M. Kane, Jerry Li, Jacob Steinhardt, and Alistair Stewart. Sever: A robust meta-algorithm for stochastic optimization. Preprint, 2018a. URL https://arxiv.org/abs/1803.02815.  Ilias Diakonikolas, Weihao Kong, and Alistair Stewart. Eﬃcient algorithms and lower bounds for robust linear regression. Preprint, 2018b. URL https://arxiv.org/abs/1806.00040.  Simon S. Du, Sivaraman Balakrishnan, and Aarti Singh. Computationally eﬃcient robust estimation of sparse functionals. CoRR, abs/1702.07709, 2017. URL http://arxiv.org/ abs/1702.07709.  Matthew A. Herman and Thomas Strohmer. General deviants: An analysis of perturbations  in compressed sensing. J. Sel. Topics Signal Processing, 4(2):342-349, 2010.  Sam B. Hopkins and Jerry Li. Mixture models, robustness, and sum of squares proofs. 2017.  Adam Tauman Kalai, Adam R. Klivans, Yishay Mansour, and Rocco A. Servedio. Agnostically learning halfspaces. SIAM J. Comput., 37(6):1777-1805, 2008. doi: 10.1137/060649057. URL https://doi.org/10.1137/060649057.  Adam R. Klivans, Philip M. Long, and Rocco A. Servedio. Learning halfspaces with malicious noise. Journal of Machine Learning Research, 10:2715-2740, 2009. doi: 10.1145/ 1577069.1755877. URL http://doi.acm.org/10.1145/1577069.1755877.  Pravesh K. Kothari and Jacob Steinhardt. Better agnostic clustering via relaxed tensor norms.  CoRR, abs/1711.07465, 2017a. URL http://arxiv.org/abs/1711.07465.  Pravesh K. Kothari and Jacob Steinhardt. Better agnostic clustering via relaxed tensor norms.  2017b.  Pravesh K. Kothari and David Steurer. Outlier-robust moment-estimation via sum-of-squares.  CoRR, abs/1711.11581, 2017. URL http://arxiv.org/abs/1711.11581.  Kevin A. Lai, Anup B. Rao, and Santosh Vempala. Agnostic estimation of mean and  covariance. CoRR, abs/1604.06968, 2016.  Po-Ling Loh and Martin J. Wainwright. High-dimensional regression with noisy and missing data: Provable guarantees with non-convexity. CoRR, abs/1109.3714, 2011. URL http://arxiv.org/abs/1109.3714.  Tengyu Ma, Jonathan Shi, and David Steurer. Polynomial-time tensor decompositions with  sum-of-squares. CoRR, abs/1610.01980, 2016. Outlier-Robust Regression  Aaron Potechin and David Steurer. Exact tensor completion with sum-of-squares.  In  Proceedings of the 30th Conference on Learning Theory, COLT 2017, Amsterdam, The Nether- lands, 7-10 July 2017, pages 1619-1673, 2017. URL http://proceedings.mlr.press/v65/ potechin17a.html.  A. Prasad, A. Sai Suggala, S. Balakrishnan, and P. Ravikumar. Robust Estimation via Robust  Gradient Estimation. ArXiv e-prints, 2018.  Peter J. Rousseeuw and Annick M. Leroy. Robust regression and outlier detection. Wiley Series in Probability and Mathematical Statistics: Applied Probability and Statistics. John Wiley & Sons, Inc., New York, 1987. ISBN 0-471-85233-3. URL https://doi.org/10.1002/ 0471725382.  Huan Xu, Constantine Caramanis, and Shie Mannor. Robust regression and lasso. IEEE Trans. Information Theory, 56(7):3561-3574, 2010. doi: 10.1109/TIT.2010.2048503. URL https://doi.org/10.1109/TIT.2010.2048503."}