{"1": "Alekh Agarwal, Animashree Anandkumar, Prateek Jain, Praneeth Netrapalli, and Rashish Tandon. Learning sparsely used overcomplete dictionaries. In COLT, volume 35 of JMLR Workshop and Conference Proceedings, pages 123-137. JMLR.org, 2014.  Anima Anandkumar, Dean P. Foster, Daniel J. Hsu, Sham Kakade, and Yi-Kai Liu. A spectral  algorithm for latent dirichlet allocation. In NIPS, pages 926-934, 2012.  Animashree Anandkumar, Rong Ge, Daniel J. Hsu, and Sham Kakade. A tensor spectral approach to learning mixed membership community models. In COLT, volume 30 of JMLR Workshop and Conference Proceedings, pages 867-881. JMLR.org, 2013.  Animashree Anandkumar, Rong Ge, Daniel J. Hsu, Sham M. Kakade, and Matus Telgarsky. Tensor decompositions for learning latent variable models. Journal of Machine Learning Research, 15 (1):2773-2832, 2014.  Sanjeev Arora, Aditya Bhaskara, Rong Ge, and Tengyu Ma. More algorithms for provable dictio-  nary learning. CoRR, abs/1401.0579, 2014.  Sanjeev Arora, Rong Ge, Tengyu Ma, and Ankur Moitra. Simple, efficient, and neural algorithms for sparse coding. In COLT, volume 40 of JMLR Workshop and Conference Proceedings, pages 113-149. JMLR.org, 2015.  Sanjeev Arora, Rong Ge, Tengyu Ma, and Andrej Risteski. Provable learning of noisy-or networks.  CoRR, abs/1612.08795, 2016.  Boaz Barak, Jonathan A. Kelner, and David Steurer. Dictionary learning and tensor decomposition  via the sum-of-squares method. In STOC, pages 143-151. ACM, 2015.  Aditya Bhaskara, Moses Charikar, Ankur Moitra, and Aravindan Vijayaraghavan. Smoothed anal-  ysis of tensor decompositions. In STOC, pages 594-603. ACM, 2014.  Michael Elad and Michal Aharon. Image denoising via sparse and redundant representations over  learned dictionaries. Image Processing, IEEE Transactions on, 15(12):3736-3745, 2006.  Andreas Argyriou Theodoros Evgeniou and Massimiliano Pontil. Multi-task feature learning. In Advances in Neural Information Processing Systems 19: Proceedings of the 2006 Conference, volume 19, pages 41-48. MIT Press, 2007.  Tom Goldstein and Stanley Osher. The split bregman method for l1-regularized problems. SIAM  journal on imaging sciences, 2(2):323-343, 2009.  31   FAST AND ROBUST TENSOR DECOMPOSITION WITH APPLICATIONS TO DICTIONARY LEARNING  T.S. is supported by an NSF Graduate Research Fellowship (NSF award no 1106400). D.S. is supported by a Microsoft Research Fellowship, a Alfred P. Sloan Fellowship, an NSF award, and the Simons Collaboration for Algorithms and Geometry.  Acknowledgments  References  Alekh Agarwal, Animashree Anandkumar, Prateek Jain, Praneeth Netrapalli, and Rashish Tandon. Learning sparsely used overcomplete dictionaries. In COLT, volume 35 of JMLR Workshop and Conference Proceedings, pages 123-137. JMLR.org, 2014.  Anima Anandkumar, Dean P. Foster, Daniel J. Hsu, Sham Kakade, and Yi-Kai Liu. A spectral  algorithm for latent dirichlet allocation. In NIPS, pages 926-934, 2012.  Animashree Anandkumar, Rong Ge, Daniel J. Hsu, and Sham Kakade. A tensor spectral approach to learning mixed membership community models. In COLT, volume 30 of JMLR Workshop and Conference Proceedings, pages 867-881. JMLR.org, 2013.  Animashree Anandkumar, Rong Ge, Daniel J. Hsu, Sham M. Kakade, and Matus Telgarsky. Tensor decompositions for learning latent variable models. Journal of Machine Learning Research, 15 (1):2773-2832, 2014.  Sanjeev Arora, Aditya Bhaskara, Rong Ge, and Tengyu Ma. More algorithms for provable dictio-  nary learning. CoRR, abs/1401.0579, 2014.  Sanjeev Arora, Rong Ge, Tengyu Ma, and Ankur Moitra. Simple, efficient, and neural algorithms for sparse coding. In COLT, volume 40 of JMLR Workshop and Conference Proceedings, pages 113-149. JMLR.org, 2015.  Sanjeev Arora, Rong Ge, Tengyu Ma, and Andrej Risteski. Provable learning of noisy-or networks.  CoRR, abs/1612.08795, 2016.  Boaz Barak, Jonathan A. Kelner, and David Steurer. Dictionary learning and tensor decomposition  via the sum-of-squares method. In STOC, pages 143-151. ACM, 2015.  Aditya Bhaskara, Moses Charikar, Ankur Moitra, and Aravindan Vijayaraghavan. Smoothed anal-  ysis of tensor decompositions. In STOC, pages 594-603. ACM, 2014.  Michael Elad and Michal Aharon. Image denoising via sparse and redundant representations over  learned dictionaries. Image Processing, IEEE Transactions on, 15(12):3736-3745, 2006.  Andreas Argyriou Theodoros Evgeniou and Massimiliano Pontil. Multi-task feature learning. In Advances in Neural Information Processing Systems 19: Proceedings of the 2006 Conference, volume 19, pages 41-48. MIT Press, 2007.  Tom Goldstein and Stanley Osher. The split bregman method for l1-regularized problems. SIAM  journal on imaging sciences, 2(2):323-343, 2009. SCHRAMM STEURER  Moritz Hardt and Eric Price. The noisy power method: A meta algorithm with applications. In  NIPS, pages 2861-2869, 2014.  Richard A Harshman. Foundations of the parafac procedure: Models and conditions for an\" ex-  planatory\" multi-modal factor analysis. 1970.  Elad Hazan and Tengyu Ma. A non-generative framework and convex relaxations for unsupervised  learning. In NIPS, pages 3306-3314, 2016.  Samuel B. Hopkins, Tselil Schramm, Jonathan Shi, and David Steurer. Speeding up sum-of-squares  for tensor decomposition and planted sparse vectors. CoRR, abs/1512.02337, 2015.  Samuel B. Hopkins, Tselil Schramm, Jonathan Shi, and David Steurer. Fast spectral algorithms from sum-of-squares proofs: tensor decomposition and planted sparse vectors. In STOC, pages 178-191. ACM, 2016.  Daniel Hsu and Sham M. Kakade. Learning mixtures of spherical Gaussians: moment methods and spectral decompositions. In ITCS’13—Proceedings of the 2013 ACM Conference on Innovations in Theoretical Computer Science, pages 11-19. ACM, New York, 2013.  Lieven De Lathauwer, Bart De Moor, and Joos Vandewalle. Blind source separation by simultaneous  third-order tensor diagonalization. In EUSIPCO, pages 1-4. IEEE, 1996.  Lieven De Lathauwer, Joséphine Castaing, and Jean-François Cardoso. Fourth-order cumulant- based blind identification of underdetermined mixtures. IEEE Trans. Signal Processing, 55(6-2): 2965-2973, 2007.  Tengyu Ma, Jonathan Shi, and David Steurer. Polynomial-time tensor decompositions with sum-  of-squares. In FOCS, pages 438-446. IEEE Computer Society, 2016.  Julien Mairal, Marius Leordeanu, Francis Bach, Martial Hebert, and Jean Ponce. Discriminative In Computer  sparse image models for class-specific edge detection and image interpretation. Vision-ECCV 2008, pages 43-56. Springer, 2008.  Y Marc’Aurelio Ranzato, Lan Boureau, and Yann LeCun. Sparse feature learning for deep belief  networks. Advances in neural information processing systems, 20:1185-1192, 2007.  Elchanan Mossel and Sébastien Roch. Learning nonsingular phylogenies and hidden markov mod-  els. In STOC, pages 366-375. ACM, 2005.  Roberto I. Oliveira. Sums of random Hermitian matrices and an inequality by Rudelson. Electron.  Commun. Probab., 15:203-212, 2010. ISSN 1083-589X/e.  Bruno A Olshausen and David J Field. Sparse coding with an overcomplete basis set: A strategy  employed by v1? Vision research, 37(23):3311-3325, 1997.  R. Tyrrell Rockafellar. Monotone operators and the proximal point algorithm. SIAM Journal on Control and Optimization, 14(5):877-898, 1976. doi: 10.1137/0314056. URL http://dx. doi.org/10.1137/0314056. FAST AND ROBUST TENSOR DECOMPOSITION WITH APPLICATIONS TO DICTIONARY LEARNING  Joel A. Tropp. User-friendly tail bounds for sums of random matrices. Foundations of Computa-  tional Mathematics, 12(4):389-434, 2012.  Jianchao Yang, John Wright, Thomas Huang, and Yi Ma. Image super-resolution as sparse repre- sentation of raw image patches. In Computer Vision and Pattern Recognition, 2008. CVPR 2008. IEEE Conference on, pages 1-8. IEEE, 2008."}