{"1": "Heinz H. Bauschke and Patrick L. Combettes. Convex analysis and monotone operator theory in  Hilbert spaces, volume 408. Springer, 2011.  Chao-Kai Chiang, Tianbao Yang, Chia-Jung Lee, Mehrdad Mahdavi, Chi-Jen Lu, Rong Jin, and Shenghuo Zhu. Online optimization with gradual variations. In Conference on Learning Theory, pages 6-1, 2012.  Constantinos Daskalakis, Alan Deckelbaum, and Anthony Kim. Near-optimal no-regret algorithms for zero-sum games. In Proceedings of the Twenty-Second Annual ACM-SIAM Symposium on Discrete Algorithms (SODA), pages 235-254, 2011.  John Duchi, Elad Hazan, and Yoram Singer. Adaptive subgradient methods for online learning and  stochastic optimization. Journal of Machine Learning Research, 12(Jul):2121-2159, 2011.  Pavel Dvurechensky, Alexander Gasnikov, Fedor Stonyakin, and Alexander Titov. Generalized mir- ror prox: Solving variational inequalities with monotone operator, inexact oracle, and unknown H¨older parameters. Technical Report 1806.05140, arXiv, 2018.  Yoav Freund, Robert E Schapire, et al. Adaptive game playing using multiplicative weights. Games  and Economic Behavior, 29(1-2):79-103, 1999.  Anatoli Juditsky and Arkadi Nemirovski. First order methods for nonsmooth convex large-scale optimization, ii: utilizing problems structure. Optimization for Machine Learning, pages 149- 183, 2011.  Anatoli Juditsky and Arkadi Nemirovski. Solving variational inequalities with monotone operators on domains given by linear minimization oracles. Mathematical Programming, 156(1-2):221- 256, 2016.  Anatoli Juditsky, Arkadi Nemirovski, and Claire Tauvel. Solving variational inequalities with  stochastic mirror-prox algorithm. Stochastic Systems, 1(1):17-58, 2011.  Anatoli Juditsky, Fatma Kılınc¸ Karzan, and Arkadi Nemirovski. Randomized first order algorithms with applications to 1-minimization. Mathematical Programming, 142(1-2):269-310, 2013.  Anatoli B Juditsky and Arkadi S Nemirovski. Large deviations of vector-valued martingales in  2-smooth normed spaces. arXiv preprint arXiv:0809.0813, 2008.  Sham Kakade. Lecture notes in multivariate analysis, dimensionality reduction, and spectral meth- ods. http://stat.wharton.upenn.edu/˜skakade/courses/stat991_mult/ lectures/MatrixConcen.pdf, April 2010.  G. M. Korpelevich. The extragradient method for finding saddle points and other problems. Mate-  con, 12:747-756, 1976.  G. M. Korpelevich. Extrapolational gradient methods and their connection with modified la-  grangians. Ehkon. Mat. Metody, 19:694-703, 1983.  13   A UNIVERSAL ALGORITHM FOR VARIATIONAL INEQUALITIES  References  Heinz H. Bauschke and Patrick L. Combettes. Convex analysis and monotone operator theory in  Hilbert spaces, volume 408. Springer, 2011.  Chao-Kai Chiang, Tianbao Yang, Chia-Jung Lee, Mehrdad Mahdavi, Chi-Jen Lu, Rong Jin, and Shenghuo Zhu. Online optimization with gradual variations. In Conference on Learning Theory, pages 6-1, 2012.  Constantinos Daskalakis, Alan Deckelbaum, and Anthony Kim. Near-optimal no-regret algorithms for zero-sum games. In Proceedings of the Twenty-Second Annual ACM-SIAM Symposium on Discrete Algorithms (SODA), pages 235-254, 2011.  John Duchi, Elad Hazan, and Yoram Singer. Adaptive subgradient methods for online learning and  stochastic optimization. Journal of Machine Learning Research, 12(Jul):2121-2159, 2011.  Pavel Dvurechensky, Alexander Gasnikov, Fedor Stonyakin, and Alexander Titov. Generalized mir- ror prox: Solving variational inequalities with monotone operator, inexact oracle, and unknown H¨older parameters. Technical Report 1806.05140, arXiv, 2018.  Yoav Freund, Robert E Schapire, et al. Adaptive game playing using multiplicative weights. Games  and Economic Behavior, 29(1-2):79-103, 1999.  Anatoli Juditsky and Arkadi Nemirovski. First order methods for nonsmooth convex large-scale optimization, ii: utilizing problems structure. Optimization for Machine Learning, pages 149- 183, 2011.  Anatoli Juditsky and Arkadi Nemirovski. Solving variational inequalities with monotone operators on domains given by linear minimization oracles. Mathematical Programming, 156(1-2):221- 256, 2016.  Anatoli Juditsky, Arkadi Nemirovski, and Claire Tauvel. Solving variational inequalities with  stochastic mirror-prox algorithm. Stochastic Systems, 1(1):17-58, 2011.  Anatoli Juditsky, Fatma Kılınc¸ Karzan, and Arkadi Nemirovski. Randomized first order algorithms with applications to 1-minimization. Mathematical Programming, 142(1-2):269-310, 2013.  Anatoli B Juditsky and Arkadi S Nemirovski. Large deviations of vector-valued martingales in  2-smooth normed spaces. arXiv preprint arXiv:0809.0813, 2008.  Sham Kakade. Lecture notes in multivariate analysis, dimensionality reduction, and spectral meth- ods. http://stat.wharton.upenn.edu/˜skakade/courses/stat991_mult/ lectures/MatrixConcen.pdf, April 2010.  G. M. Korpelevich. The extragradient method for finding saddle points and other problems. Mate-  con, 12:747-756, 1976.  G. M. Korpelevich. Extrapolational gradient methods and their connection with modified la-  grangians. Ehkon. Mat. Metody, 19:694-703, 1983. A UNIVERSAL ALGORITHM FOR VARIATIONAL INEQUALITIES  Kfir Levy. Online to ofﬂine conversions, universality and adaptive minibatch sizes. In Advances in  Neural Information Processing Systems, pages 1612-1621, 2017.  Yehuda Kfir Levy, Alp Yurtsever, and Volkan Cevher. Online adaptive methods, universality and acceleration. In Advances in Neural Information Processing Systems, pages 6501-6510, 2018.  H. Brendan McMahan and Matthew Streeter. Adaptive bound optimization for online convex opti-  mization. COLT 2010, page 244, 2010.  Arkadi Nemirovski. Prox-method with rate of convergence O(1/t) for variational inequalities with lipschitz continuous monotone operators and smooth convex-concave saddle point problems. SIAM Journal on Optimization, 15(1):229-251, 2004.  Arkadii Nemirovskii and David Borisovich Yudin. Problem complexity and method efficiency in  optimization. 1983.  ity, 8(2):153-175, 1992.  A. S. Nemirovsky. Information-based complexity of linear operator equations. Journal of Complex-  Yurii Nesterov. Universal gradient methods for convex optimization problems. Mathematical Pro-  gramming, 152(1-2):381-404, 2015.  Muhammad Aslam Noor. New extragradient-type methods for general variational inequalities. Jour-  nal of Mathematical Analysis and Applications, 277(2):379-394, 2003.  Sasha Rakhlin and Karthik Sridharan. Optimization, learning, and games with predictable se-  quences. In Advances in Neural Information Processing Systems, pages 3066-3074, 2013.  Alp Yurtsever, Quoc Tran Dinh, and Volkan Cevher. A universal primal-dual convex optimization framework. In Advances in Neural Information Processing Systems, pages 3150-3158, 2015. A UNIVERSAL ALGORITHM FOR VARIATIONAL INEQUALITIES"}