{"1": "Vineeth N. Balasubramanian, Shen-Shyang Ho, and Vladimir Vovk. Conformal Prediction for  Reliable Machine Learning. Morgan Kaufmann, Boston, 2014.  Peter J Bickel, Ya´acov Ritov, and Alexandre B Tsybakov. Simultaneous analysis of lasso and  dantzig selector. The Annals of Statistics, 37(4):1705-1732, 2009.  Richard C Bradley. Introduction to strong mixing conditions, volume 1. Kendrick Press Heber City,  2007.  Business Media, 2013.  Peter J Brockwell and Richard A Davis. Time series: theory and methods. Springer Science &  Evgeny Burnaev and Vladimir Vovk. Efficiency of conformalized ridge regression. In Conference  on Learning Theory, pages 605-622, 2014.  Xiaohong Chen and H. White. Improved rates and asymptotic normality for nonparametric neural network estimators. IEEE Transactions on Information Theory, 45(2):682-691, Mar 1999. ISSN 0018-9448. doi: 10.1109/18.749011.  Xiaohong Chen, Jeffrey Racine, and Norman R Swanson. Semiparametric arx neural-network mod- els with an application to forecasting inﬂation. IEEE Transactions on neural networks, 12(4): 674-683, 2001.  10   CONFORMAL INFERENCE FOR DEPENDENT DATA  Strong mixing is a mild condition on dependence and is satisfied by many stochastic processes. For example, it is well known that any stationary Markov chains that are Harris recurrent and ape- riodic are strong mixing. Many common serially dependent processes such as ARMA with i.i.d. innovations can also be shown to be strong mixing.  4. Conclusion  This paper extends the applicability of conformal inference to general settings that allow for time series data. Our results are developed within the general framework of randomization inference. Our method is based on a carefully-designed randomization approach based on groups of permutations, which exhibit a block structure to account for the potential serial dependence in the data. When the data are i.i.d. or more generally exchangeable, our method exhibits exact, model-free validity. When the exchangeability condition does not hold, finite-sample performance bounds can still be obtained under weak conditions on the conformity score as long as transformations of the data serve as meaningful approximations for a stationary series.  We gratefully acknowledge research support from the National Science Foundation. We are very grateful to three anonymous referees for helpful comments.  Acknowledgements  References  Vineeth N. Balasubramanian, Shen-Shyang Ho, and Vladimir Vovk. Conformal Prediction for  Reliable Machine Learning. Morgan Kaufmann, Boston, 2014.  Peter J Bickel, Ya´acov Ritov, and Alexandre B Tsybakov. Simultaneous analysis of lasso and  dantzig selector. The Annals of Statistics, 37(4):1705-1732, 2009.  Richard C Bradley. Introduction to strong mixing conditions, volume 1. Kendrick Press Heber City,  2007.  Business Media, 2013.  Peter J Brockwell and Richard A Davis. Time series: theory and methods. Springer Science &  Evgeny Burnaev and Vladimir Vovk. Efficiency of conformalized ridge regression. In Conference  on Learning Theory, pages 605-622, 2014.  Xiaohong Chen and H. White. Improved rates and asymptotic normality for nonparametric neural network estimators. IEEE Transactions on Information Theory, 45(2):682-691, Mar 1999. ISSN 0018-9448. doi: 10.1109/18.749011.  Xiaohong Chen, Jeffrey Racine, and Norman R Swanson. Semiparametric arx neural-network mod- els with an application to forecasting inﬂation. IEEE Transactions on neural networks, 12(4): 674-683, 2001. CONFORMAL INFERENCE FOR DEPENDENT DATA  Victor Chernozhukov, Chris Hansen, and Martin Spindler. hdm: High-dimensional metrics. R  Journal, 8(2):185-199, 2016.  Victor Chernozhukov, Kaspar W¨uthrich, and Yinchu Zhu. An exact and robust conformal inference  method for counterfactual and synthetic controls. arXiv:1712.09089, 2017.  Mikhail Dashevskiy and Zhiyuan Luo. Network traffic demand prediction with confidence.  In Global Telecommunications Conference, 2008. IEEE GLOBECOM 2008. IEEE, pages 1-5. IEEE, 2008.  Mikhail Dashevskiy and Zhiyuan Luo. Time series prediction with performance guarantee. IET ISSN 1751-8628. doi: 10.1049/iet-com.2010.  Communications, 5(8):1044-1051, May 2011. 0121.  Ronald A. Fisher. The Design of Experiments. Oliver & Boyd, 1935.  James D. Hamilton. Time series: theory and methods. Springer Science & Business Media, 1994.  Erich L Lehmann and Joseph P Romano. Testing statistical hypotheses. Springer Science & Busi-  ness Media, 2005.  Jing Lei and Larry Wasserman. Distribution-free prediction bands for non-parametric regression. Journal of the Royal Statistical Society: Series B (Statistical Methodology), 76(1):71-96, 2014.  Jing Lei, James Robins, and Larry Wasserman. Distribution-free prediction sets. Journal of the  American Statistical Association, 108(501):278-287, 2013.  Jing Lei, Allesandro Rinaldo, and Larry Wasserman. A conformal prediction approach to explore  functional data. Annals of Mathematics and Artificial Intelligence, 74:29-43, 2015.  Jing Lei, Max G’Sell, Alessandro Rinaldo, Ryan J Tibshirani, and Larry Wasserman. Distribution- free predictive inference for regression. Journal of the American Statistical Association, (just- accepted), 2017.  Harris Papadopoulos, Volodya Vovk, and Alex Gammermam. Conformal prediction with neural networks. In Tools with Artificial Intelligence, 2007. ICTAI 2007. 19th IEEE International Con- ference on, volume 2, pages 388-395. IEEE, 2007.  Emmanuel Rio. Asymptotic Theory of Weakly Dependent Random Processes. Springer, 2017.  Joseph P. Romano. On the behavior of randomization tests without a group invariance assumption.  Journal of the American Statistical Association, 85(411):686-692, 1990. ISSN 01621459.  Donald B. Rubin. Bayesianly justifiable and relevant frequency calculations for the applied statisti-  cian. The Annals of Statistics, 12(4):1151-1172, 12 1984. doi: 10.1214/aos/1176346785.  Vladimir Vovk. Conditional validity of inductive conformal predictors. Machine Learning, 92(2):  349-376, Sep 2013. ISSN 1573-0565. doi: 10.1007/s10994-013-5355-6.  Vladimir. Vovk, Alex. Gammerman, and Glenn. Shafer. Algorithmic Learning in a Random World.  Springer, 2005. CONFORMAL INFERENCE FOR DEPENDENT DATA  Vladimir Vovk, Ilia Nouretdinov, and Alex Gammerman. On-line predictive linear regression. The  Annals of Statistics, 37(3):1566-1590, 2009. CONFORMAL INFERENCE FOR DEPENDENT DATA"}