{"1": "E. Abbe, A. S. Bandeira, A. Bracher, and A. Singer. Decoding binary node labels from censored edge measurements: Phase transition and efficient recovery. Network Science and Engineering, IEEE Transactions on, 1(1):10-22, 2014.  E. Abbe, A.S. Bandeira, and G. Hall. Exact recovery in the stochastic block model. Information  Theory, IEEE Transactions on, 62(1):471-487, 2016.  17   THE LOW-RANK APPROACH FOR CERTAIN SEMIDEFINITE PROGRAMS  To ensure rank(Q) = 1, it remains to force rank(ddiag(AQQT ) − σ∆) = n. Since the first matrix is diagonal, this is the case in particular if  This can be controlled by Lemmas 12 and 13:  diag(AQQT )i > σ(cid:107)∆(cid:107).  min i  (cid:107)eT  min i  i AQ(cid:107)2 − σ(cid:107)∆(cid:107) = min  (cid:107)eT  i zzT Q + σ · eT (cid:107)eT  ≥ (cid:107)QT z(cid:107)2 − σ · max  i  i ∆Q(cid:107)2 − σ(cid:107)∆(cid:107)  i  i ∆Q(cid:107)2 − γcn (cid:17)  √  (cid:16)(cid:112)log n + 4  γcn  .  ≥ n − 9γcn − γcn  Forcing the latter to be positive (as with the condition in this lemma’s statement) is sufficient to imply rank(Q) = 1.  Theorem 15 Let A = zzT + σ∆ for some planted solution z ∈ {±1}n, with σ = c diag(∆) = 0, (cid:107)∆(cid:107) ≤ γ  n log n, for some γ, c ≥ 0. If  n and (cid:107)∆z(cid:107)∞ ≤ γ  √  √  √  n, ∆ = ∆T ,  γc <  √  1 log n + 4  √  ,  γcn  9 +  then all second-order critical points Q of (10) with cost matrix A are global optima of rank 1 such that QQT = zzT . There exists a constant k such that, if γc ≤ kn−1/3, then the theorem applies.  Proof By Lemma 14, all second-order critical points Q have rank 1. By Lemma 10, such Q’s are thus globally optimal. By Lemma 11 (whose conditions are satisfied a fortiori), they all satisfy QQT = zzT .  Acknowledgments  ASB was supported by NSF grant DMS-1317308. ASB acknowledges Wotao Yin for pointing the author to the relevant reference (Wen and Yin, 2013) which helped motivate the start of the investigation in this paper. NB, formerly hosted by the SIERRA group at Inria and ENS, was supported by the “Fonds Sp´eciaux de Recherche” (FSR) at UCLouvain and by the Chaire Havas “Chaire Economie et gestion des nouvelles donn´ees”, the ERC Starting Grant SIPA and a Research in Paris grant in Paris. VV acknowledges support from the Office of Naval Research.  References  E. Abbe, A. S. Bandeira, A. Bracher, and A. Singer. Decoding binary node labels from censored edge measurements: Phase transition and efficient recovery. Network Science and Engineering, IEEE Transactions on, 1(1):10-22, 2014.  E. Abbe, A.S. Bandeira, and G. Hall. Exact recovery in the stochastic block model. Information  Theory, IEEE Transactions on, 62(1):471-487, 2016. BANDEIRA BOUMAL VORONINSKI  P.-A. Absil, R. Mahony, and R. Sepulchre. Optimization Algorithms on Matrix Manifolds. Princeton  University Press, Princeton, NJ, 2008. ISBN 978-0-691-13298-3.  J. Baik, G. Ben-Arous, and S. P´ech´e. Phase transition of the largest eigenvalue for nonnull complex  sample covariance matrices. The Annals of Probability, 33(5):1643-1697, 2005.  A. S. Bandeira and R. v. Handel. Sharp nonasymptotic bounds on the norm of random matrices  with independent entries. Annals of Probability, to appear, 2015.  A. S. Bandeira, M. Charikar, A. Singer, and A. Zhu. Multireference alignment using semidefinite  programming. 5th Innovations in Theoretical Computer Science (ITCS 2014), 2014a.  A.S. Bandeira. A note on probably certifiably correct algorithms. Available at arXiv:1509.00824  [math.OC], 2015a.  arXiv:1504.03987, 2015b.  A.S. Bandeira.  Random Laplacian matrices and convex relaxations.  arXiv preprint  A.S. Bandeira, C. Kennedy, and A. Singer. Approximating the little Grothendieck problem over the  orthogonal and unitary groups. arXiv preprint arXiv:1308.5207, 2013.  A.S. Bandeira, N. Boumal, and A. Singer. Tightness of the maximum likelihood semidefinite relax-  ation for angular synchronization. arXiv preprint arXiv:1411.3272, 2014b.  A.S. Bandeira, Y. Chen, and A. Singer. Non-unique games over compact groups and orientation  estimation in cryo-EM. arXiv preprint arXiv:1505.03840, 2015.  A.I. Barvinok. Problems of distance geometry and convex properties of quadratic maps. Discrete  & Computational Geometry, 13(1):189-202, 1995. doi: 10.1007/BF02574037.  N. Boumal. A Riemannian low-rank method for optimization over semidefinite matrices with block-  diagonal constraints. arXiv preprint arXiv:1506.00575, 2015.  N. Boumal. Nonconvex phase synchronization. arXiv preprint arXiv:1601.06114, 2016.  N. Boumal, P.-A. Absil, and C. Cartis. Global rates of convergence for nonconvex optimization on  manifolds. arXiv preprint arXiv:1605.08101, 2016.  J. Bri¨et, F.M. de Oliveira Filho, and F. Vallentin. Grothendieck inequalities for semidefinite pro- grams with rank constraint. Theory of Computing, 10(4):77-105, 2014. doi: 10.4086/toc.2014. v010a004.  S. Burer and R.D.C. Monteiro. A nonlinear programming algorithm for solving semidefinite programs via low-rank factorization. Mathematical Programming, 95(2):329-357, 2003. doi: 10.1007/s10107-002-0352-8.  S. Burer and R.D.C. Monteiro. Local minima and convergence in low-rank semidefinite program-  ming. Mathematical Programming, 103(3):427-444, 2005.  S. Burer, R.D.C. Monteiro, and Y. Zhang. Rank-two relaxation heuristics for Max-Cut and other  binary quadratic programs. SIAM Journal on Optimization, 12(2):503-521, 2002. THE LOW-RANK APPROACH FOR CERTAIN SEMIDEFINITE PROGRAMS  A. Decelle, F. Krzakala, C. Moore, and L. Zdeborov´a. Asymptotic analysis of the stochastic block model for modular networks and its algorithmic applications. Phys. Rev. E, 84, December 2011.  U. Feige and J. Kilian. Heuristics for semirandom graph problems. Journal of Computer and System  Sciences, 63(4):639 - 671, 2001.  D. F´eral and S. P´ech´e. The largest eigenvalue of rank one deformation of large wigner matrices.  Communications in Mathematical Physics, 272(1):185-228, 2006.  M.X. Goemans and D.P. Williamson. Improved approximation algorithms for maximum cut and satisfiability problems using semidefinite programming. Journal of the ACM (JACM), 42(6): 1115-1145, 1995. doi: 10.1145/227683.227684.  O. Guedon and R. Vershynin. Community detection in sparse networks via Grothendieck’s inequal-  ity. Available online at arXiv:1411.4686 [math.ST], 2014.  B. Hajek, Y. Wu, and J. Xu. Achieving exact cluster recovery threshold via semidefinite program-  ming. Available online at arXiv:1412.6156, 2014.  A. Javanmard, A. Montanari, and F. Ricci-Tersenghi. Phase transitions in semidefinite relaxations.  arXiv preprint arXiv:1511.08769, 2015.  M. Journ´ee, F. Bach, P.-A. Absil, and R. Sepulchre. Low-rank optimization on the cone of positive semidefinite matrices. SIAM Journal on Optimization, 20(5):2327-2351, 2010. doi: 10.1137/ 080731359.  M. Krivelevich and B. Sudakov. The largest eigenvalue of sparse random graphs. Combinatorics,  Probability and Computing, 12:61-72, 2003.  L. Massouli´e. Community detection thresholds and the weak ramanujan property. In Proceedings of the 46th Annual ACM Symposium on Theory of Computing, STOC ’14, pages 694-703, New York, NY, USA, 2014. ACM. ISBN 978-1-4503-2710-7. doi: 10.1145/2591796.2591857. URL http://doi.acm.org/10.1145/2591796.2591857.  A. Moitra, W. Perry, and A. S. Wein. How robust are reconstruction thresholds for community  detection? Available online at arXiv:1511.01473 [cs.DS], 2015.  A. Montanari and S. Sen. Semidefinite programs on sparse random graphs. Available online at  arXiv:1504.05910 [cs.DM], 2015.  E. Mossel, J. Neeman, and A. Sly. Stochastic block models and reconstruction. Probability Theory  and Related Fields (to appear), 2014a.  E. Mossel, J. Neeman, and A. Sly. A proof of the block model threshold conjecture. Available  online at arXiv:1311.4115 [math.PR], January 2014b.  E. Mossel, J. Neeman, and A. Sly. Consistency thresholds for the planted bisection model. Available  online at arXiv:1407.1591v2 [math.PR], July 2014c.  Y. Nesterov. Introductory lectures on convex optimization: A basic course, volume 87 of Applied  optimization. Springer, 2004. ISBN 978-1-4020-7553-7. BANDEIRA BOUMAL VORONINSKI  G. Pataki. On the rank of extreme matrices in semidefinite programs and the multiplicity of optimal eigenvalues. Mathematics of operations research, 23(2):339-358, 1998. doi: 10.1287/moor.23. 2.339.  A. Shapiro. Rank-reducibility of a symmetric matrix and sampling theory of minimum trace factor  analysis. Psychometrika, 47(2):187-199, 1982.  A. Singer. Angular synchronization by eigenvectors and semidefinite programming. Applied and  Computational Harmonic Analysis, 30(1):20-36, 2011. doi: 10.1016/j.acha.2010.02.001.  Z. Wen and W. Yin. A feasible method for optimization with orthogonality constraints. Mathemat-  ical Programming, 142(1-2):397-434, 2013. doi: 10.1007/s10107-012-0584-1."}