{"1": "Alekh Agarwal, Daniel Hsu, Satyen Kale, John Langford, Lihong Li, and Robert E. Schapire. Tam- In Proceedings of the  ing the monster: A fast and simple algorithm for contextual bandits. International Conference on Machine Learning (ICML), 2014.  Nir Ailon, Zohar Karnin, and Thorsten Joachims. Reducing dueling bandits to cardinal bandits. In Proceedings of the International Conference on Machine Learning (ICML), pages 856-864, 2014.  Peter Auer, Nicol`o Cesa-Bianchi, Yoav Freund, and Robert E. Schapire. The nonstochastic multi-  armed bandit problem. SIAM J. Computing, 32(1):48-77, 2002.  Alina Beygelzimer, John Langford, Lihong Li, Lev Reyzin, and Robert Schapire. Contextual bandit  algorithms with supervised learning guarantees. J. Mach. Learn. Res., 15:19-26, 2011.  R´obert Busa-Fekete and Eyke H¨ullermeier. A survey of preference-based online learning with  bandit algorithms. In Algorithmic Learning Theory (ALT), pages 18-39, 2014.  Nicol`o Cesa-Bianchi and G´abor Lugosi. Prediction, Learning, and Games. Cambridge University  Press, 2006.  Olivier Chapelle, Thorsten Joachims, Filip Radlinski, and Yisong Yue. Large-scale validation and analysis of interleaved search evaluation. ACM Transactions on Information Systems (TOIS), 30 (1):6:1-6:41, 2012.  Miroslav Dud´ık, Daniel Hsu, Satyen Kale, Nikos Karampatziakis, John Langford, Lev Reyzin, and Tong Zhang. Efficient optimal learning for contextual bandits. In Uncertainty in Artificial Intelligence (UAI), pages 169-178, 2011.  Yoav Freund and Robert E. Schapire. Adaptive game playing using multiplicative weights. Games  and Economic Behavior, 29:79-103, 1999.  Martin Gardner. Mathematical games: The paradox of the nontransitive dice and the elusive princi-  ple of indifference. Scientific American, 223:110-114, 1970.  Fan Guo, Lei Li, and Christos Faloutsos. Tailoring click models to user goals. In Workshop on Web  Search Click Data (WSCD), pages 88-92, 2009a.  Fan Guo, Chao Liu, and Yi-Min Wang. Efficient multiple-click models in web search. In Proceed- ings of the International Conference on Web Search and Data Mining (WSDM), pages 124-131, 2009b.  Katja Hofmann, Shimon Whiteson, and Maarten de Rijke. A probabilistic method for inferring In Proceedings of the International Conference on Information and  preferences from clicks. Knowledge Management (CIKM), pages 249-258, 2011.  Katja Hofmann, Shimon Whiteson, and Maarten de Rijke. Fidelity, soundness, and efficiency of interleaved comparison methods. ACM Transactions on Information Systems (TOIS), 31(4), 2013.  13   CONTEXTUAL DUELING BANDITS  References  Alekh Agarwal, Daniel Hsu, Satyen Kale, John Langford, Lihong Li, and Robert E. Schapire. Tam- In Proceedings of the  ing the monster: A fast and simple algorithm for contextual bandits. International Conference on Machine Learning (ICML), 2014.  Nir Ailon, Zohar Karnin, and Thorsten Joachims. Reducing dueling bandits to cardinal bandits. In Proceedings of the International Conference on Machine Learning (ICML), pages 856-864, 2014.  Peter Auer, Nicol`o Cesa-Bianchi, Yoav Freund, and Robert E. Schapire. The nonstochastic multi-  armed bandit problem. SIAM J. Computing, 32(1):48-77, 2002.  Alina Beygelzimer, John Langford, Lihong Li, Lev Reyzin, and Robert Schapire. Contextual bandit  algorithms with supervised learning guarantees. J. Mach. Learn. Res., 15:19-26, 2011.  R´obert Busa-Fekete and Eyke H¨ullermeier. A survey of preference-based online learning with  bandit algorithms. In Algorithmic Learning Theory (ALT), pages 18-39, 2014.  Nicol`o Cesa-Bianchi and G´abor Lugosi. Prediction, Learning, and Games. Cambridge University  Press, 2006.  Olivier Chapelle, Thorsten Joachims, Filip Radlinski, and Yisong Yue. Large-scale validation and analysis of interleaved search evaluation. ACM Transactions on Information Systems (TOIS), 30 (1):6:1-6:41, 2012.  Miroslav Dud´ık, Daniel Hsu, Satyen Kale, Nikos Karampatziakis, John Langford, Lev Reyzin, and Tong Zhang. Efficient optimal learning for contextual bandits. In Uncertainty in Artificial Intelligence (UAI), pages 169-178, 2011.  Yoav Freund and Robert E. Schapire. Adaptive game playing using multiplicative weights. Games  and Economic Behavior, 29:79-103, 1999.  Martin Gardner. Mathematical games: The paradox of the nontransitive dice and the elusive princi-  ple of indifference. Scientific American, 223:110-114, 1970.  Fan Guo, Lei Li, and Christos Faloutsos. Tailoring click models to user goals. In Workshop on Web  Search Click Data (WSCD), pages 88-92, 2009a.  Fan Guo, Chao Liu, and Yi-Min Wang. Efficient multiple-click models in web search. In Proceed- ings of the International Conference on Web Search and Data Mining (WSDM), pages 124-131, 2009b.  Katja Hofmann, Shimon Whiteson, and Maarten de Rijke. A probabilistic method for inferring In Proceedings of the International Conference on Information and  preferences from clicks. Knowledge Management (CIKM), pages 249-258, 2011.  Katja Hofmann, Shimon Whiteson, and Maarten de Rijke. Fidelity, soundness, and efficiency of interleaved comparison methods. ACM Transactions on Information Systems (TOIS), 31(4), 2013. DUD´IK HOFMANN SCHAPIRE SLIVKINS ZOGHI  Adam Kalai and Santosh Vempala. Efficient algorithms for the online decision problem. In Confer-  ence on Learning Theory (COLT), pages 26-40, 2003.  John Langford and Tong Zhang. The epoch-greedy algorithm for contextual multi-armed bandits. In Annual Conference on Neural Information Processing Systems (NIPS), pages 817-824, 2007.  Sahand Negahban, Sewoong Oh, and Devavrat Shah. Iterative ranking from pair-wise comparisons.  In Annual Conference on Neural Information Processing Systems (NIPS), 2012.  Guillermo Owen. Game Theory. Emerald Group Publishing Limited, 3rd edition, 1995.  Filip Radlinski, Madhu Kurup, and Thorsten Joachims. How does clickthrough data reﬂect re- trieval quality? In Proceedings of the International Conference on Information and Knowledge Management (CIKM), pages 43-52, 2008.  Markus Schulze. A new monotonic, clone-independent, reversal symmetric, and Condorcet- consistent single-winner election method. Social Choice and Welfare, 36(2):267-303, 2011.  Tanguy Urvoy, Fabrice Clerot, Raphael F´eraud, and Sami Naamane. Generic exploration and k- In Proceedings of the International Conference on Machine Learning  armed voting bandits. (ICML), pages 91-99, 2013.  Yisong Yue and Thorsten Joachims.  Interactively optimizing information retrieval systems as a dueling bandits problem. In Proceedings of the International Conference on Machine Learning (ICML), pages 1201-1208, 2009.  Yisong Yue and Thorsten Joachims. Beat the mean bandit.  In Proceedings of the International  Conference on Machine Learning (ICML), pages 241-248, 2011.  Yisong Yue, J. Broder, R. Kleinberg, and T. Joachims. The k-armed dueling bandits problem. In  Conference on Learning Theory (COLT), 2009.  Martin Zinkevich. Online convex programming and generalized infinitesimal gradient ascent. In Proceedings of the International Conference on Machine Learning (ICML), pages 928-936, 2003.  Masrour Zoghi, Shimon Whiteson, Maarten de Rijke, and R´emi Munos. Relative confidence sam- pling for efficient on-line ranker evaluation. In Proceedings of the International Conference on Web Search and Data Mining (WSDM), pages 73-82, 2014a.  Masrour Zoghi, Shimon Whiteson, R´emi Munos, and Maarten de Rijke. Relative upper confidence bound for the k-armed dueling bandits problem. In Proceedings of the International Conference on Machine Learning (ICML), pages 10-18, 2014b.  Masrour Zoghi, Zohar Karnin, Shimon Whiteson, and Maarten de Rijke. Copeland dueling bandits.  2015a. arxiv:1506.00312.  Masrour Zoghi, Shimon Whiteson, and Maarten de Rijke. MergeRUCB: A method for large-scale In Proceedings of the International Conference on Web Search and  online ranker evaluation. Data Mining (WSDM), pages 17-26, 2015b. CONTEXTUAL DUELING BANDITS"}