{"1": "Jacob Abernethy and Jun-Kun Wang. Frank-wolfe and equilibrium computation. NIPS, 2017.  Jacob Abernethy, Chansoo Lee, Abhinav Sinha, and Ambuj Tewari. Online linear optimization via  smoothing. In COLT, pages 807-823, 2014.  Ilan Adler. The equivalence of linear programs and zero-sum games. International Journal of Game Theory, 42(1):165-177, Feb 2013. ISSN 1432-1270. doi: 10.1007/s00182-012-0328-8. URL https://doi.org/10.1007/s00182-012-0328-8.  Francis  Bach.  Convex  relaxations  of  structured matrix  factorizations.  https://arxiv.org/pdf/1309.3117.pdf, 2013.  Dimitri P. Bertsekas. Stochastic optimization problems with nondifferentiable cost functionals.  Journal of Optimization Theory and Applications, 1973.  David Blackwell. An analog of the minimax theorem for vector payoffs. Pacific Journal of Mathe-  matics, 6(1):1-8, 1956.  examples. Springer, 2006.  Jonathan Borwein and Adrian S Lewis. Convex analysis and nonlinear optimization theory and  Stephen Boyd. Convex optimization. Cambridge University Press, 2004.  Nicolo Cesa-Bianchi and G´abor Lugosi. Prediction, learning, and games. Cambridge university  press, 2006.  Chao-Kai Chiang, Tianbao Yang, Chia-Jung Lee, Mehrdad Mahdavi, Chi-Jen Lu, Rong Jin, , and  Shenghuo Zhu. Online optimization with gradual variations. 2012.  Vladimir F. Demyanov and Aleksandr M. Rubinov. Approximate methods in optimization prob-  lems. Elsevier Publishing Company,, 1970.  John Duchi, Peter L. Bartlett, and Martin Wainwright. Randomized smoothing for stochastic opti-  mization. SIAM Journal on Optimization (SIOPT), 2012.  Joseph C. Dunn. Rates of convergence for conditional gradient algorithms near singular and non-  singular extremals. SIAM Journal on Control and Optimization, 1979.  Marguerite Frank and Philip Wolfe. An algorithm for quadratic programming. Naval research  logistics quarterly, 3(1-2):95-110, 1956.  13   FASTER RATES FOR CONVEX-CONCAVE GAMES  J.A., K.A.L, and J.W. gratefully acknowledge financial support from the National Science Founda- tion, award IIS 1453304. K.Y.L. is supported by the ETH Zurich Postdoctoral Fellowship and Marie Curie Actions for People COFUND program. J.W. also thanks the support from ARC-TRIAD Fel- lowship.  Acknowledgments  References  Jacob Abernethy and Jun-Kun Wang. Frank-wolfe and equilibrium computation. NIPS, 2017.  Jacob Abernethy, Chansoo Lee, Abhinav Sinha, and Ambuj Tewari. Online linear optimization via  smoothing. In COLT, pages 807-823, 2014.  Ilan Adler. The equivalence of linear programs and zero-sum games. International Journal of Game Theory, 42(1):165-177, Feb 2013. ISSN 1432-1270. doi: 10.1007/s00182-012-0328-8. URL https://doi.org/10.1007/s00182-012-0328-8.  Francis  Bach.  Convex  relaxations  of  structured matrix  factorizations.  https://arxiv.org/pdf/1309.3117.pdf, 2013.  Dimitri P. Bertsekas. Stochastic optimization problems with nondifferentiable cost functionals.  Journal of Optimization Theory and Applications, 1973.  David Blackwell. An analog of the minimax theorem for vector payoffs. Pacific Journal of Mathe-  matics, 6(1):1-8, 1956.  examples. Springer, 2006.  Jonathan Borwein and Adrian S Lewis. Convex analysis and nonlinear optimization theory and  Stephen Boyd. Convex optimization. Cambridge University Press, 2004.  Nicolo Cesa-Bianchi and G´abor Lugosi. Prediction, learning, and games. Cambridge university  press, 2006.  Chao-Kai Chiang, Tianbao Yang, Chia-Jung Lee, Mehrdad Mahdavi, Chi-Jen Lu, Rong Jin, , and  Shenghuo Zhu. Online optimization with gradual variations. 2012.  Vladimir F. Demyanov and Aleksandr M. Rubinov. Approximate methods in optimization prob-  lems. Elsevier Publishing Company,, 1970.  John Duchi, Peter L. Bartlett, and Martin Wainwright. Randomized smoothing for stochastic opti-  mization. SIAM Journal on Optimization (SIOPT), 2012.  Joseph C. Dunn. Rates of convergence for conditional gradient algorithms near singular and non-  singular extremals. SIAM Journal on Control and Optimization, 1979.  Marguerite Frank and Philip Wolfe. An algorithm for quadratic programming. Naval research  logistics quarterly, 3(1-2):95-110, 1956. ABERNETHY LAI LEVY WANG  Yoav Freund and Robert E Schapire. Game theory, on-line prediction and boosting. In Proceedings of the ninth annual conference on Computational learning theory, pages 325-332. ACM, 1996.  Yoav Freund and Robert E Schapire. Adaptive game playing using multiplicative weights. Games  and Economic Behavior, 29(1-2):79-103, 1999.  Dan Garber and Elad Hazan. Faster rates for the frank-wolfe method over strongly-convex sets.  ICML, 2015.  Ian Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, Bing Xu, David Warde-Farley, Sherjil Ozair, Aaron Courville, and Yoshua Bengio. Generative adversarial nets. In Advances in neural infor- mation processing systems, pages 2672-2680, 2014.  James Hannan. Approximation to bayes risk in repeated play. Contributions to the Theory of Games,  3:97-139, 1957.  Elad Hazan. Introduction to online convex optimization. 2014.  Elad Hazan, Amit Agarwal, and Satyen Kale. Logarithmic regret algorithms for online convex  optimization. Machine Learning, 69(2-3):169-192, 2007.  Sham Kakade and Shai Shalev-Shwartz. Mind the duality gap: Logarithmic regret algorithms for  online optimization. 2009.  Sham M. Kakade, Shai Shalev-shwartz, and Ambuj Tewari. On the duality of strong convexity and  strong smoothness: Learning applications and matrix regularization. 2009.  Adam Kalai and Santosh Vempala. Efficient algorithms for online decision problems. Journal of  Computer and System Sciences, 2005a.  Adam Kalai and Santosh Vempala. Efficient algorithms for online decision problems. Journal of  Computer and System Sciences, 71(3):291-307, 2005b.  Evgeny S Levitin and Boris T Polyak. Constrained minimization methods. USSR Computational  mathematics and mathematical physics, 1966.  Kfir Levy. Online to ofﬂine conversions, universality and adaptive minibatch sizes. 2017.  Haipeng Luo. Introduction to online learning: Lecture 6. 2017.  J von Neumann, Oskar Morgenstern, et al. Theory of games and economic behavior, 1944.  E. S. Polovinkin. Strongly convex analysis. Sbornik: Mathematics 187(2):259, 1996.  Alexander Rakhlin and Karthik Sridharan. Online learning with predictable sequences. COLT,  Alexander Rakhlin and Karthik Sridharan. Optimization, learning, and games with predictable  sequences. NIPS, 2013b.  Alexander Rakhlin and Karthik Sridharan. Statistical learning theory and sequential prediction.  2013a.  2016. FASTER RATES FOR CONVEX-CONCAVE GAMES  Tyrrell Rockafellar. Convex analysis. Princeton University Press, 1996.  Shai Shalev-Shwartz et al. Online learning and online convex optimization. Foundations and  Trends R(cid:13) in Machine Learning, 4(2):107-194, 2012.  Maurice Sion. On general minimax theorems. Pacific J. Math, 8(1):171-176, 1958.  Vasilis Syrgkanis, Alekh Agarwal, Haipeng Luo, and Robert E. Schapire. Fast convergence of  regularized learning in games. NIPS, 2015.  J v. Neumann. Zur theorie der gesellschaftsspiele. Mathematische annalen, 100(1):295-320, 1928.  Linli Xu, James Neufeld, Bryce Larson, and Dale Schuurmans. Maximum margin clustering. 2005.  Yuchen Zhang and Lin Xiao. Stochastic primal-dual coordinate method for regularized empirical  risk minimization. 2015."}