{"1": "University Press, 1999.  M. Anthony and Peter Bartlett. Learning in Neural Networks: Theoretical Foundations. Cambridge  8   MAURER  so  2 (B (∆) /3 + J (∆)) ≤  68 max {1, c, c(cid:48)(cid:48)}3 λ3n  +  24c(cid:48)(cid:48)(cid:48) max {1, c(cid:48), c(cid:48)(cid:48)}3 λ4n  =  α2 ((cid:96), λ) n  ,  which proves (4).  Also, for any given x ∈ B we have  (cid:96) ((cid:104)x, g (x)(cid:105)) − (cid:96) ((cid:104)x, g (x1, ..., xk−1, x, xk+1, ..., xn)(cid:105)) = Dk  xk,x(cid:96) ((cid:104)x, g (x)(cid:105)) .  But the expectation of the second term on the left, as x ∼ µ and x ∼ µn, is equal to Ex∼µn [(cid:96) ((cid:104)xi, g (x)(cid:105))], so  E [∆]) =  E [(cid:96) ((cid:104)x, g (x)(cid:105)) − (cid:96) ((cid:104)xk, g (x)(cid:105))] =  Ex∼µ,x∼µn  1 n  (cid:88)  k  (cid:104)  Dk  (cid:105) xk,x(cid:96) ((cid:104)x, g (x)(cid:105))  ≤  sup x∈Bn  sup y,y(cid:48)∈B  Ex∼µ  (cid:104)  (cid:105) y,y(cid:48)(cid:96) ((cid:104)x, g (x)(cid:105))  Dk  ≤ max  k  sup x∈Bn  sup y,y(cid:48)∈B  (cid:12) (cid:12)L(cid:48) (x) (cid:12)  (cid:104)ˆk (cid:0)y − y(cid:48)(cid:1)(cid:105)(cid:12) (cid:12) (cid:12) ≤  k  = max  sup x∈Bn 2 max {1, c(cid:48), c(cid:48)(cid:48)}2 λ3/2n  sup y,y(cid:48)∈B  Dk  y,y(cid:48)L (x)  =  α1 ((cid:96), λ) n  ,  1 n  1 n  (cid:88)  k (cid:88)  k  which proves (3). This completes the proof of Theorem 2.  Proof [of Theorem 3] Substitution of the above bound on B (∆) into the first concentration in- equality of Theorem 4, solving for the deviation and using the bound (3) on E [∆] gives the first inequality. For any x ∈ Bn we have  Σ2 (∆) (x) =  E(y,y(cid:48))∼µ2  Dk  y,y(cid:48)∆ (x)  (cid:17)2(cid:21)  (cid:20)(cid:16)  (cid:20)  sup x∈Bn    (cid:32)  (cid:88)  k (cid:88)  k  (cid:88)  1 2  1 2  1 2  ≤  ≤  =  E(y,y(cid:48))∼µ2    k 1 ((cid:96), λ) σ2 9α2  x∼µ (x)  .  n  E(y,y(cid:48))∼µ2  (cid:12) (cid:12)  (cid:12)∆(cid:48) (x) ˆk (cid:0)y − y(cid:48)(cid:1)(cid:12)  2(cid:21) (cid:12) (cid:12)  6 max {1, c(cid:48), c(cid:48)(cid:48)}2 λ3/2n  (cid:33)2  (cid:13)y − y(cid:48)(cid:13) (cid:13) 2 (cid:13)      Substitution in the first inequality then gives the second inequality.  References  University Press, 1999.  M. Anthony and Peter Bartlett. Learning in Neural Networks: Theoretical Foundations. Cambridge SECOND-ORDER STABILITY  P. Bartlett and S. Mendelson. Rademacher and gaussian complexities: Risk bounds and structural  results. Journal of Machine Learning Research, 3:463-482, 2002.  S. Boucheron, G. Lugosi, and P. Massart. Concentration Inequalities. Oxford University Press,  O. Bousquet and A. Elisseeff. Stability and generalization. Journal of Machine Learning Research,  A. Caponnetto and E. De Vito. Optimal rates for the regularized least-squares algorithm. Founda-  tions of Computational Mathematics, 7(3):331-368, 2007.  F. Cucker and S. Smale. Best choices for regularization parameters in learning theory: on the  bias-variance problem. Foundations of Computational Mathematics, 2(4):413-428, 2002.  B. Efron and C. Stein. The jackknife estimate of variance. The Annals of Statistics, pages 586-596,  M. Hardt, B. Recht, and Y. Singer. Train faster, generalize better: Stability of stochastic gradient  descent. arXiv preprint arXiv:1509.01240, 2015.  C. Houdr´e. The iterated jackknife estimate of variance. Statistics and probability letters, 35(2):  A. Maurer. A Bernstein-type inequality for functions of bounded interaction. ArXiv e-prints, Jan-  C. McDiarmid. Concentration.  In Probabilistic Methods of Algorithmic Discrete Mathematics,  pages 195-248, Berlin, 1998. Springer.  T. Poggio and F. Girosi. Networks for approximation and learning. Proceedings of the IEEE, 78(9):  W. Rudin. Principles of mathematical analysis. McGraw-Hill New York, 1964.  J. M. Steele. An efron-stein inequality for nonsymmetric statistics. The Annals of Statistics, pages  2013.  2:499-526, 2002.  1981.  197-201, 1997.  uary 2017.  1481-1497, 1990.  753-758, 1986."}