{"1": "Emmanuel Abbe. Community detection and stochastic block models: recent developments. arXiv  preprint arXiv:1703.10146, 2017.  Emmanuel Abbe and Colin Sandon. Detection in the stochastic block model with multiple clusters: proof of the achievability conjectures, acyclic bp, and the information-computation gap. arXiv preprint arXiv:1512.09080, 2015.  Emmanuel Abbe, Afonso S Bandeira, and Georgina Hall. Exact recovery in the stochastic block  model. IEEE Transactions on Information Theory, 62(1):471-487, 2016.  Noga Alon, Michael Krivelevich, and Benny Sudakov. Finding a large hidden clique in a random  graph. Random Structures and Algorithms, 13(3-4):457-466, 1998.  Noga Alon, Alexandr Andoni, Tali Kaufman, Kevin Matulef, Ronitt Rubinfeld, and Ning Xie. Test- In Proceedings of the thirty-ninth annual ACM  ing k-wise and almost k-wise independence. symposium on Theory of computing, pages 496-505. ACM, 2007.  Noga Alon, Sanjeev Arora, Rajsekar Manokaran, Dana Moshkovitz, and Omri Weinstein. Inap- proximability of densest κ-subgraph from average case hardness. Unpublished manuscript, 1, 2011.  Brendan PW Ames and Stephen A Vavasis. Nuclear norm minimization for the planted clique and  biclique problems. Mathematical programming, 129(1):69-89, 2011.  Arash A Amini and Martin J Wainwright. High-dimensional analysis of semidefinite relaxations for  sparse principal components. The Annals of Statistics, 37(5B):2877-2921, 2009.  Benny Applebaum, Boaz Barak, and Avi Wigderson. Public-key cryptography from different as- sumptions. In Proceedings of the forty-second ACM symposium on Theory of computing, pages 171-180. ACM, 2010.  Ery Arias-Castro, Nicolas Verzelen, et al. Community detection in dense random networks. The  Annals of Statistics, 42(3):940-969, 2014.  Sanjeev Arora and Boaz Barak. Computational complexity: a modern approach. Cambridge Uni-  versity Press, 2009.  Sanjeev Arora, Boaz Barak, Markus Brunnermeier, and Rong Ge. Computational complexity and information asymmetry in financial products. Communications of the ACM, 54(5):101-107, 2011.  Bonacina Ilario De Rezende Susanna Lauria Massimo Nordstr˝om Jakob Atserias, Albert and  Alexander Razborov. Clique is hard on average for regular resolution. 2018.  Per Austrin, Mark Braverman, and Eden Chlamt´ac. Inapproximability of np-complete variants of  nash equilibrium. Theory of Computing, 9(3):117-142, 2013.  Pranjal Awasthi, Moses Charikar, Kevin A Lai, and Andrej Risteski. Label optimal regret bounds  for online local learning. pages 150-166, 2015.  13   REDUCIBILITY AND COMPUTATIONAL LOWER BOUNDS  References  Emmanuel Abbe. Community detection and stochastic block models: recent developments. arXiv  preprint arXiv:1703.10146, 2017.  Emmanuel Abbe and Colin Sandon. Detection in the stochastic block model with multiple clusters: proof of the achievability conjectures, acyclic bp, and the information-computation gap. arXiv preprint arXiv:1512.09080, 2015.  Emmanuel Abbe, Afonso S Bandeira, and Georgina Hall. Exact recovery in the stochastic block  model. IEEE Transactions on Information Theory, 62(1):471-487, 2016.  Noga Alon, Michael Krivelevich, and Benny Sudakov. Finding a large hidden clique in a random  graph. Random Structures and Algorithms, 13(3-4):457-466, 1998.  Noga Alon, Alexandr Andoni, Tali Kaufman, Kevin Matulef, Ronitt Rubinfeld, and Ning Xie. Test- In Proceedings of the thirty-ninth annual ACM  ing k-wise and almost k-wise independence. symposium on Theory of computing, pages 496-505. ACM, 2007.  Noga Alon, Sanjeev Arora, Rajsekar Manokaran, Dana Moshkovitz, and Omri Weinstein. Inap- proximability of densest κ-subgraph from average case hardness. Unpublished manuscript, 1, 2011.  Brendan PW Ames and Stephen A Vavasis. Nuclear norm minimization for the planted clique and  biclique problems. Mathematical programming, 129(1):69-89, 2011.  Arash A Amini and Martin J Wainwright. High-dimensional analysis of semidefinite relaxations for  sparse principal components. The Annals of Statistics, 37(5B):2877-2921, 2009.  Benny Applebaum, Boaz Barak, and Avi Wigderson. Public-key cryptography from different as- sumptions. In Proceedings of the forty-second ACM symposium on Theory of computing, pages 171-180. ACM, 2010.  Ery Arias-Castro, Nicolas Verzelen, et al. Community detection in dense random networks. The  Annals of Statistics, 42(3):940-969, 2014.  Sanjeev Arora and Boaz Barak. Computational complexity: a modern approach. Cambridge Uni-  versity Press, 2009.  Sanjeev Arora, Boaz Barak, Markus Brunnermeier, and Rong Ge. Computational complexity and information asymmetry in financial products. Communications of the ACM, 54(5):101-107, 2011.  Bonacina Ilario De Rezende Susanna Lauria Massimo Nordstr˝om Jakob Atserias, Albert and  Alexander Razborov. Clique is hard on average for regular resolution. 2018.  Per Austrin, Mark Braverman, and Eden Chlamt´ac. Inapproximability of np-complete variants of  nash equilibrium. Theory of Computing, 9(3):117-142, 2013.  Pranjal Awasthi, Moses Charikar, Kevin A Lai, and Andrej Risteski. Label optimal regret bounds  for online local learning. pages 150-166, 2015. REDUCIBILITY AND COMPUTATIONAL LOWER BOUNDS  Sivaraman Balakrishnan, Mladen Kolar, Alessandro Rinaldo, Aarti Singh, and Larry Wasserman. Statistical and computational tradeoffs in biclustering. In NIPS 2011 workshop on computational trade-offs in statistical learning, volume 4, 2011.  Sivaraman Balakrishnan, Simon S Du, Jerry Li, and Aarti Singh. Computationally efficient robust  sparse estimation in high dimensions. pages 169-212, 2017.  Maria-Florina Balcan, Christian Borgs, Mark Braverman, Jennifer Chayes, and Shang-Hua Teng. Finding endogenously formed communities. In Proceedings of the twenty-fourth annual ACM- SIAM symposium on Discrete algorithms, pages 767-783. Society for Industrial and Applied Mathematics, 2013.  Nicolai Baldin and Quentin Berthet. Optimal link prediction with matrix logistic regression. arXiv  preprint arXiv:1803.07054, 2018.  Afonso S Bandeira, Amelia Perry, and Alexander S Wein. Notes on computational-to-statistical  gaps: predictions using statistical physics. arXiv preprint arXiv:1803.11132, 2018.  Jess Banks, Cristopher Moore, Roman Vershynin, Nicolas Verzelen, and Jiaming Xu. Information- theoretic bounds and phase transitions in clustering, sparse pca, and submatrix localization. IEEE Transactions on Information Theory, 2018.  Boaz Barak. The Complexity of Public-Key Cryptography, pages 45-77. Springer International Publishing, Cham, 2017. ISBN 978-3-319-57048-8. doi: 10.1007/978-3-319-57048-8 2. URL https://doi.org/10.1007/978-3-319-57048-8_2.  Boaz Barak, Samuel B Hopkins, Jonathan Kelner, Pravesh Kothari, Ankur Moitra, and Aaron Potechin. A nearly tight sum-of-squares lower bound for the planted clique problem. In Foun- dations of Computer Science (FOCS), 2016 IEEE 57th Annual Symposium on, pages 428-437. IEEE, 2016.  Florent Benaych-Georges and Raj Rao Nadakuditi. The eigenvalues and eigenvectors of finite, low rank perturbations of large random matrices. Advances in Mathematics, 227(1):494-521, 2011.  Quentin Berthet and Philippe Rigollet. Complexity theoretic lower bounds for sparse principal  component detection. In COLT, pages 1046-1066, 2013a.  Quentin Berthet and Philippe Rigollet. Optimal detection of sparse principal components in high  dimension. The Annals of Statistics, 41(4):1780-1815, 2013b.  Umang Bhaskar, Yu Cheng, Young Kun Ko, and Chaitanya Swamy. Hardness results for signaling in bayesian zero-sum and network routing games. In Proceedings of the 2016 ACM Conference on Economics and Computation, pages 479-496. ACM, 2016.  Aditya Bhaskara, Moses Charikar, Eden Chlamtac, Uriel Feige, and Aravindan Vijayaraghavan. Detecting high log-densities: an o(n1/4) approximation for densest k-subgraph. Proceedings of the forty-second ACM symposium on Theory of computing, pages 201-210, 2010.  Vijay Bhattiprolu, Venkatesan Guruswami, and Euiwoong Lee. Sum-of-squares certificates for max- ima of random tensors on the sphere. In LIPIcs-Leibniz International Proceedings in Informatics, volume 81. Schloss Dagstuhl-Leibniz-Zentrum fuer Informatik, 2017. REDUCIBILITY AND COMPUTATIONAL LOWER BOUNDS  Aharon Birnbaum, Iain M Johnstone, Boaz Nadler, and Debashis Paul. Minimax bounds for sparse  pca with noisy high-dimensional data. Annals of statistics, 41(3):1055, 2013.  Andrej Bogdanov and Luca Trevisan. On worst-case to average-case reductions for np problems.  SIAM Journal on Computing, 36(4):1119-1159, 2006.  Andrej Bogdanov, Luca Trevisan, et al. Average-case complexity. Foundations and Trends R(cid:13) in  Theoretical Computer Science, 2(1):1-106, 2006.  Cristina Butucea and Yuri I Ingster. Detection of a sparse submatrix of a high-dimensional noisy  matrix. Bernoulli, 19(5B):2652-2688, 2013.  T. Tony Cai and Yihong Wu. Statistical and computational limits for sparse matrix detection. arXiv  preprint arXiv:1801.00518, 2018.  T Tony Cai, Zongming Ma, Yihong Wu, et al. Sparse pca: Optimal rates and adaptive estimation.  The Annals of Statistics, 41(6):3074-3110, 2013.  Tony Cai, Tengyuan Liang, and Alexander Rakhlin. Computational and statistical boundaries for  submatrix localization in a large noisy matrix. arXiv preprint arXiv:1502.01988, 2015a.  Tony Cai, Zongming Ma, and Yihong Wu. Optimal estimation and rank detection for sparse spiked  covariance matrices. Probability theory and related fields, 161(3-4):781-815, 2015b.  Utkan Onur Candogan and Venkat Chandrasekaran. Finding planted subgraphs with few eigenval-  ues using the schur-horn relaxation. SIAM Journal on Optimization, 28(1):735-759, 2018.  Mireille Capitaine, Catherine Donati-Martin, Delphine F´eral, et al. The largest eigenvalues of finite rank deformation of large wigner matrices: convergence and nonuniversality of the ﬂuctuations. The Annals of Probability, 37(1):1-47, 2009.  Siu On Chan, Dimitris Papailliopoulos, and Aviad Rubinstein. On the approximability of sparse  pca. In Conference on Learning Theory, pages 623-646, 2016.  Venkat Chandrasekaran and Michael I Jordan. Computational and statistical tradeoffs via convex relaxation. Proceedings of the National Academy of Sciences, 110(13):E1181-E1190, 2013.  Moses Charikar, Yonatan Naamad, and Jimmy Wu. On finding dense common subgraphs. arXiv  preprint arXiv:1802.06361, 2018.  61(5):2909-2923, 2015.  Yudong Chen. Incoherence-optimal matrix completion. IEEE Transactions on Information Theory,  Yudong Chen and Jiaming Xu. Statistical-computational tradeoffs in planted problems and subma- trix localization with a growing number of clusters and submatrices. Journal of Machine Learning Research, 17(27):1-57, 2016.  Eden Chlamtac, Michael Dinitz, and Robert Krauthgamer. Everywhere-sparse spanners via dense subgraphs. In Foundations of Computer Science (FOCS), 2012 IEEE 53rd Annual Symposium on, pages 758-767. IEEE, 2012. REDUCIBILITY AND COMPUTATIONAL LOWER BOUNDS  Eden Chlamt´aˇc, Michael Dinitz, and Yury Makarychev. Minimizing the union: Tight approxi- mations for small set bipartite vertex expansion. In Proceedings of the Twenty-Eighth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 881-899. SIAM, 2017.  E. Chlamt´aˇc and P. Manurangsi. Sherali-adams integrality gaps matching the log-density threshold.  arXiv preprint arXiv:1804.07842, 2018.  Amin Coja-Oghlan. Finding large independent sets in polynomial expected time. In Annual Sym-  posium on Theoretical Aspects of Computer Science, pages 511-522. Springer, 2003.  Amin Coja-Oghlan and Charilaos Efthymiou. On independent sets in random graphs. Random  Structures & Algorithms, 47(3):436-486, 2015.  Amit Daniely and Shai Shalev-Shwartz. Complexity theoretic limitations on learning dnfs. pages  815-830, 2016.  Amit Daniely, Nati Linial, and Shai Shalev-Shwartz. From average case complexity to improper  learning complexity. pages 441-448, 2014.  Yael Dekel, Ori Gurel-Gurevich, and Yuval Peres. Finding hidden cliques in linear time with high  probability. Combinatorics, Probability and Computing, 23(1):29-49, 2014.  Yash Deshpande and Andrea Montanari. Sparse pca via covariance thresholding. In Advances in  Neural Information Processing Systems, pages 334-342, 2014.  Yash Deshpande and Andrea Montanari. Finding hidden cliques of size(cid:112)N/e in nearly linear time.  Foundations of Computational Mathematics, 15(4):1069-1128, 2015a.  Yash Deshpande and Andrea Montanari. Improved sum-of-squares lower bounds for hidden clique  and hidden submatrix problems. In COLT, pages 523-562, 2015b.  Persi Diaconis and David Freedman. A dozen de finetti-style results in search of a theory. 23(S2):  397-423, 1987.  Ilias Diakonikolas, Daniel M Kane, and Alistair Stewart.  Statistical query lower bounds for robust estimation of high-dimensional gaussians and gaussian mixtures. arXiv preprint arXiv:1611.03473, 2016.  Shaddin Dughmi. On the hardness of signaling. In Foundations of Computer Science (FOCS), 2014  IEEE 55th Annual Symposium on, pages 354-363. IEEE, 2014.  Kord Eickmeyer, Kristoffer Arnsfelt Hansen, and Elad Verbin. Approximating the minmax value of 3-player games within a constant is as hard as detecting planted cliques. In Electronic Colloquium on Computational Complexity (ECCC), volume 19, page 25, 2012.  Uriel Feige. Relations between average case complexity and approximation complexity. In Pro- ceedings of the thiry-fourth annual ACM symposium on Theory of computing, pages 534-543. ACM, 2002.  Uriel Feige and Robert Krauthgamer. Finding and certifying a large hidden clique in a semirandom  graph. Random Structures and Algorithms, 16(2):195-208, 2000. REDUCIBILITY AND COMPUTATIONAL LOWER BOUNDS  Uriel Feige and Robert Krauthgamer. The probable value of the lov´asz-schrijver relaxations for  maximum independent set. SIAM Journal on Computing, 32(2):345-370, 2003.  Uriel Feige and Eran Ofek. Finding a maximum independent set in a sparse random graph.  In Approximation, Randomization and Combinatorial Optimization. Algorithms and Techniques, pages 282-293. Springer, 2005.  Uriel Feige and Dorit Ron. Finding hidden cliques in linear time. In 21st International Meeting on Probabilistic, Combinatorial, and Asymptotic Methods in the Analysis of Algorithms (AofA’10), pages 189-204. Discrete Mathematics and Theoretical Computer Science, 2010.  Vitaly Feldman, Elena Grigorescu, Lev Reyzin, Santosh Vempala, and Ying Xiao. Statistical algo-  rithms and a lower bound for planted clique. arXiv preprint arXiv:1201.1214, 2012.  Vitaly Feldman, Elena Grigorescu, Lev Reyzin, Santosh Vempala, and Ying Xiao. Statistical algo- rithms and a lower bound for detecting planted cliques. In Proceedings of the forty-fifth annual ACM symposium on Theory of computing, pages 655-664. ACM, 2013.  Vitaly Feldman, Will Perkins, and Santosh Vempala. On the complexity of random satisfiability  problems with planted solutions. pages 77-86, 2015.  Delphine F´eral and Sandrine P´ech´e. The largest eigenvalue of rank one deformation of large wigner  matrices. Communications in mathematical physics, 272(1):185-228, 2007.  David Gamarnik and Madhu Sudan. Limits of local algorithms over sparse random graphs.  In Proceedings of the 5th conference on Innovations in theoretical computer science, pages 369- 376. ACM, 2014.  Chao Gao, Zongming Ma, and Harrison H Zhou. Sparse cca: Adaptive estimation and computa-  tional barriers. The Annals of Statistics, 45(5):2074-2101, 2017.  Bruce Hajek, Yihong Wu, and Jiaming Xu. Achieving exact cluster recovery threshold via semidef-  inite programming. IEEE Transactions on Information Theory, 62(5):2788-2797, 2016a.  Bruce Hajek, Yihong Wu, and Jiaming Xu. Information limits for recovering a hidden community.  pages 1894-1898, 2016b.  Bruce E Hajek, Yihong Wu, and Jiaming Xu. Computational lower bounds for community detection  on random graphs. In COLT, pages 899-928, 2015.  Moritz Hardt, Raghu Meka, Prasad Raghavendra, and Benjamin Weitz. Computational limits for  matrix completion. In COLT, pages 703-725, 2014.  Elad Hazan and Robert Krauthgamer. How hard is it to approximate the best nash equilibrium?  SIAM Journal on Computing, 40(1):79-91, 2011.  Shuichi Hirahara and Rahul Santhanam. On the average-case complexity of mcsp and its variants. In LIPIcs-Leibniz International Proceedings in Informatics, volume 79. Schloss Dagstuhl-Leibniz- Zentrum fuer Informatik, 2017. REDUCIBILITY AND COMPUTATIONAL LOWER BOUNDS  Samuel B Hopkins and David Steurer. Efficient bayesian estimation from few samples: community detection and related problems. In Foundations of Computer Science (FOCS), 2017 IEEE 58th Annual Symposium on, pages 379-390. IEEE, 2017.  Samuel B Hopkins, Pravesh Kothari, Aaron Henry Potechin, Prasad Raghavendra, and Tselil Schramm. On the integrality gap of degree-4 sum of squares for planted clique. pages 1079- 1095, 2016.  Samuel B Hopkins, Pravesh K Kothari, Aaron Potechin, Prasad Raghavendra, Tselil Schramm, and David Steurer. The power of sum-of-squares for detecting hidden structures. Proceedings of the fifty-eighth IEEE Foundations of Computer Science, pages 720-731, 2017.  Mark Jerrum. Large cliques elude the metropolis process. Random Structures & Algorithms, 3(4):  Iain M Johnstone and Arthur Yu Lu.  Sparse principal components analysis. Unpublished  347-359, 1992.  manuscript, 2004.  Ari Juels and Marcus Peinado. Hiding cliques for cryptographic security. Designs, Codes and  Cryptography, 20(3):269-280, 2000.  Pascal Koiran and Anastasios Zouzias. Hidden cliques and the certification of the restricted isometry  property. IEEE Transactions on Information Theory, 60(8):4999-5006, 2014.  Mladen Kolar, Sivaraman Balakrishnan, Alessandro Rinaldo, and Aarti Singh. Minimax localization of structural information in large noisy matrices. In Advances in Neural Information Processing Systems, pages 909-917, 2011.  Pravesh K Kothari, Ryuhei Mori, Ryan O’Donnell, and David Witmer. Sum of squares lower bounds  for refuting any csp. arXiv preprint arXiv:1701.04521, 2017.  Robert Krauthgamer, Boaz Nadler, and Dan Vilenchik. Do semidefinite relaxations solve sparse pca  up to the information limit? The Annals of Statistics, 43(3):1300-1322, 2015.  Leonid A Levin. Average case complete problems. SIAM Journal on Computing, 15(1):285-286,  Jerry Li. Robust sparse estimation tasks in high dimensions. arXiv preprint arXiv:1702.05860,  1986.  2017.  Tengyu Ma and Avi Wigderson. Sum-of-squares lower bounds for sparse pca.  In Advances in  Neural Information Processing Systems, pages 1612-1620, 2015.  Zongming Ma. Sparse principal component analysis and iterative thresholding. The Annals of  Statistics, 41(2):772-801, 2013.  Zongming Ma and Yihong Wu. Computational barriers in minimax submatrix detection. The Annals  of Statistics, 43(3):1089-1116, 2015.  Pascal Massart. Concentration inequalities and model selection, volume 6. Springer, 2007. REDUCIBILITY AND COMPUTATIONAL LOWER BOUNDS  Laurent Massouli´e. Community detection thresholds and the weak ramanujan property. In Proceed- ings of the forty-sixth annual ACM symposium on Theory of computing, pages 694-703. ACM, 2014.  Frank McSherry. Spectral partitioning of random graphs.  In Foundations of Computer Science,  2001. Proceedings. 42nd IEEE Symposium on, pages 529-537. IEEE, 2001.  Lorenz Minder and Dan Vilenchik. Small clique detection and approximate nash equilibria. pages  Andrea Montanari. Finding one community in a sparse graph. Journal of Statistical Physics, 161  673-685, 2009.  (2):273-299, 2015.  Andrea Montanari, Daniel Reichman, and Ofer Zeitouni. On the limitation of spectral methods: From the gaussian hidden clique problem to rank-one perturbations of gaussian tensors. In Ad- vances in Neural Information Processing Systems, pages 217-225, 2015.  Elchanan Mossel, Joe Neeman, and Allan Sly. Stochastic block models and reconstruction. arXiv  preprint arXiv:1202.1499, 2012.  Combinatorica, pages 1-44, 2013.  Elchanan Mossel, Joe Neeman, and Allan Sly. A proof of the block model threshold conjecture.  Elchanan Mossel, Joe Neeman, and Allan Sly. Consistency thresholds for binary symmetric block  models. arXiv preprint arXiv:1407.1591, 2014.  Debashis Paul. Asymptotics of sample eigenstructure for a large dimensional spiked covariance  model. Statistica Sinica, pages 1617-1642, 2007.  Sandrine P´ech´e. The largest eigenvalue of small rank perturbations of hermitian random matrices.  Probability Theory and Related Fields, 134(1):127-173, 2006.  Amelia Perry, Alexander S Wein, and Afonso S Bandeira. Statistical limits of spiked tensor models.  arXiv preprint arXiv:1612.07728, 2016a.  Amelia Perry, Alexander S Wein, Afonso S Bandeira, and Ankur Moitra. Optimality and arXiv preprint  sub-optimality of pca for spiked random matrices and synchronization. arXiv:1609.05573, 2016b.  Jim Pitman. Some probabilistic aspects of set partitions. The American mathematical monthly, 104  (3):201-209, 1997.  Prasad Raghavendra and Tselil Schramm. Tight lower bounds for planted clique in the degree-4 sos  program. arXiv preprint arXiv:1507.05136, 2015.  Mustazee Rahman, Balint Virag, et al. Local algorithms for independent sets are half-optimal. The  Annals of Probability, 45(3):1543-1577, 2017.  Andrey A Shabalin, Victor J Weigman, Charles M Perou, Andrew B Nobel, et al. Finding large average submatrices in high dimensional data. The Annals of Applied Statistics, 3(3):985-1012, 2009. REDUCIBILITY AND COMPUTATIONAL LOWER BOUNDS  Nihar B Shah, Sivaraman Balakrishnan, and Martin J Wainwright. Feeling the bern: Adaptive In Information Theory (ISIT),  estimators for bernoulli probabilities of pairwise comparisons. 2016 IEEE International Symposium on, pages 1153-1157. IEEE, 2016.  Dan Shen, Haipeng Shen, and James Stephen Marron. Consistency of sparse pca in high dimension,  low sample size contexts. Journal of Multivariate Analysis, 115:317-333, 2013.  Roman Vershynin. Introduction to the non-asymptotic analysis of random matrices. arXiv preprint  arXiv:1011.3027, 2010.  Nicolas Verzelen, Ery Arias-Castro, et al. Community detection in sparse random networks. The  Annals of Applied Probability, 25(6):3465-3510, 2015.  Van H Vu. Spectral norm of random matrices. In Proceedings of the thirty-seventh annual ACM  symposium on Theory of computing, pages 423-430. ACM, 2005.  Vincent Q Vu and Jing Lei. Minimax rates of estimation for sparse pca in high dimensions. In  AISTATS, volume 15, pages 1278-1286, 2012.  Tengyao Wang, Quentin Berthet, and Yaniv Plan. Average-case hardness of rip certification. In  Advances in Neural Information Processing Systems, pages 3819-3827, 2016a.  Tengyao Wang, Quentin Berthet, and Richard J Samworth. Statistical and computational trade-offs in estimation of sparse principal components. The Annals of Statistics, 44(5):1896-1930, 2016b.  Bin Yu. Assouad, fano, and le cam. In Festschrift for Lucien Le Cam, pages 423-435. Springer,  1997.  arXiv:1703.02724, 2017.  Anru Zhang and Dong Xia. Tensor svd: Statistical and computational limits. arXiv preprint  Yuchen Zhang, Martin J Wainwright, and Michael I Jordan. Lower bounds on the performance of  polynomial-time algorithms for sparse linear regression. In COLT, pages 921-948, 2014. REDUCIBILITY AND COMPUTATIONAL LOWER BOUNDS  ContentsIntroduction  2 Problem Formulations  3 Summary of Results  4 Techniques  A Preliminaries  2.1 Detection and Recovery Problems . 2.2 Problems  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  .  .  .  .  .  .  .  A.1 Figure for the Main Theorem . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . A.2 Hardness Results from an Algorithmic Perspective . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . A.3 Prior Work . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . A.4 Notation .  . .  . .  . .  . .  . .  B Average-Case Reductions under Total Variation  C Densifying Planted Clique and Planted Independent Set  C.1 Detecting Planted Generalized Diagonals C.2 Planted Clique Lifting .  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  .  D Rejection Kernels and Distributional Lifting  D.1 Rejection Kernels . . D.2 Distributional Lifting .  .  . .  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  E Planted Dense Subgraph and Biclustering  E.1 Poisson Lifting and Lower Bounds for Low-Density PDS . . . . . . . . . . . . . . E.2 Gaussian Lifting and Lower Bounds for High-Density PDS and BC . . . . . . . . E.3 Lower Bounds for General PDS . . . . . . . . . . . . . . . . . . . . . . . . . . .  F Reﬂection Cloning and Subgraph Stochastic Block Model  F.1 Reﬂecting Cloning and Rank-1 Submatrix . . . . . . . . . . . . . . . . . . . . . . F.2 Sparse Spiked Wigner Matrix . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . F.3 Subgraph Stochastic Block Model  G Random Rotations and Sparse PCA  H Algorithms and Information-Theoretic Thresholds  87 H.1 Biclustering, Planted Dense Subgraph and Independent Set . . . . . . . . . . . . . 87 94 H.2 Rank-1 Submatrix, Sparse Spiked Wigner and Subgraph SBM . . . . . . . . . . . H.3 Sparse PCA and Biased Sparse PCA . . . . . . . . . . . . . . . . . . . . . . . . . 106  I Detection-Recovery Reductions  J Future Directions2  5 5 611  22 22 23 24 2831 31 32  36 36 44  50 50 53 62  65 65 71 75115 REDUCIBILITY AND COMPUTATIONAL LOWER BOUNDS"}