{"1": "D. Achlioptas and F. McSherry. On spectral learning of mixture of distributions. In The 18th Annual  Conference on Learning Theory, 2005.  L. Albera, A. Ferreol, P. Comon, and P. Chevalier. Blind Identification of Overcomplete MixturEs of  sources (BIOME). Lin. Algebra Appl., 391:1-30, 2004.  Noga Alon and Joel H Spencer. The probabilistic method. Wiley, 2004.  S. Arora and R. Kannan. Learning Mixtures of Arbitrary Gaussians. In 33rd ACM Symposium on  Theory of Computing, 2001.  Sanjeev Arora, Rong Ge, Ankur Moitra, and Sushant Sachdeva. Provable ICA with unknown In NIPS, pages  Gaussian noise, with implications for Gaussian mixtures and autoencoders. 2384-2392, 2012.  Mikhail Belkin and Kaushik Sinha. Polynomial learning of distribution families. In FOCS, pages  103-112. IEEE Computer Society, 2010. ISBN 978-0-7695-4244-7.  Mikhail Belkin, Luis Rademacher, and James Voss. Blind signal separation in the presence of  Gaussian noise. In JMLR W&CP, volume 30: COLT, pages 270-287, 2013.  Aditya Bhaskara, Moses Charikar, Ankur Moitra, and Aravindan Vijayaraghavan. Smoothed analysis  of tensor decompositions. CoRR, abs/1311.3651v4, 2014.  Anthony Carbery and James Wright. Distributional and Lq norm inequalities for polynomials over  convex bodies in Rn. Mathematical Research Letters, 8:233-248, 2001.  J-F Cardoso. Super-symmetric decomposition of the fourth-order cumulant tensor. Blind identification of more sources than sensors. In Acoustics, Speech, and Signal Processing, 1991. ICASSP-91., 1991 International Conference on, pages 3109-3112. IEEE, 1991.  J.-F. Cardoso and A. Souloumiac. Blind beamforming for non-gaussian signals. In Radar and Signal  Processing, IEE Proceedings F, volume 140, pages 362-370, 1993.  Pierre Comon and Christian Jutten, editors. Handbook of Blind Source Separation. Academic Press,  2010.  Science, 1999.  A. Dasgupta. Probability for Statistics and Machine Learning. Springer, 2011.  S. Dasgupta. Learning Mixture of Gaussians. In 40th Annual Symposium on Foundations of Computer  S. Dasgupta and L. Schulman. A Two Round Variant of EM for Gaussian Mixtures.  In 16th  Conference on Uncertainty in Artificial Intelligence, 2000.  J. Feldman, R. A. Servedio, and R. O’Donnell. PAC Learning Axis Aligned Mixtures of Gaussians with No Separation Assumption. In The 19th Annual Conference on Learning Theory, 2006.  Navin Goyal, Santosh Vempala, and Ying Xiao. Fourier PCA. CoRR, http://arxiv.org/abs/1306.5825,  2013.  14   ANDERSON BELKIN GOYAL RADEMACHER VOSS  References  D. Achlioptas and F. McSherry. On spectral learning of mixture of distributions. In The 18th Annual  Conference on Learning Theory, 2005.  L. Albera, A. Ferreol, P. Comon, and P. Chevalier. Blind Identification of Overcomplete MixturEs of  sources (BIOME). Lin. Algebra Appl., 391:1-30, 2004.  Noga Alon and Joel H Spencer. The probabilistic method. Wiley, 2004.  S. Arora and R. Kannan. Learning Mixtures of Arbitrary Gaussians. In 33rd ACM Symposium on  Theory of Computing, 2001.  Sanjeev Arora, Rong Ge, Ankur Moitra, and Sushant Sachdeva. Provable ICA with unknown In NIPS, pages  Gaussian noise, with implications for Gaussian mixtures and autoencoders. 2384-2392, 2012.  Mikhail Belkin and Kaushik Sinha. Polynomial learning of distribution families. In FOCS, pages  103-112. IEEE Computer Society, 2010. ISBN 978-0-7695-4244-7.  Mikhail Belkin, Luis Rademacher, and James Voss. Blind signal separation in the presence of  Gaussian noise. In JMLR W&CP, volume 30: COLT, pages 270-287, 2013.  Aditya Bhaskara, Moses Charikar, Ankur Moitra, and Aravindan Vijayaraghavan. Smoothed analysis  of tensor decompositions. CoRR, abs/1311.3651v4, 2014.  Anthony Carbery and James Wright. Distributional and Lq norm inequalities for polynomials over  convex bodies in Rn. Mathematical Research Letters, 8:233-248, 2001.  J-F Cardoso. Super-symmetric decomposition of the fourth-order cumulant tensor. Blind identification of more sources than sensors. In Acoustics, Speech, and Signal Processing, 1991. ICASSP-91., 1991 International Conference on, pages 3109-3112. IEEE, 1991.  J.-F. Cardoso and A. Souloumiac. Blind beamforming for non-gaussian signals. In Radar and Signal  Processing, IEE Proceedings F, volume 140, pages 362-370, 1993.  Pierre Comon and Christian Jutten, editors. Handbook of Blind Source Separation. Academic Press,  2010.  Science, 1999.  A. Dasgupta. Probability for Statistics and Machine Learning. Springer, 2011.  S. Dasgupta. Learning Mixture of Gaussians. In 40th Annual Symposium on Foundations of Computer  S. Dasgupta and L. Schulman. A Two Round Variant of EM for Gaussian Mixtures.  In 16th  Conference on Uncertainty in Artificial Intelligence, 2000.  J. Feldman, R. A. Servedio, and R. O’Donnell. PAC Learning Axis Aligned Mixtures of Gaussians with No Separation Assumption. In The 19th Annual Conference on Learning Theory, 2006.  Navin Goyal, Santosh Vempala, and Ying Xiao. Fourier PCA. CoRR, http://arxiv.org/abs/1306.5825,  2013. THE BLESSING OF DIMENSIONALITY FOR LEARNING LARGE GAUSSIAN MIXTURES  Daniel Hsu and Sham M. Kakade. Learning mixtures of spherical Gaussians: moment methods and  spectral decompositions. In ITCS, pages 11-20, 2013.  Maurice Kendall, Alan Stuart, and J. Keith Ord. Kendall’s advanced theory of statistics. Vol. 1.  Halsted Press, sixth edition, 1994. Distribution theory.  A. Moitra and G. Valiant. Settling the polynomial learnability of mixtures of Gaussians. In 51st  Annual IEEE Symposium on Foundations of Computer Science (FOCS 2010), 2010.  Elchanan Mossel, Ryan O’Donnell, and Krzysztof Oleszkiewicz. Noise stability of functions with  low inﬂuences: Invariance and optimality. Annals of Math., 171:295-341, 2010.  Ole A Nielsen. An Introduction to Integration Theory and Measure Theory. Wiley, 1997.  B.C. Rennie and A.J. Dobson. On Stirling numbers of the second kind.  Journal of Com- binatorial Theory, 7(2):116 - 121, 1969. doi: http://dx.doi.org/10. 1016/S0021-9800(69)80045-1. URL http://www.sciencedirect.com/science/ article/pii/S0021980069800451.  ISSN 0021-9800.  Christian Rieger and Barbara Zwicknagl. Sampling inequalities for infinitely smooth functions, with applications to interpolation and machine learning. Advances in Computational Mathematics, 32 (1):103-129, 2010.  John Riordan. Moment recurrence relations for binomial, poisson and hypergeometric frequency  distributions. Annals of Mathematical Statistics, 8:103-111, 1937.  Halsey Lawrence Royden, Patrick Fitzpatrick, and Prentice Hall. Real analysis, volume 4. Prentice  Hall New York, 1988.  Mark Rudelson and Roman Vershynin. Smallest singular value of a random rectangular matrix.  Comm. Pure Appl. Math., 62(12):1707-1739, 2009.  Paul Valiant and Gregory Valiant. Estimating the unseen: Improved estimators for entropy and other  properties. In NIPS, pages 2157-2165, 2013.  S. Vempala and G. Wang. A Spectral Algorithm for Learning Mixtures of Distributions. In 43rd  Annual Symposium on Foundations of Computer Science, 2002.  Holger Wendland. Scattered data approximation, volume 17. Cambridge University Press Cambridge,  A. Winkelbauer. Moments and Absolute Moments of the Normal Distribution. ArXiv e-prints,  2005.  September 2012."}