{"1": "M. Alekhnovich, M. Braverman, V. Feldman, A. Klivans, and T. Pitassi. Learnability and autom- atizability. In Proceedings of the 45th IEEE Symposium on Foundations of Computer Science, pages 621–630, 2004.  Michael Alekhnovich, Mark Braverman, Vitaly Feldman, Adam Klivans, and Toniann Pitassi. The complexity of properly learning simple concept classes. Journal of Computer & System Sciences, 74(1):16–34, 2009.  Dana Angluin. Queries and concept learning. Machine Learning, 2:319–342, 1988.  Dana Angluin. Negative results for equivalence queries. Machine Learning, 5:121–150, 1990.  Dana Angluin. Computational Learning Theory: Survey and Selected Bibliography. In Proceedings  of the 24rd ACM Symposium on Theory of Computation, pages 351–369, 1992.  31.12   HELLERSTEIN KLETENIK SELLIE SERVEDIO  algorithm we consider two mutually exclusive possibilities for the counterexample a which is given in response to hCON :  Case 1: a ∈ Z. In this case, since h(a) agrees with the majority of the values f1(a), . . . , fN (a),  such a counterexample causes the size of CON to be multiplied by at most 1/2.  Case 2: a /∈ Z. In this case we have Na,0, Na,1 ≥ 1  size of CON to be multiplied by at most (cid:0)1 − 1 nk  (cid:1) . This proves Theorem 9.  nk so the counterexample a must cause the  8. Membership queries provably help for learning log n-term DNF  The following is a sharpening of the arguments from Section 6 to apply to log(n)-term DNF.  Theorem 11 Let A be any algorithm which learns the class of all log n-term DNF formulas using only equivalence queries which are DNF formulas with at most nlog n terms. Then A must make at least n(log n)/3 equivalence queries in the worst case.  Sketch of Proof of Theorem 11: As in the proof of Theorem 6 we consider M (n, t, s), the class of all monotone DNF over n variables with exactly t distinct terms each of length exactly s. For this proof we fix s and t both to be log n. We will show that given any DNF formula with at most nlog n terms, there is an assignment such that at most a 1/n(log n)/3 fraction of the DNFs in M (n, t, s) agree with f on that assignment; this implies the theorem by the arguments of Theorem 6. Details are in"}