{"1": "Jacob Abernethy, Chansoo Lee, Abhinav Sinha, and Ambuj Tewari. Online linear optimization via smoothing. In Proceedings of The 27th Conference on Learning Theory, COLT, volume 35 of JMLR Proceedings, pages 807-823, 2014.  Dmitry Adamskiy, Wouter M. Koolen, Alexey Chernov, and Vladimir Vovk. A closer look at adaptive regret. In Proceedings of the 23rd International Conference on Algorithmic Learning Theory (ALT), LNAI 7568, pages 290-304. Springer, 2012.  Jean-Yves Audibert, S´ebastien Bubeck, and G´abor Lugosi. Regret in online combinatorial opti-  mization. Math. Oper. Res., 39(1):31-45, 2014.  Peter Auer, Nicol`o Cesa-Bianchi, and Claudio Gentile. Adaptive and self-confident on-line learning  algorithms. Journal of Computer and System Sciences, 64:48-75, 2002.  Nicol`o Cesa-Bianchi and G´abor Lugosi. Prediction, learning, and games. Cambridge University  Nicol`o Cesa-Bianchi and G´abor Lugosi. Combinatorial bandits. J. Comput. Syst. Sci., 78(5):1404-  Press, 2006.  1422, 2012.  Nicol`o Cesa-Bianchi, Yishay Mansour, and Gilles Stoltz. Improved second-order bounds for pre-  diction with expert advice. Machine Learning, 66(2/3):321-352, 2007.  Kamalika Chaudhuri, Yoav Freund, and Daniel Hsu. A parameter-free hedging algorithm. In Ad-  vances in Neural Information Processing Systems 22 (NIPS 2009), pages 297-305, 2009.  Alexey V. Chernov and Vladimir Vovk. Prediction with advice of unknown number of experts. In  Uncertainty in Artificial Intelligence, pages 117-125, 2010.  Chao-Kai Chiang, Tianbao Yang, Chia-Jung Lee, Mehrdad Mahdavi, Chi-Jen Lu, Rong Jin, and Shenghuo Zhu. Online optimization with gradual variations. In Proceedings of the 25th Annual Conference on Learning Theory, number 23 in JMLR W&CP, pages 6.1-6.20, 2012.  Yoav Freund and Robert E. Schapire. A decision-theoretic generalization of on-line learning and an  application to boosting. Journal of Computer and System Sciences, 55:119-139, 1997.  Pierre Gaillard, Gilles Stoltz, and Tim van Erven. A second-order bound with excess losses. In JMLR Workshop and Conference Proceedings, volume 35: Proceedings of the 27th Conference on Learning Theory (COLT), pages 176-196, 2014.  Eyal Gofer and Yishay Mansour. Lower bounds on individual sequence regret.  In Algorithmic  Learning Theory (ALT), volume 7568, pages 275-289. Springer Berlin Heidelberg, 2012.  Peter D. Gr¨unwald. Safe learning: bridging the gap between Bayes, MDL and statistical learning theory via empirical convexity. In JMLR W&CP 19: Proceedings of the 24th Annual Conference on Learning Theory, COLT, pages 397-420, 2011.  Peter D. Gr¨unwald. The safe Bayesian. In Algorithmic Learning Theory (ALT), volume 7568, pages  169-183. Springer Berlin Heidelberg, 2012.  13   SECOND-ORDER QUANTILE METHODS  References  Jacob Abernethy, Chansoo Lee, Abhinav Sinha, and Ambuj Tewari. Online linear optimization via smoothing. In Proceedings of The 27th Conference on Learning Theory, COLT, volume 35 of JMLR Proceedings, pages 807-823, 2014.  Dmitry Adamskiy, Wouter M. Koolen, Alexey Chernov, and Vladimir Vovk. A closer look at adaptive regret. In Proceedings of the 23rd International Conference on Algorithmic Learning Theory (ALT), LNAI 7568, pages 290-304. Springer, 2012.  Jean-Yves Audibert, S´ebastien Bubeck, and G´abor Lugosi. Regret in online combinatorial opti-  mization. Math. Oper. Res., 39(1):31-45, 2014.  Peter Auer, Nicol`o Cesa-Bianchi, and Claudio Gentile. Adaptive and self-confident on-line learning  algorithms. Journal of Computer and System Sciences, 64:48-75, 2002.  Nicol`o Cesa-Bianchi and G´abor Lugosi. Prediction, learning, and games. Cambridge University  Nicol`o Cesa-Bianchi and G´abor Lugosi. Combinatorial bandits. J. Comput. Syst. Sci., 78(5):1404-  Press, 2006.  1422, 2012.  Nicol`o Cesa-Bianchi, Yishay Mansour, and Gilles Stoltz. Improved second-order bounds for pre-  diction with expert advice. Machine Learning, 66(2/3):321-352, 2007.  Kamalika Chaudhuri, Yoav Freund, and Daniel Hsu. A parameter-free hedging algorithm. In Ad-  vances in Neural Information Processing Systems 22 (NIPS 2009), pages 297-305, 2009.  Alexey V. Chernov and Vladimir Vovk. Prediction with advice of unknown number of experts. In  Uncertainty in Artificial Intelligence, pages 117-125, 2010.  Chao-Kai Chiang, Tianbao Yang, Chia-Jung Lee, Mehrdad Mahdavi, Chi-Jen Lu, Rong Jin, and Shenghuo Zhu. Online optimization with gradual variations. In Proceedings of the 25th Annual Conference on Learning Theory, number 23 in JMLR W&CP, pages 6.1-6.20, 2012.  Yoav Freund and Robert E. Schapire. A decision-theoretic generalization of on-line learning and an  application to boosting. Journal of Computer and System Sciences, 55:119-139, 1997.  Pierre Gaillard, Gilles Stoltz, and Tim van Erven. A second-order bound with excess losses. In JMLR Workshop and Conference Proceedings, volume 35: Proceedings of the 27th Conference on Learning Theory (COLT), pages 176-196, 2014.  Eyal Gofer and Yishay Mansour. Lower bounds on individual sequence regret.  In Algorithmic  Learning Theory (ALT), volume 7568, pages 275-289. Springer Berlin Heidelberg, 2012.  Peter D. Gr¨unwald. Safe learning: bridging the gap between Bayes, MDL and statistical learning theory via empirical convexity. In JMLR W&CP 19: Proceedings of the 24th Annual Conference on Learning Theory, COLT, pages 397-420, 2011.  Peter D. Gr¨unwald. The safe Bayesian. In Algorithmic Learning Theory (ALT), volume 7568, pages  169-183. Springer Berlin Heidelberg, 2012. KOOLEN AND VAN ERVEN  Elad Hazan and Satyen Kale. Extracting certainty from uncertainty: Regret bounded by variation  in costs. Machine learning, 80(2-3):165-188, 2010.  David P. Helmbold and Manfred K. Warmuth. Learning permutations with exponential weights.  Journal of Machine Learning Research, 10:1705-1736, 2009.  Mark Herbster and Manfred K. Warmuth. Tracking the best expert. Machine Learning, 32:151-178,  1998.  Marcus Hutter and Jan Poland. Adaptive online prediction by following the perturbed leader. Jour-  nal of Machine Learning Research, 6:639-660, 2005.  Adam Kalai and Santosh Vempala. Efficient algorithms for online decision problems. Journal of  Computer and System Sciences, 71(3):291-307, 2005.  Wouter M. Koolen. The Pareto regret frontier. Systems (NIPS) 26, pages 863-871, 2013.  In Advances in Neural Information Processing  Wouter M. Koolen, Manfred K. Warmuth, and Jyrki Kivinen. Hedging structured concepts.  In  Proceedings of the 23rd Annual Conference on Learning Theory (COLT), pages 93-105, 2010.  Wouter M. Koolen, Tim van Erven, and Peter D. Gr¨unwald. Learning the learning rate for prediction In Advances in Neural Information Processing Systems (NIPS) 27, pages  with expert advice. 2294-2302, 2014.  Nick Littlestone and Manfred K. Warmuth. The weighted majority algorithm.  Information and  Computation, 108(2):212-261, 1994.  Haipeng Luo and Robert E Schapire. A drifting-games analysis for online learning and applications to boosting. In Advances in Neural Information Processing Systems 27, pages 1368-1376. Curran Associates, Inc., 2014.  Haipeng Luo and Robert E. Schapire. Achieving all with no parameters: Adaptive NormalHedge.  CoRR, abs/1502.05934, 2015. To appear at COLT.  Alexander Rakhlin, Ohad Shamir, and Karthik Sridharan. Localization and adaptation in online learning. In Proceedings of the Sixteenth International Conference on Artificial Intelligence and Statistics, AISTATS, volume 31 of JMLR Proceedings, pages 516-526. JMLR.org, 2013.  Steven de Rooij, Tim van Erven, Peter D. Gr¨unwald, and Wouter M. Koolen. Follow the leader if  you can, Hedge if you must. Journal of Machine Learning Research, 15:1281-1316, 2014.  Amir Sani, Gergely Neu, and Alessandro Lazaric. Exploiting easy data in online optimization. In Advances in Neural Information Processing Systems 27, pages 810-818. Curran Associates, Inc., 2014.  Shai Shalev-Shwartz. Online learning and online convex optimization. Foundations and Trends in  Machine Learning, 4(2):107-194, 2011.  Jacob Steinhardt and Percy Liang. Adaptivity and optimism: An improved exponentiated gradient  algorithm. In International Conference on Machine Learning (ICML), 2014. SECOND-ORDER QUANTILE METHODS  Eiji Takimoto and Manfred K. Warmuth. Path kernels and multiplicative updates. Journal of Ma-  chine Learning Research, 4:773-818, 2003.  Koji Tsuda, Gunnar R¨atsch, and Manfred K. Warmuth. Matrix Exponentiated Gradient updates for on-line learning and Bregman projections. Journal of Machine Learning Research, 6:995-1018, 2005.  Vladimir Vovk. Aggregating strategies. In COLT Proceedings, pages 371-383, 1990.  Vladimir Vovk. A game of prediction with expert advice. Journal of Computer and System Sciences,  56(2):153-173, 1998.  Manfred K. Warmuth and Dima Kuzmin. Randomized online PCA algorithms with regret bounds that are logarithmic in the dimension. Journal of Machine Learning Research, 9:2287-2320, 2008.  Manfred K. Warmuth and Dima Kuzmin. Bayesian generalized probability calculus for density  matrices. Machine Learning, 78(1-2):63-101, 2010.  Manfred K. Warmuth, Wouter M. Koolen, and David P. Helmbold. Combining initial segments of lists. Theoretical Computer Science, 519:29-45, 2014. The special issue on Algorithmic Learning Theory for ALT 2011.  Olivier Wintenberger. Optimal learning with Bernstein online aggregation. Preprint, available from  http://arxiv.org/abs/1404.1356v2, 2014. KOOLEN AND VAN ERVEN  This section collects the proofs omitted from Sections 3 and 4."}