{"1": "Jayadev Acharya, Clément L. Canonne, and Himanshu Tyagi. Distributed simulation and distributed  inference. ArXiV, abs/1804.06952, 2018a.  Jayadev Acharya, Clément L. Canonne, and Himanshu Tyagi. Inference under information constraints I: Lower bounds from chi-square contraction, 2018b. Preprint available at arXiv:abs/1812.11476.  Jayadev Acharya, Ziteng Sun, and Huanyu Zhang. Hadamard response: Estimating distributions  privately, efficiently, and with little communication. ArXiV, abs/1802.04705, 2018c.  Jayadev Acharya, Clément L. Canonne, Cody Freitag, and Himanshu Tyagi. Test without trust: Optimal locally private distribution testing. In Proceedings of the 22nd International Conference on Artificial Intelligence and Statistics (AISTATS’19), 2019. To appear. Full version available on arXiv (abs/1808.02174).  Rudolf Ahlswede and Imre Csiszár. Hypothesis testing with communication constraints. IEEE  Transactions on Information Theory, 32(4):533-542, July 1986.  Sivaraman Balakrishnan and Larry Wasserman. Hypothesis testing for high-dimensional multinomi- als: A selective review. The Annals of Applied Statistics, 12(2):727-749, 2018. ISSN 1932-6157. doi: 10.1214/18-AOAS1155SF. URL https://doi.org/10.1214/18-AOAS1155SF.  Maria-Florina Balcan, Avrim Blum, Shai Fine, and Yishay Mansour. Distributed learning, communi- cation complexity and privacy. In Proceedings of the 25th Conference on Learning Theory, COLT 2012, volume 23 of JMLR Proceedings, pages 26.1-26.22. JMLR.org, 2012.  Stephen P. Boyd, Neal Parikh, Eric Chu, Borja Peleato, and Jonathan Eckstein. Distributed optimiza- tion and statistical learning via the alternating direction method of multipliers. Foundations and Trends in Machine Learning, 3(1):1-122, 2011.  Mark Braverman, Ankit Garg, Tengyu Ma, Huy L. Nguyen, and David P. Woodruff. Communication lower bounds for statistical estimation problems via a distributed data processing inequality. In Symposium on Theory of Computing Conference, STOC’16, pages 1011-1020. ACM, 2016.  Clément L. Canonne. A Survey on Distribution Testing: your data is Big. But is it Blue? Electronic  Colloquium on Computational Complexity (ECCC), 22:63, April 2015.  Thomas M. Cover and Joy A. Thomas. Elements of information theory. Wiley-Interscience [John Wiley & Sons], Hoboken, NJ, second edition, 2006. ISBN 978-0-471-24195-9; 0-471-24195-4.  Luc Devroye and Gábor Lugosi. Combinatorial Methods in Density Estimation. Springer Series in Statistics. Springer New York, 2001. ISBN 9780387951171. URL http://books.google. com/books?id=jvT-sUt1HZYC.  Ilias Diakonikolas. Learning structured distributions. In Handbook of Big Data. CRC Press, 2016.  Ilias Diakonikolas, Elena Grigorescu, Jerry Li, Abhiram Natarajan, Krzysztof Onak, and Ludwig Schmidt. Communication-efficient distributed learning of discrete distributions. In Advances in Neural Information Processing Systems 30, pages 6394-6404, 2017.  13   INFERENCE UNDER INFORMATION CONSTRAINTS  References  Jayadev Acharya, Clément L. Canonne, and Himanshu Tyagi. Distributed simulation and distributed  inference. ArXiV, abs/1804.06952, 2018a.  Jayadev Acharya, Clément L. Canonne, and Himanshu Tyagi. Inference under information constraints I: Lower bounds from chi-square contraction, 2018b. Preprint available at arXiv:abs/1812.11476.  Jayadev Acharya, Ziteng Sun, and Huanyu Zhang. Hadamard response: Estimating distributions  privately, efficiently, and with little communication. ArXiV, abs/1802.04705, 2018c.  Jayadev Acharya, Clément L. Canonne, Cody Freitag, and Himanshu Tyagi. Test without trust: Optimal locally private distribution testing. In Proceedings of the 22nd International Conference on Artificial Intelligence and Statistics (AISTATS’19), 2019. To appear. Full version available on arXiv (abs/1808.02174).  Rudolf Ahlswede and Imre Csiszár. Hypothesis testing with communication constraints. IEEE  Transactions on Information Theory, 32(4):533-542, July 1986.  Sivaraman Balakrishnan and Larry Wasserman. Hypothesis testing for high-dimensional multinomi- als: A selective review. The Annals of Applied Statistics, 12(2):727-749, 2018. ISSN 1932-6157. doi: 10.1214/18-AOAS1155SF. URL https://doi.org/10.1214/18-AOAS1155SF.  Maria-Florina Balcan, Avrim Blum, Shai Fine, and Yishay Mansour. Distributed learning, communi- cation complexity and privacy. In Proceedings of the 25th Conference on Learning Theory, COLT 2012, volume 23 of JMLR Proceedings, pages 26.1-26.22. JMLR.org, 2012.  Stephen P. Boyd, Neal Parikh, Eric Chu, Borja Peleato, and Jonathan Eckstein. Distributed optimiza- tion and statistical learning via the alternating direction method of multipliers. Foundations and Trends in Machine Learning, 3(1):1-122, 2011.  Mark Braverman, Ankit Garg, Tengyu Ma, Huy L. Nguyen, and David P. Woodruff. Communication lower bounds for statistical estimation problems via a distributed data processing inequality. In Symposium on Theory of Computing Conference, STOC’16, pages 1011-1020. ACM, 2016.  Clément L. Canonne. A Survey on Distribution Testing: your data is Big. But is it Blue? Electronic  Colloquium on Computational Complexity (ECCC), 22:63, April 2015.  Thomas M. Cover and Joy A. Thomas. Elements of information theory. Wiley-Interscience [John Wiley & Sons], Hoboken, NJ, second edition, 2006. ISBN 978-0-471-24195-9; 0-471-24195-4.  Luc Devroye and Gábor Lugosi. Combinatorial Methods in Density Estimation. Springer Series in Statistics. Springer New York, 2001. ISBN 9780387951171. URL http://books.google. com/books?id=jvT-sUt1HZYC.  Ilias Diakonikolas. Learning structured distributions. In Handbook of Big Data. CRC Press, 2016.  Ilias Diakonikolas, Elena Grigorescu, Jerry Li, Abhiram Natarajan, Krzysztof Onak, and Ludwig Schmidt. Communication-efficient distributed learning of discrete distributions. In Advances in Neural Information Processing Systems 30, pages 6394-6404, 2017. INFERENCE UNDER INFORMATION CONSTRAINTS  John C. Duchi and Martin J. Wainwright. Distance-based and continuum Fano inequalities with  applications to statistical estimation. ArXiV, abs/1311.2669, 2013.  John C. Duchi, Michael I. Jordan, and Martin J. Wainwright. Local privacy and statistical minimax rates. In 54th Annual IEEE Symposium on Foundations of Computer Science, FOCS 2013, pages 429-438. IEEE Computer Society, 2013.  Cynthia Dwork. Differential privacy: A survey of results. In Theory and Applications of Models of  Computation, volume 4978, pages 1-19. Springer, 2008. ISBN 978-3-540-79227-7.  Orr Fischer, Uri Meir, and Rotem Oshman. Distributed uniformity testing. In Proceedings of the 2018 ACM Symposium on Principles of Distributed Computing, PODC 2018, pages 455-464. ACM, 2018.  Te Sun Han. Hypothesis testing with multiterminal data compression.  IEEE Transactions on  Information Theory, 33(6):759-772, November 1987.  Te Sun Han and Shun-Ichi Amari. Statistical inference under multiterminal data compression. IEEE  Transactions on Information Theory, 44(6):2300-2324, October 1998.  Yanjun Han, Ayfer Özgür, and Tsachy Weissman. Geometric lower bounds for distributed parameter estimation under communication constraints. In Proceedings of the 31st Conference on Learning Theory, COLT 2018, volume 75 of Proceedings of Machine Learning Research, pages 3163-3188. PMLR, 2018.  Yanjun Han, Ayfer Özgür, and Tsachy Weissman. Geometric Lower Bounds for Distributed Parameter Estimation under Communication Constraints. ArXiv e-prints, abs/1802.08417v1, February 2018. First version (https://arxiv.org/abs/1802.08417v1).  Peter Kairouz, Keith Bonawitz, and Daniel Ramage. Discrete distribution estimation under local privacy. In Proceedings of the 33rd International Conference on Machine Learning, ICML 2016, volume 48 of JMLR Workshop and Conference Proceedings, pages 2436-2444. JMLR.org, 2016.  Liam Paninski. A coincidence-based test for uniformity given very sparsely sampled discrete data.  IEEE Transactions on Information Theory, 54(10):4750-4755, 2008.  David Pollard. Asymptopia, 2003. URL http://www.stat.yale.edu/~pollard/Books/  Asymptopia/. Manuscript.  Ronitt Rubinfeld. Taming big probability distributions. XRDS: Crossroads, The ACM Magazine for Students, 19(1):24, sep 2012. doi: 10.1145/2331042.2331052. URL http://dx.doi.org/ 10.1145/2331042.2331052.  Ohad Shamir. Fundamental limits of online and distributed algorithms for statistical learning and estimation. In Advances in Neural Information Processing Systems 27, pages 163-171, 2014.  Or Sheffet. Locally private hypothesis testing. In Jennifer Dy and Andreas Krause, editors, Proceed- ings of the 35th International Conference on Machine Learning, volume 80 of Proceedings of Machine Learning Research, pages 4612-4621, Stockholmsmässan, Stockholm Sweden, 10-15 Jul 2018. PMLR. INFERENCE UNDER INFORMATION CONSTRAINTS  Shaowei Wang, Liusheng Huang, Pengzhan Wang, Yiwen Nie, Hongli Xu, Wei Yang, Xiang-Yang Li, and Chunming Qiao. Mutual information optimally local private discrete distribution estimation. ArXiV, abs/1607.08025, 2016.  Thomas Watson. Communication complexity of statistical distance. TOCT, 10(1):2:1-2:11, 2018.  Michele Wigger and Roy Timo. Testing against independence with multiple decision centers. IEEE International Conference on Signal Processing and Communications, IISc, Bangalore, June 2016.  Yu Xiang and Young Han Kim. Interactive hypothesis testing against independence. In Proceedings of the 2013 IEEE International Symposium on Information Theory (ISIT’13), pages 1782-1786, 2013.  Aolin Xu and Maxim Raginsky. Information-theoretic lower bounds on Bayes risk in decentralized  estimation. IEEE Transactions on Information Theory, 63(3):1580-1600, 2017.  Min Ye and Alexander Barg. Optimal schemes for discrete distribution estimation under locally  differential privacy. ArXiV, abs/1702.00610, 2017.  Bin Yu. Assouad, Fano, and Le Cam.  In Festschrift for Lucien Le Cam, pages 423-435. Springer, 1997. doi: 10.1007/978-1-4612-1880-7_29. URL http://dx.doi.org/10. 1007/978-1-4612-1880-7_29.  Yuchen Zhang, John Duchi, Michael I. Jordan, and Martin J. Wainwright. Information-theoretic lower bounds for distributed statistical estimation with communication constraints. In Advances in Neural Information Processing Systems 26, pages 2328-2336, 2013."}