{"1": "S. Agarwal, J. Wills, L. Cayton, G. Lanckriet, D. Kriegman, and S. Belongie. Generalized non- metric multidimensional scaling. In International Conference on Artificial Intelligence and Statis- tics (AISTATS), 2007.  N. Ailon. An active learning algorithm for ranking from pairwise preferences with an almost optimal  query complexity. JMLR, 13:137-164, 2012.  P. Alestalo, D. Trotsenko, and J. V¨ais¨al¨a. Isometric approximation. Israel Journal of Mathematics,  125:61-82, 2001.  1953.  2005.  F. Beckman and D. Quarles. On isometries of Euclidean spaces. Proc. Amer. Math. Soc., 4:810-815,  I. Borg and P. Groenen. Modern multidimensional scaling: Theory and applications. Springer,  J. Dattorro. Convex optimization and Euclidean distance geometry. Meboo Publishing, 2005.  K. Jamieson and R. Nowak. Low-dimensional embedding using adaptively selected ordinal data. In  Conference on Communication, Control, and Computing, 2011a.  K. Jamieson and R. Nowak. Active ranking using pairwise comparisons. In Neural Information  Processing Systems (NIPS), 2011b.  Psychometrika, 29(1):1-27, 1964a.  129, 1964b.  J. Kruskal. Multidimensional scaling by optimizing goodness of fit to a nonmetric hypothesis.  J. Kruskal. Nonmetric multidimensional scaling: A numerical method. Psychometrika, 29(2):115-  Y. Lan, J. Guo, X. Cheng, and T. Liu. Statistical consistency of ranking methods in a rank-  differentiable probability space. In Neural Information Processing Systems (NIPS), 2012.  B. McFee and G. Lanckriet. Partial order embedding with multiple kernels. In International Con-  ference on Machine Learning (ICML), 2009.  B. McFee and G. Lanckriet. Metric learning to rank.  In International Conference on Machine  Learning (ICML), 2010.  B. McFee and G. Lanckriet. Learning multi-modal similarity. JMLR, 12:491-523, 2011.  M. McKemie and J. V¨ais¨al¨a. Spherical maps of Euclidean spaces. Results in Mathematics, 35:  145-160, 1999.  H. Ouyang and A. Gray. Learning dissimilarities by ranking: from SDP to QP. In International  Conference on Machine Learning (ICML), 2008.  M. Quist and G. Yona. Distributional scaling: An algorithm for structure-preserving embedding of  metric and nonmetric spaces. JMLR, 5:399-420, 2004.  14   KLEINDESSNER VON LUXBURG  References  S. Agarwal, J. Wills, L. Cayton, G. Lanckriet, D. Kriegman, and S. Belongie. Generalized non- metric multidimensional scaling. In International Conference on Artificial Intelligence and Statis- tics (AISTATS), 2007.  N. Ailon. An active learning algorithm for ranking from pairwise preferences with an almost optimal  query complexity. JMLR, 13:137-164, 2012.  P. Alestalo, D. Trotsenko, and J. V¨ais¨al¨a. Isometric approximation. Israel Journal of Mathematics,  125:61-82, 2001.  1953.  2005.  F. Beckman and D. Quarles. On isometries of Euclidean spaces. Proc. Amer. Math. Soc., 4:810-815,  I. Borg and P. Groenen. Modern multidimensional scaling: Theory and applications. Springer,  J. Dattorro. Convex optimization and Euclidean distance geometry. Meboo Publishing, 2005.  K. Jamieson and R. Nowak. Low-dimensional embedding using adaptively selected ordinal data. In  Conference on Communication, Control, and Computing, 2011a.  K. Jamieson and R. Nowak. Active ranking using pairwise comparisons. In Neural Information  Processing Systems (NIPS), 2011b.  Psychometrika, 29(1):1-27, 1964a.  129, 1964b.  J. Kruskal. Multidimensional scaling by optimizing goodness of fit to a nonmetric hypothesis.  J. Kruskal. Nonmetric multidimensional scaling: A numerical method. Psychometrika, 29(2):115-  Y. Lan, J. Guo, X. Cheng, and T. Liu. Statistical consistency of ranking methods in a rank-  differentiable probability space. In Neural Information Processing Systems (NIPS), 2012.  B. McFee and G. Lanckriet. Partial order embedding with multiple kernels. In International Con-  ference on Machine Learning (ICML), 2009.  B. McFee and G. Lanckriet. Metric learning to rank.  In International Conference on Machine  Learning (ICML), 2010.  B. McFee and G. Lanckriet. Learning multi-modal similarity. JMLR, 12:491-523, 2011.  M. McKemie and J. V¨ais¨al¨a. Spherical maps of Euclidean spaces. Results in Mathematics, 35:  145-160, 1999.  H. Ouyang and A. Gray. Learning dissimilarities by ranking: from SDP to QP. In International  Conference on Machine Learning (ICML), 2008.  M. Quist and G. Yona. Distributional scaling: An algorithm for structure-preserving embedding of  metric and nonmetric spaces. JMLR, 5:399-420, 2004. UNIQUENESS OF ORDINAL EMBEDDING  R. Rosales and G. Fung. Learning sparse metrics via linear programming. In International Confer-  ence on Knowledge Discovery and Data Mining (KDD), 2006.  I. Schoenberg. Metric spaces and completely monotone functions. Ann. of Math., 39(4):811-841,  B. Shaw and T. Jebara. Structure preserving embedding. In International Conference on Machine  Learning (ICML), 2009.  R. Shepard. The analysis of proximities: Multidimensional scaling with an unknown distance func-  tion (I). Psychometrika, 27(2):125-140, 1962a.  R. Shepard. The analysis of proximities: Multidimensional scaling with an unknown distance func-  tion (II). Psychometrika, 27(3):219-246, 1962b.  R. Shepard. Metric structures in ordinal data. Journal of Mathematical Psychology, 3(2):287-315,  1938.  1966.  C. Sherman. Nonmetric multidimensional scaling: A Monte Carlo study of the basic parameters.  Psychometrika, 37(3):323-355, 1972.  O. Tamuz, C. Liu, S. Belongie, O. Shamir, and A. Kalai. Adaptively learning the crowd kernel. In  International Conference on Machine Learning (ICML), 2011.  F. Wauthier, M. Jordan, and N. Jojic. Efficient ranking from pairwise comparisons. In International  Conference on Machine Learning (ICML), 2013.  F. Young. Nonmetric multidimensional scaling: Recovery of metric information. Psychometrika,  35(4):455-473, 1970. KLEINDESSNER VON LUXBURG"}