{"1": "Edoardo M. Airoldi, David M. Blei, Stephen E. Fienberg, and Eric P. Xing. Mixed membership  stochastic blockmodels. Journal of Machine Learning Research, 9:1981-2014, 2008.  Edoardo M Airoldi, Thiago B Costa, and Stanley H Chan. Stochastic blockmodel approximation of a graphon: Theory and consistent estimation. In Advances in Neural Information Processing Systems 26, pages 692-700, 2013.  13   EDGE LABEL INFERENCE IN GENERALIZED STOCHASTIC BLOCK MODELS  The attribute of root ρ is first chosen uniformly at random from X . Then, for each child node, independently of everything else, it has the same attribute with its parent with probability 1 − (r − 1)(cid:15)((cid:96)) and one of r − 1 different attributes with probability (cid:15)((cid:96)), where  (cid:15)((cid:96)) =  bν((cid:96)) aµ((cid:96)) + (r − 1)bν((cid:96))  .  (19)  Recall that GR denote the neighborhood of ρ in G within distance R and ∂GR denote the nodes at the boundary of GR. Let TR denote the tree T up to depth R and ∂TR denote the set of leaf nodes of TR. The following lemma similar to coupling lemmas in Mossel et al. (2012) and Lelarge et al. (2013) shows that GR can be coupled with the labeled Galton-Watson tree TR.  Lemma 6 Let R = θ log n for some small enough constant θ > 0, then there exists a coupling such that a.a.s. (GR, σGR) = (TR, σTR), where σGR denote the node attributes on the subgraph GR.  For the labeled Galton-Watson tree, we show that if ω < ω0, then the attributes of leaf nodes  are asymptotically independent with the attribute of root.  Lemma 7 Consider a labeled Galton-Waltson tree T with ω < ω0. Then as R → ∞,  ∀x ∈ {1, . . . , r}, P(σρ = x|T , σ∂TR) →  a.a.s.  1 r  By exploiting Lemma 6 and Lemma 7, we give our proof of Theorem 3. By symmetry, P[σρ = x|G, σv = y] = P[σρ = x(cid:48)|G, σv = y] for x, x(cid:48) (cid:54)= y and x (cid:54)= x(cid:48). Therefore, we only need to show that P[σρ = y|G, σv = y] ∼ 1/r for any y ∈ X and it further reduces to showing that  P[σρ = y|G, σv = y, σ∂GR] ∼ 1/r.  (20)  Let R = θ log n be as in Lemma 6 such that GR = o( n) and thus v /∈ GR a.a.s.. Lemma 4.7 in Mossel et al. (2012) shows that σρ is asymptotically independent with σv conditional on σ∂GR. Hence, P[σρ = y|G, σv = y, σ∂GR] ∼ P[σρ = y|G, σ∂GR]. Also, note that P(σρ = y|G, σ∂GR) = P(σρ = y|GR, σ∂GR). Lemma 6 implies that P(σρ = y|GR, σGR) ∼ P(σρ = y|TR, σ∂TR), and by Lemma 7, P(σρ = y|TR, σ∂TR) ∼ 1  r . Therefore, equation (20) holds.  √  M.L acknowledges the support of the French Agence Nationale de la Recherche (ANR) under refer- ence ANR-11-JS02-005-01 (GAP project). J. X. acknowledges the support of NSF ECCS 10-28464.  Acknowledgments  References  Edoardo M. Airoldi, David M. Blei, Stephen E. Fienberg, and Eric P. Xing. Mixed membership  stochastic blockmodels. Journal of Machine Learning Research, 9:1981-2014, 2008.  Edoardo M Airoldi, Thiago B Costa, and Stanley H Chan. Stochastic blockmodel approximation of a graphon: Theory and consistent estimation. In Advances in Neural Information Processing Systems 26, pages 692-700, 2013. XU MASSOULI ´E LELARGE  Animashree Anandkumar, Rong Ge, Daniel Hsu, and Sham Kakade. A tensor spectral approach to  learning mixed membership community models. In COLT, pages 867-881, 2013.  Peter J. Bickel and Aiyou Chen. A nonparametric view of network models and Newman-Girvan  and other modularities. Proceedings of the National Academy of Sciences, 2009.  B´ela Bollob´as, Svante Janson, and Oliver Riordan. The phase transition in inhomogeneous random  graphs. Random Struct. Algorithms, 31(1):3-122, August 2007.  Sourav Chatterjee. Matrix estimation by universal singular value thresholding. arxiv:1212.1247,  2012.  Kamalika Chaudhuri, Fan Chung Graham, and Alexander Tsiatas. Spectral clustering of graphs with general degrees in the extended planted partition model. Journal of Machine Learning Research, 23:35.1-35.23, 2012.  Yudong Chen and Jiaming Xu. Statistical-computational tradeoffs in planted problems and subma- trix localization with a growing number of clusters and submatrices. arxiv:1402.1267, 2014.  Amin Coja-Oghlan. Graph partitioning via adaptive spectral techniques. Comb. Probab. Comput.,  19(2):227-284, 2010.  Chandler Davis and W. M. Kahan. The rotation of eigenvectors by a perturbation. III. SIAM Journal  on Numerical Analysis, 7(1):pp. 1-46, 1970.  Aurelien Decelle, Florent Krzakala, Cristopher Moore, and Lenka Zdeborov´a. Asymptotic analysis of the stochastic block model for modular networks and its algorithmic applications. Physics Review E, 84:066106, 2011.  Uriel Feige and Eran Ofek. Spectral techniques applied to sparse random graphs. Random Struct.  Algorithms, 27(2):251-275, Sept. 2005.  Santo Fortunato. Community detection in graphs. arXiv:0906.0612, 2010.  Mark S. Handcock, Adrian E. Raftery, and Jeremy M. Tantrum. Model-based clustering for social networks. Journal of the Royal Statistical Society: Series A (Statistics in Society), 170(2):301- 354, 2007.  Simon Heimlicher, Marc Lelarge, and Laurent Massouli´e. Community detection in the labelled  stochastic block model. arXiv:1209.2910, 2012.  Peter D. Hoff, Adrian E. Raftery, and Mark S. Handcock. Latent space approaches to social network  analysis. Journal of the American Statistical Association, 97:1090+, December 2002.  Tosio Kato. Perturbation Theory for Linear Operators. Springer, Berlin, 1966.  Vladimir I. Koltchinskii. Asymptotics of spectral projections of some random matrices approximat-  ing integral operators. Progress in Probability, 1998.  Marc Lelarge, Laurent Massouli´e, and Jiaming Xu. Reconstruction in the labeled stochastic block  model. In Information Theory Workshop, Sept. 2013. EDGE LABEL INFERENCE IN GENERALIZED STOCHASTIC BLOCK MODELS  Laurent Massouli´e. Community detection thresholds and the weak Ramanujan property. In STOC 2014: 46th Annual Symposium on the Theory of Computing, pages 1-10, United States, 2014.  Frank McSherry. Spectral partitioning of random graphs. In 42nd IEEE Symposium on Foundations  of Computer Science, pages 529 - 537, Oct. 2001.  Elchanan Mossel. Survey - information ﬂows on trees. DIMACS series in discrete mathematics and  theoretical computer science, pages 155-170, 2004.  Elchanan Mossel, Joe Neeman, and Allan Sly. Stochastic block models and reconstruction.  arXiv:1202.1499, 2012.  arxiv:1311.4115, 2013.  Elchanan Mossel, Joe Neeman, and Allan Sly. A proof of the block model threshold conjecture.  Karl Rohe, Sourav Chatterjee, and Bin Yu. Spectral clustering and the high-dimensional stochastic  blockmodel. The Annals of Statistics, 39(4):1878-1915, 2011.  Dan-Cristian Tomozei and Laurent Massouli´e. Distributed user profiling via spectral methods. SIG-  METRICS Perform. Eval. Rev., 38(1):383-384, June 2010.  Ulrike von Luxburg, Olivier Bousquet, and Mikhail Belkin. On the convergence of spectral cluster-  ing on random samples: the normalized case. NIPS, 2005."}