{"1": "Ainesh Bakshi and David Woodruff. Sublinear time low-rank approximation of distance matrices.  In Advances in Neural Information Processing Systems, pages 3786-3796, 2018.  Mark Braverman and Anup Rao. Information equals amortized communication. IEEE Transactions  on Information Theory, 60(10):6058-6069, 2014.  Mark Braverman, Ankit Garg, Denis Pankratov, and Omri Weinstein. Information lower bounds via  self-reducibility. Theory of Computing Systems, 59(2):377-396, 2016.  Emmanuel J Cand`es and Benjamin Recht. Exact matrix completion via convex optimization. Foun-  dations of Computational mathematics, 9(6):717, 2009.  Ke Chen. On coresets for k-median and k-means clustering in metric and euclidean spaces and their  applications. SIAM Journal on Computing, 39(3):923-947, 2009.  Xue Chen and Eric Price. Condition number-free query and active learning of linear families. arXiv  preprint arXiv:1711.10051, 2017.  Kenneth L Clarkson and David P Woodruff. Low-rank approximation and regression in input spar-  sity time. Journal of the ACM (JACM), 63(6):54, 2017. (first appeared in STOC’13).  Ivan Dokmanic, Reza Parhizkar, Juri Ranieri, and Martin Vetterli. Euclidean distance matrices: essential theory, algorithms, and applications. IEEE Signal Processing Magazine, 32(6):12-30, 2015.  Ohad N Feldheim and Sasha Sodin. A universality result for the smallest eigenvalues of certain  sample covariance matrices. Geometric And Functional Analysis, 20(1):88-123, 2010.  Alan Frieze, Ravi Kannan, and Santosh Vempala. Fast monte-carlo algorithms for finding low-rank  approximations. Journal of the ACM (JACM), 51(6):1025-1041, 2004.  Alan J Hoffman and Helmut W Wielandt. The variation of the spectrum of a normal matrix. In Selected Papers Of Alan J Hoffman: With Commentary, pages 118-120. World Scientific, 2003.  Liisa Holm and Chris Sander. Protein structure comparison by alignment of distance matrices.  Journal of molecular biology, 233(1):123-138, 1993.  Piotr Indyk. A sublinear time approximation scheme for clustering in metric spaces. In Foundations  of Computer Science, 1999. 40th Annual Symposium on, pages 154-159. IEEE, 1999.  13   Acknowledgments  P. Indyk, A. Vakilian and T. Wagner were supported by funds from the MIT-IBM Watson AI Lab, NSF, and Simons Foundation. D. Woodruff was supported partly by the National Science Foun- dation under Grant No. CCF-1815840, and this work was done partly while he was visiting the Simons Institute for the Theory of Computing. The authors would also like to thank Ainesh Bakshi for implementing the algorithm in this paper and producing our empirical results.  References  Ainesh Bakshi and David Woodruff. Sublinear time low-rank approximation of distance matrices.  In Advances in Neural Information Processing Systems, pages 3786-3796, 2018.  Mark Braverman and Anup Rao. Information equals amortized communication. IEEE Transactions  on Information Theory, 60(10):6058-6069, 2014.  Mark Braverman, Ankit Garg, Denis Pankratov, and Omri Weinstein. Information lower bounds via  self-reducibility. Theory of Computing Systems, 59(2):377-396, 2016.  Emmanuel J Cand`es and Benjamin Recht. Exact matrix completion via convex optimization. Foun-  dations of Computational mathematics, 9(6):717, 2009.  Ke Chen. On coresets for k-median and k-means clustering in metric and euclidean spaces and their  applications. SIAM Journal on Computing, 39(3):923-947, 2009.  Xue Chen and Eric Price. Condition number-free query and active learning of linear families. arXiv  preprint arXiv:1711.10051, 2017.  Kenneth L Clarkson and David P Woodruff. Low-rank approximation and regression in input spar-  sity time. Journal of the ACM (JACM), 63(6):54, 2017. (first appeared in STOC’13).  Ivan Dokmanic, Reza Parhizkar, Juri Ranieri, and Martin Vetterli. Euclidean distance matrices: essential theory, algorithms, and applications. IEEE Signal Processing Magazine, 32(6):12-30, 2015.  Ohad N Feldheim and Sasha Sodin. A universality result for the smallest eigenvalues of certain  sample covariance matrices. Geometric And Functional Analysis, 20(1):88-123, 2010.  Alan Frieze, Ravi Kannan, and Santosh Vempala. Fast monte-carlo algorithms for finding low-rank  approximations. Journal of the ACM (JACM), 51(6):1025-1041, 2004.  Alan J Hoffman and Helmut W Wielandt. The variation of the spectrum of a normal matrix. In Selected Papers Of Alan J Hoffman: With Commentary, pages 118-120. World Scientific, 2003.  Liisa Holm and Chris Sander. Protein structure comparison by alignment of distance matrices.  Journal of molecular biology, 233(1):123-138, 1993.  Piotr Indyk. A sublinear time approximation scheme for clustering in metric spaces. In Foundations  of Computer Science, 1999. 40th Annual Symposium on, pages 154-159. IEEE, 1999. Michael W Mahoney. Randomized algorithms for matrices and data. Foundations and Trends R(cid:13) in  Machine Learning, 3(2):123-224, 2011.  Cameron Musco and David P Woodruff. Sublinear time low-rank approximation of positive In Foundations of Computer Science (FOCS), 2017 IEEE 58th Annual  semidefinite matrices. Symposium on, pages 672-683. IEEE, 2017.  Mark Rudelson and Roman Vershynin. Non-asymptotic theory of random matrices: extreme singu- lar values. In Proceedings of the International Congress of Mathematicians 2010 (ICM 2010) (In 4 Volumes) Vol. I: Plenary Lectures and Ceremonies Vols. II-IV: Invited Lectures, pages 1576- 1602. World Scientific, 2010.  Terence  Tao.  matrices. 254a-notes-3a-eigenvalues-and-sums-of-hermitian-matrices, 2010.  notes hermitian https://terrytao.wordpress.com/2010/01/12/  Eigenvalues  254a,  sums  and  3a:  of  Joshua B Tenenbaum, Vin De Silva, and John C Langford. A global geometric framework for  nonlinear dimensionality reduction. science, 290(5500):2319-2323, 2000.  RC Thompson. The behavior of eigenvalues and singular values under perturbations of restricted  rank. Linear Algebra and its Applications, 13(1-2):69-78, 1976.  Kilian Q Weinberger and Lawrence K Saul. Unsupervised learning of image manifolds by semidef-  inite programming. International journal of computer vision, 70(1):77-90, 2006.  David P Woodruff. Sketching as a tool for numerical linear algebra. Foundations and Trends R(cid:13) in  Theoretical Computer Science, 10(1-2):1-157, 2014.  Figure 3: Running time of our algorithm on subsets of MNIST, for k = 40."}