{"1": "J. Acharya, C. Daskalakis, and G. Kamath. Optimal testing for properties of distributions.  In  Advances in Neural Information Processing Systems (NIPS), pages 3591-3599, 2015a.  J. Acharya, I. Diakonikolas, C. Hegde, J. Li, and L. Schmidt. Fast and Near-Optimal Algorithms for Approximating Distributions by Histograms. In 34th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems, PODS 2015, pages 249-263, 2015b.  J. Acharya, I. Diakonikolas, J. Li, and L. Schmidt. Fast algorithms for segmented regression. In Pro- ceedings of the 33nd International Conference on Machine Learning, ICML 2016, pages 2878- 2886, 2016.  J. Acharya, I. Diakonikolas, J. Li, and L. Schmidt.  nearly-linear time. on Discrete Algorithms, SODA 2017, pages 1278-1289, 2017. https://arxiv.org/abs/1506.00671.  Sample-optimal density estimation in In Proceedings of the Twenty-Eighth Annual ACM-SIAM Symposium Full version available at  R.E. Barlow, D.J. Bartholomew, J.M. Bremner, and H.D. Brunk. Statistical Inference under Order  Restrictions. Wiley, New York, 1972.  T. Batu and C. L. Canonne. Generalized uniformity testing. In 58th IEEE Annual Symposium on  Foundations of Computer Science, FOCS 2017, pages 880-889, 2017.  T. Batu, L. Fortnow, R. Rubinfeld, W. D. Smith, and P. White. Testing that distributions are close.  In IEEE Symposium on Foundations of Computer Science, pages 259-269, 2000.  T. Batu, R. Kumar, and R. Rubinfeld. Sublinear algorithms for testing monotone and unimodal  distributions. In ACM Symposium on Theory of Computing, pages 381-390, 2004.  N. Bruno, S. Chaudhuri, and L. Gravano. Stholes: A multidimensional workload-aware histogram. In Proceedings of the 2001 ACM SIGMOD international conference on Management of data, pages 211-222, 2001.  C. L. Canonne. A survey on distribution testing: Your data is big. but is it blue? Electronic  Colloquium on Computational Complexity (ECCC), 22:63, 2015.  C. L. Canonne. Are few bins enough: Testing histogram distributions.  In Proceedings of the 35th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems, PODS 2016, pages 455-463, 2016.  13   TESTING IDENTITY OF MULTIDIMENSIONAL HISTOGRAMS  Acknowledgments  We thank Alistair Stewart for his contributions to the early stages of this work. Ilias Diakonikolas was supported by NSF Award CCF-1652862 (CAREER) and a Sloan Research Fellowship. Daniel Kane was supported by NSF Award CCF-1553288 (CAREER) and a Sloan Research Fellowship. John Peebles was supported by the NSF Graduate Research Fellowship under Grant 1122374, and by NSF Grant 1065125. Some of this research was performed while the third author was visiting USC, supported by a USC startup grant.  References  J. Acharya, C. Daskalakis, and G. Kamath. Optimal testing for properties of distributions.  In  Advances in Neural Information Processing Systems (NIPS), pages 3591-3599, 2015a.  J. Acharya, I. Diakonikolas, C. Hegde, J. Li, and L. Schmidt. Fast and Near-Optimal Algorithms for Approximating Distributions by Histograms. In 34th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems, PODS 2015, pages 249-263, 2015b.  J. Acharya, I. Diakonikolas, J. Li, and L. Schmidt. Fast algorithms for segmented regression. In Pro- ceedings of the 33nd International Conference on Machine Learning, ICML 2016, pages 2878- 2886, 2016.  J. Acharya, I. Diakonikolas, J. Li, and L. Schmidt.  nearly-linear time. on Discrete Algorithms, SODA 2017, pages 1278-1289, 2017. https://arxiv.org/abs/1506.00671.  Sample-optimal density estimation in In Proceedings of the Twenty-Eighth Annual ACM-SIAM Symposium Full version available at  R.E. Barlow, D.J. Bartholomew, J.M. Bremner, and H.D. Brunk. Statistical Inference under Order  Restrictions. Wiley, New York, 1972.  T. Batu and C. L. Canonne. Generalized uniformity testing. In 58th IEEE Annual Symposium on  Foundations of Computer Science, FOCS 2017, pages 880-889, 2017.  T. Batu, L. Fortnow, R. Rubinfeld, W. D. Smith, and P. White. Testing that distributions are close.  In IEEE Symposium on Foundations of Computer Science, pages 259-269, 2000.  T. Batu, R. Kumar, and R. Rubinfeld. Sublinear algorithms for testing monotone and unimodal  distributions. In ACM Symposium on Theory of Computing, pages 381-390, 2004.  N. Bruno, S. Chaudhuri, and L. Gravano. Stholes: A multidimensional workload-aware histogram. In Proceedings of the 2001 ACM SIGMOD international conference on Management of data, pages 211-222, 2001.  C. L. Canonne. A survey on distribution testing: Your data is big. but is it blue? Electronic  Colloquium on Computational Complexity (ECCC), 22:63, 2015.  C. L. Canonne. Are few bins enough: Testing histogram distributions.  In Proceedings of the 35th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems, PODS 2016, pages 455-463, 2016. TESTING IDENTITY OF MULTIDIMENSIONAL HISTOGRAMS  C. L. Canonne, I. Diakonikolas, T. Gouleakis, and R. Rubinfeld. Testing shape restrictions of discrete distributions. In 33rd Symposium on Theoretical Aspects of Computer Science, STACS 2016, pages 25:1-25:14, 2016.  C. L. Canonne, I. Diakonikolas, D. M. Kane, and A. Stewart. Testing bayesian networks.  In  Proceedings of the 30th Conference on Learning Theory, COLT 2017, pages 370-448, 2017a.  C. L. Canonne, I. Diakonikolas, D. M. Kane, and A. Stewart. Testing conditional independence of discrete distributions. CoRR, abs/1711.11560, 2017b. URL http://arxiv.org/abs/ 1711.11560. In STOC’18.  C. L. Canonne, I. Diakonikolas, and A. Stewart. Fourier-based testing for families of distributions.  CoRR, abs/1706.05738, 2017c. In NeurIPS 2018.  S. Chan, I. Diakonikolas, R. Servedio, and X. Sun. Learning mixtures of structured distributions  over discrete domains. In SODA, pages 1380-1394, 2013.  S. Chan, I. Diakonikolas, R. Servedio, and X. Sun. Efficient density estimation via piecewise  polynomial approximation. In STOC, pages 604-613, 2014a.  S. Chan, I. Diakonikolas, R. Servedio, and X. Sun. Near-optimal density estimation in near-linear  time using variable-width histograms. In NIPS, pages 1844-1852, 2014b.  S. Chan, I. Diakonikolas, P. Valiant, and G. Valiant. Optimal algorithms for testing closeness of  discrete distributions. In SODA, pages 1193-1203, 2014c.  S. Chaudhuri, R. Motwani, and V. R. Narasayya. Random sampling for histogram construction:  How much is enough? In SIGMOD Conference, pages 436-447, 1998.  G. Cormode, M. Garofalakis, P. J. Haas, and C. Jermaine. Synopses for massive data: Samples, histograms, wavelets, sketches. Found. Trends databases, 4:1-294, 2012. ISSN 1931-7883.  C. Daskalakis and Q. Pan. Square Hellinger subadditivity for Bayesian networks and its applications to identity testing. In Proceedings of the 30th Conference on Learning Theory, COLT 2017, pages 697-703, 2017.  C. Daskalakis, I. Diakonikolas, and R.A. Servedio. Learning k-modal distributions via testing. In  SODA, pages 1371-1385, 2012.  C. Daskalakis, I. Diakonikolas, R. Servedio, G. Valiant, and P. Valiant. Testing k-modal distribu-  tions: Optimal algorithms via reductions. In SODA, pages 1833-1852, 2013.  C. Daskalakis, N. Dikkala, and G. Kamath. Testing Ising models. In SODA, 2018.  L. Devroye and G. Lugosi. Bin width selection in multivariate histograms by the combinatorial  method. Test, 13(1):129-145, 2004.  I. Diakonikolas and D. M. Kane. A new approach for testing properties of discrete distributions. In  FOCS, pages 685-694, 2016. Full version available at abs/1601.05557. TESTING IDENTITY OF MULTIDIMENSIONAL HISTOGRAMS  I. Diakonikolas, M. Hardt, and L. Schmidt. Differentially private learning of structured discrete  distributions. In NIPS, pages 2566-2574, 2015a.  I. Diakonikolas, D. M. Kane, and V. Nikishkin. Testing identity of structured distributions.  In Proceedings of the Twenty-Sixth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2015, pages 1841-1854, 2015b.  I. Diakonikolas, D. M. Kane, and V. Nikishkin. Optimal algorithms and lower bounds for test- In IEEE 56th Annual Symposium on Foundations of  ing closeness of structured distributions. Computer Science, FOCS 2015, pages 1183-1202, 2015c.  I. Diakonikolas, T. Gouleakis, J. Peebles, and E. Price. Collision-based testers are optimal for uniformity and closeness. Electronic Colloquium on Computational Complexity (ECCC), 23: 178, 2016a.  I. Diakonikolas, D. M. Kane, and A. Stewart. Efficient robust proper learning of log-concave distri-  butions. CoRR, abs/1606.03077, 2016b.  I. Diakonikolas, D. M. Kane, and A. Stewart. Statistical query lower bounds for robust estimation of high-dimensional gaussians and gaussian mixtures. CoRR, abs/1611.03473, 2016c. URL http://arxiv.org/abs/1611.03473. In Proceedings of FOCS’17.  I. Diakonikolas, T. Gouleakis, J. Peebles, and E. Price. Sample-optimal identity testing with high  probability. CoRR, abs/1708.02728, 2017a. In ICALP 2018.  I. Diakonikolas, D. M. Kane, and V. Nikishkin. Near-optimal closeness testing of discrete histogram In 44th International Colloquium on Automata, Languages, and Programming,  distributions. ICALP 2017, pages 8:1-8:15, 2017b.  I. Diakonikolas, D. M. Kane, and A. Stewart. Sharp bounds for generalized uniformity testing. In Advances in Neural Information Processing Systems 31, NeurIPS 2018, pages 6204-6213, 2018a.  I. Diakonikolas, J. Li, and L. Schmidt. Fast and sample near-optimal algorithms for learning mul- tidimensional histograms. In S´ebastien Bubeck, Vianney Perchet, and Philippe Rigollet, editors, Proceedings of the 31st Conference On Learning Theory, volume 75 of Proceedings of Machine Learning Research, pages 819-842. PMLR, 2018b.  D. Freedman and P. Diaconis. On the histogram as a density estimator:l2 theory. Zeitschrift f¨ur  Wahrscheinlichkeitstheorie und Verwandte Gebiete, 57(4):453-476, 1981.  A. C. Gilbert, S. Guha, P. Indyk, Y. Kotidis, S. Muthukrishnan, and M. Strauss. Fast, small-space  algorithms for approximate histogram maintenance. In STOC, pages 389-398, 2002.  O. Goldreich.  Introduction to Property Testing. Forthcoming, 2017. URL http://www.  wisdom.weizmann.ac.il/˜oded/pt-intro.html.  O. Goldreich, S. Goldwasser, and D. Ron. Property testing and its connection to learning and  approximation. Journal of the ACM, 45:653-750, 1998.  U. Grenander. On the theory of mortality measurement. Skand. Aktuarietidskr., 39:125-153, 1956. TESTING IDENTITY OF MULTIDIMENSIONAL HISTOGRAMS  P. Groeneboom and G. Jongbloed. Nonparametric Estimation under Shape Constraints: Estimators,  Algorithms and Asymptotics. Cambridge University Press, 2014.  S. Guha, N. Koudas, and K. Shim. Approximation and streaming algorithms for histogram con-  struction problems. ACM Trans. Database Syst., 31(1):396-438, 2006.  D. Gunopulos, G. Kollios, V. J. Tsotras, and C. Domeniconi. Approximating multi-dimensional aggregate range queries over real attributes. In Proceedings of the 2000 ACM SIGMOD Interna- tional Conference on Management of Data, pages 463-474, 2000.  P. Indyk, R. Levi, and R. Rubinfeld. Approximating and Testing k-Histogram Distributions in Sub-  linear Time. In PODS, pages 15-22, 2012.  H. V. Jagadish, N. Koudas, S. Muthukrishnan, V. Poosala, K. C. Sevcik, and T. Suel. Optimal  histograms with quality guarantees. In VLDB, pages 275-286, 1998.  J. Klemela. Multivariate histograms with data-dependent partitions. Statistica Sinica, 19(1):159-  176, 2009.  G. Lugosi and A. Nobel. Consistency of data-driven histogram methods for density estimation and  classification. Ann. Statist., 24(2):687-706, 04 1996.  S. Muthukrishnan. Data streams: Algorithms and applications. Found. Trends Theor. Comput. Sci.,  1(2):117-236, 2005.  J. Neyman and E. S. Pearson. On the problem of the most efficient tests of statistical hypothe- ses. Philosophical Transactions of the Royal Society of London. Series A, Containing Papers of a Mathematical or Physical Character, 231(694-706):289-337, 1933. doi: 10.1098/rsta. 1933.0009. URL http://rsta.royalsocietypublishing.org/content/231/ 694-706/289.short.  L. Paninski. A coincidence-based test for uniformity given very sparsely-sampled discrete data.  IEEE Transactions on Information Theory, 54:4750-4755, 2008.  K. Pearson. On the criterion that a given system of deviations from the probable in the case of a correlated system of variables is such that it can be reasonably supposed to have arisen from random sampling. Philosophical Magazine Series 5, 50(302):157-175, 1900.  V. Poosala and Y. E. Ioannidis. Selectivity estimation without the attribute value independence In Proceedings of the 23rd International Conference on Very Large Data Bases, assumption. VLDB ’97, pages 486-495, San Francisco, CA, USA, 1997. Morgan Kaufmann Publishers Inc.  R. Rubinfeld. Taming big probability distributions. XRDS, 19(1):24-28, 2012.  R. Rubinfeld and M. Sudan. Robust characterizations of polynomials with applications to program  testing. SIAM J. on Comput., 25:252-271, 1996.  D. W. Scott. On optimal and data-based histograms. Biometrika, 66(3):605-610, 1979.  D.W. Scott. Multivariate Density Estimation: Theory, Practice and Visualization. Wiley, New York,  1992. TESTING IDENTITY OF MULTIDIMENSIONAL HISTOGRAMS  N. Thaper, S. Guha, P. Indyk, and N. Koudas. Dynamic multidimensional histograms. In SIGMOD  Conference, pages 428-439, 2002.  G. Valiant and P. Valiant. An automatic inequality prover and instance optimal identity testing. In  FOCS, 2014.  R. Willett and R. D. Nowak. Multiscale poisson intensity and density estimation. IEEE Transactions  on Information Theory, 53(9):3171-3187, 2007."}