{"1": "YC was supported by the Stanford Graduate Fellowship. JCD was supported by the NSF CAREER award 1553086, the Sloan Foundation and ONR-YIP N00014-19-1-2288. AS was supported by the NSF CAREER Award CCF-1844855. KT was supported by the NSF Graduate Fellowship DGE- 1656518.  Zeyuan Allen-Zhu and Yuanzhi Li. Follow the compressed leader: Faster online learning of eigen- In Proceedings of the 34th International Conference on Machine  vectors and faster mmwu. Learning, 2017.  Zeyuan Allen-Zhu, Yin Tat Lee, and Lorenzo Orecchia. Using optimization to obtain a width- independent, parallel, simpler, and faster positive sdp solver. In Proceedings of the twenty-seventh annual ACM-SIAM symposium on Discrete algorithms. Society for Industrial and Applied Math- ematics, 2016.  Horst Alzer. On some inequalities for the gamma and psi functions. Mathematics of Computation  of the American Mathematical Society, 66(217):373-389, 1997.  S. Arora, E. Hazan, and S. Kale. The multiplicative weights update method: a meta algorithm and  applications. Theory of Computing, 8(1):121-164, 2012.  Sanjeev Arora and Satyen Kale. A combinatorial, primal-dual approach to semidefinite programs. In Proceedings of the Thirty-Ninth Annual ACM Symposium on the Theory of Computing. ACM, 2007.  K. Azuma. Weighted sums of certain dependent random variables. Tohoku Mathematical Journal,  68:357-367, 1967.  Michel Baes, Michael Bürgisser, and Arkadi Nemirovski. A randomized mirror-prox method for solving structured large-scale matrix saddle-point problems. SIAM Journal on Optimization, 23 (2):934-962, 2013.  Sébastien Bubeck and Nicoló Cesa-Bianchi. Regret analysis of stochastic and nonstochastic multi-  armed bandit problems. Foundations and Trends in Machine Learning, 5(1):1-122, 2012.  N. Cesa-Bianchi, A. Conconi, and C. Gentile. On the generalization ability of on-line learning  algorithms. IEEE Transactions on Information Theory, 50(9):2050-2057, September 2004.  Michael B. Cohen, Yin Tat Lee, Gary L. Miller, Jakub W. Pachocki, and Aaron Sidford. Geometric  median in nearly linear time. arXiv:1606.05225 [cs.DS], 2016.  Alexandre d’Aspremont. Subsampling algorithms for semidefinite programming. Stochastic Sys-  tems, 1(2):209-436, 2011.  Vladimir Druskin and Leonid Knizhnerman. Error bounds in the simple Lanczos procedure for computing functions of symmetric matrices and eigenvalues. U.S.S.R. Computational Mathemat- ics and Mathematical Physics, 31(7):970-983, 1991.  13   A RANK-1 SKETCH FOR MATRIX MULTIPLICATIVE WEIGHTS  Acknowledgments  References  YC was supported by the Stanford Graduate Fellowship. JCD was supported by the NSF CAREER award 1553086, the Sloan Foundation and ONR-YIP N00014-19-1-2288. AS was supported by the NSF CAREER Award CCF-1844855. KT was supported by the NSF Graduate Fellowship DGE- 1656518.  Zeyuan Allen-Zhu and Yuanzhi Li. Follow the compressed leader: Faster online learning of eigen- In Proceedings of the 34th International Conference on Machine  vectors and faster mmwu. Learning, 2017.  Zeyuan Allen-Zhu, Yin Tat Lee, and Lorenzo Orecchia. Using optimization to obtain a width- independent, parallel, simpler, and faster positive sdp solver. In Proceedings of the twenty-seventh annual ACM-SIAM symposium on Discrete algorithms. Society for Industrial and Applied Math- ematics, 2016.  Horst Alzer. On some inequalities for the gamma and psi functions. Mathematics of Computation  of the American Mathematical Society, 66(217):373-389, 1997.  S. Arora, E. Hazan, and S. Kale. The multiplicative weights update method: a meta algorithm and  applications. Theory of Computing, 8(1):121-164, 2012.  Sanjeev Arora and Satyen Kale. A combinatorial, primal-dual approach to semidefinite programs. In Proceedings of the Thirty-Ninth Annual ACM Symposium on the Theory of Computing. ACM, 2007.  K. Azuma. Weighted sums of certain dependent random variables. Tohoku Mathematical Journal,  68:357-367, 1967.  Michel Baes, Michael Bürgisser, and Arkadi Nemirovski. A randomized mirror-prox method for solving structured large-scale matrix saddle-point problems. SIAM Journal on Optimization, 23 (2):934-962, 2013.  Sébastien Bubeck and Nicoló Cesa-Bianchi. Regret analysis of stochastic and nonstochastic multi-  armed bandit problems. Foundations and Trends in Machine Learning, 5(1):1-122, 2012.  N. Cesa-Bianchi, A. Conconi, and C. Gentile. On the generalization ability of on-line learning  algorithms. IEEE Transactions on Information Theory, 50(9):2050-2057, September 2004.  Michael B. Cohen, Yin Tat Lee, Gary L. Miller, Jakub W. Pachocki, and Aaron Sidford. Geometric  median in nearly linear time. arXiv:1606.05225 [cs.DS], 2016.  Alexandre d’Aspremont. Subsampling algorithms for semidefinite programming. Stochastic Sys-  tems, 1(2):209-436, 2011.  Vladimir Druskin and Leonid Knizhnerman. Error bounds in the simple Lanczos procedure for computing functions of symmetric matrices and eigenvalues. U.S.S.R. Computational Mathemat- ics and Mathematical Physics, 31(7):970-983, 1991. A RANK-1 SKETCH FOR MATRIX MULTIPLICATIVE WEIGHTS  Vladimir Druskin and Leonid Knizhnerman. Krylov subspace approximation of eigenpairs and matrix functions in exact and computer arithmetic. Numerical Linear Algebra with Applications, 2(3):205-217, 1995.  Cynthia Dwork, Kunal Talwar, Abhradeep Thakurta, and Li Zhang. Analyze Gauss: optimal bounds for privacy-preserving principal component analysis. In Proceedings of the Forty-Sixth Annual ACM Symposium on the Theory of Computing. ACM, 2014.  Dan Garber and Elad Hazan. Sublinear time algorithms for approximate semidefinite programming.  Math. Program., 158(1-2):329-361, 2016.  Dan Garber, Elad Hazan, and Tengyu Ma. Online learning of eigenvectors. In Proceedings of the  32nd International Conference on Machine Learning, 2015.  Ming Gu and Stanley C. Eisenstat. A divide-and-conquer algorithm for the symmetric tridiagonal  eigenproblem. SIAM Journal on Matrix Analysis and Applications, 16(1):172-191, 1995.  Elad Hazan. Introduction to online convex optimization. Foundations and Trends in Optimization,  2(3-4):157-325, 2016.  New York, 1993.  2010.  J. Hiriart-Urruty and C. Lemaréchal. Convex Analysis and Minimization Algorithms I & II. Springer,  Marlis Hochbruck and Alexander Ostermann. Exponential integrators. Acta Numerica, 19:209-286,  W. Hoeffding. Probability inequalities for sums of bounded random variables. Journal of the  American Statistical Association, 58(301):13-30, March 1963.  Arun Jambulapati, Kirankumar Shiragur, and Aaron Sidford. Efficient structured matrix recovery and nearly-linear time algorithms for solving inverse symmetric M-matrices. arXiv:1812.06295 [cs.DS], 2018.  A. Kalai and S. Vempala. Efficient algorithms for online decision problems. Journal of Computer  and System Sciences, 71(3):291-307, 2005.  Cornelius Lanczos. An iteration method for the solution of the eigenvalue problem of linear dif- ferential and integral operators. Journal of Research of the National Bureau of Standards, 45(4), 1950.  Adrian Lewis. Convex analysis on the Hermitian matrices. SIAM Journal on Optimization, 6:  164-177, 1996.  Adrian S. Lewis and Hristo S. Sendov. Twice differentiable spectral functions. SIAM Journal on  Matrix Analysis and Applications, 23(2):368-386, 2001.  Gérard Meurant. The Lanczos and Conjugate Gradient Algorithms: From Theory to Finite Precision  Computations. Society for Industrial and Applied Mathematics, 2006.  Cleve B. Moler and Charles Van Loan. Nineteen dubious ways to compute the exponential of a  matrix, twenty-five years later. SIAM Review, 45(1):3-49, 2003. A RANK-1 SKETCH FOR MATRIX MULTIPLICATIVE WEIGHTS  Cameron Musco, Christopher Musco, and Aaron Sidford. Stability of the Lanczos method for  matrix function approximation. arXiv:1708.07788 [cs.DS], 2017.  A. Nemirovski, A. Juditsky, G. Lan, and A. Shapiro. Robust stochastic approximation approach to  stochastic programming. SIAM Journal on Optimization, 19(4):1574-1609, 2009.  Arkadi Nemirovski. Prox-method with rate of convergence O(1/t) for variational inequalities with Lipschitz continuous monotone operators and smooth convex-concave saddle point problems. SIAM Journal on Optimization, 15(1):229-251, 2004.  Y. Nesterov. Primal-dual subgradient methods for convex problems. Mathematical Programming,  120(1):261-283, 2009.  Yurii Nesterov. Smoothing technique and its applications in semidefinite optimization. Mathemati-  cal Programming, Series A, 110:245-259, 2007.  Jiazhong Nie, Wojciech Kotłowski, and Manfred K Warmuth. Online PCA with optimal regrets. In Proceedings of the Twenty Sixth Annual Conference on Computational Learning Theory, 2013.  Lorenzo Orecchia, Sushant Sachdeva, and Nisheeth K. Vishnoi. Approximating the exponential, the lanczos method and an õ(m)-time spectral algorithm for balanced separator. In Proceedings of the Forty-Fourth Annual ACM Symposium on the Theory of Computing, 2012.  Victor Y Pan and Zhao Q Chen. The complexity of the matrix eigenproblem. In Proceedings of the  Thirty-First Annual ACM Symposium on the Theory of Computing. ACM, 1999.  Richard Peng, Kanat Tangwongsan, and Peng Zhang. Faster and simpler width-independent parallel  algorithms for positive semidefinite programming. arXiv:1201.5135v3 [cs.DS], 2016.  Yousef Saad. Analysis of some Krylov subspace approximations to the matrix exponential operator.  SIAM Journal on Numerical Analysis, 29(1):209-228, 1992.  Sushant Sachdeva and Nisheeth K. Vishnoi. Faster algorithms via approximation theory. Founda-  tions and Trends in Theoretical Computer Science, 9(2):125-210, 2014.  Shai Shalev-Shwartz. Online learning and online convex optimization. Foundations and Trends in  Machine Learning, 4(2):107-194, 2012.  Koji Tsuda, Gunnar Rätsch, and Manfred K Warmuth. Matrix exponentiated gradient updates for on-line learning and bregman projection. Journal of Machine Learning Research, 6:995-1018, 2005.  Lieven Vandenberghe, Martin S Andersen, et al. Chordal graphs and semidefinite optimization.  Foundations and Trends® in Optimization, 1(4):241-433, 2015.  Manfred K. Warmuth and Dima Kuzmin. Randomized online PCA algorithms with regret bounds that are logarithmic in the dimension. Journal of Machine Learning Research, 9:2287-2320, 2008.  Manfred K. Warmuth and Dima Kuzmin. Online variance minimization. Machine Learning, 87(1):  1-32, 2012. A RANK-1 SKETCH FOR MATRIX MULTIPLICATIVE WEIGHTS"}