{"1": "N. Agarwal, A. S. Bandeira, K. Koiliaris, and A. Kolla. Multisection in the stochastic block model  using semidefinite programming. arXiv 1507.02323, July 2015.  N. Alon, M. Krivelevich, and B. Sudakov. Finding a large hidden clique in a random graph. Random  Structures and Algorithms, 13(3-4):457-466, 1998.  Z.D. Bai and Y.Q. Yin. Necessary and sufficient conditions for almost sure convergence of the largest  eigenvalue of a Wigner matrix. The Annals of Probability, 16(4):1729-1741, 1988.  A. S. Bandeira and R. van Handel. Sharp nonasymptotic bounds on the norm of random matrices  with independent entries. arXiv 1408.6185, 2014.  A.S. Bandeira. Random Laplacian matrices and convex relaxations. arXiv 1504.03987, April, 2015.  S. Boucheron, G. Lugosi, and P. Massart. Concentration inequalities: A nonasymptotic theory of  independence. Oxford University Press, 2013.  S. Boyd and L. Vandenberghe. Convex Optimization. Cambridge University Press, New York, NY,  USA, 2004.  C. Butucea, Y.I. Ingster, and I. Suslina. Sharp variable selection of a sparse submatrix in a high-  dimensional noisy matrix. ESAIM: Probability and Statistics, 19:115-134, June 2015.  T. T. Cai, T. Liang, and A. Rakhlin. Computational and statistical boundaries for submatrix localiza-  tion in a large noisy matrix. arXiv:1502.01988, Feb. 2015.  Y. Chen and J. Xu. Statistical-computational tradeoffs in planted problems and submatrix localiza- tion with a growing number of clusters and submatrices. In Proceedings of ICML 2014 (Also arXiv:1402.1267), Feb 2014.  K.-L. Chung and P. Erd¨os. On the application of the Borel-Cantelli lemma. Transactions of the  American Mathematical Society, pages 179-186, 1952.  H.A. David and H.N. Nagaraja. Order Statistics. Wiley-Interscience, Hoboken, New Jersey, USA, 3  edition, 2003.  K.R. Davidson and S. Szarek. Local operator theory, random matrices and Banach spaces. In W.B. Johnson and J. Lindenstrauss, editors, Handbook on the Geometry of Banach Spaces, volume 1, pages 317-366. Elsevier Science, 2001.  Y. Deshpande and A. Montanari. Finding hidden cliques of size (cid:112)N/e in nearly linear time.  Foundations of Computational Mathematics, 15(4):1069-1128, August 2015a.  Y. Deshpande and A. Montanari. Improved sum-of-squares lower bounds for hidden clique and  hidden submatrix problems. In Proceedings of COLT 2015, pages 523-562, June 2015b.  U. Feige and R. Krauthgamer. Finding and certifying a large hidden clique in a semirandom graph.  Random Structures & Algorithms, 16(2):195-208, 2000.  29   SDP FOR HIDDEN COMMUNITY  References  N. Agarwal, A. S. Bandeira, K. Koiliaris, and A. Kolla. Multisection in the stochastic block model  using semidefinite programming. arXiv 1507.02323, July 2015.  N. Alon, M. Krivelevich, and B. Sudakov. Finding a large hidden clique in a random graph. Random  Structures and Algorithms, 13(3-4):457-466, 1998.  Z.D. Bai and Y.Q. Yin. Necessary and sufficient conditions for almost sure convergence of the largest  eigenvalue of a Wigner matrix. The Annals of Probability, 16(4):1729-1741, 1988.  A. S. Bandeira and R. van Handel. Sharp nonasymptotic bounds on the norm of random matrices  with independent entries. arXiv 1408.6185, 2014.  A.S. Bandeira. Random Laplacian matrices and convex relaxations. arXiv 1504.03987, April, 2015.  S. Boucheron, G. Lugosi, and P. Massart. Concentration inequalities: A nonasymptotic theory of  independence. Oxford University Press, 2013.  S. Boyd and L. Vandenberghe. Convex Optimization. Cambridge University Press, New York, NY,  USA, 2004.  C. Butucea, Y.I. Ingster, and I. Suslina. Sharp variable selection of a sparse submatrix in a high-  dimensional noisy matrix. ESAIM: Probability and Statistics, 19:115-134, June 2015.  T. T. Cai, T. Liang, and A. Rakhlin. Computational and statistical boundaries for submatrix localiza-  tion in a large noisy matrix. arXiv:1502.01988, Feb. 2015.  Y. Chen and J. Xu. Statistical-computational tradeoffs in planted problems and submatrix localiza- tion with a growing number of clusters and submatrices. In Proceedings of ICML 2014 (Also arXiv:1402.1267), Feb 2014.  K.-L. Chung and P. Erd¨os. On the application of the Borel-Cantelli lemma. Transactions of the  American Mathematical Society, pages 179-186, 1952.  H.A. David and H.N. Nagaraja. Order Statistics. Wiley-Interscience, Hoboken, New Jersey, USA, 3  edition, 2003.  K.R. Davidson and S. Szarek. Local operator theory, random matrices and Banach spaces. In W.B. Johnson and J. Lindenstrauss, editors, Handbook on the Geometry of Banach Spaces, volume 1, pages 317-366. Elsevier Science, 2001.  Y. Deshpande and A. Montanari. Finding hidden cliques of size (cid:112)N/e in nearly linear time.  Foundations of Computational Mathematics, 15(4):1069-1128, August 2015a.  Y. Deshpande and A. Montanari. Improved sum-of-squares lower bounds for hidden clique and  hidden submatrix problems. In Proceedings of COLT 2015, pages 523-562, June 2015b.  U. Feige and R. Krauthgamer. Finding and certifying a large hidden clique in a semirandom graph.  Random Structures & Algorithms, 16(2):195-208, 2000. HAJEK WU XU  U. Feige and R. Krauthgamer. The probable value of the Lov´asz-Schrijver relaxations for maximum  independent set. SIAM Journal on Computing, 32(2):345-370, 2003.  B. Hajek, Y. Wu, and J. Xu. Computational lower bounds for community detection on random graphs.  In Proceedings of COLT 2015, June 2015a.  B. Hajek, Y. Wu, and J. Xu. Achieving exact cluster recovery threshold via semidefinite programming:  Extensions. arXiv 1502.07738, Feb. 2015b.  B. Hajek, Y. Wu, and J. Xu. Submatrix localization via message passing. arXiv 1510.09219, October  2015c.  B. Hajek, Y. Wu, and J. Xu. Recovering a hidden community beyond the spectral limit in  O(|E| log∗ |V |) time. arXiv 1510.02786, October 2015d.  B. Hajek, Y. Wu, and J. Xu. Information limits for recovering a hidden community. arXiv 1509.07859,  September 2015e.  B. Hajek, Y. Wu, and J. Xu. Achieving exact cluster recovery threshold via semidefinite programming. IEEE Transactions on Information Theory, 62(5):2788-2797, May 2016. (arXiv 1412.6156 Nov. 2014).  P. W. Holland, K. B. Laskey, and S. Leinhardt. Stochastic blockmodels: First steps. Social Networks,  5(2):109-137, 1983.  S. B. Hopkins, P. K. Kothari, and A. Potechin. SoS and planted clique: Tight analysis of MPW moments at all degrees and an optimal lower bound at degree four. arXiv 1507.05230, July 2015.  R.M. Karp. Reducibility among combinatorial problems. In R.E. Miller and J.W. Thacher, editors, Proceedings of a Symposium on the Complexity of Computer Computations, pages 85-103. Plenum Press, March 1972.  M. Kolar, S. Balakrishnan, A. Rinaldo, and A. Singh. Minimax localization of structural information  in large noisy matrices. In Advances in Neural Information Processing Systems, 2011.  R. Krauthgamer, B. Nadler, and D. Vilenchik. Do semidefinite relaxations solve sparse PCA up to  the information limit? The Annals of Statistics, 43(3):1300-1322, June 2015.  R. Latała. Some estimates of norms of random matrices. Proceedings of the American Mathematical  Society, 133(5):1273-1282, 2005.  C. M. Le and R. Vershynin. Concentration and regularization of random graphs. arXiv:1506.00669,  June 2015.  43(3):1089-1116, 2015.  Z. Ma and Y. Wu. Computational barriers in minimax submatrix detection. The Annals of Statistics,  F. McSherry. Spectral partitioning of random graphs. In 42nd IEEE Symposium on Foundations of  Computer Science, pages 529 - 537, Oct. 2001. SDP FOR HIDDEN COMMUNITY  R. Meka, A. Potechin, and A. Wigderson. Sum-of-squares lower bounds for planted clique. In Proceedings of the Forty-Seventh Annual ACM on Symposium on Theory of Computing, STOC ’15, pages 87-96, New York, NY, USA, 2015. ACM.  A. Montanari. Finding one community in a sparse random graph. Journal of Statistical Physics, 161  (2):273-299, 2015. arXiv 1502.05680.  A. Montanari and S. Sen. Semidefinite programs on sparse random graphs. arXiv:1504.05910, April,  W. Perry and A.S. Wein. A semidefinite program for unbalanced multisection in the stochastic block  model. arXiv 1507.05605, July 2015.  P. Raghavendra and T. Schramm. Tight lower bounds for planted clique in the degree-4 SOS program.  arXiv:1507.05136, July 2015.  A. A. Shabalin, V. J. Weigman, C. M. Perou, and A. B Nobel. Finding large average submatrices in  high dimensional data. The Annals of Applied Statistics, 3(3):985-1012, 2009.  T. Tao. Topics in random matrix theory. American Mathematical Society, Providence, RI, USA,  2015.  2012.  R. K. Vinayak, S. Oymak, and B. Hassibi. Sharp performance bounds for graph clustering via convex optimization. In 38th International Conference on Acoustics, Speech, and Signal Processing (ICASSP), 2014.  V. H. Vu. Spectral norm of random matrices. Combinatorica, 27(6):721-736, 2007.  ISSN 0209-9683. doi: 10.1007/s00493-007-2190-z. URL http://dx.doi.org/10.1007/ s00493-007-2190-z.  A. M. Zubkov and A. A. Serov. A complete proof of universal inequalities for the distribution function of the binomial law. Theory of Probability & Its Applications, 57(3):539-544, 2013."}