{"1": "M. A. Arcones. A Bernstein-type inequality for U-statistics and U-processes. Statistics and Proba-  bility Letters, 22(3):239-247, 1995.  J. Y. Audibert, R. Munos, and C. Szepesv´ari. Exploration-exploitation tradeoff using variance esti-  mates in multi-armed bandits. Theoretical Computer Science, 410(19):1876-1902, 2009.  A. C. Berry. The accuracy of the Gaussian approximation to the sum of independent variates. Trans-  actions of the American Mathematical Society, 49(1):122-136, 1941.  K. Binder. Applications of Monte Carlo methods to statistical physics. Reports on Progress in  Physics, 60(5):487, 1997.  S. Boucheron, G. Lugosi, P. Massart. Concentration Inequalities, Oxford University Press, 2013.  Q. Cao, Z. C. Guo, and Y. Ying. Generalization bounds for metric and similarity learning. Machine  Learning, 102(1):115-132, 2016.  S. Chatterjee. A new method of normal approximation. The Annals of Probability, 36.4:1584-1610,  L. H. Chen, L. Goldstein, and Q. M. Shao. Normal approximation by Stein’s method. Springer  2008.  Science and Business Media, 2010.  Annals of Statistics, 844-874, 2008.  S. Cl´emenc¸on, G. Lugosi, and N. Vayatis. Ranking and empirical minimization of U-statistics. The  B. Efron and C. Stein. The jackknife estimate of variance. The Annals of Statistics, 586-596, 1981.  W. Hoeffding. A class of statistics with asymptotically normal distribution. The Annals of Mathe-  matical Statistics, 293-325, 1948.  C. Houdr´e. The iterated jackknife estimate of variance. Statistics and Probability Letters, 35(2):197-  201, 1997.  220(4598):671-680, 1983.  S. Kirkpatrick, C. D. Gelatt, and M. P. Vecchi. Optimization by simulated annealing. Science,  A. Maurer. Concentration inequalities for functions of independent variables. Random Structures  and Algorithms 29:121-138, 2006.  A. Maurer and M. Pontil. Empirical Bernstein bounds and sample variance penalization. In COLT.  2009.  2017.  A. Maurer. A Second-order Look at Stability and Generalization. Conference on Learning Theory.  A. Maurer. A Bernstein-type inequality for functions of bounded interaction. Bernoulli (Forthcom-  ing), (see also arXiv preprint arXiv:1701.06191).  13   SHORT TITLE  References  M. A. Arcones. A Bernstein-type inequality for U-statistics and U-processes. Statistics and Proba-  bility Letters, 22(3):239-247, 1995.  J. Y. Audibert, R. Munos, and C. Szepesv´ari. Exploration-exploitation tradeoff using variance esti-  mates in multi-armed bandits. Theoretical Computer Science, 410(19):1876-1902, 2009.  A. C. Berry. The accuracy of the Gaussian approximation to the sum of independent variates. Trans-  actions of the American Mathematical Society, 49(1):122-136, 1941.  K. Binder. Applications of Monte Carlo methods to statistical physics. Reports on Progress in  Physics, 60(5):487, 1997.  S. Boucheron, G. Lugosi, P. Massart. Concentration Inequalities, Oxford University Press, 2013.  Q. Cao, Z. C. Guo, and Y. Ying. Generalization bounds for metric and similarity learning. Machine  Learning, 102(1):115-132, 2016.  S. Chatterjee. A new method of normal approximation. The Annals of Probability, 36.4:1584-1610,  L. H. Chen, L. Goldstein, and Q. M. Shao. Normal approximation by Stein’s method. Springer  2008.  Science and Business Media, 2010.  Annals of Statistics, 844-874, 2008.  S. Cl´emenc¸on, G. Lugosi, and N. Vayatis. Ranking and empirical minimization of U-statistics. The  B. Efron and C. Stein. The jackknife estimate of variance. The Annals of Statistics, 586-596, 1981.  W. Hoeffding. A class of statistics with asymptotically normal distribution. The Annals of Mathe-  matical Statistics, 293-325, 1948.  C. Houdr´e. The iterated jackknife estimate of variance. Statistics and Probability Letters, 35(2):197-  201, 1997.  220(4598):671-680, 1983.  S. Kirkpatrick, C. D. Gelatt, and M. P. Vecchi. Optimization by simulated annealing. Science,  A. Maurer. Concentration inequalities for functions of independent variables. Random Structures  and Algorithms 29:121-138, 2006.  A. Maurer and M. Pontil. Empirical Bernstein bounds and sample variance penalization. In COLT.  2009.  2017.  A. Maurer. A Second-order Look at Stability and Generalization. Conference on Learning Theory.  A. Maurer. A Bernstein-type inequality for functions of bounded interaction. Bernoulli (Forthcom-  ing), (see also arXiv preprint arXiv:1701.06191). SHORT TITLE  C. McDiarmid. Concentration. In Probabilistic Methods of Algorithmic Discrete Mathematics, p.  195-248. Springer, Berlin, 1998.  T. Peel, S. Anthoine, and L. Ralaivola. Empirical Bernstein inequalities for u-statistics. In Advances  in Neural Information Processing Systems, pp. 1903-1911, 2010.  M. Raginsky, A. Rakhlin, and M. Telgarsky. Non-convex learning via Stochastic Gradient Langevin  Dynamics: a nonasymptotic analysis. arXiv preprint arXiv:1702.03849.  J. M. Steele. An Efron-Stein inequality for nonsymmetric statistics, Annals of Statistics 14:753-758,  1986.  R. V. Mises. On the asymptotic distribution of differentiable statistical functions. The Annals of  Mathematical Statistics, 18(3):309-348, 1947.  The"}