{"1": "Nir Ailon, Moses Charikar, and Alantha Newman. Aggregating inconsistent information: Ranking  and clustering. J. ACM, 55(5):23:1-23:27, November 2008.  G D Bader and C W Hogue. An automated method for finding molecular complexes in large protein  interaction networks. BMC Bioinformatics, 4(1):2, 2003.  Maria-Florina Balcan and Mark Braverman. Finding low error clusterings. In Conference on Learn-  ing Theory (COLT), 2009.  (1-3):89-113, 2004.  Nikhil Bansal, Avrim Blum, and Shuchi Chawla. Correlation clustering. Machine Learning, 56  Amir Ben-Dor, Ron Shamir, and Zohar Yakhini. Clustering gene expression patterns. Journal of  Computational Biology, 6(3/4):281-297, 1999.  Avrim Blum and Joel Spencer. Coloring random and semi-random k-colorable graphs. J. Algo-  rithms, 19:204-234, September 1995.  Steven Kay Butler. Eigenvalues and structures of graphs. PhD thesis, UC San Diego, 2008.  Moses Charikar, Venkatesan Guruswami, and Anthony Wirth. Clustering with qualitative informa-  tion. J. Comput. Syst. Sci., 71(3):360-383, October 2005.  Shuchi Chawla, Konstantin Makarychev, Tselil Schramm, and Grigory Yaroslavtsev. Near opti- mal LP rounding algorithm for correlation clustering on complete and complete k-partite graphs. CoRR, abs/1412.0681, 2014.  Yudong Chen, Sujay Sanghavi, and Huan Xu. Clustering sparse graphs. In F. Pereira, C.J.C. Burges, L. Bottou, and K.Q. Weinberger, editors, Advances in Neural Information Processing Systems 25, pages 2204-2212. Curran Associates, Inc., 2012.  Yudong Chen, Ali Jalali, Sujay Sanghavi, and Huan Xu. Clustering partially observed graphs via  convex optimization. Journal of Machine Learning Research, 15:2213-2238, 2014.  Erik D. Demaine, Dotan Emanuel, Amos Fiat, and Nicole Immorlica. Correlation clustering in general weighted graphs. Theoretical Computer Science, 361:172-187, 2006. Approximation and Online Algorithms.  Micha Elsner and Warren Schudy. Bounding and comparing methods for correlation clustering be- yond ilp. In Proceedings of the Workshop on Integer Linear Programming for Natural Langauge Processing, ILP ’09, pages 19-27, 2009.  Uriel Feige and Joe Kilian. Heuristics for finding large independent sets, with applications to col- oring semi-random graphs. In Proceedings of Symposium on Foundations of Computer Science, pages 674-683, 1998.  Uriel Feige and Robert Krauthgamer. Finding and certifying a large hidden clique in a semirandom  graph. Random Struct. Algorithms, 16:195-208, March 2000.  13   CORRELATION CLUSTERING  References  Nir Ailon, Moses Charikar, and Alantha Newman. Aggregating inconsistent information: Ranking  and clustering. J. ACM, 55(5):23:1-23:27, November 2008.  G D Bader and C W Hogue. An automated method for finding molecular complexes in large protein  interaction networks. BMC Bioinformatics, 4(1):2, 2003.  Maria-Florina Balcan and Mark Braverman. Finding low error clusterings. In Conference on Learn-  ing Theory (COLT), 2009.  (1-3):89-113, 2004.  Nikhil Bansal, Avrim Blum, and Shuchi Chawla. Correlation clustering. Machine Learning, 56  Amir Ben-Dor, Ron Shamir, and Zohar Yakhini. Clustering gene expression patterns. Journal of  Computational Biology, 6(3/4):281-297, 1999.  Avrim Blum and Joel Spencer. Coloring random and semi-random k-colorable graphs. J. Algo-  rithms, 19:204-234, September 1995.  Steven Kay Butler. Eigenvalues and structures of graphs. PhD thesis, UC San Diego, 2008.  Moses Charikar, Venkatesan Guruswami, and Anthony Wirth. Clustering with qualitative informa-  tion. J. Comput. Syst. Sci., 71(3):360-383, October 2005.  Shuchi Chawla, Konstantin Makarychev, Tselil Schramm, and Grigory Yaroslavtsev. Near opti- mal LP rounding algorithm for correlation clustering on complete and complete k-partite graphs. CoRR, abs/1412.0681, 2014.  Yudong Chen, Sujay Sanghavi, and Huan Xu. Clustering sparse graphs. In F. Pereira, C.J.C. Burges, L. Bottou, and K.Q. Weinberger, editors, Advances in Neural Information Processing Systems 25, pages 2204-2212. Curran Associates, Inc., 2012.  Yudong Chen, Ali Jalali, Sujay Sanghavi, and Huan Xu. Clustering partially observed graphs via  convex optimization. Journal of Machine Learning Research, 15:2213-2238, 2014.  Erik D. Demaine, Dotan Emanuel, Amos Fiat, and Nicole Immorlica. Correlation clustering in general weighted graphs. Theoretical Computer Science, 361:172-187, 2006. Approximation and Online Algorithms.  Micha Elsner and Warren Schudy. Bounding and comparing methods for correlation clustering be- yond ilp. In Proceedings of the Workshop on Integer Linear Programming for Natural Langauge Processing, ILP ’09, pages 19-27, 2009.  Uriel Feige and Joe Kilian. Heuristics for finding large independent sets, with applications to col- oring semi-random graphs. In Proceedings of Symposium on Foundations of Computer Science, pages 674-683, 1998.  Uriel Feige and Robert Krauthgamer. Finding and certifying a large hidden clique in a semirandom  graph. Random Struct. Algorithms, 16:195-208, March 2000. MAKARYCHEV MAKARYCHEV VIJAYARAGHAVAN  Santo Fortunato. Community detection in graphs. Physics Reports, 486:75-174, 2010.  David A Freedman. On tail probabilities for martingales. The Annals of Probability, pages 100-118,  1975.  Naveen Garg, Vijay V. Vazirani, and Mihalis Yannakakis. Approximate max-ﬂow min-(multi)cut theorems and their applications. In Proceedings of Symposium on Theory of Computing, pages 698-707, 1993.  M. Girvan and M. E. J. Newman. Community structure in social and biological networks. Proceed-  ings of the National Academy of Sciences, 99(12):7821-7826, 2002.  Amir Globerson, Tim Roughgarden, David Sontag, and Cafer Yildirim. Tight error bounds for  structured prediction. CoRR, abs/1409.5834, 2014.  Brian Karrer and M. E. J. Newman. Stochastic blockmodels and community structure in networks.  Phys. Rev. E, 83:016107, Jan 2011.  Alexandra Kolla, Konstantin Makarychev, and Yury Makarychev. How to play unique games against In Proceeding of  a semi-random adversary: Study of semi-random models of unique games. Symposium on Foundations of Computer Science, pages 443-452, 2011.  Ravi Kumar, Prabhakar Raghavan, Sridhar Rajagopalan, and Andrew Tomkins. Trawling the web  for emerging cyber-communities. In Computer Networks, pages 1481-1493, 1999.  Konstantin Makarychev, Yury Makarychev, and Aravindan Vijayaraghavan. Approximation al- In Proceedings of Symposium on Theory of  gorithms for semi-random partitioning problems. Computing, pages 367-384, 2012.  Konstantin Makarychev, Yury Makarychev, and Aravindan Vijayaraghavan. Sorting noisy data with partial information. In Proceedings of the 4th Conference on Innovations in Theoretical Computer Science, pages 515-528, 2013.  Konstantin Makarychev, Yury Makarychev, and Aravindan Vijayaraghavan. Constant factor ap- proximation for balanced cut in the random PIE model. In Proceedings of Symposium on Theory of Computing, 2014.  Claire Mathieu and Warren Schudy. Correlation clustering with noisy input.  In Proceedings of  Symposium on Discrete Algorithms, pages 712-728, 2010.  Mark Newman, Albert-Laszlo Barabasi, and Duncan J. Watts. The Structure and Dynamics of Networks: (Princeton Studies in Complexity). Princeton University Press, Princeton, NJ, USA, 2006.  Sebastian Nowozin and Christoph H. Lampert. Structured learning and prediction in computer  vision. Foundations and Trends in Computer Graphics and Vision, 6(34):185-365, 2010.  Noah A. Smith. Linguistic Structure Prediction. Synthesis Lectures on Human Language Tech-  nologies. Morgan and Claypool, May 2011. CORRELATION CLUSTERING  Chaitanya Swamy. Correlation clustering: Maximizing agreements via semidefinite programming.  In Proceedings of Symposium on Discrete Algorithms, pages 526-527, 2004.  Ben Taskar, Ming-fai Wong, Pieter Abbeel, and Daphne Koller. Link prediction in relational data. In S. Thrun, L. Saul, and B. Sch¨olkopf, editors, Advances in Neural Information Processing Systems (NIPS) 16. Cambridge, MA: MIT Press, 2004.  Julian Yarkony, Alexander T. Ihler, and Charless C. Fowlkes. Fast planar correlation clustering for image segmentation. In 12th European Conference on Computer Vision (ECCV), pages 568-581, 2012.  Xinyuan Zhao, Defeng Sun, and Kim-Chuan Toh. A newton-cg augmented lagrangian method for  semidefinite programming. SIAM J. Optimization, 20:1737-1765, 2010."}