{"1": "N. Alon. On the density of sets of vectors. Discrete Mathematics, 46(2):199-202, 1983.  S. Ben-David, N. Cesa-Bianchi, D. Haussler, and P. M. Long. Characterizations of learnability for classes of {0, ..., n}-valued functions. Journal of Computer and System Sciences, 50(1):74-86, 1995.  A. Blumer, A. Ehrenfeucht, D. Haussler, and M. K. Warmuth. Learnability and the Vapnik-  Chervonenkis dimension. Journal of the ACM, 36(4):929-965, 1989.  A. Daniely, S. Sabato, S. Ben-David, and S. Shalev-Shwartz. Multiclass learnability and the ERM  principle. In COLT, volume 19 of JMLR Proceedings, pages 207-232. JMLR.org, 2011.  S. Floyd and M. K. Warmuth. Sample compression, learnability, and the Vapnik-Chervonenkis  dimension. Machine Learning, 21(3):269-304, 1995.  S. A. Goldman and M. J. Kearns. On the complexity of teaching. Journal of Computer and System  Sciences, 50:20-31, 1995.  L. Gurvits. Linear algebraic proofs of VC-dimension based inequalities.  In Proceedings of the Third European Conference on Computational Learning Theory, EuroCOLT ’97, pages 238-250, London, UK, 1997. Springer-Verlag.  D. Haussler and P. M. Long. A generalization of Sauer’s lemma. Journal of Combinatorial Theory,  Series A, 71(2):219-240, 1995.  N. Littlestone and M. Warmuth. Relating data compression and learnability. unpublished notes,  1986.  B. K. Natarajan. On learning sets and functions. Machine Learning, 4(1):67-97, 1989.  D. Pollard. Empirical Processes: Theory and Applications. NSF-CBMS Regional Conference Series  in Probability and Statistics, 2:pp. i-iii+v+vii-viii+1-86, 1990.  B. I. P. Rubinstein, P. L. Bartlett, and J. H. Rubinstein. Shifting: One-inclusion mistake bounds and  sample compression. Journal of Computer and System Sciences, 75(1):37-59, 2009.  N. Sauer. On the density of families of sets. J. Comb. Theory, Ser. A, 13(1):145-147, 1972.  A. Shinohara and S. Miyano. Teachability in computational learning. New Generation Computing,  8(4):337-347, 1991.  Letters, 110(8-9):341-344, 2010.  (4):299-300, 1997.  H. U. Simon and B. Sz¨or´enyi. One-inclusion hypergraph density revisited. Information Processing  R. Smolensky. Well-known bound for the VC-dimension made easy. Computational Complexity, 6  14   SAMEI SEMUKHIN YANG ZILLES  References  N. Alon. On the density of sets of vectors. Discrete Mathematics, 46(2):199-202, 1983.  S. Ben-David, N. Cesa-Bianchi, D. Haussler, and P. M. Long. Characterizations of learnability for classes of {0, ..., n}-valued functions. Journal of Computer and System Sciences, 50(1):74-86, 1995.  A. Blumer, A. Ehrenfeucht, D. Haussler, and M. K. Warmuth. Learnability and the Vapnik-  Chervonenkis dimension. Journal of the ACM, 36(4):929-965, 1989.  A. Daniely, S. Sabato, S. Ben-David, and S. Shalev-Shwartz. Multiclass learnability and the ERM  principle. In COLT, volume 19 of JMLR Proceedings, pages 207-232. JMLR.org, 2011.  S. Floyd and M. K. Warmuth. Sample compression, learnability, and the Vapnik-Chervonenkis  dimension. Machine Learning, 21(3):269-304, 1995.  S. A. Goldman and M. J. Kearns. On the complexity of teaching. Journal of Computer and System  Sciences, 50:20-31, 1995.  L. Gurvits. Linear algebraic proofs of VC-dimension based inequalities.  In Proceedings of the Third European Conference on Computational Learning Theory, EuroCOLT ’97, pages 238-250, London, UK, 1997. Springer-Verlag.  D. Haussler and P. M. Long. A generalization of Sauer’s lemma. Journal of Combinatorial Theory,  Series A, 71(2):219-240, 1995.  N. Littlestone and M. Warmuth. Relating data compression and learnability. unpublished notes,  1986.  B. K. Natarajan. On learning sets and functions. Machine Learning, 4(1):67-97, 1989.  D. Pollard. Empirical Processes: Theory and Applications. NSF-CBMS Regional Conference Series  in Probability and Statistics, 2:pp. i-iii+v+vii-viii+1-86, 1990.  B. I. P. Rubinstein, P. L. Bartlett, and J. H. Rubinstein. Shifting: One-inclusion mistake bounds and  sample compression. Journal of Computer and System Sciences, 75(1):37-59, 2009.  N. Sauer. On the density of families of sets. J. Comb. Theory, Ser. A, 13(1):145-147, 1972.  A. Shinohara and S. Miyano. Teachability in computational learning. New Generation Computing,  8(4):337-347, 1991.  Letters, 110(8-9):341-344, 2010.  (4):299-300, 1997.  H. U. Simon and B. Sz¨or´enyi. One-inclusion hypergraph density revisited. Information Processing  R. Smolensky. Well-known bound for the VC-dimension made easy. Computational Complexity, 6 SAMPLE COMPRESSION FOR MULTI-LABEL CONCEPT CLASSES  V. N. Vapnik. Inductive principles of the search for empirical dependences (methods based on weak In Proceedings of the 2nd Annual Workshop on Com- convergence of probability measures). putational Learning Theory, COLT ’89, pages 3-21, San Francisco, CA, USA, 1989. Morgan Kaufmann Publishers Inc.  E. Welzl. Complete range spaces. unpublished notes, 1987.  E. Welzl and G. Woeginger. On Vapnik-Chervonenkis dimension one. unpublished notes, 1987."}