{"1": "Noga Alon, Roi Livni, Maryanthe Malliaris, and Shay Moran. Private PAC learning implies fi- nite littlestone dimension. CoRR, abs/1806.00949, 2018. URL http://arxiv.org/abs/ 1806.00949. To appear at STOC’19.  Raef Bassily, Adam Smith, and Abhradeep Thakurta. Private empirical risk minimization: Efficient algorithms and tight error bounds. In FOCS, pages 464-473, 2014. URL http://dx.doi. org/10.1109/FOCS.2014.56.  Raef Bassily, Abhradeep Guha Thakurta, and Om Dipakbhai Thakkar. Model-agnostic private In Samy Bengio, Hanna M. Wallach, Hugo Larochelle, Kristen Grauman, Nicol`o learning. Cesa-Bianchi, and Roman Garnett, editors, NeurIPS, pages 7102-7112, 2018. URL http: //papers.nips.cc/paper/7941-model-agnostic-private-learning.  Amos Beimel, Kobbi Nissim, and Uri Stemmer. Characterizing the sample complexity of private  learners. In ITCS, pages 97-110. ACM, 2013a.  Amos Beimel, Kobbi Nissim, and Uri Stemmer. Private learning and sanitization: Pure vs. approx- imate differential privacy. In APPROX-RANDOM, volume 8096 of Lecture Notes in Computer  12   PRIVATE CENTER POINTS AND LEARNING OF HALFSPACES  δ + log∗ T ).  By Bun et al. (2015), finding a point in the convex hull (even for d = 1) requires sam- ple complexity Ω(log∗ T ). Thus, together we get a lower bound on the sample complexity of Ω( d  ε log 1 It may be tempting to guess that, even with pure (ε, 0)-differential privacy, a sample complexity of O(log |X|) = O(d log T ) should suffice for solving this task, as the size of the output space is T d, because S ⊆ [T ]d, and hence (it seems) that one could privately solve this problem using the exponential mechanism of McSherry and Talwar (2007) with sample complexity that depends logarithmically on the size of the output space. We show that this is not the case, and that any (ε, 0)-differentially private algorithm for this task must have sample complexity Ω( d2  ε log T ).  Theorem 24 Let T ≥ 2, and d ≥ 10. Let A be an (ε, δ)-differentially private algorithm that takes a database S ⊆ [T ]d of size m and returns, with probability at least 1/2, a non-trivial linear combination of the points in S. Then, m = Ω min  (cid:110) d2  (cid:111)(cid:17)  (cid:16)  .  ε log T, d  ε log 1  δ  The proof of Theorem 24 builds on the analysis of Blum et al. (2008) for lower bounding the sample complexity of releasing approximate answers for counting queries. See the full version of this work for more details.  Acknowledgments  A. B. and K. N. were supported by NSF grant no. 1565387. TWC: Large: Collaborative: Computing Over Distributed Sensitive Data. A. B. was supported by ISF grant no. 152/17. Work done while A. B. was visiting Georgetown University. S. M. was supported by the Simons Foundation and the NSF; part of this project was carried while Shay was at the Institute for Advanced Study and was supported by the National Science Foundation under agreement No. CCF-1412958. U. S. was supported by a gift from Google Ltd.  References  Noga Alon, Roi Livni, Maryanthe Malliaris, and Shay Moran. Private PAC learning implies fi- nite littlestone dimension. CoRR, abs/1806.00949, 2018. URL http://arxiv.org/abs/ 1806.00949. To appear at STOC’19.  Raef Bassily, Adam Smith, and Abhradeep Thakurta. Private empirical risk minimization: Efficient algorithms and tight error bounds. In FOCS, pages 464-473, 2014. URL http://dx.doi. org/10.1109/FOCS.2014.56.  Raef Bassily, Abhradeep Guha Thakurta, and Om Dipakbhai Thakkar. Model-agnostic private In Samy Bengio, Hanna M. Wallach, Hugo Larochelle, Kristen Grauman, Nicol`o learning. Cesa-Bianchi, and Roman Garnett, editors, NeurIPS, pages 7102-7112, 2018. URL http: //papers.nips.cc/paper/7941-model-agnostic-private-learning.  Amos Beimel, Kobbi Nissim, and Uri Stemmer. Characterizing the sample complexity of private  learners. In ITCS, pages 97-110. ACM, 2013a.  Amos Beimel, Kobbi Nissim, and Uri Stemmer. Private learning and sanitization: Pure vs. approx- imate differential privacy. In APPROX-RANDOM, volume 8096 of Lecture Notes in Computer PRIVATE CENTER POINTS AND LEARNING OF HALFSPACES  Science, pages 363-378. Springer, 2013b. Journal version:Theory of Computing, 12(1):1-61, 2016.  Amos Beimel, Hai Brenner, Shiva Prasad Kasiviswanathan, and Kobbi Nissim. Bounds on the sample complexity for private learning and private data release. Machine Learning, 94(3):401- 437, 2014.  Amos Beimel, Kobbi Nissim, and Uri Stemmer. Learning privately with labeled and unlabeled  examples. In SODA, pages 461-477. SIAM, 2015.  Shai Ben-David and Ami Litman. Combinatorial variability of vapnik-chervonenkis classes with applications to sample compression schemes. Discrete Applied Mathematics, 86(1):3-25, 1998. URL https://doi.org/10.1016/S0166-218X(98)00000-6.  Avrim Blum, Cynthia Dwork, Frank McSherry, and Kobbi Nissim. Practical privacy: The SuLQ  framework. In Chen Li, editor, PODS, pages 128-138. ACM, 2005.  Avrim Blum, Katrina Ligett, and Aaron Roth. A learning theory approach to non-interactive  database privacy. In STOC, pages 609-618. ACM, 2008.  Mark Bun. New Separations in the Complexity of Differential Privacy. PhD thesis, Harvard Uni-  versity, 2016. Supervisor-Salil Vadhan.  Mark Bun and Mark Zhandry. Order-revealing encryption and the hardness of private learning. In Eyal Kushilevitz and Tal Malkin, editors, TCC 2016-A, volume 9562 of Lecture Notes in Computer Science, pages 176-206. Springer, 2016. URL https://doi.org/10.1007/ 978-3-662-49096-9_8.  Mark Bun, Kobbi Nissim, Uri Stemmer, and Salil P. Vadhan. Differentially private release and  learning of threshold functions. In FOCS, pages 634-649, 2015.  Mark Bun, Kobbi Nissim, and Uri Stemmer. Simultaneous private learning of multiple concepts. In  ITCS, pages 369-380. ACM, 2016.  Kamalika Chaudhuri and Daniel Hsu. Sample complexity bounds for differentially private learning. In Sham M. Kakade and Ulrike von Luxburg, editors, COLT, volume 19 of JMLR Proceedings, pages 155-186. JMLR.org, 2011.  Kamalika Chaudhuri, Claire Monteleoni, and Anand D. Sarwate. Differentially private empirical  risk minimization. Journal of Machine Learning Research, 12:1069-1109, 2011.  John Dunagan and Santosh Vempala. A simple polynomial-time rescaling algorithm for solving linear programs. Mathematical Programming, 114(1):101-114, Jul 2008. ISSN 1436-4646.  Cynthia Dwork and Vitaly Feldman. Privacy-preserving prediction. In COLT 2018, pages 1693-  1702, 2018. URL http://proceedings.mlr.press/v75/dwork18a.html.  Cynthia Dwork, Frank McSherry, Kobbi Nissim, and Adam Smith. Calibrating noise to sensitivity In TCC, volume 3876 of Lecture Notes in Computer Science, pages  in private data analysis. 265-284. Springer, 2006. PRIVATE CENTER POINTS AND LEARNING OF HALFSPACES  Herbert Edelsbrunner. Algorithms in Combinatorial Geometry. Springer-Verlag, Berlin, Heidelberg,  1987. ISBN 0-387-13722-X.  Vitaly Feldman and David Xiao. Sample complexity bounds on differentially private learning via communication complexity. SIAM J. Comput., 44(6):1740-1764, 2015. URL http://dx. doi.org/10.1137/140991844.  Justin Hsu, Aaron Roth, Tim Roughgarden, and Jonathan Ullman.  Privately solving lin- In ICALP, pages 612-624, 2014. URL https://doi.org/10.1007/  ear programs. 978-3-662-43948-7_51.  Haim Kaplan, Yishay Mansour, Yossi Matias, and Uri Stemmer. Differentially private learning of geometric concepts. CoRR, abs/1902.05017, 2019. URL http://arxiv.org/abs/1902. 05017.  Shiva Prasad Kasiviswanathan, Homin K. Lee, Kobbi Nissim, Sofya Raskhodnikova, and Adam D. Smith. What can we learn privately? SIAM J. Comput., 40(3):793-826, 2011. URL https: //doi.org/10.1137/090756090.  Michael J. Kearns. Efficient noise-tolerant learning from statistical queries. J. ACM, 45(6):983-  1006, 1998.  Xiaohui Liu, Karl Mosler, and Pavlo Mozharovskyi. Fast computation of Tukey trimmed regions  and median in dimension p > 2. arXiv e-prints, arXiv:1412.5122:arXiv:1412.5122, 2014.  Frank McSherry and Kunal Talwar. Mechanism design via differential privacy. In FOCS, pages  94-103. IEEE Computer Society, 2007.  Gary L. Miller and Donald R. Sheehy. Approximate centerpoints with proofs. Comput. Geom., 43 (8):647-654, 2010. URL https://doi.org/10.1016/j.comgeo.2010.04.006.  Huy L. Nguyen, Jonathan Ullman, and Lydia Zakynthinou. Efficient private algorithms for learning halfspaces. CoRR, abs/1902.09009, 2019. URL http://arxiv.org/abs/1902.09009.  John W. Tukey. Mathematics and the picturing of data. In Proc. Int. Congress of Mathematicians,  volume 2, pages 523-532, 1975.  and Winston, 1961.  Isaac Moiseevich Yaglom and Vladimir Grigorevich Boltyanskiˇı. Convex figures. Holt, Rinehart"}