{"1": "probabilities. 2010a.  J. Acharya, H. Das, H. Mohimani, A. Orlitsky, and Shengjun Pan. Exact calculation of pattern In Proceedings of IEEE Symposium on Information Theory, pages 1498 –1502,  J. Acharya, H. Das, A. Orlitsky, S. Pan, and N. P. Santhanam. Classiﬁcation using pattern probability  estimators. In ISIT, pages 1493–1497, 2010b.  J. Acharya, H. Das, A. Jafarpour, A. Orlitsky, and S. Pan. Competitive closeness testing. Journal of  Machine Learning Research - Proceedings Track, 19:47–68, 2011.  T. Batu, L. Fortnow, R. Rubinfeld, W. D. Smith, and P. White. Testing that distributions are close.  In Annual IEEE Symposium on Foundations of Computer Science, page 259, 2000.  T. Batu, L. Fortnow, E. Fischer, R. Kumar, R. Rubinfeld, and P. White. Testing random variables for independence and identity. Annual IEEE Symposium on Foundations of Computer Science, page 442, 2001.  22.12   ACHARYA DAS JAFARPOUR ORLITSKY PAN SURESH  Similarly, for the closeness test T we provide additional information about labellings and further restrict that the first sequence is from P and the second sequence is either from P or Q, the error probability of such a closeness test is also lower bounded by the above equation. Hence, the error probability is lower bounded by,  Pe ≥  1 2  min A1  max P ∈P  Q(A1) + P (Ac 1)  (a) =  min A1  max µ  Q(A1) +  µP P (Ac 1)  (cid:32)  (b) ≥  1 2  max µ  min A1  Q(A1) +  µP P (Ac 1)  (cid:33) (c) ≥  (cid:88)  P ∈P  max µ  (cid:88)  z  (cid:32)  min  Q(z),  µP P (z)  ,  (cid:88)  P ∈P  (cid:88)  P ∈P  (cid:32)  1 2  1 2  (cid:33)  (cid:33)  where µ is any measure over P. (a) follows from the fact that maximum of a linear optimization problem occurs at the boundary. Min-max is bigger than max-min, hence (b). (c) follows from the error probability of the optimal hypothesis test with known prior.  Since the inequality is true for any measure we choose µ to be uniformly over the set P. Apply-  ing Lemma 13 to R(Z) and (cid:80)  P µP P (Z)  Pe ≥4EµpP (Z)  µpP (Z) Q(Z)  (cid:32)  exp  −(n(cid:48))2 (cid:88)  δ4 i  (a) ≥  1 4  (cid:18) 1 q2 2i−1  +  1 q2 2i  (cid:19)(cid:33)  ,  i  (3)  where δi = i log n  tn . Proof of (a) is given in"}