{"1": "Noga Alon, Tali Kaufman, Michael Krivelevich, Simon Litsyn, and Dana Ron. Testing Reed-Muller codes. IEEE Transactions on Information Theory, 51(11):4032-4039, 2005. doi: 10.1109/TIT. 2005.856958. URL http://dx.doi.org/10.1109/TIT.2005.856958.  Noga Alon, Sanjeev Arora, Rajsekar Manokaran, Dana Moshkovitz, and Omri Weinstein. Inapprox- imability of densest κ-subgraph from average case hardness. Unpublished manuscript, 2011.  Noga Alon, Troy Lee, Adi Shraibman, and Santosh Vempala. The approximate rank of a matrix and its algorithmic applications: approximate rank. In Proceedings of the forty-fifth annual ACM symposium on Theory of computing, pages 675-684. ACM, 2013.  Arash Amini and Martin Wainwright. High-dimensional analysis of semidefinite relaxations for sparse principal components. In Information Theory, 2008. ISIT 2008. IEEE International Sym- posium on, pages 2454-2458. IEEE, 2008.  Ei Ando, Toshio Nakata, and Masafumi Yamashita. Approximating the longest path length of a stochastic DAG by a normal distribution in linear time. Journal of Discrete Algorithms, 7(4):420 - 438, 2009. ISSN 1570-8667. doi: http://dx.doi.org/10.1016/j.jda.2009.01.001. URL http: //www.sciencedirect.com/science/article/pii/S1570866709000033.  Sanjeev Arora, Boaz Barak, and David Steurer. Subexponential algorithms for unique games and related problems. In Symposium on Foundations of Computer Science, FOCS, pages 563-572, Washington, DC, USA, 2010. IEEE. ISBN 978-0-7695-4244-7.  Megasthenis Asteris, Dimitris Papailiopoulos, and Alexandros Dimakis. Nonnegative sparse PCA with provable guarantees. In Proceedings of the 31st International Conference on Machine Learn- ing (ICML-14), pages 1728-1736, 2014.  Megasthenis Asteris, Dimitris Papailiopoulos, Anastasios Kyrillidis, and Alexandros G. Dimakis.  Sparse pca via bipartite matchings. preprint, 2015.  Boaz Barak, Fernando Guadalupe dos Santos Lins Brand˜ao, Aram Wettroth Harrow, Jonathan Kel- ner, David Steurer, and Yuan Zhou. Hypercontractivity, sum-of-squares proofs, and their appli- cations. In Symposium on Theory of Computing, STOC, pages 307-326, New York, NY, USA, 2012a. ACM. ISBN 978-1-4503-1245-5.  Boaz Barak, Parikshit Gopalan, Johan H˚astad, Raghu Meka, Prasad Raghavendra, and David In FOCS, pages 370-379, 2012b. URL http: Steurer. Making the long code shorter. //dx.doi.org/10.1109/FOCS.2012.83. Lemma numbers refer to the full version avail- able at arXiv:1111.0405 [cs.CC].  Q. Berthet and P. Rigollet. Complexity theoretic lower bounds for sparse principal component detection. Journal of Machine Learning Research (JMLR), 30:1046-1066 (electronic), 2013a.  20   CHAN PAPAILLIOPOULOS RUBINSTEIN  We would like to thank Robert Krauthgamer, Tsz Chiu Kwok, Lap Chi Lau, Prasad Raghavendra, Aaron Schild, and anonymous reviewers for numerous suggestions and helpful discussions.  Acknowledgments  References  Noga Alon, Tali Kaufman, Michael Krivelevich, Simon Litsyn, and Dana Ron. Testing Reed-Muller codes. IEEE Transactions on Information Theory, 51(11):4032-4039, 2005. doi: 10.1109/TIT. 2005.856958. URL http://dx.doi.org/10.1109/TIT.2005.856958.  Noga Alon, Sanjeev Arora, Rajsekar Manokaran, Dana Moshkovitz, and Omri Weinstein. Inapprox- imability of densest κ-subgraph from average case hardness. Unpublished manuscript, 2011.  Noga Alon, Troy Lee, Adi Shraibman, and Santosh Vempala. The approximate rank of a matrix and its algorithmic applications: approximate rank. In Proceedings of the forty-fifth annual ACM symposium on Theory of computing, pages 675-684. ACM, 2013.  Arash Amini and Martin Wainwright. High-dimensional analysis of semidefinite relaxations for sparse principal components. In Information Theory, 2008. ISIT 2008. IEEE International Sym- posium on, pages 2454-2458. IEEE, 2008.  Ei Ando, Toshio Nakata, and Masafumi Yamashita. Approximating the longest path length of a stochastic DAG by a normal distribution in linear time. Journal of Discrete Algorithms, 7(4):420 - 438, 2009. ISSN 1570-8667. doi: http://dx.doi.org/10.1016/j.jda.2009.01.001. URL http: //www.sciencedirect.com/science/article/pii/S1570866709000033.  Sanjeev Arora, Boaz Barak, and David Steurer. Subexponential algorithms for unique games and related problems. In Symposium on Foundations of Computer Science, FOCS, pages 563-572, Washington, DC, USA, 2010. IEEE. ISBN 978-0-7695-4244-7.  Megasthenis Asteris, Dimitris Papailiopoulos, and Alexandros Dimakis. Nonnegative sparse PCA with provable guarantees. In Proceedings of the 31st International Conference on Machine Learn- ing (ICML-14), pages 1728-1736, 2014.  Megasthenis Asteris, Dimitris Papailiopoulos, Anastasios Kyrillidis, and Alexandros G. Dimakis.  Sparse pca via bipartite matchings. preprint, 2015.  Boaz Barak, Fernando Guadalupe dos Santos Lins Brand˜ao, Aram Wettroth Harrow, Jonathan Kel- ner, David Steurer, and Yuan Zhou. Hypercontractivity, sum-of-squares proofs, and their appli- cations. In Symposium on Theory of Computing, STOC, pages 307-326, New York, NY, USA, 2012a. ACM. ISBN 978-1-4503-1245-5.  Boaz Barak, Parikshit Gopalan, Johan H˚astad, Raghu Meka, Prasad Raghavendra, and David In FOCS, pages 370-379, 2012b. URL http: Steurer. Making the long code shorter. //dx.doi.org/10.1109/FOCS.2012.83. Lemma numbers refer to the full version avail- able at arXiv:1111.0405 [cs.CC].  Q. Berthet and P. Rigollet. Complexity theoretic lower bounds for sparse principal component detection. Journal of Machine Learning Research (JMLR), 30:1046-1066 (electronic), 2013a. ON THE APPROXIMABILITY OF SPARSE PCA  Quentin Berthet and Philippe Rigollet. Optimal detection of sparse principal components in high  dimension. Ann. Statist., 41(1):1780-1815, 2013b.  Aditya Bhaskara, Moses Charikar, Eden Chlamtac, Uriel Feige, and Aravindan Vijayaraghavan. Detecting high log-densities: an O(n1/4) approximation for densest k-subgraph. In Proceedings of the 42nd ACM Symposium on Theory of Computing, (STOC) 2010, Cambridge, Massachusetts, USA, 5-8 June 2010, pages 201-210, 2010. doi: 10.1145/1806689.1806718. URL http:// doi.acm.org/10.1145/1806689.1806718.  Aditya Bhaskara, Moses Charikar, Aravindan Vijayaraghavan, Venkatesan Guruswami, and Yuan Zhou. Polynomial integrality gaps for strong SDP relaxations of densest k-subgraph. In Proceed- ings of the Twenty-Third Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2012, Kyoto, Japan, January 17-19, 2012, pages 388-405, 2012. URL http://portal.acm. org/citation.cfm?id=2095150&CFID=63838676&CFTOKEN=79617016.  Arnab Bhattacharyya, Swastik Kopparty, Grant Schoenebeck, Madhu Sudan, and David Zucker- In FOCS, pages 488-497, 2010. URL http:  man. Optimal testing of Reed-Muller codes. //dx.doi.org/10.1109/FOCS.2010.54.  Mark Braverman, Young Kun-Ko, Aviad Rubinstein, and Omri Weinstein. ETH Hardness for Densest-k-Subgraph with Perfect Completeness. volume abs/1504.08352, 2015a. URL http: //arxiv.org/abs/1504.08352.  Mark Braverman, Young Kun-Ko, and Omri Weinstein. Approximating the best nash equilib- rium in no(log n)-time breaks the exponential time hypothesis. In Proceedings of the Twenty- Sixth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2015, San Diego, CA, USA, January 4-6, 2015, pages 970-982, 2015b. doi: 10.1137/1.9781611973730.66. URL http://dx.doi.org/10.1137/1.9781611973730.66.  J. Cadima and I.T. Jolliffe. Loading and correlations in the interpretation of principle compenents.  Journal of Applied Statistics, 22(2):203-214, 1995.  T. Tony Cai, Zongming Ma, and Yihong Wu. Sparse PCA: Optimal rates and adaptive estimation. The Annals of Statistics, 41(6):3074-3110, 12 2013a. doi: 10.1214/13-AOS1178. URL http: //dx.doi.org/10.1214/13-AOS1178.  Tony Cai, Zongming Ma, and Yihong Wu. Optimal estimation and rank detection for sparse spiked  covariance matrices. arXiv preprint arXiv:1305.3235, 2013b.  Siu On Chan, Tsz Chiu Kwok, and Lap Chi Lau. Random walks and evolving sets: Faster conver-  gences and limitations. manuscript, 2015.  A. d’Aspremont, L. El Ghaoui, M.I. Jordan, and G.R.G. Lanckriet. A direct formulation for sparse  PCA using semidefinite programming. SIAM review, 49(3):434-448, 2007a.  Alexandre d’Aspremont, Laurent El Ghaoui, Michael I. Jordan, and Gert R. G. Lanckriet. A direct formulation for sparse PCA using semidefinite programming. SIAM Rev., 49(3):434-448, July 2007b. ISSN 0036-1445. URL http://dx.doi.org/10.1137/050645506. CHAN PAPAILLIOPOULOS RUBINSTEIN  Alexandre d’Aspremont, Francis Bach, and Laurent El Ghaoui. Optimal solutions for sparse prin- cipal component analysis. The Journal of Machine Learning Research, 9:1269-1294, 2008.  Alexandre d’Aspremont, Francis R. Bach, and Laurent El Ghaoui. Approximation Bounds for Sparse Principal Component Analysis. Math. Program., 148(1-2):89-110, 2014. doi: 10.1007/ s10107-014-0751-7. URL http://dx.doi.org/10.1007/s10107-014-0751-7.  Yash Deshpande and Andrea Montanari. Sparse PCA via covariance thresholding. arXiv preprint  arXiv:1311.5179, 2013.  Uriel Feige. A threshold of ln n for approximating set cover. J. ACM, 45(4):634-652, 1998.  Uriel Feige, Guy Kortsarz, and David Peleg. The dense k-subgraph problem. Algorithmica, 29 (3):410-421, 2001. doi: 10.1007/s004530010050. URL http://dx.doi.org/10.1007/ s004530010050.  Chao Gao, Zongming Ma, and Harrison H. Zhou. Sparse CCA: Adaptive Estimation and Compu-  tational Barriers. arXiv preprint arXiv:1409.8565, 2014.  Johan H˚astad. Clique is hard to approximate within n1−(cid:15). Acta Mathematica, 182(1):105-142,  1999.  I.T. Jolliffe. Rotation of principal components: choice of normalization constraints. Journal of  Applied Statistics, 22(1):29-35, 1995.  I.T. Jolliffe, N.T. Trendafilov, and M. Uddin. A modified principal component technique based on  the lasso. Journal of Computational and Graphical Statistics, 12(3):531-547, 2003.  M. Journ´ee, Y. Nesterov, P. Richt´arik, and R. Sepulchre. Generalized power method for sparse principal component analysis. The Journal of Machine Learning Research, 11:517-553, 2010.  H.F. Kaiser. The varimax criterion for analytic rotation in factor analysis. Psychometrika, 23(3):  187-200, 1958.  Subhash Khot. Improved inaproximability results for maxclique, chromatic number and approxi- mate graph coloring. In 42nd Annual Symposium on Foundations of Computer Science, FOCS 2001, 14-17 October 2001, Las Vegas, Nevada, USA, pages 600-609, 2001. doi: 10.1109/SFCS. 2001.959936. URL http://dx.doi.org/10.1109/SFCS.2001.959936.  Subhash Khot. Ruling out PTAS for graph min-bisection, dense k-subgraph, and bipartite clique.  SIAM Journal on Computing, 36(4):1025-1071, 2006.  Robert Krauthgamer, Boaz Nadler, and Dan Vilenchik. Do semidefinite relaxations solve sparse  PCA up to the information limit? Annals of Probability, 43:1300-1322, 2015.  Volodymyr Kuleshov. Fast algorithms for sparse principal component analysis based on rayleigh In Proceedings of the 30th International Conference on Machine Learning  quotient iteration. (ICML-13), pages 1418-1425, 2013. ON THE APPROXIMABILITY OF SPARSE PCA  Tsz Chiu Kwok and Lap Chi Lau. Lower bounds on expansions of graph powers. In APPROX, pages 313-324, 2014. URL http://dx.doi.org/10.4230/LIPIcs.APPROX-RANDOM. 2014.313.  Tengyu Ma and Avi Wigderson. Sum-of-Squares Lower Bounds for Sparse PCA. In NIPS, 2015.  URL http://arxiv.org/abs/1507.06370. To appear.  Zongming Ma. Sparse principal component analysis and iterative thresholding. The Annals of  Statistics, 41(2):772-801, 2013.  Malik Magdon-Ismail. NP-hardness and inapproximability of sparse PCA. CoRR, abs/1502.05675,  2015. URL http://arxiv.org/abs/1502.05675.  B. Moghaddam, Y. Weiss, and S. Avidan. Spectral bounds for sparse pca: Exact and greedy algo-  rithms. NIPS, 18:915, 2006.  B. Moghaddam, Y. Weiss, and S. Avidan. Fast pixel/part selection with sparse eigenvectors. In Computer Vision, 2007. ICCV 2007. IEEE 11th International Conference on, pages 1-8. IEEE, 2007.  Abhiram Natarajan and Yi Wu. Computational complexity of certifying restricted isometry prop- erty. In APPROX, pages 371-380, 2014. URL http://dx.doi.org/10.4230/LIPIcs. APPROX-RANDOM.2014.371.  Prasad Raghavendra and Tselil Schramm. Gap amplification for small-set expansion via ran- In APPROX, pages 381-391, 2014. URL http://dx.doi.org/10.4230/  dom walks. LIPIcs.APPROX-RANDOM.2014.381.  Prasad Raghavendra and David Steurer. Graph expansion and the unique games conjecture.  In Proceedings of the 42nd ACM Symposium on Theory of Computing, (STOC) 2010, Cambridge, Massachusetts, USA, 5-8 June 2010, pages 755-764, 2010a. doi: 10.1145/1806689.1806788. URL http://dblp.uni-trier.de/rec/bib/conf/stoc/RaghavendraS10.  Prasad Raghavendra and David Steurer. Graph expansion and the unique games conjecture.  In STOC, pages 755-764, New York, NY, USA, 2010b. ACM. ISBN 978-1-4503-0050-6. URL http://doi.acm.org/10.1145/1806689.1806792.  Prasad Raghavendra, David Steurer, and Prasad Tetali. Approximations for the isoperimetric and In STOC, pages 631-640, New York, NY, ISBN 978-1-4503-0050-6. URL http://doi.acm.org/10.1145/  spectral profile of graphs and related parameters. USA, 2010. ACM. 1806689.1806776.  Prasad Raghavendra, David Steurer, and Madhur Tulsiani. Reductions between expansion problems. In CCC, pages 64-73, Washington, DC, USA, 2012. IEEE Computer Society. ISBN 978-0-7695- 4708-4. URL http://dx.doi.org/10.1109/CCC.2012.43.  Muli Safra. Lecture notes in computational complexity theory. URL http://www.tau.ac.  il/˜safra/Complexity/pdf/2SAT_Handouts.pdf. CHAN PAPAILLIOPOULOS RUBINSTEIN  H. Shen and J.Z. Huang. Sparse principal component analysis via regularized low rank matrix  approximation. Journal of multivariate analysis, 99(6):1015-1034, 2008.  B.K. Sriperumbudur, D.A. Torres, and G.R.G. Lanckriet. Sparse eigen methods by D.C. program- ming. In Proceedings of the 24th international conference on Machine learning, pages 831-838. ACM, 2007.  Tengyao Wang, Quentin Berthet, and Richard J. Samworth. Statistical and computational trade-offs  in estimation of sparse principal components. arXiv preprint arXiv:1408.5369, 2014.  Xiao-Tong Yuan and Tong Zhang. Truncated power method for sparse eigenvalue problems. The  Journal of Machine Learning Research, 14(1):899-925, 2013.  Y. Zhang, A. d’Aspremont, and L.E. Ghaoui. Sparse PCA: Convex relaxations, algorithms and applications. Handbook on Semidefinite, Conic and Polynomial Optimization, pages 915-940, 2012.  Hui Zou, Trevor Hastie, and Robert Tibshirani. Sparse principal component analysis. Journal of  computational and graphical statistics, 15(2):265-286, 2006.  David Zuckerman. Linear degree extractors and the inapproximability of max clique and chromatic number. Theory of Computing, 3(1):103-128, 2007. doi: 10.4086/toc.2007.v003a006. URL http://dx.doi.org/10.4086/toc.2007.v003a006."}