{"1": "J. Acharya, C. Daskalakis, and G. Kamath. Optimal testing for properties of distributions.  In  Advances in Neural Information Processing Systems (NIPS), pages 3591-3599, 2015.  J. Acharya, C. L. Canonne, and H. Tyagi. Distributed simulation and distributed inference. CoRR,  abs/1804.06952, 2018a. URL http://arxiv.org/abs/1804.06952.  J. Acharya, C. L. Canonne, and H. Tyagi. Inference under information constraints I: lower bounds from chi-square contraction. CoRR, abs/1812.11476, 2018b. URL http://arxiv.org/ abs/1812.11476.  R. Ahlswede and I. Csiszar. Hypothesis testing with communication constraints. IEEE Trans. Inf.  Theor., 32(4):533-542, September 1986.  A. Andoni, T. Malkin, and N. S. Nosatzki. Two party distribution testing: Communication and security. CoRR, abs/1811.04065, 2018. URL http://arxiv.org/abs/1811.04065.  T. Batu and C. L. Canonne. Generalized uniformity testing. In 58th IEEE Annual Symposium on  Foundations of Computer Science, FOCS 2017, pages 880-889, 2017.  T. Batu, L. Fortnow, R. Rubinfeld, W. D. Smith, and P. White. Testing that distributions are close. In IEEE Symposium on Foundations of Computer Science, pages 259-269, 2000. URL citeseer. ist.psu.edu/batu00testing.html.  T. Batu, R. Kumar, and R. Rubinfeld. Sublinear algorithms for testing monotone and unimodal  distributions. In ACM Symposium on Theory of Computing, pages 381-390, 2004.  M. Braverman, A. Garg, T. Ma, H. L. Nguyen, and D. P. Woodruff. Communication lower bounds for statistical estimation problems via a distributed data processing inequality. In Proceedings of the 48th Annual ACM Symposium on Theory of Computing, STOC 2016, pages 1011-1020, 2016.  C. L. Canonne. A survey on distribution testing: Your data is big. but is it blue? Electronic  Colloquium on Computational Complexity (ECCC), 22:63, 2015.  C. L. Canonne, I. Diakonikolas, T. Gouleakis, and R. Rubinfeld. Testing shape restrictions of discrete distributions. In 33rd Symposium on Theoretical Aspects of Computer Science, STACS 2016, pages 25:1-25:14, 2016.  C. L. Canonne, I. Diakonikolas, D. M. Kane, and A. Stewart. Testing bayesian networks.  In  Proceedings of the 30th Conference on Learning Theory, COLT 2017, pages 370-448, 2017a.  13   COMMUNICATION AND MEMORY EFFICIENT TESTING OF DISCRETE DISTRIBUTIONS  I.D. is supported by NSF Award CCF-1652862 (CAREER) and a Sloan Research Fellowship. This research was performed while T.G. was a postdoctoral researcher at USC, supported by I.D.’s startup grant. D.K. is supported by NSF Award CCF-1553288 (CAREER) and a Sloan Research Fellow- ship. S.R. would like to thank Dheeraj P.V. for helpful discussions.  Acknowledgments  References  J. Acharya, C. Daskalakis, and G. Kamath. Optimal testing for properties of distributions.  In  Advances in Neural Information Processing Systems (NIPS), pages 3591-3599, 2015.  J. Acharya, C. L. Canonne, and H. Tyagi. Distributed simulation and distributed inference. CoRR,  abs/1804.06952, 2018a. URL http://arxiv.org/abs/1804.06952.  J. Acharya, C. L. Canonne, and H. Tyagi. Inference under information constraints I: lower bounds from chi-square contraction. CoRR, abs/1812.11476, 2018b. URL http://arxiv.org/ abs/1812.11476.  R. Ahlswede and I. Csiszar. Hypothesis testing with communication constraints. IEEE Trans. Inf.  Theor., 32(4):533-542, September 1986.  A. Andoni, T. Malkin, and N. S. Nosatzki. Two party distribution testing: Communication and security. CoRR, abs/1811.04065, 2018. URL http://arxiv.org/abs/1811.04065.  T. Batu and C. L. Canonne. Generalized uniformity testing. In 58th IEEE Annual Symposium on  Foundations of Computer Science, FOCS 2017, pages 880-889, 2017.  T. Batu, L. Fortnow, R. Rubinfeld, W. D. Smith, and P. White. Testing that distributions are close. In IEEE Symposium on Foundations of Computer Science, pages 259-269, 2000. URL citeseer. ist.psu.edu/batu00testing.html.  T. Batu, R. Kumar, and R. Rubinfeld. Sublinear algorithms for testing monotone and unimodal  distributions. In ACM Symposium on Theory of Computing, pages 381-390, 2004.  M. Braverman, A. Garg, T. Ma, H. L. Nguyen, and D. P. Woodruff. Communication lower bounds for statistical estimation problems via a distributed data processing inequality. In Proceedings of the 48th Annual ACM Symposium on Theory of Computing, STOC 2016, pages 1011-1020, 2016.  C. L. Canonne. A survey on distribution testing: Your data is big. but is it blue? Electronic  Colloquium on Computational Complexity (ECCC), 22:63, 2015.  C. L. Canonne, I. Diakonikolas, T. Gouleakis, and R. Rubinfeld. Testing shape restrictions of discrete distributions. In 33rd Symposium on Theoretical Aspects of Computer Science, STACS 2016, pages 25:1-25:14, 2016.  C. L. Canonne, I. Diakonikolas, D. M. Kane, and A. Stewart. Testing bayesian networks.  In  Proceedings of the 30th Conference on Learning Theory, COLT 2017, pages 370-448, 2017a. COMMUNICATION AND MEMORY EFFICIENT TESTING OF DISCRETE DISTRIBUTIONS  C. L. Canonne, I. Diakonikolas, D. M. Kane, and A. Stewart. Testing conditional independence of discrete distributions. CoRR, abs/1711.11560, 2017b. URL http://arxiv.org/abs/ 1711.11560. In STOC’18.  C. L. Canonne, I. Diakonikolas, and A. Stewart. Testing for families of distributions via the fourier transform. In Advances in Neural Information Processing Systems 31: Annual Conference on Neural Information Processing Systems 2018, NeurIPS 2018, pages 10084-10095, 2018.  S. Chan, I. Diakonikolas, P. Valiant, and G. Valiant. Optimal algorithms for testing closeness of  discrete distributions. In SODA, pages 1193-1203, 2014.  S. Chien, K. Ligett, and A. McGregor. Space-efficient estimation of robust statistics and distribution  testing. In Innovations in Computer Science - ICS 2010, pages 251-265, 2010.  T. M. Cover. Hypothesis testing with finite statistics. Ann. Math. Statist., 40(3):828-835, 06 1969.  C. Daskalakis and Q. Pan. Square Hellinger subadditivity for Bayesian networks and its applications to identity testing. In Proceedings of the 30th Conference on Learning Theory, COLT 2017, pages 697-703, 2017.  C. Daskalakis, I. Diakonikolas, R. Servedio, G. Valiant, and P. Valiant. Testing k-modal distribu-  tions: Optimal algorithms via reductions. In SODA, pages 1833-1852, 2013.  C. Daskalakis, N. Dikkala, and G. Kamath. Testing Ising models. In SODA, 2018.  L. Devroye and L. Gy¨orfi. Nonparametric Density Estimation: The L1 View. John Wiley & Sons,  L. Devroye and G. Lugosi. Combinatorial methods in density estimation. Springer Series in Statis-  1985.  tics, Springer, 2001.  I. Diakonikolas and D. M. Kane. A new approach for testing properties of discrete distributions. In  FOCS, pages 685-694, 2016. Full version available at abs/1601.05557.  I. Diakonikolas, D. M. Kane, and V. Nikishkin. Testing identity of structured distributions.  In Proceedings of the Twenty-Sixth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2015, pages 1841-1854, 2015a.  I. Diakonikolas, D. M. Kane, and V. Nikishkin. Optimal algorithms and lower bounds for test- In IEEE 56th Annual Symposium on Foundations of  ing closeness of structured distributions. Computer Science, FOCS 2015, pages 1183-1202, 2015b.  I. Diakonikolas, T. Gouleakis, J. Peebles, and E. Price. Collision-based testers are optimal for uniformity and closeness. Electronic Colloquium on Computational Complexity (ECCC), 23: 178, 2016.  I. Diakonikolas, T. Gouleakis, J. Peebles, and E. Price. Sample-optimal identity testing with high  probability. CoRR, abs/1708.02728, 2017a. COMMUNICATION AND MEMORY EFFICIENT TESTING OF DISCRETE DISTRIBUTIONS  I. Diakonikolas, E. Grigorescu, J. Li, A. Natarajan, K. Onak, and L. Schmidt. Communication- efficient distributed learning of discrete distributions. In Advances in Neural Information Pro- cessing Systems 30: Annual Conference on Neural Information Processing Systems 2017, pages 6394-6404, 2017b.  I. Diakonikolas, D. M. Kane, and V. Nikishkin. Near-optimal closeness testing of discrete histogram In 44th International Colloquium on Automata, Languages, and Programming,  distributions. ICALP 2017, pages 8:1-8:15, 2017c.  I. Diakonikolas, D. M. Kane, and A. Stewart. Sharp bounds for generalized uniformity testing. In Advances in Neural Information Processing Systems 31: Annual Conference on Neural Informa- tion Processing Systems 2018, NeurIPS 2018, pages 6204-6213, 2018.  O. Fischer, U. Meir, and R. Oshman. Distributed uniformity testing. In Proceedings of the 2018 ACM Symposium on Principles of Distributed Computing, PODC ’18, pages 455-464, New York, NY, USA, 2018. ACM.  A. Garg, T. Ma, and H. Nguyen. On communication cost of distributed statistical estimation and In Advances in Neural Information Processing Systems (NIPS), pages 2726-  dimensionality. 2734, 2014.  bution. ECCC, 23, 2016.  O. Goldreich. The uniform distribution is complete with respect to testing identity to a fixed distri-  O. Goldreich.  Introduction to Property Testing. Forthcoming, 2017. URL http://www.  wisdom.weizmann.ac.il/˜oded/pt-intro.html.  O. Goldreich and D. Ron. On testing expansion in bounded-degree graphs. Technical Report TR00-  020, Electronic Colloquium on Computational Complexity, 2000.  Y. Han, P. Mukherjee, A. ¨Ozg¨ur, and T. Weissman. Distributed statistical estimation of high- In 2018 IEEE International Symposium on In-  dimensional and nonparametric distributions. formation Theory, ISIT 2018, pages 506-510, 2018a.  Y. Han, A. ¨Ozg¨ur, and T. Weissman. Geometric lower bounds for distributed parameter estimation under communication constraints. In Conference On Learning Theory, COLT 2018, pages 3163- 3188, 2018b. URL http://proceedings.mlr.press/v75/han18a.html.  M. I. Jordan, J. D. Lee, and Y. Yang. Communication-efficient distributed statistical learning. CoRR,  abs/1605.07689, 2016.  R. Kannan, S. Vempala, and D. Woodruff. Principal component analysis and higher correlations for  distributed data. In Conference on Learning Theory, pages 1040-1057, 2014.  E. L. Lehmann and J. P. Romano. Testing statistical hypotheses. Springer Texts in Statistics.  Springer, 2005.  Y. Liang, M. F. Balcan, V. Kanchanapally, and D. Woodruff. Improved distributed principal compo- nent analysis. In Advances in Neural Information Processing Systems (NIPS), pages 3113-3121, 2014. COMMUNICATION AND MEMORY EFFICIENT TESTING OF DISCRETE DISTRIBUTIONS  J. Neyman and E. S. Pearson. On the problem of the most efficient tests of statistical hypothe- ses. Philosophical Transactions of the Royal Society of London. Series A, Containing Papers of a Mathematical or Physical Character, 231(694-706):289-337, 1933. doi: 10.1098/rsta. 1933.0009. URL http://rsta.royalsocietypublishing.org/content/231/ 694-706/289.short.  L. Paninski. A coincidence-based test for uniformity given very sparsely-sampled discrete data.  IEEE Transactions on Information Theory, 54:4750-4755, 2008.  R. Rubinfeld. Taming big probability distributions. XRDS, 19(1):24-28, 2012.  A. B. Tsybakov. Introduction to Nonparametric Estimation. Springer Publishing Company, Incor-  porated, 2008.  FOCS, 2014.  G. Valiant and P. Valiant. An automatic inequality prover and instance optimal identity testing. In  P. Valiant. Testing symmetric properties of distributions. SIAM J. Comput., 40(6):1927-1968, 2011.  Y. Zhang, J. Duchi, M. Jordan, and M. J. Wainwright. Information-theoretic lower bounds for dis- tributed statistical estimation with communication constraints. In Advances in Neural Information Processing Systems (NIPS), pages 2328-2336, 2013.  Y. Zhu and J. Lafferty. Distributed nonparametric regression under communication constraints. In Proceedings of the 35th International Conference on Machine Learning, ICML 2018, pages 6004-6012, 2018.  APPENDIX  The structure of this"}