{"1": "R. K. Ando, T. Zhang. A framework for learning predictive structures from multiple tasks  and unlabeled data. Journal of Machine Learning Research, 6:1817-1853, 2005.  A, Argyriou, R. Foygel, N. Srebro. Sparse prediction with the k−support norm. Advances  in Neural Information Processing Systems 25, pages 1466-1474, 2012.  F. R. Bach, G.R.G. Lanckriet and M. I. Jordan. Multiple kernels learning, conic duality, and the SMO algorithm. Proc. 21st International Conference on Machine Learning, 2004.  P. L. Bartlett and S. Mendelson. Rademacher and Gaussian Complexities: Risk Bounds  and Structural Results. Journal of Machine Learning Research, 3:463-482, 2002.  J. Baxter. A Model of Inductive Bias Learning, Journal of Artificial Intelligence Research,  12:149-198, 2000.  S. Ben-David and R. Schuller. Exploiting task relatedness for multiple task learning. Proc.  16th Annual Conference on Computational Learning Theory, pages 567-580, 2003.  S. Boucheron, G. Lugosi, P. Massart. Concentration Inequalities using the entropy method,  Annals of Probability, 31(3):1145-1712, 2003  S. Boucheron, G. Lugosi, P. Massart. Concentration Inequalities, Oxford University Press,  2013.  2001.  C. Cortes, M. Mohri, A. Rostamizadeh. Generalization bounds for learning kernels. Proc.  27th International Conference on Machine Learning (ICML 2010), 2010.  F. Cucker and S. Smale. On the mathematical foundations of learning, Bulletin of the  American Mathematical Society, 39(1):1-49, 2001.  L. Jacob, G. Obozinski, J. P. Vert. Group Lasso with overlap and graph Lasso. Proc. 26th  International Conference on Machine Learning (ICML 2009), pages 433-440, 2009.  S. M. Kakade, S. Shalev-Shwartz, A. Tewari. Regularization techniques for learning with  matrices. Journal of Machine Learning Research, 13:1865-1890, 2012.  V. Koltchinskii and D. Panchenko. Empirical margin distributions and bounding the gen-  eralization error of combined classifiers. The Annals of Statistics, 30(1):1-50, 2002.  M. Ledoux, M. Talagrand. Probability in Banach Spaces, Springer, 1991.  M.Ledoux. The Concentration of Measure Phenomenon, AMS Surveys and Monographs 89,  H. Liu, M. Palatucci, and J. Zhang. Blockwise coordinate descent procedures for the multi- task lasso, with applications to neural semantic basis discovery. Proc. 27th International Conference on Machine Learning, pages 82-89, 2009.  A. Maurer. Concentration inequalities for functions of independent variables. Random Struc-  tures and Algorithms, 29:121-138, 2006.  13   An Inequality with Applications...  References  R. K. Ando, T. Zhang. A framework for learning predictive structures from multiple tasks  and unlabeled data. Journal of Machine Learning Research, 6:1817-1853, 2005.  A, Argyriou, R. Foygel, N. Srebro. Sparse prediction with the k−support norm. Advances  in Neural Information Processing Systems 25, pages 1466-1474, 2012.  F. R. Bach, G.R.G. Lanckriet and M. I. Jordan. Multiple kernels learning, conic duality, and the SMO algorithm. Proc. 21st International Conference on Machine Learning, 2004.  P. L. Bartlett and S. Mendelson. Rademacher and Gaussian Complexities: Risk Bounds  and Structural Results. Journal of Machine Learning Research, 3:463-482, 2002.  J. Baxter. A Model of Inductive Bias Learning, Journal of Artificial Intelligence Research,  12:149-198, 2000.  S. Ben-David and R. Schuller. Exploiting task relatedness for multiple task learning. Proc.  16th Annual Conference on Computational Learning Theory, pages 567-580, 2003.  S. Boucheron, G. Lugosi, P. Massart. Concentration Inequalities using the entropy method,  Annals of Probability, 31(3):1145-1712, 2003  S. Boucheron, G. Lugosi, P. Massart. Concentration Inequalities, Oxford University Press,  2013.  2001.  C. Cortes, M. Mohri, A. Rostamizadeh. Generalization bounds for learning kernels. Proc.  27th International Conference on Machine Learning (ICML 2010), 2010.  F. Cucker and S. Smale. On the mathematical foundations of learning, Bulletin of the  American Mathematical Society, 39(1):1-49, 2001.  L. Jacob, G. Obozinski, J. P. Vert. Group Lasso with overlap and graph Lasso. Proc. 26th  International Conference on Machine Learning (ICML 2009), pages 433-440, 2009.  S. M. Kakade, S. Shalev-Shwartz, A. Tewari. Regularization techniques for learning with  matrices. Journal of Machine Learning Research, 13:1865-1890, 2012.  V. Koltchinskii and D. Panchenko. Empirical margin distributions and bounding the gen-  eralization error of combined classifiers. The Annals of Statistics, 30(1):1-50, 2002.  M. Ledoux, M. Talagrand. Probability in Banach Spaces, Springer, 1991.  M.Ledoux. The Concentration of Measure Phenomenon, AMS Surveys and Monographs 89,  H. Liu, M. Palatucci, and J. Zhang. Blockwise coordinate descent procedures for the multi- task lasso, with applications to neural semantic basis discovery. Proc. 27th International Conference on Machine Learning, pages 82-89, 2009.  A. Maurer. Concentration inequalities for functions of independent variables. Random Struc-  tures and Algorithms, 29:121-138, 2006. Maurer Pontil Romera-Paredes  A. Maurer. Thermodynamics and concentration. Bernoulli, 18(2):434-454, 2012.  A. Maurer, M. Pontil. Structured sparsity and generalization. Journal of Machine Learning  Research, 13:671-690, 2012.  A. Maurer and M. Pontil. Excess risk bounds for multitask learning with trace norm regu-  larization. Proc. 26th Annual Conference on Learning Theory, pages 55-76, 2013.  A. Maurer, M. Pontil, B. Romera-Paredes. Sparse coding for multitask and transfer learning.  Proc. 30th International Conference on Machine Learning, pages 343-351, 2013  C. McDiarmid. Concentration. In Probabilistic Methods of Algorithmic Discrete Mathemat-  ics, pages 195-248, Springer, 1998.  C. A. Micchelli, J. M. Morales, M. Pontil. Regularizers for structured sparsity. Advances in  Computational Mathematics, 38(3):455-489, 2013.  S. Negahban, M. Wainwright. Joint support recovery under high-dimensional scaling: Bene- fits and perils of (cid:96)1/(cid:96)∞ regularization. Advances in Neural Information Processing Systems 21 pages 1161-1168, 2008.  Y. Ying and C. Campbell. Generalization bounds for learning the kernel problem. Proc.  22nd Conference on Learning Theory, 2009.  M. Yuan and Y. Lin. Model selection and estimation in regression with grouped variables. Journal of the Royal Statistical Society, Series B (Statistical Methodology), 68(1): 49-67, 2006. An Inequality with Applications...  4."}