{"1": "Scott Aaronson and Yaoyun Shi. Quantum lower bounds for the collision and the element distinct-  ness problems. J. ACM, 51(4):595–605, 2004.  Peter L. Bartlett and Shahar Mendelson. Rademacher and gaussian complexities: Risk bounds and  structural results. Journal of Machine Learning Research, 3:463–482, 2002.  Peter L. Bartlett and Marten H. Wegkamp. Classiﬁcation with a reject option using a hinge loss.  Journal of Machine Learning Research, 9:1823–1840, 2008.  Nader H Bshouty and Lynn Burroughs. Maximizing agreements with one-sided error with applica-  tions to heuristic learning. Machine Learning, 59(1-2):99–123, 2005.  13   DISTRIBUTION-INDEPENDENT RELIABLE LEARNING  6. Discussion  We have shown that concept classes with low one-sided approximate degree can be efficiently learned in the reliable agnostic model. As we have seen, one-sided approximate degree is an in- termediate notion that lies between threshold degree and approximate degree; we have identified important concept classes, such as majorities and intersections of majorities, whose one-sided ap- proximate degree is strictly smaller than its approximate degree. Consequently, we have obtained reliable (in some cases, even fully reliable) agnostic learning algorithms that are strictly more effi- cient than the fastest known agnostic ones. We have thereby given the first evidence that even fully reliable agnostic learning may be strictly easier than agnostic learning.  The notion of one-sided polynomial approximation has only been introduced very recently (Bun and Thaler (2013a)), and previously had only been used to prove lower bounds. By giving the first algorithmic application of one-sided polynomial approximations, our work lends further credence to the notion that these approximations are fundamental objects worthy of further study in their own right. Just as threshold degree and approximate degree have found applications (both posi- tive and negative) in many domains outside of learning theory, we hope that one-sided polynomial approximations will as well. Identifying such applications is a significant direction for further work. Our work does raise several open questions specific to one-sided polynomial approximations. Here we highlight two. We have shown that halfspaces of weight at most W have one-sided ap- proximate degree ˜O(W 1/2), and yet there exist halfspaces with one-sided approximate degree Ω(n). However, the (non-explicit) halfspace from Sherstov (2013b) that we used to demonstrate the Ω(n) lower bound has weight 2Ω(n) (see"}