{"1": "Jayadev Acharya, Cl´ement L Canonne, and Himanshu Tyagi. Distributed simulation and distributed  inference. arXiv preprint arXiv:1804.06952, 2018.  Shun-ichi Amari. On optimal data compression in multiterminal statistical inference. IEEE Trans-  actions on Information Theory, 57(9):5577-5587, 2011.  Maria Florina Balcan, Avrim Blum, Shai Fine, and Yishay Mansour. Distributed learning, commu-  nication complexity and privacy. In Conference on Learning Theory, pages 26-1, 2012.  Ziv Bar-Yossef, Thathachar S Jayram, Ravi Kumar, and D Sivakumar. An information statistics ap- proach to data stream and communication complexity. Journal of Computer and System Sciences, 68(4):702-732, 2004.  Z Birnbaum and W-f Orlicz. ¨Uber die verallgemeinerung des begriffes der zueinander konjugierten  potenzen. Studia Mathematica, 3(1):1-67, 1931.  Stephen Boyd, Neal Parikh, Eric Chu, Borja Peleato, and Jonathan Eckstein. Distributed optimiza- tion and statistical learning via the alternating direction method of multipliers. Foundations and Trends R(cid:13) in Machine Learning, 3(1):1-122, 2011.  Mark Braverman, Ankit Garg, Tengyu Ma, Huy L Nguyen, and David P Woodruff. Communication lower bounds for statistical estimation problems via a distributed data processing inequality. In Proceedings of the forty-eighth annual ACM symposium on Theory of Computing, pages 1011- 1020. ACM, 2016.  Hal Daum´e, Jeff M Phillips, Avishek Saha, and Suresh Venkatasubramanian. Efficient protocols for distributed classification and optimization. In International Conference on Algorithmic Learning Theory, pages 154-168. Springer, 2012.  Hal Daume III, Jeff Phillips, Avishek Saha, and Suresh Venkatasubramanian. Protocols for learning classifiers on distributed data. In Artificial Intelligence and Statistics, pages 282-290, 2012.  Ofer Dekel, Ran Gilad-Bachrach, Ohad Shamir, and Lin Xiao. Optimal distributed online prediction  using mini-batches. Journal of Machine Learning Research, 13(Jan):165-202, 2012.  Ilias Diakonikolas, Elena Grigorescu, Jerry Li, Abhiram Natarajan, Krzysztof Onak, and Ludwig Schmidt. Communication-efficient distributed learning of discrete distributions. In Advances in Neural Information Processing Systems, pages 6394-6404, 2017.  John C Duchi and Martin J Wainwright. Distance-based and continuum fano inequalities with  applications to statistical estimation. arXiv preprint arXiv:1311.2669, 2013.  John C Duchi, Michael I Jordan, and Martin J Wainwright. Local privacy and statistical minimax In IEEE 54th Annual Symposium on Foundations of Computer Science (FOCS),, pages  rates. 429-438. IEEE, 2013.  Ankit Garg, Tengyu Ma, and Huy Nguyen. On communication cost of distributed statistical esti- mation and dimensionality. In Advances in Neural Information Processing Systems, pages 2726- 2734, 2014.  13   DISTRIBUTED PARAMETER ESTIMATION  References  Jayadev Acharya, Cl´ement L Canonne, and Himanshu Tyagi. Distributed simulation and distributed  inference. arXiv preprint arXiv:1804.06952, 2018.  Shun-ichi Amari. On optimal data compression in multiterminal statistical inference. IEEE Trans-  actions on Information Theory, 57(9):5577-5587, 2011.  Maria Florina Balcan, Avrim Blum, Shai Fine, and Yishay Mansour. Distributed learning, commu-  nication complexity and privacy. In Conference on Learning Theory, pages 26-1, 2012.  Ziv Bar-Yossef, Thathachar S Jayram, Ravi Kumar, and D Sivakumar. An information statistics ap- proach to data stream and communication complexity. Journal of Computer and System Sciences, 68(4):702-732, 2004.  Z Birnbaum and W-f Orlicz. ¨Uber die verallgemeinerung des begriffes der zueinander konjugierten  potenzen. Studia Mathematica, 3(1):1-67, 1931.  Stephen Boyd, Neal Parikh, Eric Chu, Borja Peleato, and Jonathan Eckstein. Distributed optimiza- tion and statistical learning via the alternating direction method of multipliers. Foundations and Trends R(cid:13) in Machine Learning, 3(1):1-122, 2011.  Mark Braverman, Ankit Garg, Tengyu Ma, Huy L Nguyen, and David P Woodruff. Communication lower bounds for statistical estimation problems via a distributed data processing inequality. In Proceedings of the forty-eighth annual ACM symposium on Theory of Computing, pages 1011- 1020. ACM, 2016.  Hal Daum´e, Jeff M Phillips, Avishek Saha, and Suresh Venkatasubramanian. Efficient protocols for distributed classification and optimization. In International Conference on Algorithmic Learning Theory, pages 154-168. Springer, 2012.  Hal Daume III, Jeff Phillips, Avishek Saha, and Suresh Venkatasubramanian. Protocols for learning classifiers on distributed data. In Artificial Intelligence and Statistics, pages 282-290, 2012.  Ofer Dekel, Ran Gilad-Bachrach, Ohad Shamir, and Lin Xiao. Optimal distributed online prediction  using mini-batches. Journal of Machine Learning Research, 13(Jan):165-202, 2012.  Ilias Diakonikolas, Elena Grigorescu, Jerry Li, Abhiram Natarajan, Krzysztof Onak, and Ludwig Schmidt. Communication-efficient distributed learning of discrete distributions. In Advances in Neural Information Processing Systems, pages 6394-6404, 2017.  John C Duchi and Martin J Wainwright. Distance-based and continuum fano inequalities with  applications to statistical estimation. arXiv preprint arXiv:1311.2669, 2013.  John C Duchi, Michael I Jordan, and Martin J Wainwright. Local privacy and statistical minimax In IEEE 54th Annual Symposium on Foundations of Computer Science (FOCS),, pages  rates. 429-438. IEEE, 2013.  Ankit Garg, Tengyu Ma, and Huy Nguyen. On communication cost of distributed statistical esti- mation and dimensionality. In Advances in Neural Information Processing Systems, pages 2726- 2734, 2014. HAN ¨OZG ¨UR WEISSMAN  Jaroslav H´ajek. A characterization of limiting distributions of regular estimates. Zeitschrift f¨ur  Wahrscheinlichkeitstheorie und verwandte Gebiete, 14(4):323-330, 1970.  Jaroslav H´ajek. Local asymptotic minimax and admissibility in estimation. In Proceedings of the sixth Berkeley symposium on mathematical statistics and probability, volume 1, pages 175-194, 1972.  Yanjun Han, Ayfer ¨Ozg¨ur, and Tsachy Weissman. Distributed statistical estimation of high- In Information Theory, 2018. ISIT 2018. IEEE  dimensional and nonparametric distributions. International Symposium on. IEEE, 2018.  Ildar Abdulovich Ibragimov and Rafail Z Has’minskii. Statistical estimation: asymptotic theory,  volume 16. Springer Science & Business Media, 2013.  E Kushilevitz and N Nisan. Communication complexity. cambridge university press, 1997.  Michel Ledoux. The concentration of measure phenomenon. Number 89. American Mathematical  Soc., 2005.  Michael Mitzenmacher and Eli Upfal. Probability and computing: Randomized algorithms and  probabilistic analysis. Cambridge University Press, 2005.  Walter Rudin. Real and complex analysis. Tata McGraw-Hill Education, 1987.  Ohad Shamir. Fundamental limits of online and distributed algorithms for statistical learning and  estimation. In Advances in Neural Information Processing Systems, pages 163-171, 2014.  A. Tsybakov. Introduction to Nonparametric Estimation. Springer-Verlag, 2008.  Roman Vershynin. Introduction to the non-asymptotic analysis of random matrices. arXiv preprint  arXiv:1011.3027, 2010.  A Wyner. A theorem on the entropy of certain binary sequences and applications-ii. IEEE Trans-  actions on Information Theory, 19(6):772-777, 1973.  Aolin Xu and Maxim Raginsky. Information-theoretic lower bounds on Bayes risk in decentralized  estimation. IEEE Transactions on Information Theory, 63(3):1580-1600, 2017.  Yuchen Zhang, John Duchi, Michael I Jordan, and Martin J Wainwright.  Information-theoretic lower bounds for distributed statistical estimation with communication constraints. In Advances in Neural Information Processing Systems, pages 2328-2336, 2013. DISTRIBUTED PARAMETER ESTIMATION"}