{"1": "Edoardo M. Airoldi, David M. Blei, Stephen E. Fienberg, and Eric P. Xing. Mixed member- ship stochastic blockmodels. Journal of Machine Learning Research, 9:1981-2014, June 2008.  A. Anandkumar, D. P. Foster, D. Hsu, S. M. Kakade, and Y. Liu. Two svds suﬃce: Spectral decompositions for probabilistic topic modeling and latent dirichlet allocation, 2012a. arXiv:1204.6703.  A. Anandkumar, R. Ge, D. Hsu, S. M. Kakade, and M. Telgarsky. Tensor decompositions  for latent variable models, 2012b.  A. Anandkumar, D. Hsu, and S.M. Kakade. A Method of Moments for Mixture Models  and Hidden Markov Models. In Proc. of Conf. on Learning Theory, June 2012c.  A. Anandkumar, R. Ge, D. Hsu, and S. M. Kakade. A Tensor Spectral Approach to Learning  Mixed Membership Community Models. ArXiv 1302.2684, Feb. 2013.  Sanjeev Arora, Rong Ge, Sushant Sachdeva, and Grant Schoenebeck. Finding overlapping communities in social networks: toward a rigorous approach. In Proceedings of the 13th ACM Conference on Electronic Commerce, 2012.  Maria-Florina Balcan, Christian Borgs, Mark Braverman, Jennifer T. Chayes, and Shang- Hua Teng. I like her more than you: Self-determined communities. CoRR, abs/1201.4899, 2012.  Kamalika Chaudhuri, Fan Chung, and Alexander Tsiatas. Spectral clustering of graphs with general degrees in the extended planted partition model. Journal of Machine Learning Research, pages 1-23, 2012.  S.E. Fienberg, M.M. Meyer, and S.S. Wasserman. Statistical analysis of multiple sociometric  relations. Journal of the american Statistical association, 80(389):51-67, 1985.  P. Gopalan, D. Mimno, S. Gerrish, M. Freedman, and D. Blei. Scalable inference of over- lapping communities. In Advances in Neural Information Processing Systems 25, pages 2258-2266, 2012.  C. Hillar and L.-H. Lim. Most tensor problems are NP hard, 2012.  P.W. Holland, K.B. Laskey, and S. Leinhardt. Stochastic blockmodels: first steps. Social  networks, 5(2):109-137, 1983.  T. G. Kolda and B. W. Bader. Tensor decompositions and applications. SIAM review, 51  (3):455, 2009.  F. McSherry. Spectral partitioning of random graphs. In FOCS, 2001.  G. Palla, I. Der´enyi, I. Farkas, and T. Vicsek. Uncovering the overlapping community structure of complex networks in nature and society. Nature, 435(7043):814-818, 2005.  14   Anandkumar Ge Hsu Kakade  References  Edoardo M. Airoldi, David M. Blei, Stephen E. Fienberg, and Eric P. Xing. Mixed member- ship stochastic blockmodels. Journal of Machine Learning Research, 9:1981-2014, June 2008.  A. Anandkumar, D. P. Foster, D. Hsu, S. M. Kakade, and Y. Liu. Two svds suﬃce: Spectral decompositions for probabilistic topic modeling and latent dirichlet allocation, 2012a. arXiv:1204.6703.  A. Anandkumar, R. Ge, D. Hsu, S. M. Kakade, and M. Telgarsky. Tensor decompositions  for latent variable models, 2012b.  A. Anandkumar, D. Hsu, and S.M. Kakade. A Method of Moments for Mixture Models  and Hidden Markov Models. In Proc. of Conf. on Learning Theory, June 2012c.  A. Anandkumar, R. Ge, D. Hsu, and S. M. Kakade. A Tensor Spectral Approach to Learning  Mixed Membership Community Models. ArXiv 1302.2684, Feb. 2013.  Sanjeev Arora, Rong Ge, Sushant Sachdeva, and Grant Schoenebeck. Finding overlapping communities in social networks: toward a rigorous approach. In Proceedings of the 13th ACM Conference on Electronic Commerce, 2012.  Maria-Florina Balcan, Christian Borgs, Mark Braverman, Jennifer T. Chayes, and Shang- Hua Teng. I like her more than you: Self-determined communities. CoRR, abs/1201.4899, 2012.  Kamalika Chaudhuri, Fan Chung, and Alexander Tsiatas. Spectral clustering of graphs with general degrees in the extended planted partition model. Journal of Machine Learning Research, pages 1-23, 2012.  S.E. Fienberg, M.M. Meyer, and S.S. Wasserman. Statistical analysis of multiple sociometric  relations. Journal of the american Statistical association, 80(389):51-67, 1985.  P. Gopalan, D. Mimno, S. Gerrish, M. Freedman, and D. Blei. Scalable inference of over- lapping communities. In Advances in Neural Information Processing Systems 25, pages 2258-2266, 2012.  C. Hillar and L.-H. Lim. Most tensor problems are NP hard, 2012.  P.W. Holland, K.B. Laskey, and S. Leinhardt. Stochastic blockmodels: first steps. Social  networks, 5(2):109-137, 1983.  T. G. Kolda and B. W. Bader. Tensor decompositions and applications. SIAM review, 51  (3):455, 2009.  F. McSherry. Spectral partitioning of random graphs. In FOCS, 2001.  G. Palla, I. Der´enyi, I. Farkas, and T. Vicsek. Uncovering the overlapping community structure of complex networks in nature and society. Nature, 435(7043):814-818, 2005. A Tensor Spectral Approach to Learning Mixed Membership Community Models  T.A.B. Snijders and K. Nowicki. Estimation and prediction for stochastic blockmodels for  graphs with latent block structure. Journal of Classification, 14(1):75-100, 1997.  J.A. Tropp. User-friendly tail bounds for sums of random matrices. Foundations of Com-  putational Mathematics, 12(4):389-434, 2012.  Y.J. Wang and G.Y. Wong. Stochastic blockmodels for directed graphs. Journal of the  American Statistical Association, 82(397):8-19, 1987.  H.C. White, S.A. Boorman, and R.L. Breiger. Social structure from multiple networks. i. blockmodels of roles and positions. American journal of sociology, pages 730-780, 1976.  E.P. Xing, W. Fu, and L. Song. A state-space mixed membership blockmodel for dynamic  network tomography. The Annals of Applied Statistics, 4(2):535-566, 2010.  Chen Yudong, Sujay Sanghavi, and Huan Xu. Clustering sparse graphs. In Advances in  Neural Information Processing Systems 25, 2012."}