{"1": "Shivani Agarwal, Thore Graepel, Ralf Herbrich, Sariel Har-Peled, and Dan Roth. General- ization bounds for the area under the ROC curve. Journal of Machine Learning Research, 6:393-425, 2005.  Nir Ailon and Mehryar Mohri. An eﬃcient reduction of ranking to classification. In Pro-  ceedings of the 21st Annual Conference on Learning Theory, 2008.  Maria-Florina Balcan, Nikhil Bansal, Alina Beygelzimer, Don Coppersmith, John Lang- ford, and Gregory B. Sorkin. Robust reductions from ranking to classification. Machine Learning, 72:139-153, 2008.  Peter Bartlett, Michael Jordan, and Jon McAuliﬀe. Convexity, classification and risk  bounds. Journal of the American Statistical Association, 101(473):138-156, 2006.  David Buﬀoni, Cl´ement Calauzenes, Patrick Gallinari, and Nicolas Usunier. Learning scor- ing functions with order-preserving losses and standardized supervision. In Proceedings of the 28th International Conference on Machine Learning, 2011.  Andreas Buja, Werner Stuetzle, and Yi Shen. Loss functions for binary class probability estimation: Structure and applications. Technical report, University of Pennsylvania, November 2005.  C. J. C. Burges, T. Shaked, E. Renshaw, A. Lazier, M. Deeds, N. Hamilton, and G. Hullen- der. Learning to rank using gradient descent. In Proceedings of the 22nd International Conference on Machine Learning, 2005.  Cl´ement Calauz`enes, Nicolas Usunier, and Patrick Gallinari. On the (non-)existence of con- vex, calibrated surrogate losses for ranking. In Advances in Neural Information Processing Systems 25, pages 197-205. 2012.  St´ephan Cl´emen¸con, Gabor Lugosi, and Nicolas Vayatis. Ranking and empirical minimiza-  tion of U-statistics. Annals of Statistics, 36:844-874, 2008.  St´ephan Cl´emen¸con and Sylvain Robbiano. Minimax learning rates for bipartite ranking and plug-in rules. In Proceedings of the 28th International Conference on Machine Learning, 2011.  St´ephan Cl´emen¸con and Nicolas Vayatis. Ranking the best instances. Journal of Machine  Learning Research, 8:2671-2699, 2007.  13   AUC Regret Bounds via Strongly Proper Losses  Acknowledgments  Thanks to Harish G. Ramaswamy and Arun Rajkumar for helpful discussions. Thanks also to Yoonkyung Lee for inviting me to give a talk at the ASA Conference on Statistical Learning and Data Mining held in Ann Arbor, Michigan, in June 2012; part of this work was done while preparing for that talk. This research was supported in part by a Ramanujan Fellowship from the Department of Science and Technology, Government of India.  References  Shivani Agarwal, Thore Graepel, Ralf Herbrich, Sariel Har-Peled, and Dan Roth. General- ization bounds for the area under the ROC curve. Journal of Machine Learning Research, 6:393-425, 2005.  Nir Ailon and Mehryar Mohri. An eﬃcient reduction of ranking to classification. In Pro-  ceedings of the 21st Annual Conference on Learning Theory, 2008.  Maria-Florina Balcan, Nikhil Bansal, Alina Beygelzimer, Don Coppersmith, John Lang- ford, and Gregory B. Sorkin. Robust reductions from ranking to classification. Machine Learning, 72:139-153, 2008.  Peter Bartlett, Michael Jordan, and Jon McAuliﬀe. Convexity, classification and risk  bounds. Journal of the American Statistical Association, 101(473):138-156, 2006.  David Buﬀoni, Cl´ement Calauzenes, Patrick Gallinari, and Nicolas Usunier. Learning scor- ing functions with order-preserving losses and standardized supervision. In Proceedings of the 28th International Conference on Machine Learning, 2011.  Andreas Buja, Werner Stuetzle, and Yi Shen. Loss functions for binary class probability estimation: Structure and applications. Technical report, University of Pennsylvania, November 2005.  C. J. C. Burges, T. Shaked, E. Renshaw, A. Lazier, M. Deeds, N. Hamilton, and G. Hullen- der. Learning to rank using gradient descent. In Proceedings of the 22nd International Conference on Machine Learning, 2005.  Cl´ement Calauz`enes, Nicolas Usunier, and Patrick Gallinari. On the (non-)existence of con- vex, calibrated surrogate losses for ranking. In Advances in Neural Information Processing Systems 25, pages 197-205. 2012.  St´ephan Cl´emen¸con, Gabor Lugosi, and Nicolas Vayatis. Ranking and empirical minimiza-  tion of U-statistics. Annals of Statistics, 36:844-874, 2008.  St´ephan Cl´emen¸con and Sylvain Robbiano. Minimax learning rates for bipartite ranking and plug-in rules. In Proceedings of the 28th International Conference on Machine Learning, 2011.  St´ephan Cl´emen¸con and Nicolas Vayatis. Ranking the best instances. Journal of Machine  Learning Research, 8:2671-2699, 2007. Agarwal  Corinna Cortes and Mehryar Mohri. AUC optimization vs. error rate minimization.  In Sebastian Thrun, Lawrence Saul, and Bernhard Sch¨olkopf, editors, Advances in Neural Information Processing Systems 16. MIT Press, Cambridge, MA, 2004.  David Cossock and Tong Zhang. Statistical analysis of Bayes optimal subset ranking. IEEE  Transactions on Information Theory, 54(11):5140-5154, 2008.  John Duchi, Lester Mackey, and Michael I. Jordan. On the consistency of ranking algo- rithms. In Proceedings of the 27th International Conference on Machine Learning, 2010.  Yoav Freund, Raj Iyer, Robert E. Schapire, and Yoram Singer. An eﬃcient boosting al- gorithm for combining preferences. Journal of Machine Learning Research, 4:933-969, 2003.  Tilmann Gneiting and Adrian E. Raftery. Strictly proper scoring rules, prediction, and estimation. Journal of the American Statistical Association, 102(477):359-378, 2007.  A. D. Hendrickson and R. J. Buehler. Proper scores for probability forecasters. The Annals  of Mathematical Statistics, 42:1916-1921, 1971.  R. Herbrich, T. Graepel, and K. Obermayer. Large margin rank boundaries for ordinal  regression. Advances in Large Margin Classifiers, pages 115-132, 2000.  T. Joachims. Optimizing search engines using clickthrough data. In Proceedings of the 8th  ACM Conference on Knowledge Discovery and Data Mining, 2002.  Wojciech Kotlowski, Krzysztof Dembczynski, and Eyke Huellermeier. Bipartite ranking through minimization of univariate loss. In Proceedings of the 28th International Confer- ence on Machine Learning, 2011.  Yanyan Lan, Jiafeng Guo, Xueqi Cheng, and Tie-Yan Liu. Statistical consistency of ranking methods in a rank-diﬀerentiable probability space. In Advances in Neural Information Processing Systems 25, pages 1241-1249. 2012.  A. Rakotomamonjy. Optimizing area under ROC curves with SVMs. In Proceedings of the  ECAI-2004 Workshop on ROC Analysis in AI, 2004.  Pradeep Ravikumar, Ambuj Tewari, and Eunho Yang. On NDCG consistency of listwise ranking methods. In Proceedings of the 14th International Conference on Artificial Intel- ligence and Statistics, 2010, volume 15 of JMLR Workshop and Conference Proceedings, pages 618-626, 2011.  Mark D. Reid and Robert C. Williamson. Surrogate regret bounds for proper losses. In  Proceedings of the 26th International Conference on Machine Learning, 2009.  Mark D. Reid and Robert C. Williamson. Composite binary losses. Journal of Machine  Learning Research, 11:2387-2422, 2010.  Mark D. Reid and Robert C. Williamson.  Information, divergence and risk for binary  experiments. Journal of Machine Learning Research, 12:731-817, 2011. AUC Regret Bounds via Strongly Proper Losses  Cynthia Rudin and Robert E. Schapire. Margin-based ranking and an equivalence between AdaBoost and RankBoost. Journal of Machine Learning Research, 10:2193-2232, 2009.  Leonard J. Savage. Elicitation of personal probabilities and expectations. Journal of the  American Statistical Association, 66(336):783-801, 1971.  M. J. Schervish. A general method for comparing probability assessors. The Annals of  Statistics, 17:1856-1879, 1989.  Alexandre B. Tsybakov. Optimal aggregation of classifiers in statistical learning. The  Annals of Statistics, 32(1):135-166, 2004.  Kazuki Uematsu and Yoonkyung Lee. On theoretically optimal ranking functions in bipar- tite ranking. Technical Report 863, Department of Statistics, The Ohio State University, December 2011.  Fen Xia, Tie-Yan Liu, Jue Wang, Wensheng Zhang, and Hang Li. Listwise approach to learning to rank: Theory and algorithm. In Proceedings of the 25th International Con- ference on Machine Learning, 2008.  Tong Zhang. Statistical behavior and consistency of classification methods based on convex  risk minimization. The Annals of Statistics, 32(1):56-134, 2004."}