{"1": "Jayadev Acharya, Gautam Kamath, Ziteng Sun, and Huanyu Zhang. Inspectre: Privately estimating the unseen. In Proceedings of the 35th International Conference on Machine Learning, ICML ’18, pages 30-39. JMLR, Inc., 2018a.  Jayadev Acharya, Ziteng Sun, and Huanyu Zhang. Differentially private testing of identity and closeness of discrete distributions. In Advances in Neural Information Processing Systems 31, NeurIPS ’18, pages 6878-6891. Curran Associates, Inc., 2018b.  Maryam Aliakbarpour, Ilias Diakonikolas, and Ronitt Rubinfeld. Differentially private identity and closeness testing of discrete distributions. In Proceedings of the 35th International Conference on Machine Learning, ICML ’18, pages 169-178. JMLR, Inc., 2018.  Mitali Bafna and Jonathan Ullman. The price of selection in differential privacy. In Proceedings of  the 30th Annual Conference on Learning Theory, COLT ’17, pages 151-168, 2017.  Raef Bassily, Adam Smith, and Abhradeep Thakurta. Private empirical risk minimization: Efficient In Proceedings of the 55th Annual IEEE Symposium on algorithms and tight error bounds. Foundations of Computer Science, FOCS ’14, pages 464-473, Washington, DC, USA, 2014. IEEE Computer Society.  Amos Beimel, Hai Brenner, Shiva Prasad Kasiviswanathan, and Kobbi Nissim. Bounds on the sample complexity for private learning and private data release. Machine Learning, 94(3):401-437, 2014.  Andrew C. Berry. The accuracy of the Gaussian approximation to the sum of independent variates.  Transactions of the American Mathematical Society, 49(1):122-136, 1941.  Mark Bun and Thomas Steinke. Concentrated differential privacy: Simplifications, extensions, and lower bounds. In Proceedings of the 14th Conference on Theory of Cryptography, TCC ’16-B, pages 635-658, Berlin, Heidelberg, 2016. Springer.  Mark Bun, Jonathan Ullman, and Salil Vadhan. Fingerprinting codes and the price of approximate In Proceedings of the 46th Annual ACM Symposium on the Theory of  differential privacy. Computing, STOC ’14, pages 1-10, New York, NY, USA, 2014. ACM.  13   PRIVATELY LEARNING HIGH-DIMENSIONAL DISTRIBUTIONS  Acknowledgments  Work done when GK was a graduate student at MIT, supported by NSF Award CCF-1617730, CCF-1650733, CCF-1741137, and ONR N00014-12-1-0999, and when a Microsoft Research Fellow, as part of the Simons-Berkeley Research Fellowship program. Work done when JL was a graduate student at MIT, supported by NSF Award CCF-1453261 (CAREER), CCF-1565235, a Google Faculty Research Award, and an NSF Graduate Research Fellowship, and when a VMware Research Fellow, as part of the Simons-Berkeley Research Fellowship program. Part of this work was also performed while JL was an intern at Google. VS supported by NSF award CCF-1750640. JU supported by NSF awards CCF-1750640 and NSF awards CCF-1718088 and CNS-1816028, and a Google Faculty Research Award.  References  Jayadev Acharya, Gautam Kamath, Ziteng Sun, and Huanyu Zhang. Inspectre: Privately estimating the unseen. In Proceedings of the 35th International Conference on Machine Learning, ICML ’18, pages 30-39. JMLR, Inc., 2018a.  Jayadev Acharya, Ziteng Sun, and Huanyu Zhang. Differentially private testing of identity and closeness of discrete distributions. In Advances in Neural Information Processing Systems 31, NeurIPS ’18, pages 6878-6891. Curran Associates, Inc., 2018b.  Maryam Aliakbarpour, Ilias Diakonikolas, and Ronitt Rubinfeld. Differentially private identity and closeness testing of discrete distributions. In Proceedings of the 35th International Conference on Machine Learning, ICML ’18, pages 169-178. JMLR, Inc., 2018.  Mitali Bafna and Jonathan Ullman. The price of selection in differential privacy. In Proceedings of  the 30th Annual Conference on Learning Theory, COLT ’17, pages 151-168, 2017.  Raef Bassily, Adam Smith, and Abhradeep Thakurta. Private empirical risk minimization: Efficient In Proceedings of the 55th Annual IEEE Symposium on algorithms and tight error bounds. Foundations of Computer Science, FOCS ’14, pages 464-473, Washington, DC, USA, 2014. IEEE Computer Society.  Amos Beimel, Hai Brenner, Shiva Prasad Kasiviswanathan, and Kobbi Nissim. Bounds on the sample complexity for private learning and private data release. Machine Learning, 94(3):401-437, 2014.  Andrew C. Berry. The accuracy of the Gaussian approximation to the sum of independent variates.  Transactions of the American Mathematical Society, 49(1):122-136, 1941.  Mark Bun and Thomas Steinke. Concentrated differential privacy: Simplifications, extensions, and lower bounds. In Proceedings of the 14th Conference on Theory of Cryptography, TCC ’16-B, pages 635-658, Berlin, Heidelberg, 2016. Springer.  Mark Bun, Jonathan Ullman, and Salil Vadhan. Fingerprinting codes and the price of approximate In Proceedings of the 46th Annual ACM Symposium on the Theory of  differential privacy. Computing, STOC ’14, pages 1-10, New York, NY, USA, 2014. ACM. PRIVATELY LEARNING HIGH-DIMENSIONAL DISTRIBUTIONS  Mark Bun, Kobbi Nissim, Uri Stemmer, and Salil Vadhan. Differentially private release and learning of threshold functions. In Proceedings of the 56th Annual IEEE Symposium on Foundations of Computer Science, FOCS ’15, pages 634-649, Washington, DC, USA, 2015. IEEE Computer Society.  Mark Bun, Thomas Steinke, and Jonathan Ullman. Make up your mind: The price of online queries in differential privacy. In Proceedings of the 28th Annual ACM-SIAM Symposium on Discrete Algorithms, SODA ’17, pages 1306-1325, Philadelphia, PA, USA, 2017. SIAM.  Bryan Cai, Constantinos Daskalakis, and Gautam Kamath. Priv’it: Private and sample efficient identity testing. In Proceedings of the 34th International Conference on Machine Learning, ICML ’17, pages 635-644. JMLR, Inc., 2017.  T. Tony Cai, Yichen Wang, and Linjun Zhang. The cost of privacy: Optimal rates of convergence for  parameter estimation with differential privacy. arXiv preprint arXiv:1902.04495, 2019.  Moses Charikar, Jacob Steinhardt, and Gregory Valiant. Learning from untrusted data. In Proceedings of the 49th Annual ACM Symposium on the Theory of Computing, STOC ’17, pages 47-60, New York, NY, USA, 2017. ACM.  Aref N. Dajani, Amy D. Lauger, Phyllis E. Singer, Daniel Kifer, Jerome P. Reiter, Ashwin Machanava- jjhala, Simson L. Garfinkel, Scot A. Dahl, Matthew Graham, Vishesh Karwa, Hang Kim, Philip Lelerc, Ian M. Schmutte, William N. Sexton, Lars Vilhuber, and John M. Abowd. The moderniza- tion of statistical disclosure limitation at the U.S. census bureau, 2017. Presented at the September 2017 meeting of the Census Scientific Advisory Committee.  Luc Devroye, Abbas Mehrabian, and Tommy Reddad. The minimax learning rate of normal and  Ising undirected graphical models. arXiv preprint arXiv:1806.06887, 2018.  Ilias Diakonikolas, Moritz Hardt, and Ludwig Schmidt. Differentially private learning of structured discrete distributions. In Advances in Neural Information Processing Systems 28, NIPS ’15, pages 2566-2574. Curran Associates, Inc., 2015.  Ilias Diakonikolas, Gautam Kamath, Daniel M. Kane, Jerry Li, Ankur Moitra, and Alistair Stewart. Robust estimators in high dimensions without the computational intractability. In Proceedings of the 57th Annual IEEE Symposium on Foundations of Computer Science, FOCS ’16, pages 655-664, Washington, DC, USA, 2016. IEEE Computer Society.  Ilias Diakonikolas, Gautam Kamath, Daniel M. Kane, Jerry Li, Ankur Moitra, and Alistair Stewart. Being robust (in high dimensions) can be practical. In Proceedings of the 34th International Conference on Machine Learning, ICML ’17, pages 999-1008. JMLR, Inc., 2017.  Ilias Diakonikolas, Gautam Kamath, Daniel M. Kane, Jerry Li, Ankur Moitra, and Alistair Stewart. Robustly learning a Gaussian: Getting optimal error, efficiently. In Proceedings of the 29th Annual ACM-SIAM Symposium on Discrete Algorithms, SODA ’18, Philadelphia, PA, USA, 2018. SIAM.  Differential  Privacy  privacy https://machinelearning.apple.com/docs/learning-with-privacy-at-scale/appledifferentialprivacysystem.pdf, December 2017.  Learning  Apple.  Team,  scale.  with  at PRIVATELY LEARNING HIGH-DIMENSIONAL DISTRIBUTIONS  Irit Dinur and Kobbi Nissim. Revealing information while preserving privacy. In Proceedings of the 22nd ACM SIGMOD-SIGACT-SIGART Symposium on Principles of Database Systems, PODS ’03, pages 202-210, New York, NY, USA, 2003. ACM.  Cynthia Dwork and Jing Lei. Differential privacy and robust statistics. In Proceedings of the 41st Annual ACM Symposium on the Theory of Computing, STOC ’09, pages 371-380, New York, NY, USA, 2009. ACM.  Cynthia Dwork and Guy N. Rothblum. Concentrated differential privacy.  arXiv preprint  arXiv:1603.01887, 2016.  Cynthia Dwork, Frank McSherry, Kobbi Nissim, and Adam Smith. Calibrating noise to sensitivity in private data analysis. In Proceedings of the 3rd Conference on Theory of Cryptography, TCC ’06, pages 265-284, Berlin, Heidelberg, 2006. Springer.  Cynthia Dwork, Moni Naor, Omer Reingold, Guy N. Rothblum, and Salil Vadhan. On the complexity of differentially private data release: Efficient algorithms and hardness results. In Proceedings of the 41st Annual ACM Symposium on the Theory of Computing, STOC ’09, pages 381-390, New York, NY, USA, 2009. ACM.  Cynthia Dwork, Guy N. Rothblum, and Salil Vadhan. Boosting and differential privacy. In Proceed- ings of the 51st Annual IEEE Symposium on Foundations of Computer Science, FOCS ’10, pages 51-60, Washington, DC, USA, 2010. IEEE Computer Society.  Cynthia Dwork, Kunal Talwar, Abhradeep Thakurta, and Li Zhang. Analyze Gauss: Optimal bounds for privacy-preserving principal component analysis. In Proceedings of the 46th Annual ACM Symposium on the Theory of Computing, STOC ’14, pages 11-20, New York, NY, USA, 2014. ACM.  Cynthia Dwork, Adam Smith, Thomas Steinke, Jonathan Ullman, and Salil Vadhan. Robust trace- ability from trace amounts. In Proceedings of the 56th Annual IEEE Symposium on Foundations of Computer Science, FOCS ’15, pages 650-669, Washington, DC, USA, 2015. IEEE Computer Society.  Cynthia Dwork, Adam Smith, Thomas Steinke, and Jonathan Ullman. Exposed! a survey of attacks  on private data. Annual Review of Statistics and Its Application, 4(1):61-84, 2017.  ´Ulfar Erlingsson, Vasyl Pihur, and Aleksandra Korolova. RAPPOR: Randomized aggregatable privacy-preserving ordinal response. In Proceedings of the 2014 ACM Conference on Computer and Communications Security, CCS ’14, pages 1054-1067, New York, NY, USA, 2014. ACM.  Carl-Gustaf Esseen. On the Liapounoff limit of error in the theory of probability. Arkiv f¨or matematik,  astronomi och fysik, 28A(2):1-19, 1942.  Marco Gaboardi and Ryan Rogers. Local private hypothesis testing: Chi-square tests. In Proceedings of the 35th International Conference on Machine Learning, ICML ’18, pages 1626-1635. JMLR, Inc., 2018.  Marco Gaboardi, James Honaker, Gary King, Jack Murtagh, Kobbi Nissim, Jonathan Ullman, and Salil Vadhan. Psi (ψ): A private data sharing interface. arXiv preprint arXiv:1609.04340, 2016a. PRIVATELY LEARNING HIGH-DIMENSIONAL DISTRIBUTIONS  Marco Gaboardi, Hyun-Woo Lim, Ryan M. Rogers, and Salil P. Vadhan. Differentially private chi-squared hypothesis testing: Goodness of fit and independence testing. In Proceedings of the 33rd International Conference on Machine Learning, ICML ’16, pages 1395-1403. JMLR, Inc., 2016b.  Moritz Hardt and Kunal Talwar. On the geometry of differential privacy. In Proceedings of the 42nd Annual ACM Symposium on the Theory of Computing, STOC ’10, pages 705-714, New York, NY, USA, 2010. ACM.  Moritz Hardt and Jonathan Ullman. Preventing false discovery in interactive data analysis is hard. In Proceedings of the 55th Annual IEEE Symposium on Foundations of Computer Science, FOCS ’14, pages 454-463, Washington, DC, USA, 2014. IEEE Computer Society.  Nils Homer, Szabolcs Szelinger, Margot Redman, David Duggan, Waibhav Tembe, Jill Muehling, John V. Pearson, Dietrich A. Stephan, Stanley F. Nelson, and David W. Craig. Resolving individuals contributing trace amounts of DNA to highly complex mixtures using high-density SNP genotyping microarrays. PLoS Genetics, 4(8):1-9, 2008.  Kazuya Kakizaki, Jun Sakuma, and Kazuto Fukuchi. Differentially private chi-squared test by unit circle mechanism. In Proceedings of the 34th International Conference on Machine Learning, ICML ’17, pages 1761-1770. JMLR, Inc., 2017.  Gautam Kamath. A lower bound for private covariance estimation. Note, available upon request,  2019.  Gautam Kamath, Jerry Li, Vikrant Singhal, and Jonathan Ullman. Privately learning high-dimensional  distributions. arXiv preprint arXiv:1805.00216, 2018.  Vishesh Karwa and Salil Vadhan. Finite sample differentially private confidence intervals.  In Proceedings of the 9th Conference on Innovations in Theoretical Computer Science, ITCS ’18, pages 44:1-44:9, Dagstuhl, Germany, 2018. Schloss Dagstuhl-Leibniz-Zentrum fuer Informatik.  Daniel Kifer and Ryan M. Rogers. A new class of private chi-square tests. In Proceedings of the 20th International Conference on Artificial Intelligence and Statistics, AISTATS ’17, pages 991-1000. JMLR, Inc., 2017.  Lucas Kowalczyk, Tal Malkin, Jonathan Ullman, and Mark Zhandry. Strong hardness of privacy from weak traitor tracing. In Proceedings of the 14th Conference on Theory of Cryptography, TCC ’16-B, pages 659-689, Berlin, Heidelberg, 2016. Springer.  Lucas Kowalczyk, Tal Malkin, Jonathan Ullman, and Daniel Wichs. Hardness of non-interactive differential privacy from one-way functions. In Proceedings of the 38th Annual International Cryptology Conference, CRYPTO ’18, Berlin, Heidelberg, 2018. Springer.  Kevin A. Lai, Anup B. Rao, and Santosh Vempala. Agnostic estimation of mean and covariance. In Proceedings of the 57th Annual IEEE Symposium on Foundations of Computer Science, FOCS ’16, pages 665-674, Washington, DC, USA, 2016. IEEE Computer Society.  Beatrice Laurent and Pascal Massart. Adaptive estimation of a quadratic functional by model  selection. The Annals of Statistics, 28(5):1302-1338, 2000. PRIVATELY LEARNING HIGH-DIMENSIONAL DISTRIBUTIONS  Prashanth Mohan, Abhradeep Thakurta, Elaine Shi, Dawn Song, and David Culler. GUPT: Privacy preserving data analysis made easy. In Proceedings of the 2012 ACM SIGMOD International Conference on Management of Data, SIGMOD ’12, pages 349-360, New York, NY, USA, 2012. ACM.  Kobbi Nissim, Sofya Raskhodnikova, and Adam Smith. Smooth sensitivity and sampling in private data analysis. In Proceedings of the 39th Annual ACM Symposium on the Theory of Computing, STOC ’07, pages 75-84, New York, NY, USA, 2007. ACM.  Or Sheffet. Differentially private ordinary least squares. In Proceedings of the 34th International  Conference on Machine Learning, ICML ’17, pages 3105-3114. JMLR, Inc., 2017.  Or Sheffet. Locally private hypothesis testing. In Proceedings of the 35th International Conference  on Machine Learning, ICML ’18, pages 4605-4614. JMLR, Inc., 2018.  I.G. Shevtsova. An improvement of convergence rate estimates in the Lyapunov theorem. Doklady  Mathematics, 82(3):862-864, 2010.  Reza Shokri, Marco Stronati, Congzheng Song, and Vitaly Shmatikov. Membership inference attacks against machine learning models. In Proceedings of the 38th IEEE Symposium on Security and Privacy, SP ’17, pages 3-18, Washington, DC, USA, 2017. IEEE Computer Society.  Adam Smith. Privacy-preserving statistical estimation with optimal convergence rates. In Proceedings of the 43rd Annual ACM Symposium on the Theory of Computing, STOC ’11, pages 813-822, New York, NY, USA, 2011. ACM.  Jacob Steinhardt, Moses Charikar, and Gregory Valiant. Resilience: A criterion for learning in the presence of arbitrary outliers. In Proceedings of the 9th Conference on Innovations in Theoretical Computer Science, ITCS ’18, pages 45:1-45:21, Dagstuhl, Germany, 2018. Schloss Dagstuhl- Leibniz-Zentrum fuer Informatik.  Thomas Steinke and Jonathan Ullman. Interactive fingerprinting codes and the hardness of preventing false discovery. In Proceedings of the 28th Annual Conference on Learning Theory, COLT ’15, pages 1588-1628, 2015.  Thomas Steinke and Jonathan Ullman. Between pure and approximate differential privacy. The  Journal of Privacy and Confidentiality, 7(2):3-22, 2017a.  Thomas Steinke and Jonathan Ullman. Tight lower bounds for differentially private selection. In Proceedings of the 58th Annual IEEE Symposium on Foundations of Computer Science, FOCS ’17, pages 552-563, Washington, DC, USA, 2017b. IEEE Computer Society.  Terence Tao. Topics in random matrix theory, volume 132 of Graduate Studies in Mathematics.  American Mathematical Society, Providence, RI, 2012.  Jonathan Ullman. Answering n2+o(1) counting queries with differential privacy is hard. SIAM  Journal on Computing, 45(2):473-496, 2016.  Jonathan Ullman and Salil Vadhan. PCPs and the hardness of generating private synthetic data. In Proceedings of the 8th Conference on Theory of Cryptography, TCC ’11, pages 400-416, Berlin, Heidelberg, 2011. Springer. PRIVATELY LEARNING HIGH-DIMENSIONAL DISTRIBUTIONS  Yue Wang, Jaewoo Lee, and Daniel Kifer. Revisiting differentially private hypothesis tests for  categorical data. arXiv preprint arXiv:1511.03376, 2015."}