{"1": "Noga Alon. Eigenvalues and expanders. Combinatorica, 6(2):83-96, 1986a. doi: 10.1007/  BF02579166. URL http://dx.doi.org/10.1007/BF02579166.  Noga Alon. Eigenvalues, geometric expanders, sorting in rounds, and ramsey theory. Combina- torica, 6(3):207-219, 1986b. doi: 10.1007/BF02579382. URL http://dx.doi.org/10. 1007/BF02579382.  11   SIGN RANK VERSUS VC DIMENSION  Theorem 12 For every fixed d ≥ 1, the number of U (d + 1)-free graphs on N vertices is at most 2O(N 2−1/d log N ).  The proof of the theorem is given in Section C.1.4.  3. Concluding remarks and open problems  We have given explicit examples of N × N sign matrices with small VC dimension and large sign rank. However, we have not been able to prove that any of them has sign rank exceeding N 1/2. Indeed this seems to be the limit of Forster’s approach, even if we do not bound the VC dimension. Forster’s theorem shows that the sign rank of any N × N Hadamard matrix is at least N 1/2. It is easy to see that there are Hadamard matrices of sign rank significantly smaller than linear in N . Indeed, the sign rank of the 4 × 4 signed identity matrix is 3, and hence the sign rank of its k’th tensor power, which is an N × N Hadamard matrix with N = 4k, is at most 3k = N log 3/ log 4 (a similar argument was given by Forster and Simon (2006) for the Sylvester-Hadamard matrix). It may well be, however, that some Hadamard matrices have sign rank linear in N , as do random sign matrices, and it will be very interesting to show that this is the case for some such matrices. It will also be interesting to decide what is the correct behavior of the sign rank of the incidence graph of the points and lines of a projective plane with N points. We have seen that it is at least Ω(N 1/4) and at most O(N 1/2).  Using our spectral technique we can give many additional explicit examples of matrices with high sign rank, including ones for which the matrices not only have VC dimension 2, but are more restricted than that (for example, no 3 columns have more than 6 distinct projections).  We have shown that the maximum sign rank f (N, d) of an N × N matrix with VC dimension d > 1 is at most O(N 1−1/d), and that this is tight up to a logarithmic factor for d = 2, and close to being tight for large d. It seems plausible to conjecture that f (N, d) = ˜Θ(N 1−1/d) for all d > 1.  We have also showed how to use this upper bound to get a nontrivial approximation algorithm for the sign rank. It will be interesting to fully understand the computational complexity of comput- ing the sign rank.  Finally we note that most of the analysis in this paper can be extended to deal with M × N matrices, where M and N are not necessarily equal, and we restricted the attention here for square matrices mainly in order to simplify the presentation.  We wish to thank Rom Pinchasi, Amir Shpilka, and Avi Wigderson for helpful discussions and comments.  Acknowledgments  References  Noga Alon. Eigenvalues and expanders. Combinatorica, 6(2):83-96, 1986a. doi: 10.1007/  BF02579166. URL http://dx.doi.org/10.1007/BF02579166.  Noga Alon. Eigenvalues, geometric expanders, sorting in rounds, and ramsey theory. Combina- torica, 6(3):207-219, 1986b. doi: 10.1007/BF02579382. URL http://dx.doi.org/10. 1007/BF02579382. ALON MORAN YEHUDAYOFF  Noga Alon. A parallel algorithmic version of the local lemma. Random Struct. Algorithms, 2 (4):367-378, 1991. doi: 10.1002/rsa.3240020403. URL http://dx.doi.org/10.1002/ rsa.3240020403.  Noga Alon and V. D. Milman. Eigenvalues, expanders and superconcentrators (extended abstract). In 25th Annual Symposium on Foundations of Computer Science, West Palm Beach, Florida, USA, 24-26 October 1984, pages 320-322, 1984. doi: 10.1109/SFCS.1984.715931. URL http: //dx.doi.org/10.1109/SFCS.1984.715931.  Noga Alon and V. D. Milman. lambda1, isoperimetric inequalities for graphs, and superconcentra- tors. J. Comb. Theory, Ser. B, 38(1):73-88, 1985. doi: 10.1016/0095-8956(85)90092-9. URL http://dx.doi.org/10.1016/0095-8956(85)90092-9.  Noga Alon, Peter Frankl, and Vojtech R¨odl. Geometrical realization of set systems and probabilistic communication complexity. In 26th Annual Symposium on Foundations of Computer Science, Portland, Oregon, USA, 21-23 October 1985, pages 277-280, 1985. doi: 10.1109/SFCS.1985.30. URL http://dx.doi.org/10.1109/SFCS.1985.30.  Noga Alon, David Haussler, and Emo Welzl. Partitioning and geometric embedding of range spaces In Proceedings of the Third Annual Symposium on of finite vapnik-chervonenkis dimension. Computational Geometry, Waterloo, Ontario, Canada, June 8-10, 1987, pages 331-340, 1987. doi: 10.1145/41958.41994. URL http://doi.acm.org/10.1145/41958.41994.  Noga Alon, Lajos R´onyai, and Tibor Szab´o. Norm-graphs: Variations and applications. J. Comb. Theory, Ser. B, 76(2):280-290, 1999. doi: 10.1006/jctb.1999.1906. URL http://dx.doi. org/10.1006/jctb.1999.1906.  Noga Alon, J´ozsef Balogh, B´ela Bollob´as, and Robert Morris. The structure of almost all graphs in a hereditary property. J. Comb. Theory, Ser. B, 101(2):85-110, 2011. doi: 10.1016/j.jctb.2010. 10.001. URL http://dx.doi.org/10.1016/j.jctb.2010.10.001.  Richard P. Anstee, Lajos R´onyai, and Attila Sali. Shattering news. Graphs and Combinatorics, 18(1):59-73, 2002. doi: 10.1007/s003730200003. URL http://dx.doi.org/10.1007/ s003730200003.  Rosa I. Arriaga and Santosh Vempala. An algorithmic theory of learning: Robust concepts and random projection. Machine Learning, 63(2):161-182, 2006. doi: 10.1007/s10994-006-6265-7. URL http://dx.doi.org/10.1007/s10994-006-6265-7.  Hans-J¨urgen Bandelt, Victor Chepoi, Andreas W. M. Dress, and Jack H. Koolen. Combinatorics of lopsided sets. Eur. J. Comb., 27(5):669-689, 2006. doi: 10.1016/j.ejc.2005.03.001. URL http://dx.doi.org/10.1016/j.ejc.2005.03.001.  Ronen Basri, Pedro F. Felzenszwalb, Ross B. Girshick, David W. Jacobs, and Caroline J. Klivans. Visibility constraints on features of 3d objects. In 2009 IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR 2009), 20-25 June 2009, Miami, Florida, USA, pages 1231-1238, 2009. doi: 10.1109/CVPRW.2009.5206726. URL http://dx.doi.org/ 10.1109/CVPRW.2009.5206726. SIGN RANK VERSUS VC DIMENSION  Shai Ben-David and Michael Lindenbaum. Localization vs. identification of semi-algebraic sets. Machine Learning, 32(3):207-224, 1998. doi: 10.1023/A:1007447530834. URL http://dx. doi.org/10.1023/A:1007447530834.  Shai Ben-David, Nadav Eiron, and Hans-Ulrich Simon. Limitations of learning via embeddings in euclidean half spaces. Journal of Machine Learning Research, 3:441-461, 2002. URL http: //www.jmlr.org/papers/v3/bendavid02a.html.  Albrecht Beutelspacher and Ute Rosenbaum. Projective geometry - from foundations to applica-  tions. Cambridge University Press, 1998. ISBN 978-0-521-48277-6.  Amey Bhangale and Swastik Kopparty. The complexity of computing the minimum rank of a sign pattern matrix. CoRR, abs/1503.04486, 2015. URL http://arxiv.org/abs/1503. 04486.  Anselm Blumer, Andrzej Ehrenfeucht, David Haussler, and Manfred K. Warmuth. Classifying learnable geometric concepts with the vapnik-chervonenkis dimension (extended abstract). In Ju- ris Hartmanis, editor, Proceedings of the 18th Annual ACM Symposium on Theory of Computing, May 28-30, 1986, Berkeley, California, USA, pages 273-282. ACM, 1986. ISBN 0-89791-193-8. doi: 10.1145/12130.12158. URL http://doi.acm.org/10.1145/12130.12158.  B´ela Bollob´as and A. J. Radcliffe. Defect sauer results. J. Comb. Theory, Ser. A, 72(2):189-208,  1995.  Bernhard E. Boser, Isabelle Guyon, and Vladimir Vapnik. A training algorithm for optimal In David Haussler, editor, Proceedings of the Fifth Annual ACM Confer- margin classifiers. ence on Computational Learning Theory, COLT 1992, Pittsburgh, PA, USA, July 27-29, 1992., pages 144-152. ACM, 1992. ISBN 0-89791-497-X. doi: 10.1145/130385.130401. URL http://doi.acm.org/10.1145/130385.130401.  William G. Brown. On graphs that do not contain a Thomsen graph. Canadian Mathematical  Bulletin, 9:281-85, 1966.  Christopher J. C. Burges. A tutorial on support vector machines for pattern recognition. Data Min. Knowl. Discov., 2(2):121-167, 1998. doi: 10.1023/A:1009715923555. URL http:// dx.doi.org/10.1023/A:1009715923555.  Bernard Chazelle and Emo Welzl. Quasi-optimal range searching in space of finite vc-dimension. Discrete &amp; Computational Geometry, 4:467-489, 1989. doi: 10.1007/BF02187743. URL http://dx.doi.org/10.1007/BF02187743.  Fan R. K. Chung, Ronald L. Graham, Peter Frankl, and James B. Shearer. Some intersection theorems for ordered sets and graphs. J. Comb. Theory, Ser. A, 43(1):23-37, 1986. doi: 10. 1016/0097-3165(86)90019-1. URL http://dx.doi.org/10.1016/0097-3165(86) 90019-1.  Corinna Cortes and Vladimir Vapnik. Support-vector networks. Machine Learning, 20(3):273-297, 1995. doi: 10.1007/BF00994018. URL http://dx.doi.org/10.1007/BF00994018. ALON MORAN YEHUDAYOFF  J. Dodziuk. Difference equations, isoperimetric inequality and transience of certain random walks.  Trans. Am. Math. Soc., 284:787-794, 1984.  Thorsten Doliwa, Hans-Ulrich Simon, and Sandra Zilles. Recursive teaching dimension, learn- ing complexity, and maximum classes. In Marcus Hutter, Frank Stephan, Vladimir Vovk, and Thomas Zeugmann, editors, Algorithmic Learning Theory, 21st International Confer- ence, ALT 2010, Canberra, Australia, October 6-8, 2010. Proceedings, volume 6331 of Lecture Notes in Computer Science, pages 209-223. Springer, 2010. ISBN 978-3-642- 16107-0. doi: 10.1007/978-3-642-16108-7 19. URL http://dx.doi.org/10.1007/ 978-3-642-16108-7_19.  Thorsten Doliwa, Gaojian Fan, Hans Ulrich Simon, and Sandra Zilles. Recursive teaching dimen- sion, vc-dimension and sample compression. Journal of Machine Learning Research, 15(1): 3107-3131, 2014. URL http://dl.acm.org/citation.cfm?id=2697064.  Sally Floyd and Manfred K. Warmuth.  learnability, and the vapnik- chervonenkis dimension. Machine Learning, 21(3):269-304, 1995. doi: 10.1007/BF00993593. URL http://dx.doi.org/10.1007/BF00993593.  Sample compression,  J¨urgen Forster. A linear lower bound on the unbounded error probabilistic communication com- plexity. J. Comput. Syst. Sci., 65(4):612-625, 2002. doi: 10.1016/S0022-0000(02)00019-3. URL http://dx.doi.org/10.1016/S0022-0000(02)00019-3.  J¨urgen Forster and Hans-Ulrich Simon. On the smallest possible dimension and the largest possible margin of linear arrangements representing given concept classes. Theor. Comput. Sci., 350(1): 40-48, 2006. doi: 10.1016/j.tcs.2005.10.015. URL http://dx.doi.org/10.1016/j. tcs.2005.10.015.  J¨urgen Forster, Matthias Krause, Satyanarayana V. Lokam, Rustam Mubarakzjanov, Niels Schmitt, and Hans-Ulrich Simon. Relations between communication complexity, linear arrangements, and computational complexity. In Ramesh Hariharan, Madhavan Mukund, and V. Vinay, editors, FST TCS 2001: Foundations of Software Technology and Theoretical Computer Science, 21st Conference, Bangalore, India, December 13-15, 2001, Proceedings, volume 2245 of Lecture Notes in Computer Science, pages 171-182. Springer, 2001. ISBN 3-540-43002-4. doi: 10.1007/ 3-540-45294-X 15. URL http://dx.doi.org/10.1007/3-540-45294-X_15.  J¨urgen Forster, Niels Schmitt, Hans-Ulrich Simon, and Thorsten Suttorp. Estimating the optimal margins of embeddings in euclidean half spaces. Machine Learning, 51(3):263-281, 2003. doi: 10.1023/A:1022905618164. URL http://dx.doi.org/10.1023/A:1022905618164.  Peter Frankl. Traces of antichains. Graphs and Combinatorics, 5(1):295-299, 1989. doi: 10.1007/  BF01788682. URL http://dx.doi.org/10.1007/BF01788682.  Bernd G¨artner and Emo Welzl. Vapnik-chervonenkis dimension and (pseudo-)hyperplane arrange- ments. Discrete &amp; Computational Geometry, 12:399-432, 1994. doi: 10.1007/BF02574389. URL http://dx.doi.org/10.1007/BF02574389.  David Haussler. Sphere packing numbers for subsets of the boolean n-cube with bounded vapnik-  chervonenkis dimension. J. Comb. Theory, Ser. A, 69(2):217-232, 1995. SIGN RANK VERSUS VC DIMENSION  David Haussler and Emo Welzl. epsilon-nets and simplex range queries. Discrete &amp; Computa- tional Geometry, 2:127-151, 1987. doi: 10.1007/BF02187876. URL http://dx.doi.org/ 10.1007/BF02187876.  Shlomo Hoory, Nathan Linial, and Avi Wigderson. Expander graphs and their applications. doi: 10.1090/  ISSN 0273-0979.  Bull. Amer. Math. Soc., 43(04):439-562, August 2006. s0273-0979-06-01126-8.  W. B. Johnson and J. Lindenstrauss. Extensions of Lipschitz mapping into Hilbert space. In Conf. in modern analysis and probability, volume 26 of Contemporary Mathematics, pages 189-206. American Mathematical Society, 1984.  P. Keevash. The existence of designs. CoRR, abs/1401.366, 2014.  J´anos Koml´os, J´anos Pach, and Gerhard J. Woeginger. Almost tight bounds for epsilon-nets. Dis- crete &amp; Computational Geometry, 7:163-173, 1992. doi: 10.1007/BF02187833. URL http://dx.doi.org/10.1007/BF02187833.  Ilan Kremer, Noam Nisan, and Dana Ron. On randomized one-round communication complexity. Computational Complexity, 8(1):21-49, 1999. doi: 10.1007/s000370050018. URL http:// dx.doi.org/10.1007/s000370050018.  Eyal Kushilevitz and Noam Nisan. Communication complexity. Cambridge University Press, 1997.  ISBN 978-0-521-56067-2.  Dima Kuzmin and Manfred K. Warmuth. Unlabeled compression schemes for maximum classes. Journal of Machine Learning Research, 8:2047-2081, 2007. URL http://dl.acm.org/ citation.cfm?id=1314566.  Troy Lee and Adi Shraibman. An approximation algorithm for approximation rank. In Proceed- ings of the 24th Annual IEEE Conference on Computational Complexity, CCC 2009, Paris, France, 15-18 July 2009, pages 351-357. IEEE Computer Society, 2009. ISBN 978-0-7695- 3717-7. doi: 10.1109/CCC.2009.25. URL http://doi.ieeecomputersociety.org/ 10.1109/CCC.2009.25.  Nathan Linial and Adi Shraibman.  Combinatorics, Probability &amp; Computing, 18(1-2):227-245, 2009. S0963548308009656. URL http://dx.doi.org/10.1017/S0963548308009656.  Learning complexity vs communication complexity. 10.1017/  doi:  Satyanarayana V. Lokam. Complexity lower bounds using linear algebra. Foundations and Trends in Theoretical Computer Science, 4(1-2):1-155, 2009. doi: 10.1561/0400000011. URL http: //dx.doi.org/10.1561/0400000011.  Jir´ı Matousek. Intersection graphs of segments and $\\exists\\mathbb{R}$. CoRR, abs/1406.2636,  2014. URL http://arxiv.org/abs/1406.2636.  Jir´ı Matousek, Emo Welzl, and Lorenz Wernisch. Discrepancy and approximations for bounded vc-dimension. Combinatorica, 13(4):455-466, 1993. doi: 10.1007/BF01303517. URL http: //dx.doi.org/10.1007/BF01303517. ALON MORAN YEHUDAYOFF  N. E. Mnev. The universality theorems on the classification problem of configuration varieties and  convex polytopes varieties. Topology and Geometry, 1346:527-544, 1989.  Shay Moran. Shattering-extremal systems. CoRR, abs/1211.2980, 2012. URL http://arxiv.  org/abs/1211.2980.  Shay Moran and Manfred K. Warmuth. Labeled compression schemes for extremal classes. CoRR,  abs/1506.00165, 2015. URL http://arxiv.org/abs/1506.00165.  A. Nilli. On the second eigenvalue of a graph. Discrete Mathematics, 91(2):207 - 210, 1991. ISSN 0012-365X. doi: http://dx.doi.org/10.1016/0012-365X(91)90112-F. URL http://www. sciencedirect.com/science/article/pii/0012365X9190112F.  Ramamohan Paturi and Janos Simon. Probabilistic communication complexity. J. Comput. Syst. Sci., 33(1):106-123, 1986. doi: 10.1016/0022-0000(86)90046-2. URL http://dx.doi. org/10.1016/0022-0000(86)90046-2.  Alexander A. Razborov and Alexander A. Sherstov. The sign-rank of ac0. SIAM J. Comput., 39 (5):1833-1855, 2010. doi: 10.1137/080744037. URL http://dx.doi.org/10.1137/ 080744037.  J. Richter-Gebert. Mn¨ev’s universality theorem revisited. S´emin. Lothar. Comb. (electronic), B34h,  1995.  Frank Rosenblatt. The perceptron-a perceiving and recognizing automaton. Technical Report 85-  460-1, Cornell Aeronautical Laboratory, 1957.  Benjamin I. P. Rubinstein and J. Hyam Rubinstein. A geometric approach to sample compression. Journal of Machine Learning Research, 13:1221-1261, 2012. URL http://dl.acm.org/ citation.cfm?id=2343686.  J. Hyam Rubinstein, Benjamin I. P. Rubinstein, and Peter L. Bartlett. Bounding embeddings of VC classes into maximum classes. CoRR, abs/1401.7388, 2014. URL http://arxiv.org/ abs/1401.7388.  Norbert Sauer. On the density of families of sets.  J. Comb. Theory, Ser. A, 13(1):145- 147, 1972. doi: 10.1016/0097-3165(72)90019-2. URL http://dx.doi.org/10.1016/ 0097-3165(72)90019-2.  Bernhard Sch¨olkopf, Alexander J. Smola, and Klaus-Robert M¨uller. Nonlinear component analysis as a kernel eigenvalue problem. Neural Computation, 10(5):1299-1319, 1998. doi: 10.1162/ 089976698300017467. URL http://dx.doi.org/10.1162/089976698300017467.  Alexander A. Sherstov.  2008. doi: s00037-008-0242-4.  Halfspace matrices. 10.1007/s00037-008-0242-4.  Computational Complexity, 17(2):149-178, URL http://dx.doi.org/10.1007/  Alexander A. Sherstov. Communication complexity under product and nonproduct distributions. Computational Complexity, 19(1):135-150, 2010. doi: 10.1007/s00037-009-0285-1. URL http://dx.doi.org/10.1007/s00037-009-0285-1. SIGN RANK VERSUS VC DIMENSION  Peter W. Shor. Stretchabilltv of pseudolines is np-hard.  In Peter Gritzmann and Bernd Sturm- fels, editors, Applied Geometry And Discrete Mathematics, Proceedings of a DIMACS Workshop, Providence, Rhode Island, USA, September 18, 1990, volume 4 of DIMACS Series in Discrete Mathematics and Theoretical Computer Science, pages 531-554. DIMACS/AMS, 1990. URL http://dimacs.rutgers.edu/Volumes/Vol04.html.  V. N. Vapnik and A. Ya. Chervonenkis. On the uniform convergence of relative frequencies of events to their probabilities. Theory of Probability and its Applications, 16(2):264-280, 1971. doi: 10.1137/1116025. URL http://link.aip.org/link/?TPR/16/264/1.  Vladimir Vapnik. Statistical learning theory. Wiley, 1998. ISBN 978-0-471-03003-4.  H. E. Warren. Lower bounds for approximation by nonlinear manifolds. Trans. Amer. Math. Soc.,  133:167-178, 1968.  Emo Welzl. Partition trees for triangle counting and other range searching problems. In Herbert Edelsbrunner, editor, Proceedings of the Fourth Annual Symposium on Computational Geometry, Urbana-Champaign, IL, USA, June 6-8, 1988, pages 23-33. ACM, 1988. ISBN 0-89791-270-5. doi: 10.1145/73393.73397. URL http://doi.acm.org/10.1145/73393.73397."}