{"1": "Maryam Aliakbarpour, Amartya Shankha Biswas, Themis Gouleakis, John Peebles, Ronitt Rubinfeld, and Anak Yodpinyanee. Sublinear-time algorithms for counting star subgraphs via edge sampling. Algorithmica, pages 1-30.  Coren L. Apicella, Frank W. Marlowe, James H. Fowler, and Nicholas A. Christakis. Social networks and cooperation in hunter-gatherers. Nature, 481(7382):497-501, 01 2012. URL http://dx.doi.org/10.1038/nature10736.  Peter J. Bickel, Aiyou Chen, and Elizaveta Levina. The method of moments and degree distributions for network models. Ann. Statist., 39(5):2280-2301, 2011. ISSN 0090-5364. doi: 10.1214/11-AOS904. URL http://dx.doi.org/10.1214/11-AOS904.  Norman Biggs. On cluster expansions in graph theory and physics. Quart. J. Math. Oxford Ser. (2), 29(114):159-173, 1978. ISSN 0033-5606. doi: 10.1093/qmath/29.2.159. URL http://dx.doi.org/10.1093/qmath/29.2.159.  T.T. Cai and M. G. Low. Testing composite hypotheses, Hermite polynomials and optimal  estimation of a nonsmooth functional. 39(2):1012-1041, 2011.  Michael Capobianco. Estimating the connectivity of a graph. In Y. Alavi, D. R. Lick, and A. T. White, editors, Graph Theory and Applications, pages 65-74, Berlin, Heidelberg, 1972. Springer Berlin Heidelberg.  Arun Chandrasekhar and Randall Lewis. Econometrics of sampled networks. 2011.  Hao Chen, Nancy Zhang, et al. Graph-based change-point detection. The Annals of Statis-  tics, 43(1):139-176, 2015.  Lynna Chu and Hao Chen. Asymptotic distribution-free change-point detection for modern  data. arXiv preprint arXiv:1707.00167, 2017.  Graham Cormode and Nick Duﬃeld. Sampling for big data: a tutorial.  In Proceedings of the 20th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, pages 1975-1975. ACM, 2014.  Talya Eden, Amit Levi, Dana Ron, and C. Seshadhri. Approximately counting triangles in sublinear time. In 2015 IEEE 56th Annual Symposium on Foundations of Computer Science—FOCS 2015, pages 614-633. IEEE Computer Soc., Los Alamitos, CA, 2015.  Paul Erd¨os, L´aszl´o Lov´asz, and Joel Spencer. Strong independence of graphcopy functions. In Graph theory and related topics (Proc. Conf., Univ. Waterloo, Waterloo, Ont., 1977), pages 165-172. Academic Press, New York-London, 1979.  Uriel Feige. On sums of independent random variables with unbounded variance and estimating the average degree in a graph. SIAM J. Comput., 35(4):964-984, 2006. ISSN 0097-5397. doi: 10.1137/S0097539704447304. URL http://dx.doi.org/10.1137/ S0097539704447304.  13   Counting Motifs with Graph Sampling  References  Maryam Aliakbarpour, Amartya Shankha Biswas, Themis Gouleakis, John Peebles, Ronitt Rubinfeld, and Anak Yodpinyanee. Sublinear-time algorithms for counting star subgraphs via edge sampling. Algorithmica, pages 1-30.  Coren L. Apicella, Frank W. Marlowe, James H. Fowler, and Nicholas A. Christakis. Social networks and cooperation in hunter-gatherers. Nature, 481(7382):497-501, 01 2012. URL http://dx.doi.org/10.1038/nature10736.  Peter J. Bickel, Aiyou Chen, and Elizaveta Levina. The method of moments and degree distributions for network models. Ann. Statist., 39(5):2280-2301, 2011. ISSN 0090-5364. doi: 10.1214/11-AOS904. URL http://dx.doi.org/10.1214/11-AOS904.  Norman Biggs. On cluster expansions in graph theory and physics. Quart. J. Math. Oxford Ser. (2), 29(114):159-173, 1978. ISSN 0033-5606. doi: 10.1093/qmath/29.2.159. URL http://dx.doi.org/10.1093/qmath/29.2.159.  T.T. Cai and M. G. Low. Testing composite hypotheses, Hermite polynomials and optimal  estimation of a nonsmooth functional. 39(2):1012-1041, 2011.  Michael Capobianco. Estimating the connectivity of a graph. In Y. Alavi, D. R. Lick, and A. T. White, editors, Graph Theory and Applications, pages 65-74, Berlin, Heidelberg, 1972. Springer Berlin Heidelberg.  Arun Chandrasekhar and Randall Lewis. Econometrics of sampled networks. 2011.  Hao Chen, Nancy Zhang, et al. Graph-based change-point detection. The Annals of Statis-  tics, 43(1):139-176, 2015.  Lynna Chu and Hao Chen. Asymptotic distribution-free change-point detection for modern  data. arXiv preprint arXiv:1707.00167, 2017.  Graham Cormode and Nick Duﬃeld. Sampling for big data: a tutorial.  In Proceedings of the 20th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, pages 1975-1975. ACM, 2014.  Talya Eden, Amit Levi, Dana Ron, and C. Seshadhri. Approximately counting triangles in sublinear time. In 2015 IEEE 56th Annual Symposium on Foundations of Computer Science—FOCS 2015, pages 614-633. IEEE Computer Soc., Los Alamitos, CA, 2015.  Paul Erd¨os, L´aszl´o Lov´asz, and Joel Spencer. Strong independence of graphcopy functions. In Graph theory and related topics (Proc. Conf., Univ. Waterloo, Waterloo, Ont., 1977), pages 165-172. Academic Press, New York-London, 1979.  Uriel Feige. On sums of independent random variables with unbounded variance and estimating the average degree in a graph. SIAM J. Comput., 35(4):964-984, 2006. ISSN 0097-5397. doi: 10.1137/S0097539704447304. URL http://dx.doi.org/10.1137/ S0097539704447304. Klusowski Wu  Chao Gao and John Laﬀerty. Testing network structure using relations between small  subgraph probabilities. arXiv preprint arXiv:1704.06742, 2017.  Pablo M Gleiser and Leon Danon. Community structure in jazz. Advances in Complex  Systems, 6(04):565-573, 2003.  Oded Goldreich and Dana Ron. Approximating average parameters of graphs. Random ISSN 1042-9832. doi: 10.1002/rsa.20203.  Structures Algorithms, 32(4):473-493, 2008. URL http://dx.doi.org/10.1002/rsa.20203.  Mira Gonen, Dana Ron, and Yuval Shavitt. Counting stars and other small subgraphs in sublinear-time. SIAM J. Discrete Math., 25(3):1365-1411, 2011. ISSN 0895-4801. doi: 10.1137/100783066. URL http://dx.doi.org/10.1137/100783066.  Jing-Dong J Han, Denis Dupuy, Nicolas Bertin, Michael E Cusick, and Marc Vidal. Ef- fect of sampling on topology predictions of protein-protein interaction networks. Nature Biotechnology, 23(7):839, 2005.  Mark S. Handcock and Krista J. Gile. Modeling social networks from sampled data. Ann. Appl. Stat., 4(1):5-25, 2010. ISSN 1932-6157. URL https://doi.org/10.1214/ 08-AOAS221.  Denis Hanson. On the product of the primes. Canad. Math. Bull., 15:33-37, 1972. ISSN 0008-4395. doi: 10.4153/CMB-1972-007-7. URL http://dx.doi.org/10.4153/ CMB-1972-007-7.  Daniel G Horvitz and Donovan J Thompson. A generalization of sampling without replace- ment from a finite universe. Journal of the American Statistical Association, 47(260): 663-685, 1952.  Jiantao Jiao, Kartik Venkat, Yanjun Han, and Tsachy Weissman. Minimax estimation of functionals of discrete distributions. IEEE Transactions on Information Theory, 61(5): 2835-2885, 2015.  Jason M. Klusowski and Yihong Wu. Estimating the number of connected components in  a graph via subgraph sampling. arXiv preprint arXiv:1801.04339, 2018.  W. L. Kocay. Some new methods in reconstruction theory. In Combinatorial mathematics, IX (Brisbane, 1981), volume 952 of Lecture Notes in Math., pages 89-114. Springer, Berlin-New York, 1982.  Eric D Kolaczyk. Statistical Analysis of Network Data: Methods and Models. Springer  Science & Business Media, 2009.  Eric D. Kolaczyk. Topics at the Frontier of Statistics and Network Analysis: (Re)Visiting the Foundations. SemStat Elements. Cambridge University Press, 2017. doi: 10.1017/ 9781108290159.  Oleg Lepski, Arkady Nemirovski, and Vladimir Spokoiny. On estimation of the Lr norm of  a regression function. 113(2):221-253, 1999. Counting Motifs with Graph Sampling  Jure Leskovec and Christos Faloutsos. Sampling from large graphs. In Proceedings of the 12th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, pages 631-636. ACM, 2006.  L´aszl´o Lov´asz. Large Networks and Graph Limits, volume 60. American Mathematical  Society, 2012.  arXiv:1010.5159, 2010.  L´aszl´o Lov´asz and Bal´azs Szegedy. The graph theoretic moment problem. arXiv preprint  Ron Milo, Shai Shen-Orr, Shalev Itzkovitz, Nadav Kashtan, Dmitri Chklovskii, and Uri Alon. Network motifs: simple building blocks of complex networks. Science, 298(5594): 824-827, 2002.  Elchanan Mossel, Joe Neeman, and Allan Sly. Reconstruction and estimation in the planted partition model. Probab. Theory Related Fields, 162(3-4):431-461, 2015. ISSN 0178-8051. URL https://doi.org/10.1007/s00440-014-0576-6.  M. Nair. On Chebyshev-type inequalities for primes. Amer. Math. Monthly, 89(2):126- 129, 1982. ISSN 0002-9890. doi: 10.2307/2320934. URL http://dx.doi.org/10.2307/ 2320934.  Natasa Prˇzulj, Derek G Corneil, and Igor Jurisica. Modeling interactome: scale-free or  geometric? Bioinformatics, 20(18):3508-3515, 2004.  Peter Uetz, Loic Giot, Gerard Cagney, Traci A Mansfield, Richard S Judson, James R Knight, Daniel Lockshon, Vaibhav Narayan, Maithreyan Srinivasan, Pascale Pochart, et al. A comprehensive analysis of protein-protein interactions in saccharomyces cere- visiae. Nature, 403(6770):623, 2000.  Stanley Wasserman and Katherine Faust. Social network analysis: Methods and applica-  tions, volume 8. Cambridge university press, 1994.  Douglas B. West. Introduction to graph theory. Prentice Hall, Inc., Upper Saddle River,  NJ, 1996. ISBN 0-13-227828-6.  Hassler Whitney. The coloring of graphs. Ann. of Math. (2), 33(4):688-718, 1932. ISSN  0003-486X. doi: 10.2307/1968214. URL http://dx.doi.org/10.2307/1968214.  Yihong Wu and Pengkun Yang. Minimax rates of entropy estimation on large alphabets via best polynomial approximation. IEEE Transactions on Information Theory, 62(6): 3702-3720, 2016."}