{"1": "Robert John Aumann. Game theory. In The new Palgrave: a dictionary of economics, pages 460-  482. London (UK) Macmillan, 1987.  James P. Bailey and Georgios Piliouras. Multiplicative weights update in zero-sum games. In EC,  pages 321-338, 2018.  D. Balduzzi, S. Racaniere, J. Martens, J. Foerster, K. Tuyls, and T. Graepel. The Mechanics of  n-Player Differentiable Games. In ICML, 2018.  G.W. Brown. Iterative solutions of games by fictitious play. In Activity Analysis of Production and  Allocation, T.C. Koopmans (Ed.), New York: Wiley., 1951.  Nikolo Cesa-Bianchi and Gabor Lugoisi. Prediction, Learning, and Games. Cambridge University  Press, 2006.  Yun Kuen Cheung. Multiplicative weights updates with constant step-size in graphical constant-sum  games. In NeurIPS 2018, pages 3532-3542, 2018.  Thiparat Chotibut, Fryderyk Falniowski, Michal Misiurewicz, and Georgios Piliouras. Family of  chaotic maps from game theory. arXiv preprint arXiv:1807.06831, 2018.  Constantinos Daskalakis and Ioannis Panageas. The limit points of (optimistic) gradient descent in min-max optimization. In Advances in Neural Information Processing Systems, pages 9256- 9266, 2018.  Constantinos Daskalakis and Ioannis Panageas. Last-iterate convergence: Zero-sum games and  constrained min-max optimization. ITCS, 2019.  Constantinos Daskalakis, Andrew Ilyas, Vasilis Syrgkanis, and Haoyang Zeng. Training gans with  optimism. In ICLR, 2018.  Biology, 18:123-133, 1983.  pages 325-332, 1996.  (4):1232-1236, 2013.  I. Eshel and E. Akin. Coevolutionary instability of mixed nash solutions. Journal of Mathematical  Yoav Freund and Robert E. Schapire. Game theory, on-line prediction and boosting.  In COLT,  Tobias Galla and J. Doyne Farmer. Complex dynamics in learning complicated games. PNAS, 110  Gauthier Gidel, Reyhane Askari Hemmat, Mohammad Pezeshki, Gabriel Huang, Remi Lepriol, Si- mon Lacoste-Julien, and Ioannis Mitliagkas. Negative momentum for improved game dynamics. In AISTATS, 2019.  13   CHAOS AND BUTTERFLY EFFECTS OF ONLINE LEARNING IN ZERO-SUM GAMES  Yun Kuen Cheung and Georgios Piliouras acknowledge SUTD grant SRG ESD 2015 097, MOE AcRF Tier 2 Grant 2016-T2-1-170, grant PIE-SGP-AI-2018-01 and NRF 2018 Fellowship NRF- NRFF2018-07.  Acknowledgments  References  Robert John Aumann. Game theory. In The new Palgrave: a dictionary of economics, pages 460-  482. London (UK) Macmillan, 1987.  James P. Bailey and Georgios Piliouras. Multiplicative weights update in zero-sum games. In EC,  pages 321-338, 2018.  D. Balduzzi, S. Racaniere, J. Martens, J. Foerster, K. Tuyls, and T. Graepel. The Mechanics of  n-Player Differentiable Games. In ICML, 2018.  G.W. Brown. Iterative solutions of games by fictitious play. In Activity Analysis of Production and  Allocation, T.C. Koopmans (Ed.), New York: Wiley., 1951.  Nikolo Cesa-Bianchi and Gabor Lugoisi. Prediction, Learning, and Games. Cambridge University  Press, 2006.  Yun Kuen Cheung. Multiplicative weights updates with constant step-size in graphical constant-sum  games. In NeurIPS 2018, pages 3532-3542, 2018.  Thiparat Chotibut, Fryderyk Falniowski, Michal Misiurewicz, and Georgios Piliouras. Family of  chaotic maps from game theory. arXiv preprint arXiv:1807.06831, 2018.  Constantinos Daskalakis and Ioannis Panageas. The limit points of (optimistic) gradient descent in min-max optimization. In Advances in Neural Information Processing Systems, pages 9256- 9266, 2018.  Constantinos Daskalakis and Ioannis Panageas. Last-iterate convergence: Zero-sum games and  constrained min-max optimization. ITCS, 2019.  Constantinos Daskalakis, Andrew Ilyas, Vasilis Syrgkanis, and Haoyang Zeng. Training gans with  optimism. In ICLR, 2018.  Biology, 18:123-133, 1983.  pages 325-332, 1996.  (4):1232-1236, 2013.  I. Eshel and E. Akin. Coevolutionary instability of mixed nash solutions. Journal of Mathematical  Yoav Freund and Robert E. Schapire. Game theory, on-line prediction and boosting.  In COLT,  Tobias Galla and J. Doyne Farmer. Complex dynamics in learning complicated games. PNAS, 110  Gauthier Gidel, Reyhane Askari Hemmat, Mohammad Pezeshki, Gabriel Huang, Remi Lepriol, Si- mon Lacoste-Julien, and Ioannis Mitliagkas. Negative momentum for improved game dynamics. In AISTATS, 2019. CHAOS AND BUTTERFLY EFFECTS OF ONLINE LEARNING IN ZERO-SUM GAMES  Ian J. Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, Bing Xu, David Warde-Farley, Sherjil Ozair, In Proceedings of the Aaron Courville, and Yoshua Bengio. Generative adversarial nets. 27th International Conference on Neural Information Processing Systems - Volume 2, NIPS’14, pages 2672-2680, Cambridge, MA, USA, 2014. MIT Press. URL http://dl.acm.org/ citation.cfm?id=2969033.2969125.  Ralph Howard. The inverse function theorem for lipschitz maps. http://people.math.sc.  edu/howard/Notes/inverse.pdf, 1997.  Tien-Yien Li and James A. Yorke. Period three implies chaos. The American Mathematical Monthly,  82(10):985-992, 1975. doi: 10.1080/00029890.1975.11994008.  P. Mertikopoulos, H. Zenati, B. Lecouat, C.-S. Foo, V. Chandrasekhar, and G. Piliouras. Mirror descent in saddle-point problems: Going the extra (gradient) mile. ArXiv e-prints, July 2018.  Panayotis Mertikopoulos, Christos Papadimitriou, and Georgios Piliouras. Cycles in adversarial  regularized learning. In ACM-SIAM Symposium on Discrete Algorithms, 2018.  Noam Nisan, Tim Roughgarden, Eva Tardos, and Vijay V. Vazirani. Algorithmic Game Theory.  Cambridge University Press, New York, NY, USA, 2007. ISBN 0521872820.  Brynjulf Owren. Volume preserving methods. https://wiki.math.ntnu.no/_media/  aarms2015/lectures/volumepreservation.pdf, 2015.  Gerasimos Palaiopanos, Ioannis Panageas, and Georgios Piliouras. Multiplicative weights update with constant step-size in congestion games: Convergence, limit cycles and chaos. In NIPS, pages 5874-5884, 2017.  Georgios Piliouras and Leonard J. Schulman. Learning dynamics and the co-evolution of competing  sexual species. In ITCS, 2018.  Georgios Piliouras and Jeff S. Shamma. Optimization despite chaos: Convex relaxations to complex  limit sets via poincar´e recurrence. In SODA, pages 861-873, 2014.  J. Robinson. An iterative method of solving a game. Annals of Mathematics, 54:296-301, 1951.  Tim Roughgarden. Twenty lectures on algorithmic game theory. Cambridge University Press, 2016.  Yuzuru Sato, Eizo Akiyama, and J. Doyne Farmer. Chaos in learning a simple two-person game.  PNAS, 99(7):4748-4751, 2002.  John von Neumann. Zur theorie der gesellschaftsspiele. Mathematische Annalen, 100:295-300,  1928.  University Press, 1944.  John von Neumann and Oskar Morgenstern. Theory of Games and Economic Behavior. Princeton  Y. Yazıcı, C.-S. Foo, S. Winkler, K.-H. Yap, G. Piliouras, and V. Chandrasekhar. The Unusual  Effectiveness of Averaging in GAN Training. ArXiv e-prints, June 2018.  H Peyton Young. Strategic learning and its limits. Oxford Univ. Press, 2004. CHAOS AND BUTTERFLY EFFECTS OF ONLINE LEARNING IN ZERO-SUM GAMES"}