{"1": "Jayadev Acharya, Ilias Diakonikolas, Jerry Li, and Ludwig Schmidt. Sample-optimal density esti- mation in nearly-linear time. In Proceedings of the Twenty-Eighth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 1278-1289. SIAM, 2017.  Quentin Berthet and Philippe Rigollet. Optimal detection of sparse principal components in high  dimension. The Annals of Statistics, 41(4):1780-1815, 2013a.  Quentin Berthet and Philippe Rigollet. Computational lower bounds for sparse pca. arXiv preprint  arXiv:1304.0828, 2013b.  Kush Bhatia, Prateek Jain, and Purushottam Kar. Robust regression via hard thresholding.  In  Advances in Neural Information Processing Systems, pages 721-729, 2015.  Jacob Bien and Robert J Tibshirani. Sparse estimation of a covariance matrix. Biometrika, 98(4):  807, 2011.  13   COMPUTATIONALLY EFFICIENT ROBUST SPARSE ESTIMATION IN HIGH DIMENSIONS  Algorithm 4 Robust estimation of the top principal component  1: Input: samples x1, . . . , xn, error rate (cid:15), failure probability δ, signal to noise ratio ρ 2: Let w∗, A∗ be the solution to  argminw∈Sn,(cid:15),A∈Xk  wi(xixT  i − I) − ρA  (22)  (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12)  n (cid:88)  i=1  ∗  (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12) (cid:12)  W2k  3: Let u be the top eigenector of A∗ 4: return Pk(v)  6. Conclusion and Future Directions  In this paper we propose a computationally tractable robust algorithm for sparse high-dimensional statistical estimation problems. We develop a general result, which we then specialize to obtain corollaries for sparse mean/covariance estimation, sparse linear regression and sparse generalized linear models. In each of these problems, we obtain near optimal dependency on the contamination parameter, and sample complexities that depend only logarithmically on the ambient dimension.  Future directions of research include developing faster alternatives to the ellipsoid algorithm, to further relax the assumptions in various settings, and finally to close the gap in sample complexity to statistically optimal, albeit computationally intractable procedures (Chen et al., 2015, 2016).  Acknowledgments  S.B. was supported by the NSF grant DMS-1713003. S.S.D was supported by ARPA-E under grant in the the Terra program (Transportation Energy Resources from Renewable Agriculture) with title Automated TERRA Phenotyping System for Genetic Improvement of Energy Crops. J.L. was supported by NSF grant CCF-1217921, DOE grant DE-SC0008923, NSF CAREER Award CCF- 145326, and a NSF Graduate Research Fellowship. The authors would like to thank Michael Cohen, Ilias Diakonikolas, Ankur Moitra, Ludwig Schmidt and Martin Wainwright for useful discussions. A.S. was supported by the NSF CAREER grant IIS-1252412 and CCF-1563918.  References  Jayadev Acharya, Ilias Diakonikolas, Jerry Li, and Ludwig Schmidt. Sample-optimal density esti- mation in nearly-linear time. In Proceedings of the Twenty-Eighth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 1278-1289. SIAM, 2017.  Quentin Berthet and Philippe Rigollet. Optimal detection of sparse principal components in high  dimension. The Annals of Statistics, 41(4):1780-1815, 2013a.  Quentin Berthet and Philippe Rigollet. Computational lower bounds for sparse pca. arXiv preprint  arXiv:1304.0828, 2013b.  Kush Bhatia, Prateek Jain, and Purushottam Kar. Robust regression via hard thresholding.  In  Advances in Neural Information Processing Systems, pages 721-729, 2015.  Jacob Bien and Robert J Tibshirani. Sparse estimation of a covariance matrix. Biometrika, 98(4):  807, 2011. BALAKRISHNAN DU LI SINGH  Siu-On Chan, Ilias Diakonikolas, Xiaorui Sun, and Rocco A Servedio. Learning mixtures of struc- In Proceedings of the Twenty-Fourth Annual ACM-  tured distributions over discrete domains. SIAM Symposium on Discrete Algorithms, pages 1380-1394. SIAM, 2013.  Siu On Chan, Ilias Diakonikolas, Rocco A Servedio, and Xiaorui Sun. Near-optimal density esti- mation in near-linear time using variable-width histograms. In Advances in Neural Information Processing Systems, pages 1844-1852, 2014.  Moses Charikar, Jacob Steinhardt, and Gregory Valiant. Learning from untrusted data. arXiv  preprint arXiv:1611.02315, 2016.  Mengjie Chen, Chao Gao, and Zhao Ren. Robust covariance matrix estimation via matrix depth.  arXiv preprint arXiv:1506.00691, 2015.  Mengjie Chen, Chao Gao, and Zhao Ren. A general decision theory for huber’s epsilon-  contamination model. Electronic Journal of Statistics, 10(2):3752-3774, 2016.  Constantinos Daskalakis, Ilias Diakonikolas, and Rocco A Servedio. Learning k-modal distribu- tions via testing. In Proceedings of the twenty-third annual ACM-SIAM symposium on Discrete Algorithms, pages 1371-1385. Society for Industrial and Applied Mathematics, 2012.  Alexandre d’Aspremont, Laurent El Ghaoui, Michael I Jordan, and Gert RG Lanckriet. A direct formulation for sparse pca using semidefinite programming. SIAM review, 49(3):434-448, 2007.  Ilias Diakonikolas, Gautam Kamath, Daniel Kane, Jerry Li, Ankur Moitra, and Alistair Stewart. Robust estimators in high dimensions without the computational intractability. arXiv preprint arXiv:1604.06443, 2016a.  Ilias Diakonikolas, Daniel M Kane, and Alistair Stewart. Efficient robust proper learning of log-  concave distributions. arXiv preprint arXiv:1606.03077, 2016b.  Ilias Diakonikolas, Daniel M Kane, and Alistair Stewart.  Statistical query lower bounds for robust estimation of high-dimensional gaussians and gaussian mixtures. arXiv preprint arXiv:1611.03473, 2016c.  Martin Gr¨otschel, L´aszl´o Lov´asz, and Alexander Schrijver. Geometric algorithms and combinato-  rial optimization, volume 2. Springer Science & Business Media, 2012.  Frank R Hampel, Elvezio M Ronchetti, Peter J Rousseeuw, and Werner A Stahel. Robust statistics:  the approach based on inﬂuence functions, volume 114. John Wiley & Sons, 2011.  Cecil Hastings Jr, Frederick Mosteller, John W Tukey, and Charles P Winsor. Low moments for small samples: a comparative study of order statistics. The Annals of Mathematical Statistics, pages 413-426, 1947.  Peter J Huber. Robust estimation of a location parameter. The Annals of Mathematical Statistics,  35(1):73-101, 1964.  36(6):1753-1758, 1965.  Peter J Huber. A robust version of the probability ratio test. The Annals of Mathematical Statistics, COMPUTATIONALLY EFFICIENT ROBUST SPARSE ESTIMATION IN HIGH DIMENSIONS  Peter J Huber. Robust statistics. Springer, 2011.  Prateek Jain, Ambuj Tewari, and Purushottam Kar. On iterative hard thresholding methods for high-dimensional m-estimation. In Advances in Neural Information Processing Systems, pages 685-693, 2014.  Iain M. Johnstone. On the distribution of the largest eigenvalue in principal components analysis.  Ann. Statist., 29(2):295-327, 04 2001.  Michael Kearns. Efficient noise-tolerant learning from statistical queries. J. ACM, 45(6):983-1006,  1998.  Kevin A Lai, Anup B Rao, and Santosh Vempala. Agnostic estimation of mean and covariance.  arXiv preprint arXiv:1604.06968, 2016.  Malik Magdon-Ismail. Np-hardness and inapproximability of sparse pca.  arXiv preprint  arXiv:1502.05675, 2015.  Michael L Overton and Robert S Womersley. On the sum of the largest eigenvalues of a symmetric  matrix. SIAM Journal on Matrix Analysis and Applications, 13(1):41-45, 1992.  Amelia Perry, Alexander S Wein, Afonso S Bandeira, and Ankur Moitra. Optimality and arXiv preprint  sub-optimality of pca for spiked random matrices and synchronization. arXiv:1609.05573, 2016.  Charles Stein. Dependent random variables. 1971.  Andreas M Tillmann and Marc E Pfetsch. The computational complexity of the restricted isometry property, the nullspace property, and related concepts in compressed sensing. IEEE Transactions on Information Theory, 60(2):1248-1259, 2014.  John W Tukey. Mathematics and the picturing of data. In Proceedings of the international congress  of mathematicians, volume 2, pages 523-531, 1975.  Vincent Q Vu, Juhee Cho, Jing Lei, and Karl Rohe. Fantope projection and selection: A near- optimal convex relaxation of sparse pca. In Advances in neural information processing systems, pages 2670-2678, 2013.  Tengyao Wang, Quentin Berthet, and Richard J Samworth. Statistical and computational trade-offs in estimation of sparse principal components. The Annals of Statistics, 44(5):1896-1930, 2016.  Yannis G Yatracos. Rates of convergence of minimum distance estimators and kolmogorov’s en-  tropy. The Annals of Statistics, 13(2):768-774, 1985. BALAKRISHNAN DU LI SINGH"}