{"1": "Maria-Florina Balcan, Andrei Z. Broder, and Tong Zhang. Margin based active learning.  In COLT, pages 35-50, 2007.  Maria-Florina Balcan, Steve Hanneke, and Jennifer Wortman Vaughan. The true sample  complexity of active learning. Machine Learning, 80(2-3):111-139, 2010.  Shai Ben-David, Alon Itai, and Eyal Kushilevitz. Learning by distances. In COLT, pages  232-245, 1990.  Alina Beygelzimer, Sanjoy Dasgupta, and John Langford.  Importance weighted active  learning. In ICML, page 7, 2009.  Alina Beygelzimer, Daniel Hsu, John Langford, and Tong Zhang. Agnostic active learning  without constraints. In NIPS, pages 199-207, 2010.  Avrim Blum, Alan M. Frieze, Ravi Kannan, and Santosh Vempala. A polynomial-time algorithm for learning noisy linear threshold functions. Algorithmica, 22(1/2):35-52, 1998.  Sanjoy Dasgupta. Analysis of a greedy active learning strategy. In NIPS, 2004.  Sanjoy Dasgupta. Coarse sample complexity bounds for active learning. In NIPS, 2005.  Sanjoy Dasgupta. Two faces of active learning. Theor. Comput. Sci., 412(19):1767-1781,  2011.  208-215, 2008.  Sanjoy Dasgupta and Daniel Hsu. Hierarchical sampling for active learning. In ICML, pages  Sanjoy Dasgupta, Daniel Hsu, and Claire Monteleoni. A general agnostic active learning  algorithm. In ISAIM, 2008.  Vitaly Feldman, Elena Grigorescu, Lev Reyzin, Santosh Vempala, and Ying Xiao. Statistical algorithms and a lower bound for detecting planted cliques. STOC 2013, to appear, 2013.  Alon Gonen, Sivan Sabato, and Shai Shalev-Shwartz. Active learning halfspaces under  margin assumptions. CoRR, abs/1112.1556, 2011.  Steve Hanneke. A bound on the label complexity of agnostic active learning. In ICML,  pages 353-360, 2007.  Steve Hanneke. Activized learning: Transforming passive to active with improved label complexity. Journal of Machine Learning Research (JMLR), 13(May):14691587, 2012.  Matti K¨a¨ari¨ainen. Active learning in the non-realizable case. In ALT, pages 63-77, 2006.  Michael J. Kearns. Eﬃcient noise-tolerant learning from statistical queries. In STOC, pages  392-401, 1993.  14   Urner Wulff Ben-David  References  Maria-Florina Balcan, Andrei Z. Broder, and Tong Zhang. Margin based active learning.  In COLT, pages 35-50, 2007.  Maria-Florina Balcan, Steve Hanneke, and Jennifer Wortman Vaughan. The true sample  complexity of active learning. Machine Learning, 80(2-3):111-139, 2010.  Shai Ben-David, Alon Itai, and Eyal Kushilevitz. Learning by distances. In COLT, pages  232-245, 1990.  Alina Beygelzimer, Sanjoy Dasgupta, and John Langford.  Importance weighted active  learning. In ICML, page 7, 2009.  Alina Beygelzimer, Daniel Hsu, John Langford, and Tong Zhang. Agnostic active learning  without constraints. In NIPS, pages 199-207, 2010.  Avrim Blum, Alan M. Frieze, Ravi Kannan, and Santosh Vempala. A polynomial-time algorithm for learning noisy linear threshold functions. Algorithmica, 22(1/2):35-52, 1998.  Sanjoy Dasgupta. Analysis of a greedy active learning strategy. In NIPS, 2004.  Sanjoy Dasgupta. Coarse sample complexity bounds for active learning. In NIPS, 2005.  Sanjoy Dasgupta. Two faces of active learning. Theor. Comput. Sci., 412(19):1767-1781,  2011.  208-215, 2008.  Sanjoy Dasgupta and Daniel Hsu. Hierarchical sampling for active learning. In ICML, pages  Sanjoy Dasgupta, Daniel Hsu, and Claire Monteleoni. A general agnostic active learning  algorithm. In ISAIM, 2008.  Vitaly Feldman, Elena Grigorescu, Lev Reyzin, Santosh Vempala, and Ying Xiao. Statistical algorithms and a lower bound for detecting planted cliques. STOC 2013, to appear, 2013.  Alon Gonen, Sivan Sabato, and Shai Shalev-Shwartz. Active learning halfspaces under  margin assumptions. CoRR, abs/1112.1556, 2011.  Steve Hanneke. A bound on the label complexity of agnostic active learning. In ICML,  pages 353-360, 2007.  Steve Hanneke. Activized learning: Transforming passive to active with improved label complexity. Journal of Machine Learning Research (JMLR), 13(May):14691587, 2012.  Matti K¨a¨ari¨ainen. Active learning in the non-realizable case. In ALT, pages 63-77, 2006.  Michael J. Kearns. Eﬃcient noise-tolerant learning from statistical queries. In STOC, pages  392-401, 1993. PLAL  Michael J. Kearns. Eﬃcient noise-tolerant learning from statistical queries. J. ACM, 45(6):  983-1006, 1998.  Ingo Steinwart and Andreas Christmann. Support Vector Machines. Springer Publishing  Company, Incorporated, 1st edition, 2008. ISBN 0387772413.  Ingo Steinwart and Clint Scovel. Fast rates for support vector machines. 35(2):575-607,  2007.  Ruth Urner, Shai Ben-David, and Shai Shalev-Shwartz. Unlabeled data can speed up prediction time. Supplementay Material, 2011a. URL http://www.cs.uwaterloo.ca/ ~rurner/SupplementICML2011.pdf.  Ruth Urner, Shai Ben-David, and Shai Shalev-Shwartz. Unlabeled data can speed up  prediction time. In ICML, 2011b.  Nakul Verma, Samory Kpotufe, and Sanjoy Dasgupta. Which spatial partition trees are  adaptive to intrinsic dimension? CoRR, abs/1205.2609, 2012."}