{"1": "Ery Arias-Castro, Joseph Salmon, and Rebecca Willett. Oracle inequalities and minimax rates for nonlocal means and related adaptive kernel-based methods. SIAM Journal on Imaging Sciences, 5(3):944-992, 2012.  Taylor B. Arnold and Ryan J. Tibshirani. Efficient implementations of the generalized lasso dual path algorithm. Journal of Computational and Graphical Statistics, 25(1):1-27, 2016. doi: 10.1080/10618600.2015.1008638.  Pierre C. Bellec. Sharp oracle inequalities for Least Squares estimators in shape restricted regres-  sion. arXiv preprint arXiv:1510.08029, 2015.  B´ela Bollob´as. A probabilistic proof of an asymptotic formula for the number of labelled regular  graphs. European Journal of Combinatorics, 1(4):311-316, 1980.  St´ephane Boucheron, G´abor Lugosi, and Pascal Massart. Concentration Inequalities: A Nonasymp-  totic Theory of Independence. OUP Oxford, February 2013. ISBN 978-0-19-953525-5.  Sabyasachi Chatterjee, Adityanand Guntuboyina, and Bodhisattva Sen. On matrix estimation under  monotonicity constraints. arXiv preprint arXiv:1506.03430, 2015.  Fan RK Chung. Spectral graph theory, volume 92. American Mathematical Soc., 1997.  Arnak S. Dalalyan, Mohamed Hebiri, and Johannes Lederer. On the prediction performance of the lasso. to appear in Bernoulli, arXiv 1402.1700, February 2014. URL http://arxiv.org/ pdf/1402.1700v1.pdf.  David L. Donoho and Iain M. Johnstone. Adapting to unknown smoothness via wavelet shrinkage.  J. Amer. Statist. Assoc., 90(432):1200-1224, 1995. ISSN 0162-1459.  David L. Donoho and Jain M. Johnstone. Ideal spatial adaptation by wavelet shrinkage. Biometrika,  81(3):425-455, 1994.  Math. Soc, 195(910), May 2004.  J Friedman. A proof of Alon’s second eigenvalue conjecture and related problems. Mem. Amer.  Christophe Giraud. Introduction to high-dimensional statistics. CRC Press, 2014.  16   H ¨UTTER RIGOLLET  Acknowledgments  We would like to thank Vivian Viallon for bringing the paper by Sharpnack et al. (2012) to our attention. We thank the participants in the workshop “Computationally and Statistically Efficient Inference for Complex Large-scale Data”, that took place in Oberwolfach on March 6-12, 2016; in particular Axel Munk for pointers to the literature on the spectral decomposition of the Toeplitz ma- trix in (B.10) and Alessandro Rinaldo for interesting discussion. Finally, we thank Ryan Tibshirani for pointing us to the paper Wang et al. (2015) and discussing his results with us.  Philippe Rigollet is supported in part by NSF grants DMS-1317308 and CAREER-DMS-1053987.  References  Ery Arias-Castro, Joseph Salmon, and Rebecca Willett. Oracle inequalities and minimax rates for nonlocal means and related adaptive kernel-based methods. SIAM Journal on Imaging Sciences, 5(3):944-992, 2012.  Taylor B. Arnold and Ryan J. Tibshirani. Efficient implementations of the generalized lasso dual path algorithm. Journal of Computational and Graphical Statistics, 25(1):1-27, 2016. doi: 10.1080/10618600.2015.1008638.  Pierre C. Bellec. Sharp oracle inequalities for Least Squares estimators in shape restricted regres-  sion. arXiv preprint arXiv:1510.08029, 2015.  B´ela Bollob´as. A probabilistic proof of an asymptotic formula for the number of labelled regular  graphs. European Journal of Combinatorics, 1(4):311-316, 1980.  St´ephane Boucheron, G´abor Lugosi, and Pascal Massart. Concentration Inequalities: A Nonasymp-  totic Theory of Independence. OUP Oxford, February 2013. ISBN 978-0-19-953525-5.  Sabyasachi Chatterjee, Adityanand Guntuboyina, and Bodhisattva Sen. On matrix estimation under  monotonicity constraints. arXiv preprint arXiv:1506.03430, 2015.  Fan RK Chung. Spectral graph theory, volume 92. American Mathematical Soc., 1997.  Arnak S. Dalalyan, Mohamed Hebiri, and Johannes Lederer. On the prediction performance of the lasso. to appear in Bernoulli, arXiv 1402.1700, February 2014. URL http://arxiv.org/ pdf/1402.1700v1.pdf.  David L. Donoho and Iain M. Johnstone. Adapting to unknown smoothness via wavelet shrinkage.  J. Amer. Statist. Assoc., 90(432):1200-1224, 1995. ISSN 0162-1459.  David L. Donoho and Jain M. Johnstone. Ideal spatial adaptation by wavelet shrinkage. Biometrika,  81(3):425-455, 1994.  Math. Soc, 195(910), May 2004.  J Friedman. A proof of Alon’s second eigenvalue conjecture and related problems. Mem. Amer.  Christophe Giraud. Introduction to high-dimensional statistics. CRC Press, 2014. OPTIMAL RATES FOR TOTAL VARIATION DENOISING  Zaıd Harchaoui and C´eline L´evy-Leduc. Multiple change-point estimation with a total variation  penalty. Journal of the American Statistical Association, 2012.  Theodore Kolokolnikov, Braxton Osting, and James Von Brecht. Algebraic connectivity of Erd¨os- R´enyi graphs near the connectivity threshold. Manuscript in preparation, 2014. URL http: //www.mathstat.dal.ca/˜tkolokol/papers/critscaling4.pdf.  A. P. Korostelev and A. B. Tsybakov. Minimax Theory of Image Reconstruction, volume 82 of Lecture Notes in Statistics. Springer New York, New York, NY, 1993. ISBN 978-0-387-94028-1 978-1-4612-2712-0.  Enno Mammen and Sara van de Geer. Locally adaptive regression splines. The Annals of Statistics,  25(1):387-413, 1997.  Deanna Needell and Rachel Ward. Stable image reconstruction using total variation minimization.  SIAM Journal on Imaging Sciences, 6(2):1035-1058, 2013a.  Deanna Needell and Rachel Ward. Near-optimal compressed sensing guarantees for total variation  minimization. IEEE Transactions on Image Processing, 22(10):3941-3949, 2013b.  Edouard Ollier and Vivian Viallon. Regression modeling on stratified data: automatic and covariate- specific selection of the reference stratum with simple L1-norm penalties. arXiv:1508.05476 [math, stat], August 2015.  Golan Pundak. Random Regular Generator. MATLAB Central File Exchange, December 2010.  Junyang Qian and Jinzhu Jia. On pattern recovery of the fused Lasso. arXiv:1211.5194, November  2012.  2952, 2009.  A. Rinaldo. Properties and refinements of the fused lasso. The Annals of Statistics, 37(5B):2922-  Ralph Tyrell Rockafellar. Convex analysis. Princeton university press, 1970.  Leonid I. Rudin, Stanley Osher, and Emad Fatemi. Nonlinear total variation based noise removal  algorithms. Physica D: Nonlinear Phenomena, 60(1):259-268, 1992.  James Sharpnack, Aarti Singh, and Alessandro Rinaldo. Sparsistency of the edge lasso over graphs. In Neil D. Lawrence and Mark A. Girolami, editors, Proceedings of the Fifteenth International Conference on Artificial Intelligence and Statistics (AISTATS-12), volume 22, pages 1028-1036, 2012.  Yiyuan She. Sparse regression with exact clustering. Electronic Journal of Statistics, 4:1055-1096,  Gilbert Strang. Computational science and engineering, volume 1. Wellesley-Cambridge Press  2010.  Wellesley, 2007.  Robert Tibshirani, Michael Saunders, Saharon Rosset, Ji Zhu, and Keith Knight. Sparsity and smoothness via the fused lasso. Journal of the Royal Statistical Society: Series B (Statistical Methodology), 67(1):91-108, 2005. H ¨UTTER RIGOLLET  Vivian Viallon, Sophie Lambert-Lacroix, H¨olger Hoeﬂing, and Franck Picard. On the robustness of the generalized fused lasso to prior specifications. Statistics and Computing, 26(1-2):285-301, 2016.  Yu-Xiang Wang, James Sharpnack, Alex Smola, and Ryan Tibshirani. Trend Filtering on Graphs. In Proceedings of the Eighteenth International Conference on Artificial Intelligence and Statistics, pages 1042-1050, 2015.  Rebecca Willett, Robert Nowak, and Rui M. Castro. Faster rates in regression via active learning.  In Advances in Neural Information Processing Systems, pages 179-186, 2005.  Bo Xin, Yoshinobu Kawahara, Yizhou Wang, and Wen Gao. Efficient Generalized Fused Lasso and Its Application to the Diagnosis of Alzheimer’s Disease. In Twenty-Eighth AAAI Conference on Artificial Intelligence, pages 2163-2169, 2014."}