{"1": "tional Mathematics, 2007.  R. Baraniuk and M. Wakin. Random projections of smooth manifolds. Foundations of Computa-  M. Bernstein, V. de Silva, J. Langford, and J. Tenebaum. Graph approximations to geodesics on  embedded manifolds. Techical Report, 2000.  K. Clarkson. Tighter bounds for random projections of manifolds. Comp. Geometry, 2007.  S. Dasgupta and Y. Freund. Random projection trees and low dimensional manifolds. ACM Sym-  posium on Theory of Computing, 2008.  M. do Carmo. Riemannian Geometry. Birkhauser, 1992.  Q. Han and J. Hong. Isometric embedding of Riemannian manifolds in Euclidean spaces. American  Mathematical Society, 2006.  W. Johnson and J. Lindenstrauss. Extensions of Lipschitz mappings into a Hilbert space. Conf. in  Modern Analysis and Probability, pages 189–206, 1984.  J. Milnor. Topology from the differential viewpoint. Univ. of Virginia Press, 1972.  J. Nash. C1 isometric imbeddings. Annals of Mathematics, 60(3):383–396, 1954.  P. Niyogi, S. Smale, and S. Weinberger. Finding the homology of submanifolds with high conﬁdence  from random samples. Disc. Computational Geometry, 2006.  J. Tenebaum, V. de Silva, and J. Langford. A global geometric framework for nonlinear dimension-  ality reduction. Science, 290, 2000.  Report CS2011-0971, 2011.  N. Verma. A note on random projections for preserving paths on a manifold. UC San Diego, Tech.  H. Whitney. Differentiable manifolds. Annals of Mathematics, 37:645–680, 1936.  Appendix A. Properties of a Well-conditioned Manifold  Throughout this section we will assume that M is a compact submanifold of RD of dimension n, and condition number 1/τ . The following are some properties of such a manifold that would be useful throughout the text.  Lemma 16 (relating closeby tangent vectors – implicit in the proof of Proposition 6.2 Niyogi et al. (2006)) Pick any two (path-connected) points p, q ∈ M . Let u ∈ TpM be a unit length tangent vector and v ∈ TqM be its parallel transport along the (shortest) geodesic path to q. Then2, i) u · v ≥ 1 − DG(p, q)/τ , ii) (cid:107)u − v(cid:107) ≤ (cid:112)2DG(p, q)/τ .  2. Technically, it is not possible to directly compare two vectors that reside in different tangent spaces. However, since we only deal with manifolds that are immersed in some ambient space, we can treat the tangent spaces as n-dimensional afﬁne subspaces. We can thus parallel translate the vectors to the origin of the ambient space, and do the necessary comparison (such as take the dot product, etc.). We will make a similar abuse of notation for any calculation that uses vectors from different afﬁne subspaces to mean to ﬁrst translate the vectors and then perform the necessary calculation.  32.13   DISTANCE PRESERVING EMBEDDINGS FOR MANIFOLDS  References  tional Mathematics, 2007.  R. Baraniuk and M. Wakin. Random projections of smooth manifolds. Foundations of Computa-  M. Bernstein, V. de Silva, J. Langford, and J. Tenebaum. Graph approximations to geodesics on  embedded manifolds. Techical Report, 2000.  K. Clarkson. Tighter bounds for random projections of manifolds. Comp. Geometry, 2007.  S. Dasgupta and Y. Freund. Random projection trees and low dimensional manifolds. ACM Sym-  posium on Theory of Computing, 2008.  M. do Carmo. Riemannian Geometry. Birkhauser, 1992.  Q. Han and J. Hong. Isometric embedding of Riemannian manifolds in Euclidean spaces. American  Mathematical Society, 2006.  W. Johnson and J. Lindenstrauss. Extensions of Lipschitz mappings into a Hilbert space. Conf. in  Modern Analysis and Probability, pages 189-206, 1984.  J. Milnor. Topology from the differential viewpoint. Univ. of Virginia Press, 1972.  J. Nash. C1 isometric imbeddings. Annals of Mathematics, 60(3):383-396, 1954.  P. Niyogi, S. Smale, and S. Weinberger. Finding the homology of submanifolds with high confidence  from random samples. Disc. Computational Geometry, 2006.  J. Tenebaum, V. de Silva, and J. Langford. A global geometric framework for nonlinear dimension-  ality reduction. Science, 290, 2000.  Report CS2011-0971, 2011.  N. Verma. A note on random projections for preserving paths on a manifold. UC San Diego, Tech.  H. Whitney. Differentiable manifolds. Annals of Mathematics, 37:645-680, 1936."}