{"1": "[1] D.H. Ackley, G.E. Hinton, and T.J. Sejnowski. A Learning Algorithm for Boltzmann Ma-  chines. Cognitive Science, 9(1):147-169, 1985.  [2] A. Anandkumar, D.J. Hsu, F. Huang, and S.M. Kakade. Learning mixtures of tree graphical models. In Advances in Neural Information Processing Systems (NeurIPS), pages 1052-1060, 2012.  [3] T. Batu, E. Fischer, L. Fortnow, R. Kumar, R. Rubinfeld, and P. White. Testing random variables for independence and identity. In Proceedings of the 42nd Annual IEEE Symposium on Foundations of Computer Science (FOCS), pages 442-451, 2001.  [4] I. Bez´akov´a, A. Blanca, Z. Chen, D. ˇStefankoviˇc, and E. Vigoda. Lower bounds for testing graphical models: colorings and antiferromagnetic Ising models. ArXiv preprint ArXiv:1901.07361, 2019.  [5] A. Blanca, Z. Chen, D. ˇStefankoviˇc, and E. Vigoda. Structure Learning of H-colorings. In Proceedings of the 29th International Conference on Algorithmic Learning Theory (ALT), volume 83, pages 152-185, 2018.  [6] G. Bresler. Efficiently learning Ising models on arbitrary graphs. In Proceedings of the 47th  Annual ACM Symposium on Theory of Computing (STOC), pages 771-782, 2015.  [7] G. Bresler, E. Mossel, and A. Sly. Reconstruction of Markov random fields from samples: some observations and algorithms. SIAM Journal on Computing, 42(2):563-578, 2013.  [8] G. Bresler, D. Gamarnik, and D. Shah. Structure learning of antiferromagnetic Ising models. In Advances in Neural Information Processing Systems (NeurIPS), pages 2852-2860, 2014.  [9] G. Bresler, D. Gamarnik, and D. Shah. Hardness of parameter estimation in graphical models. In Advances in Neural Information Processing Systems (NeurIPS), pages 1062-1070, 2014.  [10] G. Brito, I. Dumitriu, and K.D. Harris. Spectral gap in random bipartite biregular graphs and  its applications. ArXiv preprint ArXiv:1804.07808, 2018.  [11] A.A. Bulatov, M. Dyer, L.A. Goldberg, M. Jerrum, and C. McQuillan. The expressibility of functions on the Boolean domain, with applications to Counting CSPs. Journal of the ACM (JACM), 60(5):32, 2013.  [12] J.-Y. Cai, A. Galanis, L.A. Goldberg, H. Guo, M. Jerrum, D. ˇStefankoviˇc, and E. Vigoda. #BIS-hardness for 2-spin systems on bipartite bounded degree graphs in the tree non- uniqueness region. Journal of Computer and System Sciences, 82(5):690-711, 2016.  [13] C. Calabro, R. Impagliazzo, V. Kabanets, and R. Paturi. The complexity of Unique k-SAT: An Isolation Lemma for k-CNFs. Journal of Computer and System Sciences, 74(3):386-393, 2008.  13   LOWER BOUNDS FOR TESTING GRAPHICAL MODELS  Research supported by NSF grants 1819546, CCF-1617306, CCF-1563838 and CCF-1563757.  Acknowledgments  References  [1] D.H. Ackley, G.E. Hinton, and T.J. Sejnowski. A Learning Algorithm for Boltzmann Ma-  chines. Cognitive Science, 9(1):147-169, 1985.  [2] A. Anandkumar, D.J. Hsu, F. Huang, and S.M. Kakade. Learning mixtures of tree graphical models. In Advances in Neural Information Processing Systems (NeurIPS), pages 1052-1060, 2012.  [3] T. Batu, E. Fischer, L. Fortnow, R. Kumar, R. Rubinfeld, and P. White. Testing random variables for independence and identity. In Proceedings of the 42nd Annual IEEE Symposium on Foundations of Computer Science (FOCS), pages 442-451, 2001.  [4] I. Bez´akov´a, A. Blanca, Z. Chen, D. ˇStefankoviˇc, and E. Vigoda. Lower bounds for testing graphical models: colorings and antiferromagnetic Ising models. ArXiv preprint ArXiv:1901.07361, 2019.  [5] A. Blanca, Z. Chen, D. ˇStefankoviˇc, and E. Vigoda. Structure Learning of H-colorings. In Proceedings of the 29th International Conference on Algorithmic Learning Theory (ALT), volume 83, pages 152-185, 2018.  [6] G. Bresler. Efficiently learning Ising models on arbitrary graphs. In Proceedings of the 47th  Annual ACM Symposium on Theory of Computing (STOC), pages 771-782, 2015.  [7] G. Bresler, E. Mossel, and A. Sly. Reconstruction of Markov random fields from samples: some observations and algorithms. SIAM Journal on Computing, 42(2):563-578, 2013.  [8] G. Bresler, D. Gamarnik, and D. Shah. Structure learning of antiferromagnetic Ising models. In Advances in Neural Information Processing Systems (NeurIPS), pages 2852-2860, 2014.  [9] G. Bresler, D. Gamarnik, and D. Shah. Hardness of parameter estimation in graphical models. In Advances in Neural Information Processing Systems (NeurIPS), pages 1062-1070, 2014.  [10] G. Brito, I. Dumitriu, and K.D. Harris. Spectral gap in random bipartite biregular graphs and  its applications. ArXiv preprint ArXiv:1804.07808, 2018.  [11] A.A. Bulatov, M. Dyer, L.A. Goldberg, M. Jerrum, and C. McQuillan. The expressibility of functions on the Boolean domain, with applications to Counting CSPs. Journal of the ACM (JACM), 60(5):32, 2013.  [12] J.-Y. Cai, A. Galanis, L.A. Goldberg, H. Guo, M. Jerrum, D. ˇStefankoviˇc, and E. Vigoda. #BIS-hardness for 2-spin systems on bipartite bounded degree graphs in the tree non- uniqueness region. Journal of Computer and System Sciences, 82(5):690-711, 2016.  [13] C. Calabro, R. Impagliazzo, V. Kabanets, and R. Paturi. The complexity of Unique k-SAT: An Isolation Lemma for k-CNFs. Journal of Computer and System Sciences, 74(3):386-393, 2008. LOWER BOUNDS FOR TESTING GRAPHICAL MODELS  [14] C.L. Canonne, I. Diakonikolas, T. Gouleakis, and R. Rubinfeld. Testing Shape Restrictions of  Discrete Distributions. Theory of Computing Systems, 62(1):4-62, 2018.  [15] X. Chen, M. Dyer, L.A. Goldberg, M. Jerrum, P. Lu, C. McQuillan, and D. Richerby. The complexity of approximating conservative counting CSPs. Journal of Computer and System Sciences, 81(1):311-329, 2015.  [16] C.K. Chow and C. Liu. Approximating discrete probability distributions with dependence  trees. IEEE Transactions on Information Theory, 14(3):462-467, 1968.  [17] A. Collevecchio, T.M. Garoni, T. Hyndman, and D. Tokarev. The Worm process for the Ising  model is rapidly mixing. Journal of Statistical Physics, 164(5):1082-1102, 2016.  [18] S. Dasgupta. Learning polytrees. In Proceedings of the 15th Conference on Uncertainty in  Artificial Intelligence (UAI), pages 134-141, 1999.  [19] C. Daskalakis, E. Mossel, and S. Roch. Evolutionary trees and the Ising model on the Bethe lattice: a proof of Steel’s conjecture. Probability Theory and Related Fields, 149(1-2):149- 189, 2011.  [20] C. Daskalakis, N. Dikkala, and G. Kamath. Testing Ising models. In Proceedings of the 29th Annual ACM-SIAM Symposium on Discrete Algorithms (SODA), pages 1989-2007, 2018.  [21] I. Diakonikolas and D.M. Kane. A new approach for testing properties of discrete distributions. In Proceedings of the 57th Annual IEEE Symposium on Foundations of Computer Science (FOCS), pages 685-694, 2016.  [22] I. Diakonikolas, D.M. Kane, and V. Nikishkin. Optimal algorithms and lower bounds for test- ing closeness of structured distributions. In Proceedings of the 56th Annual IEEE Symposium on Foundations of Computer Science (FOCS), pages 1183-1202, 2015.  [23] I. Diakonikolas, T. Gouleakis, J. Peebles, and E. Price. Sample-Optimal Identity Testing In Proceedings of the 45th International Colloquium on Automata,  with High Probability. Languages, and Programming (ICALP), volume 1, pages 1-41, 2018.  [24] M. Dyer, L.A. Goldberg, C. Greenhill, and M. Jerrum. The relative complexity of approximate  counting problems. Algorithmica, 38(3):471-500, 2004.  [25] M. Dyer, L.A. Goldberg, and M. Jerrum. An approximation trichotomy for Boolean #CSP.  Journal of Computer and System Sciences, 76(3-4):267-277, 2010.  [26] T. Emden-Weinert, S. Hougardy, and B. Kreuter. Uniquely colourable graphs and the hardness of colouring graphs of large girth. Combinatorics, Probability and Computing, 7(4):375-386, 1998.  [27] J. Felsenstein. Inferring phylogenies, volume 2. Sinauer Associates, Inc., Sunderland, MA,  2004.  [28] S. Friedli and Y. Velenik. Statistical mechanics of lattice systems: a concrete mathematical  introduction. Cambridge University Press, 2017. LOWER BOUNDS FOR TESTING GRAPHICAL MODELS  [29] A. Galanis, L.A. Goldberg, and M. Jerrum. Approximately Counting H-Colourings is #BIS-  Hard. SIAM Journal on Computing, 45(3):680-711, 2016.  [30] A. Galanis, D. ˇStefankoviˇc, and E. Vigoda. Inapproximability of the partition function for the antiferromagnetic Ising and hard-core models. Combinatorics, Probability and Computing, 25(4):500-559, 2016.  [31] S. Geman and C. Graffigne. Markov random field image models and their applications to computer vision. In Proceedings of the International Congress of Mathematicians, volume 1, pages 1496-1517. Berkeley, CA, 1986.  [32] H.-O. Georgii. Gibbs measures and phase transitions, volume 9. Walter de Gruyter, 2011.  [33] L.A. Goldberg and M. Jerrum. The complexity of ferromagnetic Ising with local fields. Com-  binatorics, Probability and Computing, 16(1):43-61, 2007.  [34] L.A. Goldberg and M. Jerrum. Approximating the partition function of the ferromagnetic Potts  model. Journal of the ACM, 59(5):25, 2012.  [35] L.A. Goldberg and M. Jerrum. Approximating pairwise correlations in the Ising Model. ACM  Transactions on Computation Theory. To appear, 2019.  [36] O. Goldreich, S. Goldwasser, and D. Ron. Property testing and its connection to learning and  approximation. Journal of the ACM, 45(4):653-750, 1998.  [37] H. Guo and M. Jerrum. Random cluster dynamics for the Ising model is rapidly mixing. In Proceedings of the 28th Annual ACM-SIAM Symposium on Discrete Algorithms (SODA), pages 1818-1827, 2017.  [38] L. Hamilton, F. Koehler, and A. Moitra. Information theoretic properties of Markov random fields, and their algorithmic applications. In Advances in Neural Information Processing Sys- tems (NeurIPS), pages 2460-2469, 2017.  [39] S. Hoory, N. Linial, and A. Wigderson. Expander graphs and their applications. Bulletin of  the American Mathematical Society, 43(4):439-561, 2006.  [40] R. Impagliazzo and R. Paturi. On the Complexity of k-SAT. Journal of Computer and System  Sciences, 62(2):367-375, 2001.  [41] M. Jerrum and A. Sinclair. Polynomial-time approximation algorithms for the Ising model.  SIAM Journal on computing, 22(5):1087-1116, 1993.  [42] A. Klivans and R. Meka. Learning graphical models using multiplicative weights. In Pro- ceedings of the 58th Annual Symposium on Foundations of Computer Science (FOCS), pages 343-354. IEEE, 2017.  [43] S.-I. Lee, V. Ganapathi, and D. Koller. Efficient Structure Learning of Markov Networks using L1-Regularization. In Advances in Neural Information Processing Systems (NeurIPS), pages 817-824, 2007. LOWER BOUNDS FOR TESTING GRAPHICAL MODELS  [44] M. Molloy and B. Reed. Colouring graphs when the number of colours is nearly the maximum degree. In Proceedings of the 33rd Annual ACM Symposium on Theory of Computing (STOC), pages 462-470, 2001.  [45] D. Randall and D. Wilson. Sampling spin configurations of an Ising system. In Proceedings of the 10th Annual ACM-SIAM Symposium on Discrete Algorithms (SODA), pages 959-960, 1999.  [46] P. Ravikumar, M.J. Wainwright, and J.D. Lafferty. High-dimensional Ising model selection using (cid:96)1-regularized logistic regression. The Annals of Statistics, 38(3):1287-1319, 2010.  [47] S. Roth and M.J. Black. Fields of experts: A framework for learning image priors. In Pro- ceedings of the 2005 IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR), volume 2, pages 860-867, 2005.  [48] R. Rubinfeld and M. Sudan. Robust characterizations of polynomials with applications to  program testing. SIAM Journal on Computing, 25(2):252-271, 1996.  [49] R. Salakhutdinov and G. Hinton. An efficient learning procedure for Deep Boltzmann Ma-  chines. Neural Computation, 24(8):1967-2006, 2012.  [50] R. Salakhutdinov and H. Larochelle. Efficient learning of deep Boltzmann machines. In Pro- ceedings of the 13th International Conference on Artificial Intelligence and Statistics (AIS- TATS), pages 693-700, 2010.  [51] N.P. Santhanam and M.J. Wainwright. Information-theoretic limits of selecting binary graph- ical models in high dimensions. IEEE Trans. Information Theory, 58(7):4117-4134, 2012.  [52] A. Sly. Computational transition at the uniqueness threshold.  In Proceedings of the 51st Annual IEEE Symposium on Foundations of Computer Science (FOCS), pages 287-296, 2010.  [53] A. Sly and N. Sun. The computational hardness of counting in two-spin models on d-regular graphs. In Proceedings of the 53rd Annual Symposium on Foundations of Computer Science (FOCS), pages 361-369, 2012.  [54] G. Valiant and P. Valiant. An automatic inequality prover and instance optimal identity testing.  SIAM Journal on Computing, 46(1):429-455, 2017.  [55] M. Vuffray, S. Misra, A. Lokhov, and M. Chertkov.  Interaction screening: Efficient and sample-optimal learning of Ising models. In Advances in Neural Information Processing Sys- tems (NeurIPS), pages 2595-2603, 2016."}