{"1": "Jacob D. Abernethy and Elad Hazan. Faster convex optimization: Simulated annealing with an In Proceedings of the 33nd International Conference on Machine efficient universal barrier. Learning, ICML 2016, New York City, NY, USA, June 19-24, 2016, pages 2520-2528, 2016. URL http://jmlr.org/proceedings/papers/v48/abernethy16.html.  Dimitris Bertsimas and Santosh Vempala. Solving convex programs by random walks. Journal of  the ACM (JACM), 51(4):540-556, 2004.  Paul Christiano, Jonathan A Kelner, Aleksander Madry, Daniel A Spielman, and Shang-Hua Teng. Electrical ﬂows, laplacian systems, and faster approximation of maximum ﬂow in undirected graphs. In Proceedings of the forty-third annual ACM symposium on Theory of computing, pages 273-282. ACM, 2011.  Martin Gr¨otschel, L´aszl´o Lov´asz, and Alexander Schrijver. Geometric algorithms and combinato-  rial optimization, volume 2. Algorithms and Combinatorics, 1988.  A. T. Kalai and S. Vempala. Simulated annealing for convex optimization. Math. Oper. Res., 31(2):  253-266, 2006.  2   OPTIMIZATION WITH ORACLES  and Abernethy and Hazan (2016) provides further improvements of up to a factor of structured convex sets.  Our main result in this paper is an algorithm that minimizes a convex function over a convex set using only ˜O(n2) membership and evaluation queries. Interestingly, we obtain this result by first showing that we can implement a separation oracle for a convex set and a subgradient ora- cle for a function using only ˜O(n) membership queries and then using the known reduction from optimization to separation. We state the result informally below.  √  n for more  Theorem 1 Let K be a convex set specified by a membership oracle, a point x0 ∈ Rn, and numbers 0 < r < R such that B(x0, r) ⊆ K ⊆ B(x0, R). For any convex function f given by an evaluation oracle and (cid:15) > 0, there is a randomized algorithm that computes a point z ∈ B(K, (cid:15)) such that  f (z) ≤ min x∈K  f (x) + (cid:15)  max x∈K  f (x) − min x∈K  f (x)  (cid:18)  (cid:19)  with constant probability using O(n2 logO(1)( nR oracle and O(n3 logO(1)( nR  (cid:15)r )) total arithmetic operations.  (cid:15)r )) calls to the membership oracle and evaluation  See the full version for the formal statement, proofs, comparison to prior work, and further  consequences of this result.  Acknowledgments  The authors thank Sebastien Bubeck, Ben Cousins, Sham M. Kakade and Ravi Kannan for help- ful discussions, and Yan Kit Chim for making the illustrations. Finally, we thank Xiaodi Wu for pointing out some typos in a previous version of the paper.  References  Jacob D. Abernethy and Elad Hazan. Faster convex optimization: Simulated annealing with an In Proceedings of the 33nd International Conference on Machine efficient universal barrier. Learning, ICML 2016, New York City, NY, USA, June 19-24, 2016, pages 2520-2528, 2016. URL http://jmlr.org/proceedings/papers/v48/abernethy16.html.  Dimitris Bertsimas and Santosh Vempala. Solving convex programs by random walks. Journal of  the ACM (JACM), 51(4):540-556, 2004.  Paul Christiano, Jonathan A Kelner, Aleksander Madry, Daniel A Spielman, and Shang-Hua Teng. Electrical ﬂows, laplacian systems, and faster approximation of maximum ﬂow in undirected graphs. In Proceedings of the forty-third annual ACM symposium on Theory of computing, pages 273-282. ACM, 2011.  Martin Gr¨otschel, L´aszl´o Lov´asz, and Alexander Schrijver. Geometric algorithms and combinato-  rial optimization, volume 2. Algorithms and Combinatorics, 1988.  A. T. Kalai and S. Vempala. Simulated annealing for convex optimization. Math. Oper. Res., 31(2):  253-266, 2006. OPTIMIZATION WITH ORACLES  Jonathan A Kelner, Yin Tat Lee, Lorenzo Orecchia, and Aaron Sidford. An almost-linear-time algo- rithm for approximate max ﬂow in undirected graphs, and its multicommodity generalizations. In Proceedings of the Twenty-Fifth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 217-226. SIAM, 2014.  Yin Tat Lee and Aaron Sidford. Path finding methods for linear programming: Solving linear programs in o(sqrt(rank)) iterations and faster algorithms for maximum ﬂow. In Foundations of Computer Science (FOCS), 2014 IEEE 55th Annual Symposium on, pages 424-433. IEEE, 2014.  Yin Tat Lee and Aaron Sidford. Efficient inverse maintenance and faster algorithms for linear programming. In Foundations of Computer Science (FOCS), 2015 IEEE 56th Annual Symposium on, pages 230-249. IEEE, 2015.  Yin Tat Lee, Satish Rao, and Nikhil Srivastava. A new approach to computing maximum ﬂows In Proceedings of the forty-fifth annual ACM symposium on Theory of  using electrical ﬂows. computing, pages 755-764. ACM, 2013.  Yin Tat Lee, Aaron Sidford, and Sam Chiu-wai Wong. A faster cutting plane method and its impli- cations for combinatorial and convex optimization. In Foundations of Computer Science (FOCS), 2015 IEEE 56th Annual Symposium on, pages 1049-1065. IEEE, 2015.  L. Lov´asz and S. Vempala. Fast algorithms for logconcave functions: sampling, rounding, integra-  tion and optimization. In FOCS, pages 57-68, 2006.  Aleksander Madry. Navigating central path with electrical ﬂows: From ﬂows to matchings, and In Foundations of Computer Science (FOCS), 2013 IEEE 54th Annual Symposium on,  back. pages 253-262. IEEE, 2013.  Jonah Sherman. Nearly maximum ﬂows in nearly linear time. In Foundations of Computer Science  (FOCS), 2013 IEEE 54th Annual Symposium on, pages 263-269. IEEE, 2013.  Jonah Sherman. Area-convexity, l∞ regularization, and undirected multicommodity ﬂow.  In Proceedings of the 49th Annual ACM SIGACT Symposium on Theory of Computing, STOC 2017, Montreal, QC, Canada, June 19-23, 2017, pages 452-460, 2017. doi: 10.1145/3055399. 3055501. URL http://doi.acm.org/10.1145/3055399.3055501.  P. M. Vaidya. A new algorithm for minimizing convex functions over convex sets. Math. Prog., 73:  291-341, 1996."}