{"1": "Alekh Agarwal, Alina Beygelzimer, Miroslav Dudk, and John Langford. A reductions approach to  fair classification. In FATML, 2017.  Alekh Agarwal, Alina Beygelzimer, Miroslav Dudk, John Langford, and Hanna Wallach. A reduc-  tions approach to fair classification. In ICML, 2018.  Solon Barocas and Andrew D Selbst. Big data’s disparate impact. Cal. L. Rev., 104:671, 2016.  R´obert Busa-Fekete, Bal´azs Sz¨or´enyi, Paul Weng, and Shie Mannor. Multi-objective bandits: Optimizing the generalized gini index. In International Conference on Machine Learning, pages 625-634, 2017.  Alexandra Chouldechova. Fair prediction with disparate impact: A study of bias in recidivism  prediction instruments. Big data, 5(2):153-163, 2017.  Kimberle Crenshaw. Demarginalizing the intersection of race and sex: A black feminist critique of antidiscrimination doctrine, feminist theory and antiracist politics. U. Chi. Legal F., page 139, 1989.  Ilias Diakonikolas. Approximation of Multiobjective Optimization Problems. PhD thesis, New York,  NY, USA, 2011. AAI3454077.  Tammy Drezner, Zvi Drezner, and Jeffery Guyse. Equitable service by a facility: Minimizing the  gini coefficient. Computers & Operations Research, 36(12):3240-3246, 2009.  Cynthia Dwork, Moritz Hardt, Toniann Pitassi, Omer Reingold, and Richard Zemel. Fairness through awareness. In Proceedings of the 3rd Innovations in Theoretical Computer Science Conference, ITCS ’12, pages 214-226, New York, NY, USA, 2012. ACM.  Cynthia Dwork, Nicole Immorlica, Adam Tauman Kalai, and Mark DM Leiserson. Decoupled In Sorelle A. Friedler and Christo classifiers for group-fair and efficient machine learning. Wilson, editors, Proceedings of the 1st Conference on Fairness, Accountability and Transparency, volume 81 of Proceedings of Machine Learning Research, pages 119-133, New York, NY, USA, 23-24 Feb 2018. PMLR.  Corrado Gini. Variabilit`a e mutabilit`a. Reprinted in Memorie di metodologica statistica (Ed. Pizetti  E, Salvemini, T). Rome: Libreria Eredi Virgilio Veschi, 1912.  13   UNLEASHING LINEAR OPTIMIZERS FOR GROUP-FAIR LEARNING AND OPTIMIZATION  7. Conclusions  This paper enables application designers and data scientists to optimize complex continuous ob- jectives, with possibly many local non-global minima, that account for differences across various groups. It is not our claim or belief that important issues such as fairness can be captured solely by such group statistics. However, with this ability, domain experts are hopefully better equipped to design objectives that, when optimized, lead to desirable outcomes.  Acknowledgments. We would like to thank Miro Dudk, Salil Vadhan, and the anonymous COLT reviewers for helpful comments.  References  Alekh Agarwal, Alina Beygelzimer, Miroslav Dudk, and John Langford. A reductions approach to  fair classification. In FATML, 2017.  Alekh Agarwal, Alina Beygelzimer, Miroslav Dudk, John Langford, and Hanna Wallach. A reduc-  tions approach to fair classification. In ICML, 2018.  Solon Barocas and Andrew D Selbst. Big data’s disparate impact. Cal. L. Rev., 104:671, 2016.  R´obert Busa-Fekete, Bal´azs Sz¨or´enyi, Paul Weng, and Shie Mannor. Multi-objective bandits: Optimizing the generalized gini index. In International Conference on Machine Learning, pages 625-634, 2017.  Alexandra Chouldechova. Fair prediction with disparate impact: A study of bias in recidivism  prediction instruments. Big data, 5(2):153-163, 2017.  Kimberle Crenshaw. Demarginalizing the intersection of race and sex: A black feminist critique of antidiscrimination doctrine, feminist theory and antiracist politics. U. Chi. Legal F., page 139, 1989.  Ilias Diakonikolas. Approximation of Multiobjective Optimization Problems. PhD thesis, New York,  NY, USA, 2011. AAI3454077.  Tammy Drezner, Zvi Drezner, and Jeffery Guyse. Equitable service by a facility: Minimizing the  gini coefficient. Computers & Operations Research, 36(12):3240-3246, 2009.  Cynthia Dwork, Moritz Hardt, Toniann Pitassi, Omer Reingold, and Richard Zemel. Fairness through awareness. In Proceedings of the 3rd Innovations in Theoretical Computer Science Conference, ITCS ’12, pages 214-226, New York, NY, USA, 2012. ACM.  Cynthia Dwork, Nicole Immorlica, Adam Tauman Kalai, and Mark DM Leiserson. Decoupled In Sorelle A. Friedler and Christo classifiers for group-fair and efficient machine learning. Wilson, editors, Proceedings of the 1st Conference on Fairness, Accountability and Transparency, volume 81 of Proceedings of Machine Learning Research, pages 119-133, New York, NY, USA, 23-24 Feb 2018. PMLR.  Corrado Gini. Variabilit`a e mutabilit`a. Reprinted in Memorie di metodologica statistica (Ed. Pizetti  E, Salvemini, T). Rome: Libreria Eredi Virgilio Veschi, 1912. UNLEASHING LINEAR OPTIMIZERS FOR GROUP-FAIR LEARNING AND OPTIMIZATION  Gabriel Goh, Andrew Cotter, Maya Gupta, and Michael P Friedlander. Satisfying real-world goals with dataset constraints. In Advances in Neural Information Processing Systems 29, pages 2415-2423. 2016.  Fabrizio Grandoni, R. Ravi, Mohit Singh, and Rico Zenklusen. New approaches to multi-objective  optimization. Math. Program., 146(1-2):525-554, 2014.  David Ingold and Spencer Soper. Amazon doesnt consider the race of its customers. should it?, April 2016. URL https://www.bloomberg.com/graphics/2016-amazon-same-day/.  Martin Jaggi. Revisiting frank-wolfe: Projection-free sparse convex optimization. In ICML (1),  pages 427-435, 2013.  Matthew Joseph, Michael J. Kearns, Jamie H. Morgenstern, and Aaron Roth. Fairness in learning: Classic and contextual bandits. In Advances in Neural Information Processing Systems 29: Annual Conference on Neural Information Processing Systems 2016, December 5-10, 2016, Barcelona, Spain, pages 325-333, 2016.  Sham M. Kakade, Adam Tauman Kalai, and Katrina Ligett. Playing games with approximation  algorithms. SIAM J. Comput., 39(3):1088-1106, 2009.  Adam Tauman Kalai and Santosh Vempala. Efficient algorithms for online decision problems. J.  Comput. Syst. Sci., 71(3):291-307, 2005.  Adam Tauman Kalai, Yishay Mansour, and Elad Verbin. On agnostic boosting and parity learning. In Proceedings of the 40th Annual ACM Symposium on Theory of Computing, Victoria, British Columbia, Canada, May 17-20, 2008, pages 629-638, 2008.  Michael J. Kearns, Robert E. Schapire, and Linda M. Sellie. Toward efficient agnostic learning. In Proceedings of the Fifth Annual Workshop on Computational Learning Theory, COLT ’92, pages 341-352, New York, NY, USA, 1992. ACM.  Michael J. Kearns, Seth Neel, Aaron Roth, and Zhiwei Steven Wu. Preventing fairness gerrymander-  ing: Auditing and learning for subgroup fairness. CoRR, abs/1711.05144, 2017.  Jon M. Kleinberg, Sendhil Mullainathan, and Manish Raghavan. Inherent trade-offs in the fair determination of risk scores. In 8th Innovations in Theoretical Computer Science Conference, ITCS 2017, January 9-11, 2017, Berkeley, CA, USA, pages 43:1-43:23, 2017.  Aditya Krishna Menon and Robert C. Williamson. The cost of fairness in classification. CoRR,  abs/1705.09055, 2017.  Wolfgang Mulzer and Yannik Stein. Computational aspects of the colorful carath´eodory theorem.  arXiv preprint arXiv:1412.3347, 2014.  Harikrishna Narasimhan, Harish G. Ramaswamy, Aadirupa Saha, and Shivani Agarwal. Consistent multiclass algorithms for complex performance measures. In Proceedings of the 32nd International Conference on Machine Learning, ICML 2015, Lille, France, 6-11 July 2015, pages 2398-2407, 2015. UNLEASHING LINEAR OPTIMIZERS FOR GROUP-FAIR LEARNING AND OPTIMIZATION  Wlodzimierz Ogryczak, Hanan Luss, Michal Pi´oro, Dritan Nace, and Artur Tomaszewski. Fair optimization and networks: A survey. J. Applied Mathematics, 2014:612018:1-612018:25, 2014. URL https://doi.org/10.1155/2014/612018.  Christos H Papadimitriou and Mihalis Yannakakis. On the approximability of trade-offs and optimal access of web sources. In Foundations of Computer Science, 2000. Proceedings. 41st Annual Symposium on, pages 86-92. IEEE, 2000.  Shameem Puthiya Parambath, Nicolas Usunier, and Yves Grandvalet. Optimizing f-measures by cost-sensitive classification. In Advances in Neural Information Processing Systems 27: Annual Conference on Neural Information Processing Systems 2014, December 8-13 2014, Montreal, Quebec, Canada, pages 2123-2131, 2014.  R. Ravi, Madhav V. Marathe, S. S. Ravi, Daniel J. Rosenkrantz, and Harry B. Hunt III. Many birds with one stone: multi-objective approximation algorithms. In Proceedings of the Twenty-Fifth Annual ACM Symposium on Theory of Computing, May 16-18, 1993, San Diego, CA, USA, pages 438-447, 1993.  John Rawls. A theory of justice. 1971.  Hinrich Sch¨utze, Christopher D Manning, and Prabhakar Raghavan. Introduction to information  retrieval, volume 39. Cambridge University Press, 2008.  Leslie G Valiant. A theory of the learnable. Communications of the ACM, 27(11):1134-1142, 1984.  Arthur Warburton. Approximation of pareto optima in multiple-objective, shortest-path problems.  Operations Research, 35(1):70-79, 1987.  John A Weymark. Generalized gini inequality indices. Mathematical Social Sciences, 1(4):409-430,  1981.  Blake Woodworth, Suriya Gunasekar, Mesrob I. Ohannessian, and Nathan Srebro. Learning non- discriminatory predictors. In Proceedings of the 2017 Conference on Learning Theory, volume 65, pages 1920-1953, Amsterdam, Netherlands, 07-10 Jul 2017.  Marcela Zuluaga, Guillaume Sergent, Andreas Krause, and Markus P¨uschel. Active learning for multi-objective optimization. In Proceedings of the 30th International Conference on Machine Learning, ICML 2013, Atlanta, GA, USA, 16-21 June 2013, pages 462-470, 2013.  8."}