{"1": "N. Ailon. An active learning algorithm for ranking from pairwise preferences with an almost optimal  query complexity. Journal of Machine Learning Research, 13:137-164, 2012.  N. Ailon, B. Chazelle, S. Comandur, and D. Liu. Estimating the distance to a monotone function.  Random Struct. Algorithms, 31(3):371-383, 2007.  N. Ailon, M. Charikar, and A. Newman. Aggregating inconsistent information: Ranking and clus-  tering. Journal of the ACM, 55(5):23:1-23:27, Oct. 2008.  N. Ailon, R. Begleiter, and E. Ezra. Active learning using smooth relative regret approximations  with applications (full version). In arXiv:1110.2136, 2012.  N. Alon. Ranking tournaments. SIAM Journal on Discrete Mathematics, 20, 2006.  F. R. Bach. Active learning for misspecified generalized linear models. In B. Sch¨olkopf, J. Platt, and T. Hoffman, editors, Advances in Neural Information Processing Systems 19, pages 65-72. MIT Press, Cambridge, MA, 2007.  M.-F. Balcan, A. Beygelzimer, and J. Langford. Agnostic active learning. In ICML, pages 65-72,  M.-F. Balcan, A. Z. Broder, and T. Zhang. Margin based active learning. In COLT, pages 35-50,  2006.  2007.  M.-F. Balcan, S. Hanneke, and J. Wortman. The true sample complexity of active learning.  In  COLT, pages 45-56, 2008.  N. Bansal, A. Blum, and S. Chawla. Correlation clustering. Machine Learning, 56:89-113, 2004.  S. Basu. Semi-supervised Clustering: Probabilistic Models, Algorithms and Experiments. PhD  thesis, Department of Computer Sciences, University of Texas at Austin, 2005.  A. Ben-Dor, R. Shamir, and Z. Yakhini. Clustering gene expression patterns. Journal of Computa-  tional Biology, 6(3/4):281-297, 1999.  19.13   ACTIVE LEARNING USING SRRA  work of Eriksson et al. (2011) indicates that incorporating geometric information into our analysis is a fruitful direction to pursue.  Our work made no assumptions on the noise, except maybe for its magnitude. Another promis- ing future research direction would be to incorporate various standard noise assumptions known to improve active learning rates (especially the model of Mammen and Tsybakov, 1999; Tsybakov, 2004) within our setting.  We thank Alekh Agarwal, Miroslav Dudik, Ran El-Yaniv, Sariel Har-Peled, John Langford, Rob Schapire, Masashi Sugiyama, and Yair Weiner for helpful discussions.  Acknowledgments  References  N. Ailon. An active learning algorithm for ranking from pairwise preferences with an almost optimal  query complexity. Journal of Machine Learning Research, 13:137-164, 2012.  N. Ailon, B. Chazelle, S. Comandur, and D. Liu. Estimating the distance to a monotone function.  Random Struct. Algorithms, 31(3):371-383, 2007.  N. Ailon, M. Charikar, and A. Newman. Aggregating inconsistent information: Ranking and clus-  tering. Journal of the ACM, 55(5):23:1-23:27, Oct. 2008.  N. Ailon, R. Begleiter, and E. Ezra. Active learning using smooth relative regret approximations  with applications (full version). In arXiv:1110.2136, 2012.  N. Alon. Ranking tournaments. SIAM Journal on Discrete Mathematics, 20, 2006.  F. R. Bach. Active learning for misspecified generalized linear models. In B. Sch¨olkopf, J. Platt, and T. Hoffman, editors, Advances in Neural Information Processing Systems 19, pages 65-72. MIT Press, Cambridge, MA, 2007.  M.-F. Balcan, A. Beygelzimer, and J. Langford. Agnostic active learning. In ICML, pages 65-72,  M.-F. Balcan, A. Z. Broder, and T. Zhang. Margin based active learning. In COLT, pages 35-50,  2006.  2007.  M.-F. Balcan, S. Hanneke, and J. Wortman. The true sample complexity of active learning.  In  COLT, pages 45-56, 2008.  N. Bansal, A. Blum, and S. Chawla. Correlation clustering. Machine Learning, 56:89-113, 2004.  S. Basu. Semi-supervised Clustering: Probabilistic Models, Algorithms and Experiments. PhD  thesis, Department of Computer Sciences, University of Texas at Austin, 2005.  A. Ben-Dor, R. Shamir, and Z. Yakhini. Clustering gene expression patterns. Journal of Computa-  tional Biology, 6(3/4):281-297, 1999.  19.13   AILON BEGLEITER EZRA  A. Beygelzimer, S. Dasgupta, and J. Langford.  Importance weighted active learning.  In ICML,  2009.  In NIPS, 2010.  A. Beygelzimer, D. Hsu, J. Langford, and T. Zhang. Agnostic active learning without constraints.  M. Braverman and E. Mossel. Noisy sorting without resampling. In SODA, pages 268-276, 2008.  R. Castro, R. Willett, and R. Nowak. Faster rates in regression via active learning. In NIPS, 2005.  R. M. Castro and R. D. Nowak. Minimax bounds for active learning. IEEE Transactions on Infor-  mation Theory, 54(5):2339-2353, 2008.  G. Cavallanti, N. Cesa-Bianchi, and C. Gentile. Linear classification and selective sampling under  low noise conditions. In NIPS, pages 249-256, 2008.  G. Cavallanti, N. Cesa-Bianchi, and C. Gentile. Learning noisy linear classifiers via adaptive and  selective sampling. Machine Learning, 83(1):71-102, 2011.  N. Cesa-Bianchi, C. Gentile, F. Vitale, and G. Zappella. Active learning on trees and graphs. In  COLT, pages 320-332, 2010.  M. Charikar and A. Wirth. Maximizing quadratic programs: Extending grothendieck’s inequality.  In FOCS, pages 54-60. IEEE Computer Society, 2004.  D. Cohn, R. Caruana, and A. Mccallum. Semi-supervised clustering with user feedback. un- published manuscript, 2000. URL http://www.cs.umass.edu/˜mccallum/papers/ semisup-aaai2000s.ps.  D. Coppersmith, L. K. Fleischer, and A. Rurda. Ordering by weighted number of wins gives a good  ranking for weighted tournaments. ACM Trans. Algorithms, 6:55:1-55:13, July 2010.  S. Dasgupta. Coarse sample complexity bounds for active learning. In NIPS, 2005.  S. Dasgupta and D. Hsu. Hierarchical sampling for active learning. In ICML, pages 208-215, 2008.  S. Dasgupta, D. Hsu, and C. Monteleoni. A general agnostic active learning algorithm. In NIPS,  2007.  M. de Berg, O. Cheong, M. van Kreveld, and M. Overmars. Computational geometry: Algorithms  and applications. Springer-Verlag, Berlin, 3rd edition, 2008.  A. Demiriz, K. Bennett, and M. J. Embrechts. Semi-supervised clustering using genetic algorithms. In In Artificial Neural Networks in Engineering (ANNIE-99, pages 809-814. ASME Press, 1999.  R. El-Yaniv and Y. Wiener. On the foundations of noise-free selective classification. Journal of  Machine Learning Research, 11:1605-1641, 2010.  B. Eriksson, G. Dasarathy, A. Singh, and R. D. Nowak. Active clustering: Robust and efficient hier- archical clustering using adaptively selected similarities. Journal of Machine Learning Research - Proceedings Track, 15:260-268, 2011.  19.14   ACTIVE LEARNING USING SRRA  Y. Freund, S. H. Seung, E. Shamir, and N. Tishby. Selective sampling using the query by committee  algorithm. Machine Learning, 28:133-168, September 1997.  I. Giotis and V. Guruswami. Correlation clustering with a fixed number of clusters. Theory of  Computing, 2(1):249-266, 2006.  S. Halevy and E. Kushilevitz. Distribution-free property-testing. SIAM J. Comput., 37(4):1107-  1138, 2007.  S. Hanneke. A bound on the label complexity of agnostic active learning. In ICML, 2007.  S. Hanneke. Adaptive rates of convergence in active learning. In COLT, 2009.  S. Hanneke. Rates of convergence in active learning. Annals of Statistics, 39(1):333-361, 2011.  S. Hanneke and L. Yang. Negative results for active learning with convex losses. Journal of Machine  Learning Research - Proceedings Track, 9:321-325, 2010.  D. Haussler. Decision theoretic generalizations of the PAC model for neural net and other learning  applications. Information and Control, 100(1):78-150, Sept. 1992.  K. G. Jamieson and R. Nowak. Active ranking using pairwise comparisons. In NIPS 24, pages  2240-2248, 2011.  M. K¨a¨ari¨ainen. Active learning in the non-realizable case. In ALT, pages 63-77, 2006.  C. Kenyon-Mathieu and W. Schudy. How to rank with few errors. In Proceedings of the thirty-ninth  annual ACM symposium on Theory of computing, STOC ’07, pages 95-103, 2007.  D. Klein, S. D. Kamvar, and C. D. Manning. From instance-level constraints to space-level con- straints: Making the most of prior knowledge in data clustering. In ICML, pages 307-314, 2002.  V. Koltchinskii. Rademacher complexities and bounding the excess risk in active learning. Journal  of Machine Learning Research, 11:2457-2485, 2010.  Y. Li, P. M. Long, and A. Srinivasan.  Improved bounds on the sample complexity of learning.  Journal of Computer and System Sciences, 62:2001, 2000.  E. Mammen and A. B. Tsybakov. Smooth discrimination analysis. Annals of Statistics, 27:1808-  S. Minsker. Plug-in approach to active learning. Journal of Machine Learning Research, 13:67-90,  F. Orabona and N. Cesa-Bianchi. Better algorithms for selective sampling. In ICML, pages 433-  1829, 1999.  2012.  440, 2011.  K. Radinsky and N. Ailon. Ranking from pairs and triplets: information quality, evaluation methods  and query complexity. In WSDM, pages 105-114, 2011.  B. Settles. Active learning literature survey. Technical Report 1648, University of Wisconsin-  Madison, 2009.  19.15   AILON BEGLEITER EZRA  O. Shamir and N. Tishby. Spectral clustering on a budget. Journal of Machine Learning Research  - Proceedings Track, 15:661-669, 2011.  R. Shamir, R. Sharan, and D. Tsur. Cluster graph modification problems. Discrete Applied Math,  144:173-182, nov 2004.  M. Sugiyama. Active learning in approximately linear regression based on conditional expectation  of generalization error. Journal of Machine Learning Research, 7:141-166, 2006.  A. B. Tsybakov. Optimal aggregation of classifiers in statistical learning. Annals of Statistics, 32:  135-166, 2004.  K. Voevodski, M.-F. Balcan, H. R¨oglin, S.-H. Teng, and Y. Xia. Active clustering of biological  sequences. Journal of Machine Learning Research, 13:203-225, 2012.  L. Wang. Smoothness, disagreement coefficient, and the label complexity of agnostic active learn-  ing. Journal of Machine Learning Research, 12:2269-2292, 2011.  E. P. Xing, A. Y. Ng, M. I. Jordan, and S. Russell. Distance metric learning, with application to In Advances in Neural Information Processing Systems 15,  clustering with side-information. pages 505-512. MIT Press, 2002.  L. Yang, S. Hanneke, and J. G. Carbonell. Bayesian active learning using arbitrary binary valued  queries. In ALT, pages 50-58, 2010.  L. Yang, S. Hanneke, and J. G. Carbonell. The sample complexity of self-verifying bayesian active  learning. Journal of Machine Learning Research - Proceedings Track, 15:816-822, 2011."}