{"1": "Alexander A. Ageev and Maxim Sviridenko. Pipage rounding: A new method of constructing  algorithms with proven performance guarantee. J. Comb. Optim., 8(3), 2004.  Mikl´os Ajtai, Vitaly Feldman, Avinatan Hassidim, and Jelani Nelson. Sorting and selection with  imprecise comparisons. In ICALP. 2009.  Dana Angluin. Queries and concept learning. Machine Learning, 2(4):319-342, 1988.  Ashwinkumar Badanidiyuru, Shahar Dobzinski, Hu Fu, Robert Kleinberg, Noam Nisan, and Tim  Roughgarden. Sketching valuation functions. In SODA, 2012.  Ashwinkumar Badanidiyuru, Baharan Mirzasoleiman, Amin Karbasi, and Andreas Krause. Stream-  ing submodular maximization: massive data summarization on the ﬂy. In KDD, 2014.  Maria-Florina Balcan. Learning submodular functions with applications to multi-agent systems. In  Maria-Florina Balcan and Nicholas J. A. Harvey. Learning submodular functions. In STOC, 2011.  Maria-Florina Balcan, Florin Constantin, Satoru Iwata, and Lei Wang. Learning valuation functions.  AAMAS, 2015.  In COLT, 2012.  Michael Ben Or and Avinatan Hassidim. The bayesian learner is optimal for noisy binary search  (and pretty good for quantum as well). In FOCS, 2008.  J. Bilmes. Deep mathematical properties of submodularity with applications to machine learning.  Tutorial at NIPS, 2013.  Mark Braverman and Elchanan Mossel. Noisy sorting without resampling. In SODA, 2008.  Nader H. Bshouty and Vitaly Feldman. On using extended statistical queries to avoid membership  queries. Journal of Machine Learning Research, 2:359-395, 2002.  Niv Buchbinder, Moran Feldman, Joseph Naor, and Roy Schwartz. A tight linear time (1/2)-  approximation for unconstrained submodular maximization. In FOCS.  Niv Buchbinder, Moran Feldman, Joseph Naor, and Roy Schwartz. Submodular maximization with  cardinality constraints. In SODA, 2014.  D. Buchfuhrer, S. Dughmi, H. Fu, R. Kleinberg, E. Mossel, C. H. Papadimitriou, M. Schapira, Y. Singer, and C. Umans. Inapproximability for VCG-based combinatorial auctions. In SIAM- ACM Symposium on Discrete Algorithms (SODA), 2010a.  D. Buchfuhrer, M. Schapira, and Y. Singer. Computation and incentives in combinatorial public  projects. In EC, 2010b.  Gruia Calinescu, Chandra Chekuri, Martin P´al, and Jan Vondr´ak. Maximizing a submodular set  function subject to a matroid constraint. In IPCO. 2007.  23   SUBMODULAR OPTIMIZATION UNDER NOISE  References  Alexander A. Ageev and Maxim Sviridenko. Pipage rounding: A new method of constructing  algorithms with proven performance guarantee. J. Comb. Optim., 8(3), 2004.  Mikl´os Ajtai, Vitaly Feldman, Avinatan Hassidim, and Jelani Nelson. Sorting and selection with  imprecise comparisons. In ICALP. 2009.  Dana Angluin. Queries and concept learning. Machine Learning, 2(4):319-342, 1988.  Ashwinkumar Badanidiyuru, Shahar Dobzinski, Hu Fu, Robert Kleinberg, Noam Nisan, and Tim  Roughgarden. Sketching valuation functions. In SODA, 2012.  Ashwinkumar Badanidiyuru, Baharan Mirzasoleiman, Amin Karbasi, and Andreas Krause. Stream-  ing submodular maximization: massive data summarization on the ﬂy. In KDD, 2014.  Maria-Florina Balcan. Learning submodular functions with applications to multi-agent systems. In  Maria-Florina Balcan and Nicholas J. A. Harvey. Learning submodular functions. In STOC, 2011.  Maria-Florina Balcan, Florin Constantin, Satoru Iwata, and Lei Wang. Learning valuation functions.  AAMAS, 2015.  In COLT, 2012.  Michael Ben Or and Avinatan Hassidim. The bayesian learner is optimal for noisy binary search  (and pretty good for quantum as well). In FOCS, 2008.  J. Bilmes. Deep mathematical properties of submodularity with applications to machine learning.  Tutorial at NIPS, 2013.  Mark Braverman and Elchanan Mossel. Noisy sorting without resampling. In SODA, 2008.  Nader H. Bshouty and Vitaly Feldman. On using extended statistical queries to avoid membership  queries. Journal of Machine Learning Research, 2:359-395, 2002.  Niv Buchbinder, Moran Feldman, Joseph Naor, and Roy Schwartz. A tight linear time (1/2)-  approximation for unconstrained submodular maximization. In FOCS.  Niv Buchbinder, Moran Feldman, Joseph Naor, and Roy Schwartz. Submodular maximization with  cardinality constraints. In SODA, 2014.  D. Buchfuhrer, S. Dughmi, H. Fu, R. Kleinberg, E. Mossel, C. H. Papadimitriou, M. Schapira, Y. Singer, and C. Umans. Inapproximability for VCG-based combinatorial auctions. In SIAM- ACM Symposium on Discrete Algorithms (SODA), 2010a.  D. Buchfuhrer, M. Schapira, and Y. Singer. Computation and incentives in combinatorial public  projects. In EC, 2010b.  Gruia Calinescu, Chandra Chekuri, Martin P´al, and Jan Vondr´ak. Maximizing a submodular set  function subject to a matroid constraint. In IPCO. 2007. HASSIDIM SINGER  Chandra Chekuri and Alina Ene. Approximation algorithms for submodular multiway partition. In  FOCS, 2011.  In FOCS, 2015.  Chandra Chekuri, T. S. Jayram, and Jan Vondr´ak. On multiplicative weight updates for concave and  submodular function maximization. In ITCS, 2015.  Flavio Chierichetti, Abhimanyu Das, Anirban Dasgupta, and Ravi Kumar. Approximate modularity.  Abhimanyu Das and David Kempe. Submodular meets spectral: Greedy algorithms for subset  selection, sparse approximation and dictionary selection. In ICML, 2011.  Abhimanyu Das, Anirban Dasgupta, and Ravi Kumar. Selecting diverse features via spectral regu-  larization. In NIPS, 2012.  models. In NIPS, 2014.  J. Djolonga and A. Krause. From MAP to marginals: Variational inference in bayesian submodular  Shahar Dobzinski and Michael Schapira. An improved approximation algorithm for combinatorial  auctions with submodular bidders. In SODA, 2006.  Shahar Dobzinski and Jan Vondr´ak. The computational complexity of truthfulness in combinatorial  auctions. In EC, pages 405-422, 2012.  Shahar Dobzinski, Noam Nisan, and Michael Schapira. Approximation algorithms for combinato-  rial auctions with complement-free bidders. In STOC, pages 610-618, 2005.  Shahar Dobzinski, Ron Lavi, and Noam Nisan. Multi-unit auctions with budget limits. In FOCS,  easy. In STOC, 2011.  networks. In ICML, 2014a.  2008.  2014b.  Shahar Dobzinski, Hu Fu, and Robert D. Kleinberg. Optimal auctions with correlated bidders are  N. Du, Y. Liang, M. Balcan, and L. Song.  Inﬂuence function learning in information diffusion  N. Du, Y. Liang, M. Balcan, and L. Song. Learning time-varying coverage functions. In NIPS,  Shaddin Dughmi, Tim Roughgarden, and Qiqi Yan. From convex optimization to randomized mech-  anisms: toward optimal combinatorial auctions. In STOC, pages 149-158, 2011.  Ethan R. Elenberg, Rajiv Khanna, Alexandros G. Dimakis, and Sahand Negahban. Restricted strong convexity implies weak submodularity. In NIPS Workshop on Learning in High Dimensions with Structure, 2016.  Clemens Elster and Arnold Neumaier. A grid algorithm for bound constrained optimization of noisy  functions. IMA Journal of Numerical Analysis, 15(4):585-608, 1995.  Uriel Feige. A threshold of ln n for approximating set cover. Journal of the ACM (JACM), 45(4):  634-652, 1998. SUBMODULAR OPTIMIZATION UNDER NOISE  Uriel Feige and Jan Vondrak. Approximation algorithms for allocation problems: Improving the  factor of 1-1/e. In FOCS, 2006.  Uriel Feige, Prabhakar Raghavan, David Peleg, and Eli Upfal. Computing with noisy information.  SIAM Journal on Computing, 23(5):1001-1018, 1994.  Uriel Feige, Vahab S. Mirrokni, and Jan Vondr´ak. Maximizing non-monotone submodular func-  tions. SIAM J. Comput., 40(4):1133-1153, 2011.  Vitaly Feldman. On the power of membership queries in agnostic learning. Journal of Machine  Learning Research, 10:163-182, 2009.  Vitaly Feldman and Pravesh Kothari. Colt. 2014.  tions by juntas. In FOCS, 2013.  and xos functions. In FOCS, 2015.  Vitaly Feldman and Jan Vondr´ak. Optimal bounds on approximation of submodular and XOS func-  Vitaly Feldman and Jan Vondr´ak. Tight bounds on low-degree spectral concentration of submodular  Vitaly Feldman, Pravesh Kothari, and Jan Vondr´ak. Representation, approximation and learning of  submodular functions using low-rank decision trees. In COLT, 2013.  Marshall L Fisher, George L Nemhauser, and Laurence A Wolsey. An analysis of approximations  for maximizing submodular set functionsII. Springer, 1978.  Torkel Glad and Allen Goldstein. Optimization of functions whose values are subject to small  errors. BIT Numerical Mathematics, 17(2):160-169, 1977.  Michel X Goemans, Nicholas JA Harvey, Satoru Iwata, and Vahab Mirrokni. Approximating sub-  modular functions everywhere. In SODA, 2009.  Sally A. Goldman, Michael J. Kearns, and Robert E. Schapire. Exact identification of circuits using  fixed points of amplification functions. In COLT, 1990.  D. Golovin and A. Krause. Adaptive submodularity: Theory and applications in active learning and  stochastic optimization. JAIR, 42:427-486, 2011.  D. Golovin, M. Faulkner, and A. Krause. Online distributed sensor selection. In IPSN, 2010.  R. Gomes and A. Krause. Budgeted nonparametric learning from data streams. In ICML, 2010.  Trevor J. Hastie, Robert John Tibshirani, and Jerome H. Friedman. The elements of statistical learning : data mining, inference, and prediction. Springer series in statistics. Springer, New York, 2009.  Thibaut Horel and Yaron Singer. Maximizing approximately submodular functions. In NIPS 2016.  Thibaut Horel, Stratis Ioannidis, and S. Muthukrishnan. Budget feasible mechanisms for experi-  mental design. In LATIN, 2014. HASSIDIM SINGER  2011a.  cuts. In CVPR, 2011b.  work. In KDD, 2003.  Jeffrey C. Jackson. An efficient membership-query algorithm for learning DNF with respect to the  uniform distribution. In FOCS, 1994.  Jeffrey C. Jackson, Eli Shamir, and Clara Shwartzman. Learning with queries corrupted by classi-  fication noise. Discrete Applied Mathematics, 1999.  S. Jegelka and J. Bilmes. Approximation bounds for inference using cooperative cuts. In ICML,  S. Jegelka and J. Bilmes. Submodularity beyond submodular energies: Coupling edges in graph  D. Kempe, J. Kleinberg, and E. Tardos. Maximizing the spread of inﬂuence through a social net-  Claire Kenyon-Mathieu and Warren Schudy. How to rank with few errors. In STOC, 2007.  Subhash Khot, Richard J Lipton, Evangelos Markakis, and Aranyak Mehta.  Inapproximability  results for combinatorial auctions with submodular utility functions. In WINE. 2005.  Andr´e I Khuri and John A Cornell. Response surfaces: designs and analyses, volume 152. CRC  P. Kohli, A. Osokin, and S. Jegelka. A principled deep random field for image segmentation. In  A. Krause and C. Guestrin. Nonmyopic active learning of gaussian processes. an exploration-  exploitation approach. In ICML, 2007.  A. Krause and C. Guestrin. Submodularity and its applications in optimized information gathering.  ACM Trans. on Int. Systems and Technology, 2(4), 2011.  A. Krause and S. Jegelka. Submodularity in Machine Learning: New directions. Tutorial ICML,  press, 1996.  CVPR, 2013.  2013.  ICML, 2010.  Andreas Krause and Volkan Cevher. Submodular dictionary selection for sparse representation. In  Andreas Krause and Carlos Guestrin. A note on the budgeted maximization of submodular func-  tions. In Technical Report, 2005.  Andreas Krause, H. Brendan McMahan, Carlos Guestrin, and Anupam Gupta. Selecting observa-  tions against adversarial objectives. In NIPS, 2007.  Andreas Krause, Ajit Paul Singh, and Carlos Guestrin. Near-optimal sensor placements in gaussian processes: Theory, efficient algorithms and empirical studies. Journal of Machine Learning Research, 9:235-284, 2008.  Ravi Kumar, Benjamin Moseley, Sergei Vassilvitskii, and Andrea Vattani. Fast greedy algorithms  in mapreduce and streaming. In SPAA, 2013. SUBMODULAR OPTIMIZATION UNDER NOISE  Harold J Kushner and Dean S Clark. Stochastic Approximation Methods for Constrained and Un-  constrained Systems (Applied Mathematical Sciences, Vol. 26), volume 8. Springer, 1978.  Jon Lee, Vahab S. Mirrokni, Viswanath Nagarajan, and Maxim Sviridenko. Non-monotone sub-  modular maximization under matroid and knapsack constraints. In STOC, 2009.  Benny Lehmann, Daniel Lehmann, and Noam Nisan. Combinatorial auctions with decreasing  marginal utilities. In ACM conference on electronic commerce, 2001.  J. Leskovec, A. Krause, C. Guestrin, C. Faloutsos, J. VanBriesen, and N. Glance. Cost-effective  outbreak detection in networks. In KDD, 2007.  H. Lin and J. Bilmes. A class of submodular functions for document summarization. In ACL/HLT,  2011a.  2011b.  H. Lin and J. Bilmes. Optimal selection of limited vocabulary speech corpora. In Proc. Interspeech,  Brendan Lucier, Yaron Singer, Vasilis Syrgkanis, and ´Eva Tardos. Equilibrium in combinatorial  public projects. In WINE, 2013.  Vahab S. Mirrokni, Michael Schapira, and Jan Vondr´ak. Tight information-theoretic lower bounds  for welfare maximization in combinatorial auctions. In EC, 2008.  George L Nemhauser and Leonard A Wolsey. Best algorithms for approximating the maximum of  a submodular set function. Mathematics of operations research, 3(3):177-188, 1978.  George L Nemhauser, Laurence A Wolsey, and Marshall L Fisher. An analysis of approximations for maximizing submodular set functionsi. Mathematical Programming, 14(1):265-294, 1978a.  G.L. Nemhauser, L.A. Wolsey, and M.L. Fisher. An analysis of approximations for maximizing  submodular set functions—I. Mathematical Programming, 14(1):265-294, 1978b.  C. H. Papadimitriou, M. Schapira, and Y. Singer. On the hardness of being truthful. In FOCS, 2008.  Christos H. Papadimitriou and George Pierrakos. On optimal single-item auctions. In STOC, 2011.  Boris T Polyak. Introduction to optimization. Optimization Software New York, 1987.  M. Gomez Rodriguez, J. Leskovec, and A. Krause. Inferring networks of diffusion and inﬂuence.  ACM TKDD, 5(4), 2011.  CoRR, abs/1608.02402, 2016.  2008.  Tim Roughgarden, Inbal Talgam-Cohen, and Jan Vondr´ak. When are welfare guarantees robust?  Michael Schapira and Yaron Singer. Inapproximability of combinatorial public projects. In WINE,  Shai Shalev-Shwartz and Shai Ben-David. Understanding Machine Learning: From Theory to ISBN 1107057132,  Algorithms. Cambridge University Press, New York, NY, USA, 2014. 9781107057135. HASSIDIM SINGER  Eli Shamir and Clara Schwartzman. Learning by extended statistical queries and its relation to PAC In Computational Learning Theory: Eurocolt 95, pages 357-366. Springer-Verlag,  learning. 1995.  L. S. Shapley. Cores of convex games. International Journal of Game Theory, 1(1):11-26, 1971.  Yaron Singer and Jan Vondrak. Information-theoretic lower bounds for convex optimization with  erroneous oracles. In NIPS, pages 3204-3212, 2015.  Adish Singla, Sebastian Tschiatschek, and Andreas Krause. Noisy submodular maximization via adaptive sampling with applications to crowdsourced image collection summarization. In AAAI, 2016.  M. Streeter, D. Golovin, and A. Krause. Online learning of assignments. In Advances in Neural  Information Processing Systems (NIPS), 2009.  Leslie G. Valiant. A Theory of the Learnable. Commun. ACM, 1984.  Jan Vondr´ak. Optimal approximation for the submodular welfare problem in the value oracle model.  In STOC, pages 67-74, 2008.  Comput., 42(1):265-304, 2013.  Jan Vondr´ak. Symmetry and approximability of submodular maximization problems. SIAM J.  Jan Vondr´ak, Chandra Chekuri, and Rico Zenklusen. Submodular function maximization via the  multilinear relaxation and contention resolution schemes. In STOC ’11, 2011.  Larry Wasserman. All of Statistics: A Concise Course in Statistical Inference. Springer Publishing  Company, Incorporated, 2010. ISBN 1441923225, 9781441923226. SUBMODULAR OPTIMIZATION UNDER NOISE"}