{"1": "I. Bez´akov´a, D. ˇStefankoviˇc, V. V. Vazirani, and E. Vigoda. Accelerating simulated annealing for the permanent and combinatorial counting problems. SIAM J. Comput., 37:1429-1454, 2008.  G. P. Bhattacharjee. Algorithm AS 32: The incomplete gamma integral. Journal of the Royal  Statistical Society. Series C (Applied Statistics), 19(3):285-287, 1970.  Steve Brooks, Andrew Gelman, Galin L. Jones, and Xiao-Li Meng, editors. Handbook of Markov  chain Monte Carlo. Chapman & Hall/CRC, 2011.  M. Dyer and A. Frieze. Computing the volume of convex bodies: A case where randomness prov- ably helps. In Proceedings of AMS Symposium on Probabilistic Combinatorics and Its Applica- tions 44, pages 123-170, 1991.  J. A. Fill and M. L. Huber. Perfect simulation of Vervaat perpetuities. Electron. J. Probab., 15:  96-109, 2010.  G. S. Fishman. Choosing sample path length and number of sample paths when starting in the  steady state. Oper. Res. Lett., 16:209-219, 1994.  Heng Guo and Mark Jerrum. Random cluster dynamics for the Ising model is rapidly mixing. The  Annals of Applied Probability, 28(2):1292-1313, 2018.  Mark Huber. Perfect sampling using bounding chains. Annals of Applied Probability, 14(2):734-  753, 2004.  Mark Huber. Approximation algorithms for the normalizing constant of Gibbs distributions.  arXiv:1206.2689v1, June 2012.  Mark Huber. Approximation algorithms for the normalizing constant of Gibbs distributions. The  Annals of Applied Probability, 25(2):974-985, 2015.  Mark Huber and Sarah Schott. Using TPA for Bayesian inference. Bayesian Statistics 9, pages  257-282, 2010.  Mark Huber and Sarah Schott. Random construction of interpolating sets for high-dimensional  integration. arXiv:1112.3692, December 2011.  Mark Huber and Sarah Schott. Random construction of interpolating sets for high-dimensional  integration. J. Appl. Prob., 51:92-105, 2014.  M. Jerrum. A very simple algorithm for estimating the number of k-colourings of a low-degree  graph. Random Structures and Algorithms, 7:157-165, 1995.  M. Jerrum and A. Sinclair. Polynomial-time approximation algorithms for the Ising model. SIAM  J. Comput., 22:1087-1116, 1993.  1178, December 1989.  Mark Jerrum and Alistair Sinclair. Approximating the permanent. SIAM J. COMPUT., 18(6):1149-  12   A FASTER APPROXIMATION ALGORITHM FOR THE GIBBS PARTITION FUNCTION  References  I. Bez´akov´a, D. ˇStefankoviˇc, V. V. Vazirani, and E. Vigoda. Accelerating simulated annealing for the permanent and combinatorial counting problems. SIAM J. Comput., 37:1429-1454, 2008.  G. P. Bhattacharjee. Algorithm AS 32: The incomplete gamma integral. Journal of the Royal  Statistical Society. Series C (Applied Statistics), 19(3):285-287, 1970.  Steve Brooks, Andrew Gelman, Galin L. Jones, and Xiao-Li Meng, editors. Handbook of Markov  chain Monte Carlo. Chapman & Hall/CRC, 2011.  M. Dyer and A. Frieze. Computing the volume of convex bodies: A case where randomness prov- ably helps. In Proceedings of AMS Symposium on Probabilistic Combinatorics and Its Applica- tions 44, pages 123-170, 1991.  J. A. Fill and M. L. Huber. Perfect simulation of Vervaat perpetuities. Electron. J. Probab., 15:  96-109, 2010.  G. S. Fishman. Choosing sample path length and number of sample paths when starting in the  steady state. Oper. Res. Lett., 16:209-219, 1994.  Heng Guo and Mark Jerrum. Random cluster dynamics for the Ising model is rapidly mixing. The  Annals of Applied Probability, 28(2):1292-1313, 2018.  Mark Huber. Perfect sampling using bounding chains. Annals of Applied Probability, 14(2):734-  753, 2004.  Mark Huber. Approximation algorithms for the normalizing constant of Gibbs distributions.  arXiv:1206.2689v1, June 2012.  Mark Huber. Approximation algorithms for the normalizing constant of Gibbs distributions. The  Annals of Applied Probability, 25(2):974-985, 2015.  Mark Huber and Sarah Schott. Using TPA for Bayesian inference. Bayesian Statistics 9, pages  257-282, 2010.  Mark Huber and Sarah Schott. Random construction of interpolating sets for high-dimensional  integration. arXiv:1112.3692, December 2011.  Mark Huber and Sarah Schott. Random construction of interpolating sets for high-dimensional  integration. J. Appl. Prob., 51:92-105, 2014.  M. Jerrum. A very simple algorithm for estimating the number of k-colourings of a low-degree  graph. Random Structures and Algorithms, 7:157-165, 1995.  M. Jerrum and A. Sinclair. Polynomial-time approximation algorithms for the Ising model. SIAM  J. Comput., 22:1087-1116, 1993.  1178, December 1989.  Mark Jerrum and Alistair Sinclair. Approximating the permanent. SIAM J. COMPUT., 18(6):1149- A FASTER APPROXIMATION ALGORITHM FOR THE GIBBS PARTITION FUNCTION  Mark R. Jerrum, Leslie G. Valiant, and Vijay V. Vazirani. Random generation of combinatorial  structures from a uniform distribution. Theoret. Comput. Sci., 43(2-3):169-188, 1986.  J. F. C. Kingman. Poisson Processes. Clarendon Press, 1992.  James Matthews. Markov Chains for Sampling Matchings. PhD thesis, University of Edinburgh,  School of Informatics, 2008.  N. Metropolis, A. W. Rosenbluth, M. N. Rosenbluth, A. H. Teller, and E. Teller. Equation of state  calculation by fast computing machines. J. Chem. Phys., 21:1087-1092, 1953.  James G. Propp and David B. Wilson. Exact sampling with coupled Markov chains and applications  to statistical mechanics. Random Structures and Algorithms, 9(1-2):223-252, 1996.  Robert H. Swendsen and Jian-Sheng Wang. Replica Monte Carlo simulation of spin-glasses. Phys.  Rev. Lett., 57(21):2607-2609, 1986.  Chem. Phys., 57:5457-5462, 1972.  J. P. Valleau and D. N. Card. Monte Carlo estimation of the free energy by multistage sampling. J.  E. Vigoda. Improved bounds for sampling colorings. In FOCS, pages 51-59, 1999.  D. ˇStefankoviˇc, S. Vempala, and E. Vigoda. Adaptive simulated annealing: A near-optimal connec-  tion between sampling and counting. J. of the ACM, 56(3):1-36, 2009.  M. J. Wainwright and M. I. Jordan. Graphical models, exponential families, and variational infer-  ence. Foundations and Trends in Machine Learning, 1(1-2):1-305, December 2008. A FASTER APPROXIMATION ALGORITHM FOR THE GIBBS PARTITION FUNCTION"}