{"1": "Ralph A. Bradley and Milton E. Terry. Rank analysis of incomplete block designs. I. The method  of paired comparisons. Biometrika, 39:324-345, 1952.  Mark Braverman and Elchanan Mossel. Noisy sorting without resampling. In Proceedings of the Nineteenth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 268-276. ACM, New York, 2008.  Sabyasachi Chatterjee and Sumit Mukherjee. On estimation in tournaments and graphs under mono-  tonicity constraints. arXiv preprint arXiv:1603.04556, 2016.  Sourav Chatterjee. Matrix estimation by universal singular value thresholding. Ann. Statist., 43(1):  177-214, 2015.  Alexander Philip Dawid and Allan M. Skene. Maximum likelihood estimation of observer error-  rates using the EM algorithm. Applied Statistics, pages 20-28, 1979.  Nicolas Flammarion, Cheng Mao, and Philippe Rigollet. Optimal rates of statistical seriation. arXiv  preprint arXiv:1607.02435, 2016.  R. Duncan Luce. Individual choice behavior: A theoretical analysis. John Wiley & Sons, Inc., New  York; Chapman & Hall, Ltd., London, 1959.  Cheng Mao, Jonathan Weed, and Philippe Rigollet. Minimax rates and efficient algorithms for noisy sorting. In Firdaus Janoos, Mehryar Mohri, and Karthik Sridharan, editors, Proceedings of Algorithmic Learning Theory, volume 83 of Proceedings of Machine Learning Research, pages 821-847. PMLR, 07-09 Apr 2018.  Ashwin Pananjady, Cheng Mao, Vidya Muthukumar, Martin J. Wainwright, and Thomas A. Cour- tade. Worst-case vs average-case design for estimation from fixed pairwise comparisons. arXiv preprint arXiv:1707.06217, 2017a.  Ashwin Pananjady, Martin J. Wainwright, and Thomas A. Courtade. Denoising linear models with In Information Theory (ISIT), 2017 IEEE International Symposium on, pages  permuted data. 446-450. IEEE, 2017b.  Nihar B. Shah, Sivaraman Balakrishnan, and Martin J. Wainwright. A permutation-based model for crowd labeling: Optimal estimation and robustness. arXiv preprint arXiv:1606.09632, 2016a.  Nihar B. Shah, Sivaraman Balakrishnan, and Martin J. Wainwright. Feeling the Bern: Adaptive In Information Theory (ISIT),  estimators for Bernoulli probabilities of pairwise comparisons. 2016 IEEE International Symposium on, pages 1153-1157. IEEE, 2016b.  5   FASTER RATES FOR PERMUTATION-BASED MODELS  This work was supported in part by grants NSF CAREER DMS-1541099, NSF DMS-1541100, NSF-DMS-1612948 and DOD ONR-N00014.  Acknowledgments  References  Ralph A. Bradley and Milton E. Terry. Rank analysis of incomplete block designs. I. The method  of paired comparisons. Biometrika, 39:324-345, 1952.  Mark Braverman and Elchanan Mossel. Noisy sorting without resampling. In Proceedings of the Nineteenth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 268-276. ACM, New York, 2008.  Sabyasachi Chatterjee and Sumit Mukherjee. On estimation in tournaments and graphs under mono-  tonicity constraints. arXiv preprint arXiv:1603.04556, 2016.  Sourav Chatterjee. Matrix estimation by universal singular value thresholding. Ann. Statist., 43(1):  177-214, 2015.  Alexander Philip Dawid and Allan M. Skene. Maximum likelihood estimation of observer error-  rates using the EM algorithm. Applied Statistics, pages 20-28, 1979.  Nicolas Flammarion, Cheng Mao, and Philippe Rigollet. Optimal rates of statistical seriation. arXiv  preprint arXiv:1607.02435, 2016.  R. Duncan Luce. Individual choice behavior: A theoretical analysis. John Wiley & Sons, Inc., New  York; Chapman & Hall, Ltd., London, 1959.  Cheng Mao, Jonathan Weed, and Philippe Rigollet. Minimax rates and efficient algorithms for noisy sorting. In Firdaus Janoos, Mehryar Mohri, and Karthik Sridharan, editors, Proceedings of Algorithmic Learning Theory, volume 83 of Proceedings of Machine Learning Research, pages 821-847. PMLR, 07-09 Apr 2018.  Ashwin Pananjady, Cheng Mao, Vidya Muthukumar, Martin J. Wainwright, and Thomas A. Cour- tade. Worst-case vs average-case design for estimation from fixed pairwise comparisons. arXiv preprint arXiv:1707.06217, 2017a.  Ashwin Pananjady, Martin J. Wainwright, and Thomas A. Courtade. Denoising linear models with In Information Theory (ISIT), 2017 IEEE International Symposium on, pages  permuted data. 446-450. IEEE, 2017b.  Nihar B. Shah, Sivaraman Balakrishnan, and Martin J. Wainwright. A permutation-based model for crowd labeling: Optimal estimation and robustness. arXiv preprint arXiv:1606.09632, 2016a.  Nihar B. Shah, Sivaraman Balakrishnan, and Martin J. Wainwright. Feeling the Bern: Adaptive In Information Theory (ISIT),  estimators for Bernoulli probabilities of pairwise comparisons. 2016 IEEE International Symposium on, pages 1153-1157. IEEE, 2016b. FASTER RATES FOR PERMUTATION-BASED MODELS  Nihar B. Shah, Sivaraman Balakrishnan, Adityanand Guntuboyina, and Martin J. Wainwright. Stochastically transitive models for pairwise comparisons: statistical and computational issues. IEEE Trans. Inform. Theory, 63(2):934-959, 2017.  Louis L. Thurstone. A law of comparative judgment. Psychological review, 34(4):273, 1927."}