{"1": "1992.  2002.  M. A. Arcones and E. Gin´e. On the bootstrap of U and V statistics. Ann. Statist., 20(2):655-674,  Y. Baraud. Non-asymptotic minimax rates of testing in signal detection. Bernoulli, 8(5):577-606,  Y. Baraud, S. Huet, and B. Laurent. Adaptive tests of linear hypotheses by model selection. Ann.  Statist., 31(1):225-251, 2003.  Math. Statist., 40:1-23, 1968.  P. J. Bickel. A distribution free version of the Smirnov two sample test in the p-variate case. Ann.  J. M. Bovett and J. G. Saw. On comparing two Poisson intensity functions. Comm. Statist. A—  Theory Methods, 9(9):943-948, 1980.  D. J. Daley and D. Vere-Jones. An introduction to the theory of point processes. Vol. II. Probability and its Applications (New York). Springer, New York, second edition, 2008. General theory and structure.  V. H. de la Pe˜na and E. Gin´e. Decoupling. Probability and its Applications (New York). Springer- Verlag, New York, 1999. From dependence to independence, Randomly stopped processes. U - statistics and processes. Martingales and beyond.  J. V. Deshpande, M. Mukhopadhyay, and U. V. Naik-Nimbalkar. Testing of two sample proportional intensity assumption for non-homogeneous Poisson processes. J. Statist. Plann. Inference, 81(2): 237-251, 1999.  J. Franke and S. Halim. Wild bootstrap tests. Signal proc. mag., IEEE, 24(4):31-37, 2007.  M. Fromont, B. Laurent, and P. Reynaud-Bouret. Adaptive tests of homogeneity for a Poisson  process. Ann. Inst. Henri Poincar´e Probab. Stat., 47(1):176-213, 2011.  23.12   FROMONT LAURENT LERASLE REYNAUD-BOURET  test is of the same order as the smallest uniform separation rate in the collection of single tests, up to the factor wm. By choosing a collection of kernels based on nested or more complicated linear subspaces generated by subsets of the Haar basis of L2(Z, dν), when Z = [0, 1] and ν is the Lebesgue measure on [0, 1], as in the paper by Fromont et al. (2011), this can be used to prove that our test is adaptive in the minimax sense over classes of alternatives (s1, s2) such that (s1 − s2) belongs to Besov or weak Besov bodies with various parameters (see Fromont et al. (2011) for more details).  Acknowledgments  The authors acknowledge the support of the French Agence Nationale de la Recherche (ANR), under grant ATLAS (JCJC06-137446) ”From Applications to Theory in Learning and Adaptive Statistics” and under grant Calibration (ANR-2011-BS01-010-02).  References  1992.  2002.  M. A. Arcones and E. Gin´e. On the bootstrap of U and V statistics. Ann. Statist., 20(2):655-674,  Y. Baraud. Non-asymptotic minimax rates of testing in signal detection. Bernoulli, 8(5):577-606,  Y. Baraud, S. Huet, and B. Laurent. Adaptive tests of linear hypotheses by model selection. Ann.  Statist., 31(1):225-251, 2003.  Math. Statist., 40:1-23, 1968.  P. J. Bickel. A distribution free version of the Smirnov two sample test in the p-variate case. Ann.  J. M. Bovett and J. G. Saw. On comparing two Poisson intensity functions. Comm. Statist. A—  Theory Methods, 9(9):943-948, 1980.  D. J. Daley and D. Vere-Jones. An introduction to the theory of point processes. Vol. II. Probability and its Applications (New York). Springer, New York, second edition, 2008. General theory and structure.  V. H. de la Pe˜na and E. Gin´e. Decoupling. Probability and its Applications (New York). Springer- Verlag, New York, 1999. From dependence to independence, Randomly stopped processes. U - statistics and processes. Martingales and beyond.  J. V. Deshpande, M. Mukhopadhyay, and U. V. Naik-Nimbalkar. Testing of two sample proportional intensity assumption for non-homogeneous Poisson processes. J. Statist. Plann. Inference, 81(2): 237-251, 1999.  J. Franke and S. Halim. Wild bootstrap tests. Signal proc. mag., IEEE, 24(4):31-37, 2007.  M. Fromont, B. Laurent, and P. Reynaud-Bouret. Adaptive tests of homogeneity for a Poisson  process. Ann. Inst. Henri Poincar´e Probab. Stat., 47(1):176-213, 2011.  23.12   KERNELS BASED TESTS  K. Fukumizu, B. Sriperumbudur, A. Gretton, and B. Sch¨olkopf. Characteristic kernels on groups and semigroups. Advances in Neural Information Processing Systems 21, (NIPS 2008), pages 473-480, 2009.  A. Gretton, K. M. Borgwardt, M. J. Rasch, B. Sch¨olkopf, and A. Smola. A kernel method for the  two-sample problem. J. Mach. Learn. Res., 1:1-10, 2008.  A. Gretton, K. Fukumizu, Z. Harchaoui, and B. K. Sriperumbudur. A fast, consistent kernel two- In Advances in Neural Information Processing Systems 22, (NIPS 2009), pages  sample test. 673-681, 2010.  P. Hall and J. D. Hart. Bootstrap test for difference between means in nonparametric regression. J.  Amer. Statist. Assoc., 85(412):1039-1049, 1990.  E. King, J. D. Hart, and T. E. Wehrly. Testing the equality of two regression curves using linear  smoothers. Statist. Probab. Lett., 12(3):239-247, 1991.  Q. Li. Nonparametric testing the similarity of two unknown density functions: local power and  bootstrap analysis. J. Nonparametr. Statist., 11(1-3):189-213, 1999.  E. Mammen. Bootstrap, wild bootstrap, and asymptotic normality. Probab. Theory Related Fields,  93(4):439-455, 1992.  B. Sch¨olkopf and A. J. Smola. Learning with kernels. Cambridge (Mass.) : MIT Press, 2002.  A. B. Tsybakov. Introduction to nonparametric estimation. Springer Series in Statistics. Springer, New York, 2009. Revised and extended from the 2004 French original, Translated by Vladimir Zaiats."}