{"1": "[1] Nir Ailon and Bernard Chazelle. The fast johnson–lindenstrauss transform and approximate  nearest neighbors. SIAM Journal on computing, 39(1):302–322, 2009.  [2] Ahmed Alaoui and Michael W Mahoney. Fast randomized kernel ridge regression with statis- tical guarantees. Advances in Neural Information Processing Systems, pages 775–783, 2015.  12   SHARP NONPARAMETRIC TESTING UNDER RANDOM PROJECTION  The last inequality holds with probability greater than 1 − e−nδn by Lemma B.2. Furthermore, it can be shown that T1 = OP (λ), T2 = op(T1), and T3 = oP (T1) . Then with probability at least 1 − e−nδn,  sup f0∈B  (cid:107) (cid:98)fR − f0(cid:107)2 n  (cid:38) sup f0∈B  (cid:107) E(cid:15) (cid:98)fR − f0(cid:107)2  n (cid:29) Cλ†.  Our second result is about the sharpness of s∗. Theorem 4.8 shows that when s (cid:28) s∗, there exists a local alternative f that is not detectable by Tn,λ even when it is separated from zero by d∗ n. In this case, the asymptotic testing power is actually smaller than the nominal level α.  Theorem 4.8 Suppose s = o(s∗). Then there exists an s × n projection matrix S satisfying Assumption A3 and a positive nonrandom sequence βn,λ satisfying limn→∞ βn,λ = ∞ such that, with probability at least 1 − e−cnδn − e−c1s − e−c2sλ,  lim sup n→∞  inf f ∈B (cid:107)f (cid:107)n≥βn,λd∗ n  Pf (φn,λ = 1|x, S) ≤ α,  where c is a constant independent of n, and c1, c2 ∈ (0, ∞] are given in Assumption A3 (b). Recall 1 − α is the significance level.  The proof of Theorem 4.8 is similar as that of Theorem 4.7, except that a different true function i=1 K(xi, ·)wi with w = (w1, · · · , wn)(cid:62) = U α, where α ∈ Rn satisfies  is constructed as f (·) = (cid:80)n  α2  i =  (cid:40) 1 n 0  C  s−1 (cid:98)µ−1  gs+k  for i = (gs + k) k = 1, 2, · · · , s − 1; otherwise,  (4.5)  with g ≥ 1 as an integer satisfying (g + 1)s (cid:28) s∗; see"}