{"1": "M. Aanjaneya, F. Chazal, D. Chen, M. Glisse, L. Guibas, and D. Morozov. Metric graph recon-  struction from noisy data. In Proc. 27th Sympos. Comput. Geom., pages 37-46, 2011.  M. Belkin. Problems of learning on manifold. PhD thesis, University of Chicago, 2003.  M. Belkin and P. Niyogi. Laplacian eigenmaps for dimensionality reduction and data representation.  Neural Comp, 15(6):1373-1396, 2003.  M. Belkin and P. Niyogi. Convergence of laplacian eigenmaps. preprint, short version appeared in  NIPS 2007, 2008a.  M. Belkin and P. Niyogi. Towards a theoretical foundation for laplacian-based manifold methods.  Journal of Computer and System Sciences, 74(8):1289-1308, 2008b.  P. Bendich, B. Wang, and S. Mukherjee. Local homology transfer and stratification learning. In  Proceedings of ACM-SIAM Symposium on Discrete Algorithms, 2012.  O. Chapelle, B. Sch¨olkopf, and A. Zien. Semi-supervised Learning. MIT Press, 2006.  F. Chazal and S. Oudot. Towards persistence-based reconstruction in Euclidean spaces. In Proc.  24th ACM Sympos. on Comput. Geom., pages 232-241, 2008.  F. Chazal, D. Cohen-Steiner, and A. Lieutier. A sampling theory for compact sets in euclidean  space. Discrete & Computational Geometry, 41(3):461-479, 2009.  G. Chen and G. Lerman. Foundations of a multi-way spectral clustering framework for hybrid linear  modeling. Foundations of Computational Mathematics, 9(5):517-558, 2009.  R. R. Coifman and S. Lafon. Diffusion maps. Applied and Computational Harmonic Analysis, 21  (1):5-30, 2006.  E. Gin´e and V. Koltchinskii. Empirical graph laplacian approximation of laplace-beltrami operators:  Large sample results. 51:238-259, 2006.  A. Goldberg, X. Zhu, A. Singh, Z. Xu, , and R. Nowak. Multi-manifold semi-supervised learning.  In Artificial Intelligence and Statistics, AISTATS, 2009.  A. Grigor’yan. Heat kernels on weighted manifolds and applications. Cont. Math., 398:93-191,  2006.  W. H¨ardle. Applied Nonparametric Regression. Cambridge Univeristy Press, 1992.  G. Haro, G. Randall, and G. Sapiro. Translated poisson mixture model for stratification learning.  International Journal of Computer Vision, 80(3):358-374, 2008.  M. Hein. Geometrical aspects of statistical learning theory. PhD thesis, Wissenschaftlicher Mitar- beiter am Max-Planck-Institut f¨ur biologische Kybernetik in T¨ubingen in der Abteilung, 2005.  M. Hein, J. yves Audibert, and U. V. Luxburg. Graph laplacians and their convergence on random  neighborhood graphs. Journal of Machine Learning Research, 8:1325-1368, 2007.  36.13   GRAPH LAPLACIANS ON SINGULAR MANIFOLDS  References  M. Aanjaneya, F. Chazal, D. Chen, M. Glisse, L. Guibas, and D. Morozov. Metric graph recon-  struction from noisy data. In Proc. 27th Sympos. Comput. Geom., pages 37-46, 2011.  M. Belkin. Problems of learning on manifold. PhD thesis, University of Chicago, 2003.  M. Belkin and P. Niyogi. Laplacian eigenmaps for dimensionality reduction and data representation.  Neural Comp, 15(6):1373-1396, 2003.  M. Belkin and P. Niyogi. Convergence of laplacian eigenmaps. preprint, short version appeared in  NIPS 2007, 2008a.  M. Belkin and P. Niyogi. Towards a theoretical foundation for laplacian-based manifold methods.  Journal of Computer and System Sciences, 74(8):1289-1308, 2008b.  P. Bendich, B. Wang, and S. Mukherjee. Local homology transfer and stratification learning. In  Proceedings of ACM-SIAM Symposium on Discrete Algorithms, 2012.  O. Chapelle, B. Sch¨olkopf, and A. Zien. Semi-supervised Learning. MIT Press, 2006.  F. Chazal and S. Oudot. Towards persistence-based reconstruction in Euclidean spaces. In Proc.  24th ACM Sympos. on Comput. Geom., pages 232-241, 2008.  F. Chazal, D. Cohen-Steiner, and A. Lieutier. A sampling theory for compact sets in euclidean  space. Discrete & Computational Geometry, 41(3):461-479, 2009.  G. Chen and G. Lerman. Foundations of a multi-way spectral clustering framework for hybrid linear  modeling. Foundations of Computational Mathematics, 9(5):517-558, 2009.  R. R. Coifman and S. Lafon. Diffusion maps. Applied and Computational Harmonic Analysis, 21  (1):5-30, 2006.  E. Gin´e and V. Koltchinskii. Empirical graph laplacian approximation of laplace-beltrami operators:  Large sample results. 51:238-259, 2006.  A. Goldberg, X. Zhu, A. Singh, Z. Xu, , and R. Nowak. Multi-manifold semi-supervised learning.  In Artificial Intelligence and Statistics, AISTATS, 2009.  A. Grigor’yan. Heat kernels on weighted manifolds and applications. Cont. Math., 398:93-191,  2006.  W. H¨ardle. Applied Nonparametric Regression. Cambridge Univeristy Press, 1992.  G. Haro, G. Randall, and G. Sapiro. Translated poisson mixture model for stratification learning.  International Journal of Computer Vision, 80(3):358-374, 2008.  M. Hein. Geometrical aspects of statistical learning theory. PhD thesis, Wissenschaftlicher Mitar- beiter am Max-Planck-Institut f¨ur biologische Kybernetik in T¨ubingen in der Abteilung, 2005.  M. Hein, J. yves Audibert, and U. V. Luxburg. Graph laplacians and their convergence on random  neighborhood graphs. Journal of Machine Learning Research, 8:1325-1368, 2007.  36.13   BELKIN QUE WANG ZHOU  S. Lafon. Diffusion Maps and Geodesic Harmonics. PhD thesis, Yale University, 2004.  G. Lerman and T. Zhang. Probabilistic recovery of multiple subspaces in point clouds by geometric  lp minimization, 2010.  P. Niyogi, S. Smale, and S. Weinberger. Finding the homology of submanifolds with high confidence  from random samples. Discrete & Computational Geometry, 39(1-3):419-441, 2008.  P. Niyogi, S. Smale, and S. Weinberger. A topological view of unsupervised learning from noisy  data. SIAM J. Comput., 40(3):646-663, 2011.  S. T. Roweis and L. K. Saul. Nonlinear dimensionality reduction by locally linear embedding.  Science, 290(5500):2323-2326, 2000.  A. Singer. From graph to manifold laplacian: The convergence rate. Appl. Comput. Harmon. Anal.,  21:128-134, 2006.  J. B. Tenenbaum, V. de Silva, and J. C. Langford. A global geometric framework for nonlinear  dimensionality reduction. Science, 290(5500):2319-2323, 2000.  R. Vidal, Y. Ma, and S. Sastry. Generalized principal component analysis (gpca). IEEE Transactions  on Pattern Analysis and Machine Intelligence, pages 1945-1959, 2005.  U. von Luxburg. A tutorial on spectral clustering. In Statistics and Computing, volume 17, pages  X. Zhu. Semi-supervised learning literature survey. Computer Science, University of Wisconsin-  395-416, 2007.  Madison, 2006.  36.14   GRAPH LAPLACIANS ON SINGULAR MANIFOLDS"}