{"1": "N. Alon and J. Spencer. The Probabilistic Method. John Wiley,, 2000.  I. Alth¨ofer. On sparse approximations to randomized strategies and convex combinations. Linear  Algebra and its Applications, 199:339-355, 1994.  Edoardo Amaldi and Raphael Hauser. Boundedness theorems for the relaxation method. Mathe-  matics of Operations Research, 30:939-955, 2005.  F. Bach, S. Lacoste-Julien, and G. Obozinsk. On the equivalence between herding and conditional  gradient algorithms. In In Proc. ICML, 2012.  K. Ball. An elementary introduction to modern convex geometry. Random Structures and Algo-  rithms, 31, 1997.  W. Banaszczyk. Balancing vectors and Gaussian measures of n-dimensional convex bodies. Ran-  dom Structures and Algorithms, 12(4):351-360, 1998.  W. Banaszczyk. On series of signed vectors and their rearrangements. Random Structures and  Algorithms, 40:301-316, 2012.  N. Bansal. Constructive algorithms for discrepancy minimization. In FOCS, 2010.  N. Bansal and J. Spencer. Deterministic discrepancy minimization. Algorithmica, 67(4):451-471,  I. Ba´ra´ny. On the power of linear dependencies. Building Bridges, Bolyai Society Mathematical  Viktor Bergstr¨om. Zwei s¨atze ¨uber ebene vektorpolygone. Abh. Math. Sem. Univ. Hamburg, 8:  2013.  Studies, 19:31-45, 2008.  148-152, 1931.  H. D. Block and S. A. Levin. On the boundedness of an iterative procedure for solving a system of  linear inequalities. Proceedings of the American Mathematical Society, 26:229-235, 1970.  L. Bornn, Y. Chen, N. de Freitas, M. Eskelin, J. Fang, and M. Welling. Herded Gibbs sampling. In  International Conference on Learning Representations, 2013.  Bernard Chazelle. The Discrepancy Method: Randomness and Complexity. Cambridge University  Press, 2000.  S. Chen, J. Dick, and A. B. Owen. Consistency of Markov chain quasi-monte carlo on continuous  state spaces. Annals of Statistics, 39:673-701, 2011.  Y. Chen, M. Welling, and A. Smola. Super-samples from kernel herding. In In Proc. UAI, 2010.  A. Gelfand, Y. Chen, L. van der Maaten, and M. Welling. On herding and the perceptron cycling  theorem. In In Proc. NIPS, 2010.  Alexander E. Holroyd and James Propp. Rotor walks and Markov chains. Algorithmic Probability  and Combinatorics, 520:105-126, 2010.  14   HARVEY SAMADI  References  N. Alon and J. Spencer. The Probabilistic Method. John Wiley,, 2000.  I. Alth¨ofer. On sparse approximations to randomized strategies and convex combinations. Linear  Algebra and its Applications, 199:339-355, 1994.  Edoardo Amaldi and Raphael Hauser. Boundedness theorems for the relaxation method. Mathe-  matics of Operations Research, 30:939-955, 2005.  F. Bach, S. Lacoste-Julien, and G. Obozinsk. On the equivalence between herding and conditional  gradient algorithms. In In Proc. ICML, 2012.  K. Ball. An elementary introduction to modern convex geometry. Random Structures and Algo-  rithms, 31, 1997.  W. Banaszczyk. Balancing vectors and Gaussian measures of n-dimensional convex bodies. Ran-  dom Structures and Algorithms, 12(4):351-360, 1998.  W. Banaszczyk. On series of signed vectors and their rearrangements. Random Structures and  Algorithms, 40:301-316, 2012.  N. Bansal. Constructive algorithms for discrepancy minimization. In FOCS, 2010.  N. Bansal and J. Spencer. Deterministic discrepancy minimization. Algorithmica, 67(4):451-471,  I. Ba´ra´ny. On the power of linear dependencies. Building Bridges, Bolyai Society Mathematical  Viktor Bergstr¨om. Zwei s¨atze ¨uber ebene vektorpolygone. Abh. Math. Sem. Univ. Hamburg, 8:  2013.  Studies, 19:31-45, 2008.  148-152, 1931.  H. D. Block and S. A. Levin. On the boundedness of an iterative procedure for solving a system of  linear inequalities. Proceedings of the American Mathematical Society, 26:229-235, 1970.  L. Bornn, Y. Chen, N. de Freitas, M. Eskelin, J. Fang, and M. Welling. Herded Gibbs sampling. In  International Conference on Learning Representations, 2013.  Bernard Chazelle. The Discrepancy Method: Randomness and Complexity. Cambridge University  Press, 2000.  S. Chen, J. Dick, and A. B. Owen. Consistency of Markov chain quasi-monte carlo on continuous  state spaces. Annals of Statistics, 39:673-701, 2011.  Y. Chen, M. Welling, and A. Smola. Super-samples from kernel herding. In In Proc. UAI, 2010.  A. Gelfand, Y. Chen, L. van der Maaten, and M. Welling. On herding and the perceptron cycling  theorem. In In Proc. NIPS, 2010.  Alexander E. Holroyd and James Propp. Rotor walks and Markov chains. Algorithmic Probability  and Combinatorics, 520:105-126, 2010. NEAR-OPTIMAL HERDING  Ferenc Husz´ar and David Duvenaud. Optimally-weighted herding is Bayesian quadrature. In In  S. Lovett and R. Meka. Constructive discrepancy minimization by walking on the edges. In FOCS,  Proc. UAI, 2012.  2012.  Jiri Matousek. Geometric Discrepancy: An Illustrated Guide. Springer, 1999.  J. Spencer. Six standard deviations suffice. Trans. Amer. Math. Soc., 289:679-706, 1985.  E. Steinitz. Bedingt konvergente reihen und konvexe systeme. J. Reine Ang. Mathematik, 143:  128-175, 1913.  T. Rothvoss. Constructive discrepancy minimization for convex sets. CoRR, abs/1404.0339, 2014.  R. Vershynin. Lecture notes in geometric functional analysis, 2009. manuscript.  M. Welling. Herding dynamical weights to learn. In Proceedings of the 26th International Confer-  ence on Machine Learning (ICML), 2009."}