{"1": "E. Arias-Castro, D.L. Donoho, and X. Huo. Near-optimal detection of geometric objects by fast  multiscale methods. IEEE Trans. Inform. Theory, 51(7):2402-2425, 2005.  Ery Arias-Castro, Emmanuel J. Cand`es, and Arnaud Durand. Detection of an anomalous cluster in  a network. Ann. Statist., 39(1):278-304, 2011.  Sean M. Brennan, Angela M. Mielke, David C. Torney, and Arthur B. Maccabe. Radiation detection with distributed sensor networks. Computer, 37(8):57-59, 2004. ISSN 0018-9162. doi: http: //doi.ieeecomputersociety.org/10.1109/MC.2004.103.  12   LEARNING PATTERNS FOR DETECTION  Wiener process. Suppose also that hi asymptotically powerful (has diminishing probability of type 1 and type 2 error) if  j ≤ Lc for some 0 ≤ c < 1 for all i, j, then the PAMSS is  √  µ −  2 ·  (cid:80)n (cid:80)n  i=1 v2 hi i=1 vhi  → ∞.  (10)  We take this result to mean that as long as the function class, |F|, does not grow exponentially in n, we achieve asymptotic power under the same conditions as if |F| = 1.  Proof We can see this because, under the assumptions, Vn ≥ Cn log L for some C > 0 and √ n = ω(Fn(δ) log log L) making the  Vn/Mn → 0. Furthermore, Fn(δ) = o(  n) and so Mn/  √  √  term involving |F| lower order. Evaluating Mn, Vn gives us the result.  Let us conclude with a remark about the restrictiveness of the assumption that we have a finite function class F. It is known that functions of bounded variation have Haar wavelet coefficients that are bounded in a weak (cid:96)1 norm, Cohen et al. (2003). It is reasonable to discretize the allowed coefficient values and then restrict our function class to functions with k-sparse wavelet coefficients of m then the log-size of the class scales like k log m which is very manageable. One advantage with this approach is that the sparse Haar wavelets will naturally satisfy condition (TVC). It is outside of the scope of this work to extend the result to infinite function classes, but this would present a very interesting and important extension.  6. Conclusions  We have addressed learning and detecting patterns from a function class, F, using multiscale scan statistics. We have introduced the multiscale scan statistic and proved a subexponential concentra- tion bound for it, which relied on a novel chaining result for standardized suprema of subGaussian random fields (a result that may be of independent interest). We introduced the pattern adapted mul- tiscale scan statistic, that can learn patterns in a database of tensors (when the locations and scales vary). This result allowed us to prove Bernstein-type concentration for the PAMSS, meaning that we can learn finite function classes that grow exponentially with the sample size, n. With evidence that representation learning and detection are not incompatible, we anticipate that efficient methods for learning functions in this setting will emerge, by using modern tools from deep learning and multiscale methods.  Acknowledgements: JS is supported in part by NSF DMS-1712996.  References  E. Arias-Castro, D.L. Donoho, and X. Huo. Near-optimal detection of geometric objects by fast  multiscale methods. IEEE Trans. Inform. Theory, 51(7):2402-2425, 2005.  Ery Arias-Castro, Emmanuel J. Cand`es, and Arnaud Durand. Detection of an anomalous cluster in  a network. Ann. Statist., 39(1):278-304, 2011.  Sean M. Brennan, Angela M. Mielke, David C. Torney, and Arthur B. Maccabe. Radiation detection with distributed sensor networks. Computer, 37(8):57-59, 2004. ISSN 0018-9162. doi: http: //doi.ieeecomputersociety.org/10.1109/MC.2004.103. LEARNING PATTERNS FOR DETECTION  Y. Caron, P. Makris, and N. Vincent. A method for detecting artificial objects in natural environ- ments. In Proceedings 16th International Conference on Pattern Recognition, volume 1, pages 600-603. IEEE Comput. Soc., 2002.  Hock Peng Chan and Guenther Walther. Detection with the scan and the average likelihood ratio.  Statistica Sinica, pages 409-428, 2013.  Hock Peng Chan, Guenther Walther, et al. Optimal detection of multi-sample aligned sparse signals.  The Annals of Statistics, 43(5):1865-1895, 2015.  Albert Cohen, Wolfgang Dahmen, Ingrid Daubechies, Ronald DeVore, et al. Harmonic analysis of  the space bv. Revista Matematica Iberoamericana, 19(1):235-263, 2003.  D. Culler, D. Estrin, and M. Srivastava. Overview of sensor networks.  IEEE Computer, 37(8):  Laurens De Haan and Ana Ferreira. Extreme value theory: an introduction. Springer Science &  41-49, 2004.  Business Media, 2007.  Statistics, pages 124-152, 2001.  Statistics, 31(8):967-980, 2004.  Lutz Dumbgen and Vladimir G Spokoiny. Multiscale testing of qualitative hypotheses. Annals of  Joseph Glaz and Zhenkui Zhang. Multiple window discrete scan statistics. Journal of Applied  Joseph Glaz, Joseph I Naus, and Sylvan Wallenstein. Scan statistics. Springer, 2001.  G Haiman and C Preda. Estimation for the distribution of two-dimensional discrete scan statistics.  Methodology and Computing in Applied Probability, 8(3):373-382, 2006.  R. Heffernan, F. Mostashari, D. Das, A. Karpati, M. Kulldorff, and D. Weiss. Syndromic surveil- lance in public health practice, New York City. Emerging Infectious Diseases, 10(5):858-864, 2004.  D. James, B. D. Clymer, and P. Schmalbrock. Texture detection of simulated microcalcification susceptibility effects in magnetic resonance imaging of breasts. Journal of Magnetic Resonance Imaging, 13(6):876-881, 2001.  Zakhar Kabluchko. Extremes of the standardized gaussian noise. Stochastic Processes and their  Applications, 121(3):515-533, 2011.  Daniel Kifer, Shai Ben-David, and Johannes Gehrke. Detecting change in data streams. In Pro- ceedings of the Thirtieth international conference on Very large data bases-Volume 30, pages 180-191. VLDB Endowment, 2004.  Dimitris Manolakis and Gary Shaw. Detection algorithms for hyperspectral imaging applications.  IEEE signal processing magazine, 19(1):29-43, 2002.  Nathan Moon, Elizabeth Bullitt, Koen van Leemput, and Guido Gerig. Automatic brain and tumor segmentation. In MICCAI ’02: Proceedings of the 5th International Conference on Medical Im- age Computing and Computer-Assisted Intervention-Part I, pages 372-379, London, UK, 2002. Springer-Verlag. ISBN 3-540-44224-3. LEARNING PATTERNS FOR DETECTION  Joseph I. Naus. The distribution of the size of the maximum cluster of points on a line. J. Amer.  Statist. Assoc., 60:532-538, 1965. ISSN 0162-1459.  Joseph I Naus and Sylvan Wallenstein. Multiple window and cluster size scan procedures. Method-  ology and Computing in Applied Probability, 6(4):389-400, 2004.  Daniel B Neill. Fast subset scan for spatial pattern detection. Journal of the Royal Statistical  Society: Series B (Statistical Methodology), 74(2):337-360, 2012.  Vladimir Pozdnyakov, Joseph Glaz, Martin Kulldorff, and J Michael Steele. A martingale approach  to scan statistics. Annals of the Institute of Statistical Mathematics, 57(1):21-37, 2005.  D. Pozo, F.J. Olmo, and L. Alados-Arboledas. Fire detection and growth monitoring using a multi- temporal technique on AVHRR mid-infrared and thermal channels. Remote Sensing of Environ- ment, 60(2):111-120, 1997.  Katharina Proksch, Frank Werner, and Axel Munk. Multiscale scanning in inverse problems. arXiv  preprint arXiv:1611.04537, 2016.  L.D. Rotz and J.M. Hughes. Advances in detecting and responding to threats from bioterrorism and  emerging infectious disease. Nature Medicine, pages S130-S136, 2004.  James Sharpnack and Ery Arias-Castro. Exact asymptotics for the scan statistic and fast alternatives.  Electronic Journal of Statistics, 10(2):2641-2684, 2016.  David O Siegmund and Keith J Worsley. Testing for a signal with unknown location and scale in a  stationary gaussian random field. The Annals of Statistics, pages 608-639, 1995.  Michel Talagrand. The generic chaining: upper and lower bounds of stochastic processes. Springer  Science & Business Media, 2006.  AW Van der Vaart and JA Wellner. Weak convergence and empirical processes. Springer, New  York, 1996.  arXiv:1011.3027, 2010.  Roman Vershynin. Introduction to the non-asymptotic analysis of random matrices. arXiv preprint  Guenther Walther. Optimal and fast detection of spatial clusters with scan statistics. Ann. Statist.,  38(2):1010-1033, 2010. ISSN 0090-5364. doi: 10.1214/09-AOS732.  Xiao Wang and Joseph Glaz. Variable window scan statistics for normal data. Communications in  Statistics-Theory and Methods, 43(10-12):2489-2504, 2014.  Brian A White, Antonios Tsourdos, Immanuel Ashokaraj, S Subchan, and Rafal Zbikowski. Con- taminant cloud boundary monitoring using network of uav sensors. IEEE Sensors Journal, 8(10): 1681-1692, 2008.  Y Jeffrey Yang, Roy C Haught, and James A Goodrich. Real-time contaminant detection and classification in a drinking water pipe using conventional water quality sensors: Techniques and experimental results. Journal of environmental management, 90(8):2494-2506, 2009. LEARNING PATTERNS FOR DETECTION"}