{"1": "Zeyuan Allen Zhu, Yuanzhi Li, Rafael Oliveira, and Avi Wigderson. Much faster algorithms for matrix scaling. In FOCS’17: Proceedings of the 58th Annual IEEE Symposium on Foundations of Computer Science, 2017.  Noga Alon and Van H. Vu. Anti-Hadamard matrices, coin weighing, threshold gates, and indecom- posable hypergraphs. J. Comb. Theory, Ser. A, 79(1):133-160, 1997. doi: 10.1006/jcta.1997. 2780. URL https://doi.org/10.1006/jcta.1997.2780.  Nima Anari and Shayan Oveis Gharan. A generalization of permanent inequalities and applications in counting and optimization. In Proceedings of the 49th Annual ACM SIGACT Symposium on Theory of Computing, STOC 2017, pages 384-396, 2017. ISBN 978-1-4503-4528-6. doi: 10. 1145/3055399.3055469. URL http://doi.acm.org/10.1145/3055399.3055469.  Arash Asadpour, Michel X. Goemans, Aleksander Madry, Shayan Oveis Gharan, and Amin Saberi. An O(log n/ log log n)-approximation algorithm for the asymmetric traveling salesman problem. In Proceedings of the Twenty-first Annual ACM-SIAM Symposium on Discrete Algorithms, SODA ’10, pages 379-389, 2010.  Franck Barthe. On a reverse form of the brascamp-lieb inequality. Inventiones mathematicae, 134  (2):335-361, Oct 1998.  Aharon Ben-Tal and Arkadi Nemirovski. Optimization III: Convex analysis, nonlinear program-  ming theory, nonlinear programming algorithms. Lecture Notes, 2012.  Andr´e Bouchet and William H. Cunningham. Delta-matroids, jump systems, and bisubmodular polyhedra. SIAM J. Discrete Math., 8(1):17-32, 1995. doi: 10.1137/S0895480191222926. URL http://dx.doi.org/10.1137/S0895480191222926.  Olivier Bousquet and Andr´e Elisseeff. Stability and generalization. Journal of machine learning  research, 2(Mar):499-526, 2002.  matics, 216(1):302 - 320, 2007.  Petter Branden. Polynomials with the half-plane property and matroid theory. Advances in Mathe-  Herm Jan Brascamp and Elliott H. Lieb. Best constants in Young’s inequality, its converse, and its generalization to more than three functions, pages 417-439. Springer Berlin Heidelberg, Berlin, Heidelberg, 2002.  L. Elisa Celis, Amit Deshpande, Tarun Kathuria, Damian Straszak, and Nisheeth K. Vish- In Approxima- noi. On the complexity of constrained determinantal point processes. tion, Randomization, and Combinatorial Optimization. Algorithms and Techniques, AP- PROX/RANDOM 2017, August 16-18, 2017, Berkeley, CA, USA, pages 36:1-36:22, 2017. doi: 10.4230/LIPIcs.APPROX-RANDOM.2017.36. URL https://doi.org/10.4230/ LIPIcs.APPROX-RANDOM.2017.36.  L. Elisa Celis, Vijay Keswani, Damian Straszak, Amit Deshpande, Tarun Kathuria, and Nisheeth K. Vishnoi. Fair and Diverse DPP-Based Data Summarization. In ICML, volume 80 of Proceedings of Machine Learning Research, pages 715-724. PMLR, 2018.  13   MAXIMUM ENTROPY DISTRIBUTIONS  References  Zeyuan Allen Zhu, Yuanzhi Li, Rafael Oliveira, and Avi Wigderson. Much faster algorithms for matrix scaling. In FOCS’17: Proceedings of the 58th Annual IEEE Symposium on Foundations of Computer Science, 2017.  Noga Alon and Van H. Vu. Anti-Hadamard matrices, coin weighing, threshold gates, and indecom- posable hypergraphs. J. Comb. Theory, Ser. A, 79(1):133-160, 1997. doi: 10.1006/jcta.1997. 2780. URL https://doi.org/10.1006/jcta.1997.2780.  Nima Anari and Shayan Oveis Gharan. A generalization of permanent inequalities and applications in counting and optimization. In Proceedings of the 49th Annual ACM SIGACT Symposium on Theory of Computing, STOC 2017, pages 384-396, 2017. ISBN 978-1-4503-4528-6. doi: 10. 1145/3055399.3055469. URL http://doi.acm.org/10.1145/3055399.3055469.  Arash Asadpour, Michel X. Goemans, Aleksander Madry, Shayan Oveis Gharan, and Amin Saberi. An O(log n/ log log n)-approximation algorithm for the asymmetric traveling salesman problem. In Proceedings of the Twenty-first Annual ACM-SIAM Symposium on Discrete Algorithms, SODA ’10, pages 379-389, 2010.  Franck Barthe. On a reverse form of the brascamp-lieb inequality. Inventiones mathematicae, 134  (2):335-361, Oct 1998.  Aharon Ben-Tal and Arkadi Nemirovski. Optimization III: Convex analysis, nonlinear program-  ming theory, nonlinear programming algorithms. Lecture Notes, 2012.  Andr´e Bouchet and William H. Cunningham. Delta-matroids, jump systems, and bisubmodular polyhedra. SIAM J. Discrete Math., 8(1):17-32, 1995. doi: 10.1137/S0895480191222926. URL http://dx.doi.org/10.1137/S0895480191222926.  Olivier Bousquet and Andr´e Elisseeff. Stability and generalization. Journal of machine learning  research, 2(Mar):499-526, 2002.  matics, 216(1):302 - 320, 2007.  Petter Branden. Polynomials with the half-plane property and matroid theory. Advances in Mathe-  Herm Jan Brascamp and Elliott H. Lieb. Best constants in Young’s inequality, its converse, and its generalization to more than three functions, pages 417-439. Springer Berlin Heidelberg, Berlin, Heidelberg, 2002.  L. Elisa Celis, Amit Deshpande, Tarun Kathuria, Damian Straszak, and Nisheeth K. Vish- In Approxima- noi. On the complexity of constrained determinantal point processes. tion, Randomization, and Combinatorial Optimization. Algorithms and Techniques, AP- PROX/RANDOM 2017, August 16-18, 2017, Berkeley, CA, USA, pages 36:1-36:22, 2017. doi: 10.4230/LIPIcs.APPROX-RANDOM.2017.36. URL https://doi.org/10.4230/ LIPIcs.APPROX-RANDOM.2017.36.  L. Elisa Celis, Vijay Keswani, Damian Straszak, Amit Deshpande, Tarun Kathuria, and Nisheeth K. Vishnoi. Fair and Diverse DPP-Based Data Summarization. In ICML, volume 80 of Proceedings of Machine Learning Research, pages 715-724. PMLR, 2018. MAXIMUM ENTROPY DISTRIBUTIONS  Michael B. Cohen, Aleksander Madry, Dimitris Tsipras, and Adrian Vladu. Matrix scaling and balancing via box constrained Newton’s method and interior point methods. In FOCS’17: Pro- ceedings of the 58th Annual IEEE Symposium on Foundations of Computer Science, 2017.  Miroslav Dud´ık, Steven J Phillips, and Robert E Schapire. Maximum entropy density estimation with generalized regularization and an application to species distribution modeling. Journal of Machine Learning Research, 8(Jun):1217-1260, 2007.  Ankit Garg, Leonid Gurvits, Rafael Oliveira, and Avi Wigderson. Algorithmic and optimization aspects of Brascamp-Lieb inequalities, via operator scaling. In Proceedings of the 49th Annual ACM Symposium on Theory of Computing, Montreal, QC, Canada, June 19-23, 2017, pages 397-409, 2017. doi: 10.1145/3055399.3055458. URL http://doi.acm.org/10.1145/ 3055399.3055458.  Martin Gr¨otschel, L´aszlo Lov´asz, and Alexander Schrijver. Geometric algorithms and combina- torial optimization, volume 2 of Algorithms and Combinatorics. Springer, 1988. ISBN 3-540- 13624-X, 0-387-13624-X (U.S.).  Osman G¨uler. Hyperbolic polynomials and interior point methods for convex programming. Math. Oper. Res., 22(2):350-377, 1997. doi: 10.1287/moor.22.2.350. URL https://doi.org/ 10.1287/moor.22.2.350.  Leonid Gurvits. Hyperbolic polynomials approach to Van der Waerden/Schrijver-Valiant like con- In Proceedings of the  jectures: sharper bounds, simpler proofs and algorithmic applications. thirty-eighth annual ACM symposium on Theory of computing, pages 417-426. ACM, 2006.  Leonid Gurvits and Alex Samorodnitsky. A deterministic polynomial-time algorithm for approxi- mating mixed discriminant and mixed volume, and a combinatorial corollary. Discrete & Com- putational Geometry, 27:531-550, 2002.  Leonid Gurvits and Alex Samorodnitsky. Bounds on the permanent and some applications. In 55th IEEE Annual Symposium on Foundations of Computer Science, FOCS 2014, Philadelphia, PA, USA, October 18-21, 2014, pages 90-99, 2014. doi: 10.1109/FOCS.2014.18. URL https: //doi.org/10.1109/FOCS.2014.18.  Lingxiao Huang and Nisheeth K. Vishnoi. Stable and Fair Classification. In ICML, 2019.  Edwin T. Jaynes.  Information theory and statistical mechanics. Physical Review, 106:620-630,  May 1957a. doi: 10.1103/PhysRev.106.620.  Edwin T. Jaynes. Information theory and statistical mechanics. II. Physical Review, 108:171-190,  October 1957b. doi: 10.1103/PhysRev.108.171.  Bahman Kalantari, Isabella Lari, Federica Ricca, and Bruno Simeone. On the complexity of gen- eral matrix scaling and entropy minimization via the RAS algorithm. Math. Program., 112(2): 371-401, 2008. doi: 10.1007/s10107-006-0021-4. URL https://doi.org/10.1007/ s10107-006-0021-4.  Alex Kulesza and Ben Taskar. Determinantal point processes for machine learning. Now Publishers  Inc., Hanover, MA, USA, 2012. ISBN 1601986289, 9781601986283. MAXIMUM ENTROPY DISTRIBUTIONS  Elliott H. Lieb. Gaussian kernels have only gaussian maximizers. Inventiones mathematicae, 102  (1):179-208, Dec 1990.  Yurii Nesterov. Introductory lectures on convex optimization: A basic course. Springer Publishing  Company, Incorporated, 1 edition, 2014. ISBN 1461346916, 9781461346913.  Kamal Nigam. Using maximum entropy for text classification. In In IJCAI-99 Workshop on Ma-  chine Learning for Information Filtering, pages 61-67, 1999.  Aleksandar Nikolov and Mohit Singh. Maximizing determinants under partition constraints.  In Proceedings of the 48th Annual ACM SIGACT Symposium on Theory of Computing, pages 192- 201, 2016.  Stephen Della Pietra, Vincent J. Della Pietra, and John D. Lafferty. Inducing features of random fields. IEEE Trans. Pattern Anal. Mach. Intell., 19(4):380-393, 1997. doi: 10.1109/34.588021. URL https://doi.org/10.1109/34.588021.  M. C. Shewry and H. P. Wynn. Maximum entropy sampling. Journal of Applied Statistics, 14(2):  165-170, 1987. doi: 10.1080/02664768700000020.  Mohit Singh and Nisheeth K Vishnoi. Entropy, optimization and counting. In Proceedings of the  46th Annual ACM Symposium on Theory of Computing, pages 50-59. ACM, 2014.  Ehsan S Soofi. Principal information theoretic approaches. Journal of the American Statistical  Association, 95(452):1349-1353, 2000.  Damian Straszak and Nisheeth K. Vishnoi. Real stable polynomials and matroids: Optimization and counting. In Proceedings of the 49th Annual ACM SIGACT Symposium on Theory of Computing, STOC 2017, pages 370-383, 2017. ISBN 978-1-4503-4528-6. doi: 10.1145/3055399.3055457. URL http://doi.acm.org/10.1145/3055399.3055457.  David Wagner. Multivariate stable polynomials: theory and applications. Bulletin of the American  Mathematical Society, 48(1):53-84, 2011.  Bin Yu. Stability. Bernoulli, 19(4):1484-1500, 09 2013. doi: 10.3150/13-BEJSP14. URL https:  //doi.org/10.3150/13-BEJSP14."}