{"1": "R. Adamczak, A. E. Litvak, , A. Pajor, and N. Tomczak-Jaegermann. Restricted isometry property of matrices with independent columns and neighborly polytopes by random sampling, 2009. 0904.4723v1.  R. Adamczak, R. Latala, A. E. Litvak, , A. Pajor, and N. Tomczak-Jaegermann. Geometry of log- concave ensembles of random matrices and approximate reconstruction, 2011. 1103.0401v1.  R. G. Baraniuk, M. Davenport, R. A. DeVore, and M. B. Wakin. A simple proof of the restricted isometry property for random matrices. Constructive Approximation, 28(3):253-263, 2008.  P. Bickel, Y. Ritov, and A. Tsybakov. Simultaneous analysis of Lasso and Dantzig selector. The  Annals of Statistics, 37(4):1705-1732, 2009.  E. Cand`es and T. Tao. Decoding by Linear Programming. IEEE Trans. Info. Theory, 51:4203-4215,  2005.  E. Cand`es and T. Tao. Near optimal signal recovery from random projections: Universal encoding  strategies? IEEE Trans. Info. Theory, 52(12):5406-5425, December 2006.  E. Cand`es and T. Tao. The Dantzig selector: statistical estimation when p is much larger than n.  Annals of Statistics, 35(6):2313-2351, 2007.  E. Cand`es, J. Romberg, and T. Tao. Stable signal recovery from incomplete and inaccurate mea- surements. Communications in Pure and Applied Mathematics, 59(8):1207-1223, August 2006.  S. Chen, D. Donoho, and M. Saunders. Atomic decomposition by basis pursuit. SIAM Journal on  Scientific and Statistical Computing, 20:33-61, 1998.  D. Donoho. For most large underdetermined systems of equations, the minimal (cid:96)1-norm solution is also the sparsest solution. Communications in Pure and Applied Mathematics, 59(6):797-829, 2006a.  D. Donoho. Compressed sensing. IEEE Trans. Info. Theory, 52(4):1289-1306, April 2006b.  G. Duncan and R. Pearson. Enhancing access to microdata while protecting confidentiality:  Prospects for the future. Statistical Science, 6(3):219-232, August 1991.  Y. Gordon. Some inequalities for gaussian processes and applications. Israel Journal of Mathemat-  ics, 50(4):265-289, 1985.  M. Ledoux. The concentration of measure phenomenon. Mathematical Surveys and Monographs,  89. American Mathematical Society, 2001.  M. Ledoux and M. Talagrand. Probability in Banach Spaces: Isoperimetry and processes. Springer,  1991.  S. Mendelson, A. Pajor, and N. Tomczak-Jaegermann. Reconstruction and subgaussian operators in asymptotic geometric analysis. Geometric and Functional Analysis, 17(4):1248-1282, 2007.  10.13   ANISOTROPIC RANDOM MEASUREMENTS  References  R. Adamczak, A. E. Litvak, , A. Pajor, and N. Tomczak-Jaegermann. Restricted isometry property of matrices with independent columns and neighborly polytopes by random sampling, 2009. 0904.4723v1.  R. Adamczak, R. Latala, A. E. Litvak, , A. Pajor, and N. Tomczak-Jaegermann. Geometry of log- concave ensembles of random matrices and approximate reconstruction, 2011. 1103.0401v1.  R. G. Baraniuk, M. Davenport, R. A. DeVore, and M. B. Wakin. A simple proof of the restricted isometry property for random matrices. Constructive Approximation, 28(3):253-263, 2008.  P. Bickel, Y. Ritov, and A. Tsybakov. Simultaneous analysis of Lasso and Dantzig selector. The  Annals of Statistics, 37(4):1705-1732, 2009.  E. Cand`es and T. Tao. Decoding by Linear Programming. IEEE Trans. Info. Theory, 51:4203-4215,  2005.  E. Cand`es and T. Tao. Near optimal signal recovery from random projections: Universal encoding  strategies? IEEE Trans. Info. Theory, 52(12):5406-5425, December 2006.  E. Cand`es and T. Tao. The Dantzig selector: statistical estimation when p is much larger than n.  Annals of Statistics, 35(6):2313-2351, 2007.  E. Cand`es, J. Romberg, and T. Tao. Stable signal recovery from incomplete and inaccurate mea- surements. Communications in Pure and Applied Mathematics, 59(8):1207-1223, August 2006.  S. Chen, D. Donoho, and M. Saunders. Atomic decomposition by basis pursuit. SIAM Journal on  Scientific and Statistical Computing, 20:33-61, 1998.  D. Donoho. For most large underdetermined systems of equations, the minimal (cid:96)1-norm solution is also the sparsest solution. Communications in Pure and Applied Mathematics, 59(6):797-829, 2006a.  D. Donoho. Compressed sensing. IEEE Trans. Info. Theory, 52(4):1289-1306, April 2006b.  G. Duncan and R. Pearson. Enhancing access to microdata while protecting confidentiality:  Prospects for the future. Statistical Science, 6(3):219-232, August 1991.  Y. Gordon. Some inequalities for gaussian processes and applications. Israel Journal of Mathemat-  ics, 50(4):265-289, 1985.  M. Ledoux. The concentration of measure phenomenon. Mathematical Surveys and Monographs,  89. American Mathematical Society, 2001.  M. Ledoux and M. Talagrand. Probability in Banach Spaces: Isoperimetry and processes. Springer,  1991.  S. Mendelson, A. Pajor, and N. Tomczak-Jaegermann. Reconstruction and subgaussian operators in asymptotic geometric analysis. Geometric and Functional Analysis, 17(4):1248-1282, 2007.  10.13   RUDELSON ZHOU  S. Mendelson, A. Pajor, and N. Tomczak-Jaegermann. Uniform uncertainty principle for bernoulli  and subgaussian ensembles. Constructive Approximation, 28(3):277-289, 2008.  V. D. Milman and G. Schechtman. Asymptotic Theory of Finite Dimensional Normed Spaces. Lec-  ture Notes in Mathematics 1200. Springer, 1986.  G. Pisier. Remarques sur un r´esultat non publi´e de b. Maurey. Seminar on Functional Analysis,  ´Ecole Polytech., Palaiseau, 5, 1981.  G. Raskutti, Martin Wainwright, and Bin Yu. Restricted nullspace and eigenvalue properties for  correlated gaussian designs. Journal of Machine Learning Research, 11:2241-2259, 2010.  M. Rudelson and R. Vershynin. Geometric approach to error correcting codes and reconstruction of  signals. International Mathematical Research Notices, 64:4019-4041, 2005.  M. Rudelson and R. Vershynin. Sparse reconstruction by convex relaxation: Fourier and gaussian measurements. In 40th Annual Conference on Information Sciences and Systems (CISS 2006), pages 207-212, March 2006.  M. Rudelson and R. Vershynin. On sparse reconstruction from fourier and gaussian measurements.  Communications on Pure and Applied Mathematics, 61:1025-1045, 2008.  M. Talagrand. New concentration inequalities in product spaces. Invent. Math., 126:505-563, 1996.  M. Talagrand. The Generic Chaining: Upper and Lower Bounds of Stochastic Processes. Springer,  R. Tibshirani. Regression shrinkage and selection via the Lasso. J. Roy. Statist. Soc. Ser. B, 58(1):  2000.  267-288, 1996.  S. van de Geer and P. Buhlmann. On the conditions used to prove oracle results for the lasso.  Electronic Journal of Statistics, 3:1360-1392, 2009.  R. Vershynin. Approximating the moments of marginals of high dimensional distributions. Annals  of Probability, 39:1591-1606, 2011a.  R. Vershynin. How close is the sample covariance matrix to the actual covariance matrix? Journal  of Theoretical Probability, to appear, 2011b.  S. Zhou. Restricted eigenvalue conditions on subgaussian random matrices, 2009. Unpublished  Manuscript. Available at http://arxiv.org/pdf/0912.4045v2.pdf.  S. Zhou, J. Lafferty, and L. Wasserman. Compressed and privacy sensitive sparse regression. IEEE  Transactions on Information Theory, 55(2):846-866, 2009a.  S. Zhou, S. van de Geer, and P. B¨uhlmann. Adaptive Lasso for high dimensional regression and  gaussian graphical modeling, 2009b. arXiv:0903.2515.  S. Zhou, P. R¨utimann, M. Xu, and P. B¨uhlmann. High-dimensional covariance estimation based on  Gaussian graphical models. Journal of Machine Learning Research, 12:2975-3026, 2011.  10.14   ANISOTROPIC RANDOM MEASUREMENTS"}