{"1": "89-113, 2004.  A Blum, N. Bansal, and S. Chawla. Correlation clustering. Machine Learning Journal, 56(1/3):  B. Bollobas. Combinatorics. Cambridge University Press, 1986.  D. Cartwright and F. Harary. Structure balance: A generalization of Heider’s theory. Psychological  review, 63(5):277-293, 1956.  N. Cesa-Bianchi, C. Gentile, and F. Vitale. Fast and optimal prediction of a labeled tree. In Pro-  ceedings of the 22nd Annual Conference on Learning Theory. Omnipress, 2009.  N. Cesa-Bianchi, C. Gentile, F. Vitale, and G. Zappella. Random spanning trees and the prediction of weighted graphs. In Proceedings of the 27th International Conference on Machine Learning. Omnipress, 2010.  K. Chiang, N. Natarajan, A. Tewari, and I. Dhillon. Exploiting longer cycles for link prediction in signed networks. In Proceedings of the 20th ACM Conference on Information and Knowledge Management (CIKM). ACM, 2011.  E.D. Demaine, D. Emanuel, A. Fiat, and N. Immorlica. Correlation clustering in general weighted  graphs. Theoretical Computer Science, 361(2-3):172-187, 2006.  R. El-Yaniv and D. Pechyony. Transductive rademacher complexity and its applications. Journal of  Artificial Intelligence Research, 35(1):193-234, 2009.  M. Elkin, Y. Emek, D.A. Spielman, and S.-H. Teng. Lower-stretch spanning trees. SIAM Journal  on Computing, 38(2):608-628, 2010.  34.12   CESA-BIANCHI GENTILE VITALE ZAPPELLA  (cid:17)  (cid:16)(cid:113) |VG| ρ  log |VG|  , respectively, provided |C(G)| = Ω(|EG|) and ρ ≤ (cid:112)|VG|. For instance, O when the input graph G = (VG, EG) has a quadratic number of edges, SCCCC has an amortized time per prediction which is only logarithmic in |VG|. In all cases, both algorithms need linear space in the size of the input graph. In addition, each do-while loop execution within CCCC can be run in parallel.  5. Conclusions and ongoing research  In this paper we initiated a rigorous study of link classification in signed graphs. Motivated by social balance theory, we adopted the correlation clustering index as a natural regularity measure for the problem. We proved upper and lower bounds on the number of prediction mistakes in three fundamental transductive learning models: online, batch and active. Our main algorithmic contribution is for the active model, where we introduced a new family of algorithms based on the notion of circuit covering. Our algorithms are efficient, relatively easy to implement, and have mistake bounds that hold on any signed graph. We are currently working on extensions of our techniques based on recursive decompositions of the input graph. Experiments on social network datasets are also in progress.  References  89-113, 2004.  A Blum, N. Bansal, and S. Chawla. Correlation clustering. Machine Learning Journal, 56(1/3):  B. Bollobas. Combinatorics. Cambridge University Press, 1986.  D. Cartwright and F. Harary. Structure balance: A generalization of Heider’s theory. Psychological  review, 63(5):277-293, 1956.  N. Cesa-Bianchi, C. Gentile, and F. Vitale. Fast and optimal prediction of a labeled tree. In Pro-  ceedings of the 22nd Annual Conference on Learning Theory. Omnipress, 2009.  N. Cesa-Bianchi, C. Gentile, F. Vitale, and G. Zappella. Random spanning trees and the prediction of weighted graphs. In Proceedings of the 27th International Conference on Machine Learning. Omnipress, 2010.  K. Chiang, N. Natarajan, A. Tewari, and I. Dhillon. Exploiting longer cycles for link prediction in signed networks. In Proceedings of the 20th ACM Conference on Information and Knowledge Management (CIKM). ACM, 2011.  E.D. Demaine, D. Emanuel, A. Fiat, and N. Immorlica. Correlation clustering in general weighted  graphs. Theoretical Computer Science, 361(2-3):172-187, 2006.  R. El-Yaniv and D. Pechyony. Transductive rademacher complexity and its applications. Journal of  Artificial Intelligence Research, 35(1):193-234, 2009.  M. Elkin, Y. Emek, D.A. Spielman, and S.-H. Teng. Lower-stretch spanning trees. SIAM Journal  on Computing, 38(2):608-628, 2010.  34.12   A CORRELATION CLUSTERING APPROACH TO LINK CLASSIFICATION  G. Facchetti, G. Iacono, and C. Altafini. Computing global structural balance in large-scale signed  social networks. PNAS, 2011.  I. Giotis and V. Guruswami. Correlation clustering with a fixed number of clusters. In Proceedings of the Seventeenth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 1167-1176. ACM, 2006.  R. Guha, R. Kumar, P. Raghavan, and A. Tomkins. Propagation of trust and distrust. In Proceedings  of the 13th international conference on World Wide Web, pages 403-412. ACM, 2004.  F. Harary. On the notion of balance of a signed graph. Michigan Mathematical Journal, 2(2):  143-146, 1953.  F. Heider. Attitude and cognitive organization. J. Psychol, 21:107-122, 1946.  M. Herbster and M. Pontil. Prediction on a graph with the Perceptron. Information Processing Systems 21, pages 577-584. MIT Press, 2007.  In Advances in Neural  Y.P. Hou. Bounds for the least Laplacian eigenvalue of a signed graph. Acta Mathematica Sinica,  21(4):955-960, 2005.  J. Kunegis, A. Lommatzsch, and C. Bauckhage. The Slashdot Zoo: Mining a social network with negative edges. In Proceedings of the 18th International Conference on World Wide Web, pages 741-750. ACM, 2009.  J. Leskovec, D. Huttenlocher, and J. Kleinberg. Signed networks in social media. In Proceedings of the 28th International Conference on Human Factors in Computing Systems, pages 1361-1370. ACM, 2010a.  J. Leskovec, D. Huttenlocher, and J. Kleinberg. Predicting positive and negative links in online social networks. In Proceedings of the 19th International Conference on World Wide Web, pages 641-650. ACM, 2010b.  N. Littlestone. Mistake Bounds and Logarithmic Linear-threshold Learning Algorithms. PhD thesis,  University of California at Santa Cruz, 1989.  N. Littlestone and M.K. Warmuth. The weighted majority algorithm. Information and Computation,  108:212-261, 1994.  R. Lyons and Y. Peres. Probability on trees and networks. Manuscript, 2009.  U. Von Luxburg. A tutorial on spectral clustering. Statistics and Computing, 17(4):395-416, 2007."}