{"1": "R. Ahlswede and A. Winter. Strong converse for identification via quantum channels. IEEE  Transactions on Information Theory, 48(3):569-579, 2002.  Y. Amit, M. Fink, N. Srebro, S. Ullman. Uncovering shared structures in multiclass classifi- cation. Proc. 24th International Conference on Machine Learning (ICML), pages 17-24, 2007.  R. K. Ando, T. Zhang. A framework for learning predictive structures from multiple tasks  and unlabeled data. Journal of Machine Learning Research, 6:1817-1853, 2005.  A. Argyriou, T. Evgeniou, M. Pontil. Convex multi-task feature learning. Machine Learning,  F.R. Bach. Consistency of trace norm minimization. Journal of Machine Learning Research,  73(3):243-272, 2008.  9:1019-1048, 2008.  P.L. Bartlett and S. Mendelson. Rademacher and Gaussian Complexities: Risk bounds and  structural results. Journal of Machine Learning Research, 3:463-482, 2002.  J. Baxter. A model of inductive bias learning. Journal of Artificial Intelligence Research,  12:149-198, 2000.  S. Ben-David and R. Schuller. Exploiting task relatedness for multiple task learning. Proc. 16th Annual Conference on Computational Learning Theory (COLT), pages 567-580, 2003.  R. Bhatia. Matrix Analysis. Springer, 1997.  E. Cand`es and T. Tao. The power of convex relaxation: Near optimal matrix completion.  IEEE Transactions on Information Theory, 56(5):2053-2080, 2009.  R. Caruana. Multi-task learning. Machine Learning, 28(1):41-75, 1997.  G. Cavallanti, N. Cesa-Bianchi, and C. Gentile. Linear algorithms for online multitask  classification. Journal of Machine Learning Research, 11:2597-2630, 2010.  T. Evgeniou, C. Micchelli and M. Pontil. Learning multiple tasks with kernel methods.  Journal of Machine Learning Research, 6:615-637, 2005.  M. Fazel, H. Hindi, and S. Boyd. A rank minimization heuristic with application to minimum order system approximation. Proc. American Control Conference, Vol. 6, pages 4734- 4739, 2001.  R. Foygel, R. Salakhutdinov, O. Shamir, and N. Srebro. Learning with the weighted trace- norm under arbitrary sampling distributions. Advances in Neural Information Processing Systems, 24, pages 2133-2141, 2011.  Z. Harchaoui, M. Douze, M. Paulin, M. Dudik, J. Malick. Large-scale image classification with trace-norm regularization. IEEE Conference on Computer Vision & Pattern Recog- nition (CVPR), pages 3386-3393, 2012.  13   Excess risk bounds for multitask learning  References  R. Ahlswede and A. Winter. Strong converse for identification via quantum channels. IEEE  Transactions on Information Theory, 48(3):569-579, 2002.  Y. Amit, M. Fink, N. Srebro, S. Ullman. Uncovering shared structures in multiclass classifi- cation. Proc. 24th International Conference on Machine Learning (ICML), pages 17-24, 2007.  R. K. Ando, T. Zhang. A framework for learning predictive structures from multiple tasks  and unlabeled data. Journal of Machine Learning Research, 6:1817-1853, 2005.  A. Argyriou, T. Evgeniou, M. Pontil. Convex multi-task feature learning. Machine Learning,  F.R. Bach. Consistency of trace norm minimization. Journal of Machine Learning Research,  73(3):243-272, 2008.  9:1019-1048, 2008.  P.L. Bartlett and S. Mendelson. Rademacher and Gaussian Complexities: Risk bounds and  structural results. Journal of Machine Learning Research, 3:463-482, 2002.  J. Baxter. A model of inductive bias learning. Journal of Artificial Intelligence Research,  12:149-198, 2000.  S. Ben-David and R. Schuller. Exploiting task relatedness for multiple task learning. Proc. 16th Annual Conference on Computational Learning Theory (COLT), pages 567-580, 2003.  R. Bhatia. Matrix Analysis. Springer, 1997.  E. Cand`es and T. Tao. The power of convex relaxation: Near optimal matrix completion.  IEEE Transactions on Information Theory, 56(5):2053-2080, 2009.  R. Caruana. Multi-task learning. Machine Learning, 28(1):41-75, 1997.  G. Cavallanti, N. Cesa-Bianchi, and C. Gentile. Linear algorithms for online multitask  classification. Journal of Machine Learning Research, 11:2597-2630, 2010.  T. Evgeniou, C. Micchelli and M. Pontil. Learning multiple tasks with kernel methods.  Journal of Machine Learning Research, 6:615-637, 2005.  M. Fazel, H. Hindi, and S. Boyd. A rank minimization heuristic with application to minimum order system approximation. Proc. American Control Conference, Vol. 6, pages 4734- 4739, 2001.  R. Foygel, R. Salakhutdinov, O. Shamir, and N. Srebro. Learning with the weighted trace- norm under arbitrary sampling distributions. Advances in Neural Information Processing Systems, 24, pages 2133-2141, 2011.  Z. Harchaoui, M. Douze, M. Paulin, M. Dudik, J. Malick. Large-scale image classification with trace-norm regularization. IEEE Conference on Computer Vision & Pattern Recog- nition (CVPR), pages 3386-3393, 2012. Maurer Pontil  W. Hoeﬀding. Probability inequalities for sums of bounded random variables. Journal of  the American Statistical Association, 58:13-30, 1963.  S. M. Kakade, S. Shalev-Shwartz, A. Tewari. Regularization techniques for learning with  matrices. Journal of Machine Learning Research 13:1865-1890, 2012.  V. Koltchinskii and D. Panchenko. Empirical margin distributions and bounding the gen-  eralization error of combined classiers. Annals of Statistics, 30(1):1-50, 2002.  M. Ledoux, M. Talagrand. Probability in Banach Spaces:  Isoperimetry and Processes.  Springer, Berlin, 1991.  K. Lounici, M. Pontil, A.B. Tsybakov and S. van de Geer. Oracle inequalities and optimal  inference under group sparsity. Annals of Statistics, 39(4):2164-2204, 2011.  A. Maurer. Bounds for linear multi-task learning. Journal of Machine Learning Research,  7:117-139, 2006.  A. Maurer. The Rademacher complexity of linear transformation classes. Proc. 19th Annual  Conference on Learning Theory (COLT), pages 65-78, 2006.  A. Maurer and M. Pontil. A uniform lower error bound for half-space learning. Proc. 19th  International Conference on Algorithmic Learning Theory, pages 70-78, 2008.  S. Mendelson and A. Pajor. On singular values of matrices with independent rows. Bernoulli  12(5):761-773, 2006.  R.I. Oliveira. Sums of random Hermitian matrices and an inequality by Rudelson, Electronic  Communications in Probability, 15:203-212, 2010.  B. Recht. A simpler approach to matrix completion. Journal of Machine Learning Research,  12:3413-3430, 2009.  O. Shamir and S. Shalev-Shwartz. Collaborative filtering with the trace norm: Learning, bounding and transducing. Proc. 24th Annual Conference on Learning Theory (COLT), pages 661-678, 2011.  N. Srebro and A. Shraibman. Rank, trace-norm and max-norm. Proc. 18th Annual Confer-  ence on Learning Theory (COLT), pages 545-560, 2005.  S. Thrun and L. Pratt. Learning to Learn. Springer, 1998.  J. Tropp. User-friendly tail bounds for sums of random matrices. Foundations of Computa-  tional Mathematics, 12:389-434, 2012. Excess risk bounds for multitask learning"}