{"1": "Jayadev Acharya, Ashkan Jafarpour, Alon Orlitsky, and Ananda Theertha Suresh. Near-optimal-  sample estimators for spherical Gaussian mixtures. In NIPS, 2014.  Jayadev Acharya, Ilias Diakonikolas, Jerry Li, and Ludwig Schmidt. Sample-optimal density esti-  mation in nearly-linear time. 2017.  Dimitris Achlioptas and Frank McSherry. On spectral learning of mixtures of distributions. Learning Theory, volume 3559 of Lecture Notes in Computer Science, pages 458-469. 2005.  In  Joseph Anderson, Mikhail Belkin, Navin Goyal, Luis Rademacher, and James R. Voss. The more, the merrier: the blessing of dimensionality for learning large Gaussian mixtures. In COLT, 2014.  Sanjeev Arora and Ravi Kannan. Learning mixtures of arbitrary Gaussians. In STOC, 2001.  Sivaraman Balakrishnan, Martin J. Wainwright, and Bin Yu. Statistical guarantees for the EM  algorithm: From population to sample-based analysis. arXiv:1408.2156, 2014.  Mikhail Belkin and Kaushik Sinha. Polynomial learning of distribution families. In FOCS, 2010.  Jarle Berntsen, Terje O. Espelid, and Alan Genz. An adaptive algorithm for the approximate cal- culation of multiple integrals. ACM Transactions on Mathematical Software, 17(4):437-451, 1991.  Aditja Bhaskara, Ananda Theertha Suresh, and Morteza Zadimoghaddam. Sparse solutions to non-  negative linear systems and applications. In AISTATS, 2015.  Aditya Bhaskara, Moses Charikar, Ankur Moitra, and Aravindan Vijayaraghavan. Smoothed anal-  ysis of tensor decompositions. In STOC, 2014.  Christopher M. Bishop. Neural Networks for Pattern Recognition. Oxford University Press, Inc.,  S. Charles Brubaker. Robust PCA and clustering in noisy mixtures. In SODA, 2009.  S. Charles Brubaker and Santosh Vempala. Isotropic PCA and affine-invariant clustering. In FOCS,  1995.  2008.  Siu-On Chan, Ilias Diakonikolas, Rocco Servedio, and Xiaorui Sun. Learning mixtures of structured  distributions over discrete domains. In SODA, 2013.  78   LI SCHMIDT  to approximate the original 2-GMM better than this perturbation, i.e., the algorithm succceeds in “denoising” the perturbed distribution.  We thank Jayadev Acharya, Ilias Diakonikolas, Piotr Indyk, Gautam Kamath, Ankur Moitra, Cameron Musco, Christopher Musco, Ilya Razenshteyn, Rocco Servedio, Ananda Theertha Suresh, and San- tosh Vempala for helpful discussions.  Acknowledgments  References  Jayadev Acharya, Ashkan Jafarpour, Alon Orlitsky, and Ananda Theertha Suresh. Near-optimal-  sample estimators for spherical Gaussian mixtures. In NIPS, 2014.  Jayadev Acharya, Ilias Diakonikolas, Jerry Li, and Ludwig Schmidt. Sample-optimal density esti-  mation in nearly-linear time. 2017.  Dimitris Achlioptas and Frank McSherry. On spectral learning of mixtures of distributions. Learning Theory, volume 3559 of Lecture Notes in Computer Science, pages 458-469. 2005.  In  Joseph Anderson, Mikhail Belkin, Navin Goyal, Luis Rademacher, and James R. Voss. The more, the merrier: the blessing of dimensionality for learning large Gaussian mixtures. In COLT, 2014.  Sanjeev Arora and Ravi Kannan. Learning mixtures of arbitrary Gaussians. In STOC, 2001.  Sivaraman Balakrishnan, Martin J. Wainwright, and Bin Yu. Statistical guarantees for the EM  algorithm: From population to sample-based analysis. arXiv:1408.2156, 2014.  Mikhail Belkin and Kaushik Sinha. Polynomial learning of distribution families. In FOCS, 2010.  Jarle Berntsen, Terje O. Espelid, and Alan Genz. An adaptive algorithm for the approximate cal- culation of multiple integrals. ACM Transactions on Mathematical Software, 17(4):437-451, 1991.  Aditja Bhaskara, Ananda Theertha Suresh, and Morteza Zadimoghaddam. Sparse solutions to non-  negative linear systems and applications. In AISTATS, 2015.  Aditya Bhaskara, Moses Charikar, Ankur Moitra, and Aravindan Vijayaraghavan. Smoothed anal-  ysis of tensor decompositions. In STOC, 2014.  Christopher M. Bishop. Neural Networks for Pattern Recognition. Oxford University Press, Inc.,  S. Charles Brubaker. Robust PCA and clustering in noisy mixtures. In SODA, 2009.  S. Charles Brubaker and Santosh Vempala. Isotropic PCA and affine-invariant clustering. In FOCS,  1995.  2008.  Siu-On Chan, Ilias Diakonikolas, Rocco Servedio, and Xiaorui Sun. Learning mixtures of structured  distributions over discrete domains. In SODA, 2013. ROBUST AND PROPER LEARNING FOR MIXTURES OF GAUSSIANSVIA SYSTEMS OF POLYNOMIAL INEQUALITIES  Siu-On Chan, Ilias Diakonikolas, Rocco Servedio, and Xiaorui Sun. Efficient density estimation via  piecewise polynomial approximation. In STOC, 2014.  Thomas M. Cover and Joy A. Thomas. Elements of Information Theory (Wiley Series in Telecom-  munications and Signal Processing). Wiley-Interscience, 2006. ISBN 0471241954.  Daniel Dadush. A deterministic polynomial space construction for eps-nets under any norm. CoRR,  abs/1311.6671, 2013.  Sanjoy Dasgupta. Learning mixtures of Gaussians. In FOCS, 1999.  Sanjoy Dasgupta and Leonard J. Schulman. A probabilistic analysis of em for mixtures of separated,  spherical gaussians. Journal of Machine Learning Research, 8:203-226, 2007.  Constantinos Daskalakis and Gautam Kamath. Faster and sample near-optimal algorithms for  proper learning mixtures of gaussians. In COLT, 2014.  Constantinos Daskalakis, Christos Tzamos, and Manolis Zampetakis. Ten steps of em suffice for mixtures of two gaussians. In NIPS 2016 Workshop on Non-Convex Optimization for Machine Learning, 2016. URL https://arxiv.org/abs/1609.00368.  Luc Devroye and Gabor Lugosi. Combinatorial methods in density estimation. Springer Series in  Statistics, Springer, 2001.  Ilias Diakonikolas. Learning structured distributions. In Peter Bühlmann, Petros Drineas, Michael J. Kane, and Mark Van Der Laan, editors, Handbook of Big Data. Chapman and Hall/CRC, 2016.  Ilias Diakonikolas, Gautam Kamath, Daniel Kane, Jerry Li, Ankur Moitra, and Alistair Stewart. Robust estimators in high dimensions without the computational intractability. In FOCS, 2016a.  Ilias Diakonikolas, Daniel M. Kane, and Alistair Stewart. Properly learning poisson binomial dis-  tributions in almost polynomial time. In COLT, 2016b.  Ilias Diakonikolas, Daniel M Kane, and Alistair Stewart.  Statistical query lower bounds for robust estimation of high-dimensional gaussians and gaussian mixtures. arXiv preprint arXiv:1611.03473, 2016c.  Ilias Diakonikolas, Daniel M. Kane, and Alistair Stewart. Learning multivariate log-concave distri- butions. CoRR, abs/1605.08188, 2016d. URL http://arxiv.org/abs/1605.08188.  Jon Feldman, Rocco A. Servedio, and Ryan O’Donnell. PAC learning axis-aligned mixtures of  Gaussians with no separation assumption. In COLT, 2006.  Jon Feldman, Ryan O’Donnell, and Rocco A. Servedio. Learning mixtures of product distributions  over discrete domains. SIAM Journal on Computing, 37(5):1536-1564, 2008.  Yoav Freund and Yishay Mansour. Estimating a mixture of two product distributions. In COLT,  Rong Ge, Qingqing Huang, and Sham M. Kakade. Learning mixtures of gaussians in high dimen-  1999.  sions. In STOC, 2015. LI SCHMIDT  W. Morven Gentleman. Implementing clenshaw-curtis quadrature, i methodology and experience.  Communications of the ACM, 15(5):337-342, 1972.  Alan C. Genz and Arham A. Malik. Remarks on algorithm 006: An adaptive algorithm for numeri- cal integration over an n-dimensional rectangular region. Journal of Computational and Applied Mathematics, 6(4):295 - 302, 1980.  Moritz Hardt and Eric Price. Tight bounds for learning a mixture of two Gaussians. In STOC, 2015.  Daniel Hsu and Sham M. Kakade. Learning mixtures of spherical Gaussians: Moment methods and  spectral decompositions. In ITCS, 2013.  Arian Maleki Ji Xu, Daniel Hsu. Global analysis of expectation maximization for mixtures of two  gaussians. In NIPS, 2016.  Chi Jin, Yuchen Zhang, Sivaraman Balakrishnan, Martin J. Wainwright, and Michael I. Jordan. Local maxima in the likelihood of gaussian mixture models: Structural results and algorithmic consequences. In NIPS, 2016.  Adam Tauman Kalai, Ankur Moitra, and Gregory Valiant. Efficiently learning mixtures of two  Gaussians. In STOC, 2010.  Ravindran Kannan, Hadi Salmasian, and Santosh Vempala. The spectral method for general mixture  models. SIAM Journal on Computing, 38(3):1141-1156, 2008.  Michael J. Kearns, Robert E. Schapire, and Linda M. Sellie. Toward efficient agnostic learning.  Machine Learning, 17(2-3):115-141, 1994.  Arlene K. H. Kim and Richard J. Samworth. Global rates of convergence in log-concave density  estimation. Annals of Statistics, 44(6):2756-2779, 12 2016.  Sergey Levine, Chelsea Finn, Trevor Darrell, and Pieter Abbeel. End-to-end training of deep visuo-  motor policies. Journal of Machine Learning Research, 17(1):1334-1373, 2016.  Ankur Moitra. Algorithmic aspects of machine learning. http://people.csail.mit.edu/  moitra/docs/bookex.pdf, 2014.  Ankur Moitra and Gregory Valiant. Settling the polynomial learnability of mixtures of Gaussians.  In FOCS, 2010.  Cameron Musco and Christopher Musco. Stronger and faster approximate singular value decompo-  sition via the block lanczos method. In NIPS, 2015.  Karl Pearson. Contributions to the mathematical theory of evolution. Philosophical Transactions of the Royal Society of London A: Mathematical, Physical and Engineering Sciences, 185:71-110, 1894.  James Renegar. On the computational complexity and geometry of the first-order theory of the reals. Part i: Introduction. Preliminaries. The geometry of semi-algebraic sets. the decision problem for the existential theory of the reals. Journal of Symbolic Computation, 13(3):255 - 299, 1992a. ROBUST AND PROPER LEARNING FOR MIXTURES OF GAUSSIANSVIA SYSTEMS OF POLYNOMIAL INEQUALITIES  James Renegar. On the computational complexity of approximating solutions for real algebraic  formulae. SIAM Journal on Computing, 21(6):1008-1025, 1992b.  Aleksandr F. Timan. Theory of Approximation of Functions of a Real Variable. Pergamon, New  York, 1963.  Timo Tossavainen. On the zeros of finite sums of exponential functions. Australian Mathematical  Society Gazette, 33(1):47 - 50, 2006.  Alexandre B. Tsybakov. Introduction to Nonparametric Estimation. Springer Publishing Company,  Incorporated, 1st edition, 2008. ISBN 0387790519, 9780387790510.  Santosh Vempala and Grant Wang. A spectral algorithm for learning mixture models. Journal of  Computer and System Sciences, 68(4):841-860, 2004.  Roman Vershynin. Introduction to the non-asymptotic analysis of random matrices. arXiv preprint  arXiv:1011.3027, 2010."}