{"1": "Sanjeev Arora, Rong Ge, Tengyu Ma, and Ankur Moitra. Simple, efficient, and neural algorithms for sparse coding. In Conference on Learning Theory (COLT), pages 113-149, Paris, France, July 2015.  Sohail Bahmani and Justin Romberg. Phase retrieval meets statistical learning theory: A ﬂexible convex relaxation. In Proc. of the 20th International Conference on Artificial Intelligence and Statistics (AISTATS), pages 252-260, Fort Lauderdale, FL, June 2017.  2. Here optimality is understood with respect to the weak recovery threshold.  4   FUNDAMENTAL LIMITS OF WEAK RECOVERY WITH APPLICATIONS TO PHASE RETRIEVAL  The lower bound is proved by estimating the conditional entropy via the second moment method. The spectral algorithm computes the eigenvector corresponding to the largest eigenvalue of a  matrix of the form:  Dn =  T (yi)aia∗ i ,  1 n  n (cid:88)  i=1  (9)  (10)  where T : R → R is a pre-processing function. For δ large enough (and a suitable choice of T ), we expect the resulting eigenvector ˆx(y) to be positively correlated with the true signal x. The recent paper (Lu and Li, 2017) computed exactly the threshold value δu, under the assumption that the measurement vectors are real Gaussian, and T is non-negative.  Here, we generalize the result of (Lu and Li, 2017) by removing the assumption that T (y) ≥ 0 and by considering the complex case. Armed with this result, we compute the optimal2 pre- processing function T ∗ δ (y) for the general model (1). Our upper bound δu is the phase transition In the case of phase retrieval (as σ → 0), this pre- location for this optimal spectral method. processing function is given by  T ∗ δ (y) =  y − 1 √  ,  y +  δ − 1  and achieves weak recovery for any δ > δu = 1. In the limit δ ↓ 1, this converges to the limiting function T ∗(y) = 1 − (1/y).  While the expression (10) is remarkably simple, it is somewhat counter-intuitive. Earlier meth- ods (Candès et al., 2015c; Chen and Candès, 2015; Lu and Li, 2017) use T (y) ≥ 0 and try to extract information from the large values of yi. The function (10) has a large negative part for small y, in particular when δ is close to 1. Furthermore, it extracts useful information from data points with yi small. One possible interpretation is that the points in which the measurement vector is basically orthogonal to the unknown signal are not informative, hence we penalize them.  Our analysis applies to Gaussian measurement matrices. However, the proposed spectral method  works well also on real images and realistic measurement matrices.  We also compare our spectral approach to message passing algorithms. In particular, we prove that, for δ < δu (i.e. in the regime in which the spectral approach fails), message passing converges to an un-informative fixed point, even if initialized in a state that is correlated with the true signal x. Vice versa, for δ > δu (i.e. in the regime in which the spectral approach achieves weak recovery), we consider a linearized message passing algorithm, and prove that the un-informative fixed point is unstable.  References  Sanjeev Arora, Rong Ge, Tengyu Ma, and Ankur Moitra. Simple, efficient, and neural algorithms for sparse coding. In Conference on Learning Theory (COLT), pages 113-149, Paris, France, July 2015.  Sohail Bahmani and Justin Romberg. Phase retrieval meets statistical learning theory: A ﬂexible convex relaxation. In Proc. of the 20th International Conference on Artificial Intelligence and Statistics (AISTATS), pages 252-260, Fort Lauderdale, FL, June 2017.  2. Here optimality is understood with respect to the weak recovery threshold. FUNDAMENTAL LIMITS OF WEAK RECOVERY WITH APPLICATIONS TO PHASE RETRIEVAL  Radu Balan, Pete Casazza, and Dan Edidin. On signal reconstruction without phase. Applied and  Computational Harmonic Analysis, 20(3):345-356, 2006.  Afonso S. Bandeira, Jameson Cahill, Dustin G. Mixon, and Aaron A. Nelson. Saving phase: In- jectivity and stability for phase retrieval. Applied and Computational Harmonic Analysis, 37(1): 106-125, 2014.  T. Tony Cai, Xiaodong Li, and Zongming Ma. Optimal rates of convergence for noisy sparse phase  retrieval via thresholded Wirtinger ﬂow. The Annals of Statistics, 44(5):2221-2251, 2016.  Emmanuel J. Candès, Thomas Strohmer, and Vladislav Voroninski. Phaselift: Exact and stable signal recovery from magnitude measurements via convex programming. Communications on Pure and Applied Mathematics, 66(8):1241-1274, 2013.  Emmanuel J. Candès, Yonina C. Eldar, Thomas Strohmer, and Vladislav Voroninski. Phase retrieval  via matrix completion. SIAM Review, 57(2):225-251, 2015a.  Emmanuel J. Candès, Xiaodong Li, and Mahdi Soltanolkotabi. Phase retrieval from coded diffrac-  tion patterns. Applied and Computational Harmonic Analysis, 39(2):277-299, 2015b.  Emmanuel J. Candès, Xiaodong Li, and Mahdi Soltanolkotabi. Phase retrieval via Wirtinger ﬂow:  Theory and algorithms. IEEE Trans. Inform. Theory, 61(4):1985-2007, 2015c.  Yuxin Chen and Emmanuel J. Candès. Solving random quadratic systems of equations is nearly as easy as solving linear systems. In Advances in Neural Information Processing Systems, pages 739-747, 2015.  Yuxin Chen and Emmanuel J. Candès. The projected power method: An efficient algorithm for  joint alignment from pairwise differences. arXiv:1609.05820, 2016.  Yuxin Chen and Emmanuel J. Candès. Solving random quadratic systems of equations is nearly as easy as solving linear systems. Communications on Pure and Applied Mathematics, 70:0822- 0883, 2017.  Aldo Conca, Dan Edidin, Milena Hering, and Cynthia Vinzant. An algebraic characterization of injectivity in phase retrieval. Applied and Computational Harmonic Analysis, 38(2):346-356, 2015.  John C. Duchi and Feng Ruan. Solving (most) of a set of quadratic equalities: Composite optimiza-  tion for robust phase retrieval. arXiv:1705.02356, 2017.  J. R. Fienup. Phase retrieval algorithms: A comparison. Applied Optics, 21(15):2758-2769, Apr.  1982.  Ralph W. Gerchberg. A practical algorithm for the determination of the phase from image and  diffraction plane pictures. Optik, 35:237-246, 1972.  Tom Goldstein and Christoph Studer.  Phasemax: Convex phase retrieval via basis pursuit.  arXiv:1610.07531, 2016. FUNDAMENTAL LIMITS OF WEAK RECOVERY WITH APPLICATIONS TO PHASE RETRIEVAL  Prateek Jain, Praneeth Netrapalli, and Sujay Sanghavi. Low-rank matrix completion using alternat- ing minimization. In Proc. of the 45th Ann. ACM Symp. on Theory of Computing (STOC), pages 665-674, Palo Alto, CA, June 2013. ACM.  Raghunandan H. Keshavan, Andrea Montanari, and Sewoong Oh. Matrix completion from a few  entries. IEEE Trans. Inform. Theory, 56(6):2980-2998, 2010.  Kiryung Lee, Yanjun Li, Marius Junge, and Yoram Bresler. Blind recovery of sparse signals from  subsampled convolution. IEEE Trans. Inform. Theory, 63(2):802-821, 2017.  Gen Li, Yuantao Gu, and Yue M. Lu. Phase retrieval using iterative projections: Dynamics in the large systems limit. In Proc. of the 53rd Annual Allerton Conf. on Commun., Control, and Computing (Allerton), pages 1114-1118, Monticello, IL, Oct. 2015.  Xiaodong Li, Shuyang Ling, Thomas Strohmer, and Ke Wei. Rapid, robust, and reliable blind  deconvolution via nonconvex optimization. arXiv:1606.04933, 2016.  Yue M. Lu and Gen Li. Phase transitions of spectral initialization for high-dimensional nonconvex  estimation. arXiv:1702.06435, 2017.  Praneeth Netrapalli, Prateek Jain, and Sujay Sanghavi. Phase retrieval using alternating minimiza-  tion. In Advances in Neural Information Processing Systems, pages 2796-2804, 2013.  Philip Schniter and Sundeep Rangan. Compressive phase retrieval via generalized approximate  message passing. IEEE Transactions on Signal Processing, 63(4):1043-1055, 2015.  Mahdi Soltanolkotabi. Structured signal recovery from quadratic measurements: Breaking sample  complexity barriers via nonconvex optimization. arXiv:1702.06175, 2017.  Irène Waldspurger, Alexandre d’Aspremont, and Stéphane Mallat. Phase recovery, maxcut and  complex semidefinite programming. Mathematical Programming, 149(1-2):47-81, 2015.  Gang Wang and Georgios B. Giannakis. Solving random systems of quadratic equations via trun- cated generalized gradient ﬂow. In Advances in Neural Information Processing Systems, pages 568-576, 2016.  Gang Wang, Georgios B. Giannakis, and Yonina C. Eldar. Solving systems of random quadratic  equations via truncated amplitude ﬂow. arXiv:1605.08285, 2016.  Gang Wang, Georgios B. Giannakis, Yousef Saad, and Jie Chen. Solving almost all systems of  random quadratic equations. arXiv:1705.10407, 2017.  Ke Wei. Solving systems of phaseless equations via Kaczmarz methods: A proof of concept study.  Inverse Problems, 31(12), 2015.  Huishuai Zhang and Yingbin Liang. Reshaped Wirtinger Flow for solving quadratic system of equations. In Advances in Neural Information Processing Systems, pages 2622-2630, 2016."}