{"1": "Emmanuel Abbe. Community detection and the stochastic block model: recent developments. Journal of Machine Learning Research, to appear, 2017. URL http://www.princeton. edu/˜eabbe/publications/sbm_jmlr_4.pdf.  Dimitris Achlioptas and Frank McSherry. On spectral learning of mixtures of distributions.  In  International Conference on Computational Learning Theory, pages 458-469. Springer, 2005.  Daniel Aloise, Amit Deshpande, Pierre Hansen, and Preyas Popat. NP-hardness of euclidean sum-  of-squares clustering. Machine Learning, 75(2):245-248, 2009.  Brendan P. W. Ames and Stephen A. Vavasis. Convex optimization for the planted k-disjoint-clique  problem. Mathematical Programming, 143(1-2):299-337, 2014.  Arash A. Amini and Elizaveta Levina. On semidefinite relaxations for the block model. arXiv  preprint arXiv:1406.5647, 2014.  arXiv:1206.3204, 2012.  Pranjal Awasthi and Or Sheffet.  Improved spectral-norm bounds for clustering. arXiv preprint  Pranjal Awasthi and Aravindan Vijayaraghavan. Clustering semi-random mixtures of gaussians.  arXiv preprint arXiv:1711.08841, 2017.  Pranjal Awasthi, Afonso S. Bandeira, Moses Charikar, Ravishankar Krishnaswamy, Soledad Villar, and Rachel Ward. Relax, no need to round: Integrality of clustering formulations. In Proceedings of the 2015 Conference on Innovations in Theoretical Computer Science, pages 191-200. ACM, 2015.  Sivaraman Balakrishnan, Martin J. Wainwright, and Bin Yu. Statistical guarantees for the em algo- rithm: From population to sample-based analysis. The Annals of Statistics, 45(1):77-120, 2017.  Moses Charikar, Sudipto Guha, ´Eva Tardos, and David B. Shmoys. A constant-factor approximation In Proceedings of the 31st Annual ACM Symposium on  algorithm for the k-median problem. Theory of Computing, pages 1-10. ACM, 1999.  Yudong Chen, Sujay Sanghavi, and Huan Xu. Improved graph clustering. IEEE Transactions on  Information Theory, 60(10):6440-6455, 2014.  Sanjoy Dasgupta. Learning mixtures of gaussians. In 40th Annual Symposium on Foundations of  Computer Science, pages 634-644. IEEE, 1999.  Constantinos Daskalakis, Christos Tzamos, and Manolis Zampetakis. Ten steps of em suffice for  mixtures of two gaussians. arXiv preprint arXiv:1609.00368, 2016.  13   HIDDEN INTEGRALITY OF SDP RELAXATIONS FOR SUB-GAUSSIAN MIXTURE MODELS  Y. Fei and Y. Chen were partially supported by the National Science Foundation CRII award 1657420 and grant 1704828.  Acknowledgments  References  Emmanuel Abbe. Community detection and the stochastic block model: recent developments. Journal of Machine Learning Research, to appear, 2017. URL http://www.princeton. edu/˜eabbe/publications/sbm_jmlr_4.pdf.  Dimitris Achlioptas and Frank McSherry. On spectral learning of mixtures of distributions.  In  International Conference on Computational Learning Theory, pages 458-469. Springer, 2005.  Daniel Aloise, Amit Deshpande, Pierre Hansen, and Preyas Popat. NP-hardness of euclidean sum-  of-squares clustering. Machine Learning, 75(2):245-248, 2009.  Brendan P. W. Ames and Stephen A. Vavasis. Convex optimization for the planted k-disjoint-clique  problem. Mathematical Programming, 143(1-2):299-337, 2014.  Arash A. Amini and Elizaveta Levina. On semidefinite relaxations for the block model. arXiv  preprint arXiv:1406.5647, 2014.  arXiv:1206.3204, 2012.  Pranjal Awasthi and Or Sheffet.  Improved spectral-norm bounds for clustering. arXiv preprint  Pranjal Awasthi and Aravindan Vijayaraghavan. Clustering semi-random mixtures of gaussians.  arXiv preprint arXiv:1711.08841, 2017.  Pranjal Awasthi, Afonso S. Bandeira, Moses Charikar, Ravishankar Krishnaswamy, Soledad Villar, and Rachel Ward. Relax, no need to round: Integrality of clustering formulations. In Proceedings of the 2015 Conference on Innovations in Theoretical Computer Science, pages 191-200. ACM, 2015.  Sivaraman Balakrishnan, Martin J. Wainwright, and Bin Yu. Statistical guarantees for the em algo- rithm: From population to sample-based analysis. The Annals of Statistics, 45(1):77-120, 2017.  Moses Charikar, Sudipto Guha, ´Eva Tardos, and David B. Shmoys. A constant-factor approximation In Proceedings of the 31st Annual ACM Symposium on  algorithm for the k-median problem. Theory of Computing, pages 1-10. ACM, 1999.  Yudong Chen, Sujay Sanghavi, and Huan Xu. Improved graph clustering. IEEE Transactions on  Information Theory, 60(10):6440-6455, 2014.  Sanjoy Dasgupta. Learning mixtures of gaussians. In 40th Annual Symposium on Foundations of  Computer Science, pages 634-644. IEEE, 1999.  Constantinos Daskalakis, Christos Tzamos, and Manolis Zampetakis. Ten steps of em suffice for  mixtures of two gaussians. arXiv preprint arXiv:1609.00368, 2016. HIDDEN INTEGRALITY OF SDP RELAXATIONS FOR SUB-GAUSSIAN MIXTURE MODELS  Arthur P. Dempster, Nan M. Laird, and Donald B. Rubin. Maximum likelihood from incomplete data via the em algorithm. Journal of the Royal Statistical Society. Series B (Methodological), pages 1-38, 1977.  Yingjie Fei and Yudong Chen. Exponential error rates of SDP for block models: Beyond  Grothendieck’s inequality. arXiv preprint arXiv:1705.08391, 2017.  Olivier Gu´edon and Roman Vershynin. Community detection in sparse networks via Grothendieck’s  inequality. Probability Theory and Related Fields, 165(3-4):1025-1049, 2016.  Takayuki Iguchi, Dustin G. Mixon, Jesse Peterson, and Soledad Villar. Probably certifiably correct  k-means clustering. Mathematical Programming, 165(2):605-642, 2017.  Kamal Jain, Mohammad Mahdian, and Amin Saberi. A new greedy approach for facility location problems. In Proceedings of the Thiry-Fourth Annual ACM Symposium on Theory of Computing, pages 731-740. ACM, 2002.  Chi Jin, Yuchen Zhang, Sivaraman Balakrishnan, Martin J. Wainwright, and Michael I. Jordan. Local maxima in the likelihood of gaussian mixture models: Structural results and algorithmic consequences. In Advances in Neural Information Processing Systems, pages 4116-4124, 2016.  Tapas Kanungo, David M. Mount, Nathan S. Netanyahu, Christine D. Piatko, Ruth Silverman, and Angela Y. Wu. A local search approximation algorithm for k-means clustering. Computational Geometry, 28(2-3):89-112, 2004.  Jason M. Klusowski and W. D. Brinda. Statistical guarantees for estimating the centers of a two-  component gaussian mixture by em. arXiv preprint arXiv:1608.02280, 2016.  Michael Krivelevich and Dan Vilenchik. Semirandom models as benchmarks for coloring algo- rithms. In Third Workshop on Analytic Algorithmics and Combinatorics (ANALCO), pages 211- 221, 2006.  Amit Kumar and Ravindran Kannan. Clustering with spectral norm and the k-means algorithm. In Proceedings of the 2010 IEEE 51st Annual Symposium on Foundations of Computer Science, pages 299-308. IEEE Computer Society, 2010.  Shi Li and Ola Svensson. Approximating k-median via pseudo-approximation. SIAM Journal on  Computing, 45(2):530-547, 2016.  Xiaodong Li, Yang Li, Shuyang Ling, Thomas Strohmer, and Ke Wei. When do birds of a feather ﬂock together? K-means, proximity, and conic programming. arXiv preprint arXiv:1710.06008, 2017.  Stuart Lloyd. Least squares quantization in PCM. IEEE Transactions on Information Theory, 28  (2):129-137, 1982.  Yu Lu and Harrison H. Zhou. Statistical and computational guarantees of Lloyd’s algorithm and its  variants. arXiv preprint arXiv:1612.02099, 2016. HIDDEN INTEGRALITY OF SDP RELAXATIONS FOR SUB-GAUSSIAN MIXTURE MODELS  Meena Mahajan, Prajakta Nimbhorkar, and Kasturi Varadarajan. The planar k-means problem is NP-hard. In International Workshop on Algorithms and Computation, pages 274-285. Springer, 2009.  Konstantin Makarychev, Yury Makarychev, and Aravindan Vijayaraghavan. Learning communities In 29th Annual Conference on Learning Theory, pages 1258-1291,  in the presence of errors. 2016.  Dustin G. Mixon, Soledad Villar, and Rachel Ward. Clustering subgaussian mixtures by semidefi-  nite programming. Information and Inference: A Journal of the IMA, page iax001, 2017.  Andrea Montanari and Subhabrata Sen. Semidefinite programs on sparse random graphs and their application to community detection. In Proceedings of the 48th Annual ACM SIGACT Symposium on Theory of Computing (STOC), pages 814-827, Cambridge, MA, USA, June 2016. doi: 10. 1145/2897518.2897548. URL http://doi.acm.org/10.1145/2897518.2897548.  Abhinav Nellore and Rachel Ward. Recovery guarantees for exemplar-based clustering. Information  and Computation, 245:165-180, 2015.  Samet Oymak and Babak Hassibi. Finding dense clusters via ”low rank+ sparse” decomposition.  arXiv preprint arXiv:1104.5186, 2011.  Karl Pearson. Method of moments and method of maximum likelihood. Biometrika, 28(1/2):34-59,  1936.  Jiming Peng and Yu Wei. Approximating k-means-type clustering via semidefinite programming.  SIAM Journal on Optimization, 18(1):186-205, 2007.  Jiming Peng and Yu Xia. A new theoretical framework for k-means-type clustering. In Foundations  and Advances in Data Mining, pages 79-96. Springer, 2005.  Santosh Vempala and Grant Wang. A spectral algorithm for learning mixture models. Journal of  Computer and System Sciences, 68(4):841-860, 2004.  Roman Vershynin. High-dimensional probability. 2017.  Ji Xu, Daniel J. Hsu, and Arian Maleki. Global analysis of expectation maximization for mixtures In Advances in Neural Information Processing Systems, pages 2676-2684,  of two gaussians. 2016.  Bowei Yan, Mingzhang Yin, and Purnamrita Sarkar. Convergence analysis of gradient EM for  multi-component gaussian mixture. arXiv preprint arXiv:1705.08530, 2017."}