{"1": "Tugkan Batu, Lance Fortnow, Ronitt Rubinfeld, Warren D. Smith, and Patrick White. Test- ing that distributions are close. In 41st Annual Symposium on Foundations of Computer Science, FOCS 2000, 12-14 November 2000, Redondo Beach, California, USA, pages 259-269, 2000. doi: 10.1109/SFCS.2000.892113. URL http://dx.doi.org/10.1109/ SFCS.2000.892113.  Avrim Blum. Relevant examples and relevant features: Thoughts from computational  learning theory. In AAAI Fall Symposium on ‘Relevance’, volume 5, 1994.  17   Learning and Testing Junta Distributions  (cid:96) is not in J, x(J) = y(J). Thus, y is also in Xi. On the other hand, the parity of the first k bits of x and y is not the same, because (cid:96) ∈ [k]. Thus, one of them has probability zero. Note that we can pair up all the elements in Xi as we did for to x and y. Therefore, at least half of the elements in Xi have probability zero. By definition, we know ai = (cid:80) D(cid:48)(x) for i = 0, 1, . . . , 2k − 1 and D(cid:48)(x) = ai/2k2 for x ∈ Xi. We can conclude that D(cid:48) is 1/4-far from D, since  x∈Xi  dTV(D, D(cid:48)) =  |D(x) − D(cid:48)(x)| =  |D(x) − D(cid:48)(x)|  (cid:88)  x  1 2  1 2  =  2k−1 (cid:88)  (cid:88)  i=0  x∈Xi  1 2  2k−1 (cid:88)  (cid:88)  i=0  x∈Xi  2k−1 (cid:88)  1 2  |D(x) − ai/2k2| ≥  (cid:88)  ai/2k2 ≥  i=0  x∈Xi:D(x)=0  2k−1 (cid:88)  i=0  ai 4  ≥  1 4  where the first inequality follows from the fact that at least 2k2−1 elements in Xi have probability zero. Since D(cid:48) is an arbitrary k-junta distribution on an arbitrary set J (cid:54)= [k], it follows that D is 1/4-far from being a junta distribution on any J (cid:54)= [k].  As we mentioned earlier, this implies that D is a k-junta distribution iﬀ C is a collection of uniform distributions. It is not hard to see that we can convert a sample drawn from C to get a sample from D. Thus, any (cid:15)-tester for a k-junta distribution can be used as an (cid:15)-tester for a collection of uniform distributions. Diakonikolas and Kane (2016) (in section M N /(cid:15)2) = Ω(2(k1+k2)/2) samples are required to distinguish a 3.1.1) have shown that Ω( collection of M uniform distributions from a collection which is (cid:15)-far from being uniform with probability 2/3. This implies that we need Ω(2n/2/(cid:15)2) samples to test k-junta distri- butions.  √  5. Acknowledgements  This material is based upon work supported by the National Science Foundation Gradu- ate Research Fellowship under Grant No. CCF-1420692 and CCF-1065125. Any opinion, findings, and conclusions or recommendations expressed in this material are those of the authors(s) and do not necessarily reﬂect the views of the National Science Foundation. We thank anonymous reviewers for their insightful comments on the preliminary version of this paper.  References  Tugkan Batu, Lance Fortnow, Ronitt Rubinfeld, Warren D. Smith, and Patrick White. Test- ing that distributions are close. In 41st Annual Symposium on Foundations of Computer Science, FOCS 2000, 12-14 November 2000, Redondo Beach, California, USA, pages 259-269, 2000. doi: 10.1109/SFCS.2000.892113. URL http://dx.doi.org/10.1109/ SFCS.2000.892113.  Avrim Blum. Relevant examples and relevant features: Thoughts from computational  learning theory. In AAAI Fall Symposium on ‘Relevance’, volume 5, 1994. Aliakbarpour Blais Rubinfeld  Avrim Blum and Pat Langley. Selection of relevant features and examples in machine  learning. Artificial Intelligence, 97(1-2):245-271, December 1997.  Cl´ement L Canonne, Dana Ron, and Rocco A Servedio. Testing probability distributions  using conditional samples. SIAM Journal on Computing, 44(3):540-616, 2015.  Sourav Chakraborty, Eldar Fischer, Yonatan Goldhirsh, and Arie Matsliah. On the power of conditional samples in distribution testing. In Proceedings of the 4th Conference on Innovations in Theoretical Computer Science, ITCS ’13, pages 561-580, New York, NY, USA, 2013. ACM. ISBN 978-1-4503-1859-4. doi: 10.1145/2422436.2422497. URL http: //doi.acm.org/10.1145/2422436.2422497.  Girish Chandrashekar and Ferat Sahin. A survey on feature selection methods. Computers  & Electrical Engineering, 40(1):16 - 28, 2014.  Constantinos Daskalakis, Ilias Diakonikolas, and Rocco A. Servedio. Learning k-modal distributions via testing. Theory of Computing, 10(20):535-570, 2014. doi: 10.4086/toc. 2014.v010a020. URL http://www.theoryofcomputing.org/articles/v010a020.  Luc Devroye and G´abor Lugosi. Combinatorial methods in density estimation. Springer,  2001.  Ilias Diakonikolas. Learning structured distributions. In CRC Handbook of Big Data. 2016.  Ilias Diakonikolas and Daniel M. Kane. A new approach for testing properties of discrete distributions. CoRR, abs/1601.05557, 2016. URL http://arxiv.org/abs/1601.05557.  Isabelle Guyon and Andr´e Elisseeﬀ. An introduction to variable and feature selection.  Journal of Machine Learning Research, 3:1157-1182, 2003.  Adam Tauman Kalai, Adam R. Klivans, Yishay Mansour, and Rocco A. Servedio. Agnos-  tically learning halfspaces. SIAM J. Comput., 37(6):1777-1805, 2008.  Michael J. Kearns, Yishay Mansour, Dana Ron, Ronitt Rubinfeld, Robert E. Schapire, and Linda Sellie. On the learnability of discrete distributions. In Proceedings of the Twenty- Sixth Annual ACM Symposium on Theory of Computing, 23-25 May 1994, Montr´eal, Qu´ebec, Canada, pages 273-282, 1994. doi: 10.1145/195058.195155. URL http://doi. acm.org/10.1145/195058.195155.  Reut Levi, Dana Ron, and Ronitt Rubinfeld. Testing properties of collections of distribu-  tions. Theory of Computing, 9(8):295-347, 2013.  Nathan Linial, Yishay Mansour, and Noam Nisan. Constant depth circuits, Fourier trans-  form, and learnability. Journal of the ACM (JACM, 40(3):607-620, July 1993.  Huan Liu and Hiroshi Motoda. Feature selection for knowledge discovery and data mining,  volume 454. Springer Science & Business Media, 2012.  Michael Mitzenmacher and Eli Upfal. Probability and Computing: Randomized Algorithms and Probabilistic Analysis. Cambridge University Press, New York, NY, USA, 2005. ISBN 0521835402. Learning and Testing Junta Distributions  Elchanan Mossel, Ryan O’Donnell, and Rocco A Servedio. Learning functions of k relevant variables. Journal of Computer and System Sciences, 69(3):421-434, November 2004.  Ryan O’Donnell. Analysis of Boolean functions. Cambridge University Press, October 2014.  Liam Paninski. A coincidence-based test for uniformity given very sparsely sampled discrete data. IEEE Trans. Inf. Theor., 54(10):4750-4755, October 2008. ISSN 0018-9448. doi: 10.1109/TIT.2008.928987. URL http://dx.doi.org/10.1109/TIT.2008.928987.  Gregory Valiant. Finding correlations in subquadratic time, with applications to learning  parities and juntas. FOCS, pages 11-20, 2012. Aliakbarpour Blais Rubinfeld"}