{"1": "Jean-Pierre Aubin and H´el`ene Frankowska. Set-Valued Analysis. Birkh¨auser, 1990.  Abdessamad Barbara and Jean-Pierre Crouzeix. Concave gauge functions and applications. ZOR -  Mathematical Methods of Operations Research, 40:43-74, 1994.  Andreas Buja, Werner Stuetzle, and Yi Shen. Loss functions for binary class probability estima- tion and classification: Structure and applications. Technical report, University of Pennsylvania, November 2005.  Alain Chateauneuf. Decomposable capacities, distorted probabilities and concave capacities. Math-  ematical Social Sciences, 31:19-37, 1996.  Charles W. Cobb and Paul H. Douglas. A theory of production. The American Economic Review,  18(1):139-165, March 1928.  Richard Cornes. Duality and Modern Economics. Cambridge University Press, 1992.  A. Philip Dawid. The geometry of proper scoring rules. Annals of the Institute of Statistical Math-  ematics, 59(1):77-93, March 2007.  A. Philip Dawid and Steffen L. Lauritzen. The geometry of decision theory. In Proceedings of the 2nd International Symposium on Information Geometry and its Applications, pages 22-28, 2006.  Michael P. Drazin. Pseudo-inverses in associative rings and semigroups. The American Mathemat-  ical Monthly, 65(7):506-514, August 1958.  Rolf F¨are and Daniel Primont. The unification of Ronald W. Shephard’s duality theory. Journal of  Economics (Zeitschrift f¨ur National¨okonomie), 60(2):199-207, 1994.  Rolf F¨are and Daniel Primont. Multi-output Production and Duality: Theory and Applications.  Kluwer Academic Publishers, 1995.  Edward Furman and Riˇcardas Zitikis. Weighted pricing functionals with applications to insurance:  An overview. North American Actuarial Journal, 13(4):483-496, 2009.  Dario Garcia-Garcia and Robert C. Williamson. Divergences and Risks for Multiclass Experiments.  In Conference on Learning Theory (JMLR: W&CP), volume 23, pages 28.1-28.20, 2012.  Tilmann Gneiting. Making and evaluating point forecasts. Journal of the American Statistical  Association, 106(494):746-762, 2011.  Tilmann Gneiting and Matthias Katzfuss. Probabilistic forecasting. Annual Review of Statistics and  its Applications, 1:125-151, 2014.  Tilmann Gneiting and Adrian E. Raftery. Strictly proper scoring rules, prediction, and estimation.  Journal of the American Statistical Association, 102(477):359-378, March 2007.  David J. Hand. Deconstructing Statistical Questions. Journal of the Royal Statistical Society. Series  A (Statistics in Society), 157(3):317-356, 1994.  14   WILLIAMSON  References  Jean-Pierre Aubin and H´el`ene Frankowska. Set-Valued Analysis. Birkh¨auser, 1990.  Abdessamad Barbara and Jean-Pierre Crouzeix. Concave gauge functions and applications. ZOR -  Mathematical Methods of Operations Research, 40:43-74, 1994.  Andreas Buja, Werner Stuetzle, and Yi Shen. Loss functions for binary class probability estima- tion and classification: Structure and applications. Technical report, University of Pennsylvania, November 2005.  Alain Chateauneuf. Decomposable capacities, distorted probabilities and concave capacities. Math-  ematical Social Sciences, 31:19-37, 1996.  Charles W. Cobb and Paul H. Douglas. A theory of production. The American Economic Review,  18(1):139-165, March 1928.  Richard Cornes. Duality and Modern Economics. Cambridge University Press, 1992.  A. Philip Dawid. The geometry of proper scoring rules. Annals of the Institute of Statistical Math-  ematics, 59(1):77-93, March 2007.  A. Philip Dawid and Steffen L. Lauritzen. The geometry of decision theory. In Proceedings of the 2nd International Symposium on Information Geometry and its Applications, pages 22-28, 2006.  Michael P. Drazin. Pseudo-inverses in associative rings and semigroups. The American Mathemat-  ical Monthly, 65(7):506-514, August 1958.  Rolf F¨are and Daniel Primont. The unification of Ronald W. Shephard’s duality theory. Journal of  Economics (Zeitschrift f¨ur National¨okonomie), 60(2):199-207, 1994.  Rolf F¨are and Daniel Primont. Multi-output Production and Duality: Theory and Applications.  Kluwer Academic Publishers, 1995.  Edward Furman and Riˇcardas Zitikis. Weighted pricing functionals with applications to insurance:  An overview. North American Actuarial Journal, 13(4):483-496, 2009.  Dario Garcia-Garcia and Robert C. Williamson. Divergences and Risks for Multiclass Experiments.  In Conference on Learning Theory (JMLR: W&CP), volume 23, pages 28.1-28.20, 2012.  Tilmann Gneiting. Making and evaluating point forecasts. Journal of the American Statistical  Association, 106(494):746-762, 2011.  Tilmann Gneiting and Matthias Katzfuss. Probabilistic forecasting. Annual Review of Statistics and  its Applications, 1:125-151, 2014.  Tilmann Gneiting and Adrian E. Raftery. Strictly proper scoring rules, prediction, and estimation.  Journal of the American Statistical Association, 102(477):359-378, March 2007.  David J. Hand. Deconstructing Statistical Questions. Journal of the Royal Statistical Society. Series  A (Statistics in Society), 157(3):317-356, 1994. THE GEOMETRY OF LOSSES  Berlin, 2001.  1965.  1972.  David J. Hand and Veronica Vinciotti. Local Versus Global Models for Classification Problems:  Fitting Models Where it Matters. The American Statistician, 57(2):124-131, 2003.  Giora Hanoch. Symmetric duality and polar production functions. In Melvyn Fuss and Daniel Mc- Fadden, editors, Production Economics: A Dual Approach to Theory and Applications, volume 1, pages 111-132. North-Holland, 1978.  Georg Hasenkamp and J¨urgen Schrader. Dual polar price and quantity aggregation. Zeitschrift f¨ur  National¨okonomie, 38(3-4):305-322, 1978.  Matthias Hein and Olivier Bousquet. Hilbertian metrics and positive definite kernels on probability measures. Technical Report 126, Max-Planck-Institut f¨ur biologische Kybernetik, July 2004.  Arlo D. Hendrickson and Robert J. Buehler. Proper scores for probability forecasters. The Annals  of Mathematical Statisitics, 42(6):1916-1921, 1971.  Jean-Baptiste Hiriart-Urruty and Claude Lemar´echal. Fundamentals of Convex Analysis. Springer,  Hendrik S. Houthhakker. A note on self-dual preferences. Econometrica, 33(4):797-801, October  Patrick Hummel and R. Preston McAfee. Loss functions for predicted click-through rates in auctions  for online advertising. Preprint, Google Inc., October 2013.  Stephen E. Jacobsen. On Shephard’s duality theorem. Journal of Economic Theory, 4:458-464,  John McCarthy. Measures of the value of information. Proceedings of the National Academy of  Sciences, 42:654-655, 1956.  Daniel McFadden. Cost, revenue, and profit functions.  In Melvyn Fuss and Daniel McFadden, editors, Production Economics: A Dual Approach to Theory and Applications, volume 1, pages 1-110. North-Holland, 1978.  Edgar C. Merkle and Mark Steyvers. Choosing a strictly proper scoring rule. Preprint, Department  of Psychological Sciences, University of Missouri, Columbia, Missouri, June 2013.  Walter Meyer and David C. Kay. A convexity structure admits but one real linearization of dimen- sion greater than one. Journal of the London Mathematical Society, 7:124-130, 1973. Series 2.  Allan H. Murphy and Carl-Axel S. Sta¨el von Holstein. A geometrical framework for the ranked  probability score. Monthly Weather Review, 103(1):16-20, 1975.  Jean-Paul Penot. The bearing of duality on microeconomics. In Advances in Mathematical Eco-  nomics, pages 113-139. Springer, 2005.  Jean-Paul Penot and Constantin Z˘alinescu. Harmonic sum and duality. Journal of Convex Analysis,  7(1):95-113, 2000. WILLIAMSON  Georg Ch. Pﬂug and Werner R¨omisch. Modeling, Measuring and Managing Risk. World Scientific,  2007.  Friedrich Pukelsheim. On information functions and their polars. Journal of Optimization Theory  and Applications, 41(4):533-546, 1983.  R. Mark Reesor and Don L. McLeish. Risk, entropy, and the transformation of distributions. Bank  of Canada Working Paper 2002-11, April 2002.  Mark D. Reid and Robert C. Williamson. Information, divergence and risk for binary experiments.  Journal of Machine Learning Research, 12:731-817, March 2011.  R. Tyrell Rockafellar. Convex Analysis. Princeton University Press, 1970.  R. Tyrrell Rockafellar. Monotone Processes of Convex and Concave Type, volume 77 of Memoirs  of the American Mathematical Society. 1967.  Michael Edward Ruberry. Prediction Markets: Theory and Applications. PhD thesis, School of  Engineering and Applied Sciences, Harvard University, November 2013.  Paul A. Samuelson. Using full duality to show that simultaneously additive direct and indirect utilities implies unitary price elasticity of demand. Econometrica, 33(4):781-796, October 1965.  Ryuzo Sato. Self-dual preferences. Econometrica, 44(5):1017-1032, September 1976.  Leonard J. Savage. Elicitation of personal probabilities and expectations. Journal of the American  Statistical Association, 66(336):783-801, 1971.  Rolf Schneider. Convex Bodies: The Brunn-Minkowski Theory. Cambridge University Press, 2014.  Second expanded edition.  Alberto Seeger. Direct and inverse addition in convex analysis and applications. Journal of Mathe-  matical Analysis and Applications, 148:317-349, 1990.  Alberto Seeger and Michel Volle. On a convolution operation obtained by adding level sets: classical  and new results. Recherche op´erationnelle/Operations Research, 29(2):131-154, 1995.  Ronald W. Shephard. Cost and Production Functions. Princeton University Press, 1953.  Maurice Sion. On general minimax theorems. Pacific Journal of Mathematics, 8:171-176, 1958.  Carl-Axel S. Sta¨el von Holstein. Assessment and evaluation of subjective probability distributions. PhD thesis, The Economic Research Institute, Stockholm School of Economics, September 1970.  Carl-Axel S. Sta¨el von Holstein and Allan H. Murphy. The family of quadratic scoring rules.  Monthly Weather Review, 106(7):917-924, July 1978.  Ingo Steinwart and Andreas Christmann. Support Vector Machines. Springer, New York, 2008.  Anthony C. Thompson. Minkowski Geometry. Cambridge University Press, 1996.  Hal R. Varian. Microeconomic Analysis. W.W. Norton and Company, 1978. THE GEOMETRY OF LOSSES  Elodie Vernet, Robert C. Williamson, and Mark D. Reid. Composite multiclass losses. Submitted to Journal of Machine Learning Research, 42 pages., June 2012. URL http://users.cecs. anu.edu.au/˜williams/papers/P189.pdf.  Volodya Vovk. Aggregating strategies. In Proceedings of the Third Annual Workshop on Computa-  tional Learning Theory (COLT), pages 371-383, 1990.  Volodya Vovk. A game of prediction with expert advice.  In Proceedings of the Eighth Annual  Conference on Computational Learning Theory, pages 51-60. ACM, 1995.  Volodya Vovk. Competitive on-line statistics.  International Statistical Review, 69(2):213-248,  2001.  Robert C. Williamson. Loss functions. In Bernhard Sch¨olkopf, Zhiyuan Luo, and Vladimir Vovk, editors, Empirical Inference: Festschrift in Honor of Vladimir N. Vapnik, pages 71-80. Springer, 2013.  Eugene M. Zaustinsky. Spaces with non-symmetric distance. Memoirs of the American Mathemat-  ical Society, 34:1-91, 1959.  Fedor Zhdanov. Theory and Applications of Competitive Prediction. PhD thesis, Department of  Computer Science, Royal Holloway, University of London, 2011.  Constantin Z˘alinescu. Relations between the convexity of a set and the differentiability of its support  function. arXiv:1301.0810v1, January 2013."}