{"1": "Zoology, 17:144–150, 1968.  J.W. Carmichael, G.A. George, and R.S. Julius. Finding natural clusters. Systematic  K. Chaudhuri and S. Dasgupta. Rates of convergence for the cluster tree. In J. Laﬀerty, C.K.I. Williams, J. Shawe-Taylor, R.S. Zemel, and A. Culotta, editors, Advances in Neural Information Processing Systems 23, pages 343–351. 2010.  A. Cuevas and R. Fraiman. A plug-in approach to support estimation. Ann. Statist., 25:  2300–2312, 1997.  A. Cuevas, M. Febrero, and R. Fraiman. Estimating the number of clusters. The Canadian  Journal of Statistics, 28:367–382, 2000.  L. Devroye, L. Gy¨orﬁ, and G. Lugosi. A Probabilistic Theory of Pattern Recognition.  Springer, New York, 1996.  J. A. Hartigan. Clustering Algorithms. John Wiley & Sons, New York, 1975.  J.A. Hartigan. Consistency of single linkage for high-density clusters. J. Amer. Statist.  Assoc., 76:388–394, 1981.  M. Maier, M. Hein, and U. von Luxburg. Generalized density clustering. Optimal construc- tion of k-nearest neighbor graphs for identifying noisy clusters, 410:1749–1764, 2009.  P. Rigollet. Generalization error bounds in semi-supervised classiﬁcation under the cluster  assumption. J. Mach. Learn. Res., 8:1369–1392, 2007.  A. Rinaldo and L. Wasserman. Generalized density clustering. Ann. Statist., 38:2678–2722,  2010.  W. Stuetzle. Estimating the cluster tree of a density by analyzing the minimal spanning  tree of a sample. Journal of Classiﬁcation, 20:25–47, 2003.  W. Stuetzle and R. Nugent. A generalized single linkage method for estimating the cluster tree of a density. Journal of Computational and Graphical Statistics, 19:397–418, 2010.  Appendix A. Proofs related to the deﬁnition of level sets  Proof of Lemma 1 The second inclusion has already been shown in (2), and hence it ˚{h ≥ ρ} and an open set suﬃces to show the ﬁrst. To show the ﬁrst inclusion we ﬁx an x ∈ U with x ∈ U . Then  ˚{h ≥ ρ} ∩ U is open and non-empty, and hence supp µ = X yields  µρ(U ) = µ(cid:0){h ≥ ρ} ∩ U (cid:1) ≥ µ(cid:0) ˚{h ≥ ρ} ∩ U (cid:1) > 0 .  720   Steinwart  Acknowledgments  I like to thank Michael Eisermann for many fruitful discussions.  References  Zoology, 17:144-150, 1968.  J.W. Carmichael, G.A. George, and R.S. Julius. Finding natural clusters. Systematic  K. Chaudhuri and S. Dasgupta. Rates of convergence for the cluster tree. In J. Laﬀerty, C.K.I. Williams, J. Shawe-Taylor, R.S. Zemel, and A. Culotta, editors, Advances in Neural Information Processing Systems 23, pages 343-351. 2010.  A. Cuevas and R. Fraiman. A plug-in approach to support estimation. Ann. Statist., 25:  2300-2312, 1997.  A. Cuevas, M. Febrero, and R. Fraiman. Estimating the number of clusters. The Canadian  Journal of Statistics, 28:367-382, 2000.  L. Devroye, L. Gy¨orfi, and G. Lugosi. A Probabilistic Theory of Pattern Recognition.  Springer, New York, 1996.  J. A. Hartigan. Clustering Algorithms. John Wiley & Sons, New York, 1975.  J.A. Hartigan. Consistency of single linkage for high-density clusters. J. Amer. Statist.  Assoc., 76:388-394, 1981.  M. Maier, M. Hein, and U. von Luxburg. Generalized density clustering. Optimal construc- tion of k-nearest neighbor graphs for identifying noisy clusters, 410:1749-1764, 2009.  P. Rigollet. Generalization error bounds in semi-supervised classification under the cluster  assumption. J. Mach. Learn. Res., 8:1369-1392, 2007.  A. Rinaldo and L. Wasserman. Generalized density clustering. Ann. Statist., 38:2678-2722,  2010.  W. Stuetzle. Estimating the cluster tree of a density by analyzing the minimal spanning  tree of a sample. Journal of Classification, 20:25-47, 2003.  W. Stuetzle and R. Nugent. A generalized single linkage method for estimating the cluster tree of a density. Journal of Computational and Graphical Statistics, 19:397-418, 2010."}