{"1": "P. L. Bartlett, M. I. Jordan, and J. D. McAuliﬀe. Convexity, classification, and risk bounds.  Journal of the American Statistical Association, 101(473):138-156, 2006.  M. R. Boutell, J. Luo, X. Shen, and C.M. Brown. Learning multi-label scene classification.  Pattern Recognition, 37(9):1757-1771, 2004.  D. Cossock and T. Zhang. Statistical analysis of bayes optimal subset ranking.  IEEE  Transactions on Information Theory, 54(11):5140-5154, 2008.  O. Dekel, C. Manning, and Y. Singer. Log-linear models for label ranking. In S. Thrun, L. K. Saul, and B. Sch¨olkopf, editors, Advances in Neural Information Processing Systems 16. MIT Press, Cambridge, MA, 2004.  K. Dembczy´nski, W. W. Cheng, and E. H¨ullermeier. Bayes optimal multilabel classification via probabilistic classifier chains. In Proceedings of the 27th International Conference on Machine Learning, pages 279-286, Haifa, Israel, 2010.  J. C. Duchi, L. W. Mackey, and M. I. Jordan. On the consistency of ranking algorithms. In Proceedings of the 27th International Conference on Machine Learning, pages 327-334, Haifa, Israel, 2010.  A. Elisseeﬀ and J. Weston. A kernel method for multi-labelled classification. In T. G. Diet- terich, S. Becker, and Z. Ghahramani, editors, Advances in Neural Information Processing Systems 14, pages 681-687. MIT Press, Cambridge, MA, 2002.  N. Ghamrawi and A. McCallum. Collective multi-label classification. In Proceedings of the 14th ACM International Conference on Information and Knowledge Management, pages 195-200, Bremen, Germany, 2005.  S. Godbole and S. Sarawagi. Discriminative methods for multi-labeled classification. In Proceedings of the 8th Pacific-Asia Conference on Knowledge Discovery and Data Mining, pages 22-30, Sydney, Austrialia, 2004.  B. Hariharan, L. Zelnik-Manor, S. Vishwanathan, and M. Varma. Large scale max-margin multi-label classification with priors. In Proceedings of the 27th International Conference on Machine Learning, pages 423-430, Haifa, Israel, 2010.  D. Hsu, S. M. Kakade, J. Langford, and T. Zhang. Multi-label prediction via compressed sensing. In Y. Bengio, D. Schuurmans, J. Laﬀerty, C. K. I. Williams, and A. Culotta, editors, Advances in Neural Information Processing Systems 22, pages 772-780. MIT Press, Cambridge, MA, 2009.  357   On the Consistency of Multi-Label Learning  Acknowledgments  The authors want to thank the anonymous reviewers for their helpful comments and sug- gestions, and Tong Zhang for reading a preliminary version. This research was supported by the National Fundamental Research Program of China (2010CB327903), the National Science Foundation of China (61073097) and the Jiangsu Science Foundation (BK2008018).  References  P. L. Bartlett, M. I. Jordan, and J. D. McAuliﬀe. Convexity, classification, and risk bounds.  Journal of the American Statistical Association, 101(473):138-156, 2006.  M. R. Boutell, J. Luo, X. Shen, and C.M. Brown. Learning multi-label scene classification.  Pattern Recognition, 37(9):1757-1771, 2004.  D. Cossock and T. Zhang. Statistical analysis of bayes optimal subset ranking.  IEEE  Transactions on Information Theory, 54(11):5140-5154, 2008.  O. Dekel, C. Manning, and Y. Singer. Log-linear models for label ranking. In S. Thrun, L. K. Saul, and B. Sch¨olkopf, editors, Advances in Neural Information Processing Systems 16. MIT Press, Cambridge, MA, 2004.  K. Dembczy´nski, W. W. Cheng, and E. H¨ullermeier. Bayes optimal multilabel classification via probabilistic classifier chains. In Proceedings of the 27th International Conference on Machine Learning, pages 279-286, Haifa, Israel, 2010.  J. C. Duchi, L. W. Mackey, and M. I. Jordan. On the consistency of ranking algorithms. In Proceedings of the 27th International Conference on Machine Learning, pages 327-334, Haifa, Israel, 2010.  A. Elisseeﬀ and J. Weston. A kernel method for multi-labelled classification. In T. G. Diet- terich, S. Becker, and Z. Ghahramani, editors, Advances in Neural Information Processing Systems 14, pages 681-687. MIT Press, Cambridge, MA, 2002.  N. Ghamrawi and A. McCallum. Collective multi-label classification. In Proceedings of the 14th ACM International Conference on Information and Knowledge Management, pages 195-200, Bremen, Germany, 2005.  S. Godbole and S. Sarawagi. Discriminative methods for multi-labeled classification. In Proceedings of the 8th Pacific-Asia Conference on Knowledge Discovery and Data Mining, pages 22-30, Sydney, Austrialia, 2004.  B. Hariharan, L. Zelnik-Manor, S. Vishwanathan, and M. Varma. Large scale max-margin multi-label classification with priors. In Proceedings of the 27th International Conference on Machine Learning, pages 423-430, Haifa, Israel, 2010.  D. Hsu, S. M. Kakade, J. Langford, and T. Zhang. Multi-label prediction via compressed sensing. In Y. Bengio, D. Schuurmans, J. Laﬀerty, C. K. I. Williams, and A. Culotta, editors, Advances in Neural Information Processing Systems 22, pages 772-780. MIT Press, Cambridge, MA, 2009. Gao Zhou  Y. Lin. Support vector machines and the bayes rule in classification. Data Mining and  Knowledge Discovery, 6(3):259-275, 2002.  J. Petterson and T. Caetano. Reverse multi-label learning. In J. Laﬀerty, C. K. I. Williams, J. Shawe-Taylor, R. S. Zemel, and A. Culotta, editors, Advances in Neural Information Processing Systems 23, pages 1912-1920. MIT Press, Cambridge, MA, 2010.  G.-J. Qi, X.-S. Hua, Y. Rui, J. Tang, T. Mei, and H.-J. Zhang. Correlative multi-label video annotation. In Proceedings of the 15th ACM International Conference on Multimedia, pages 17-26, Augsburg, Germany, 2007.  R. T. Rockafellar. Convex Analysis. Princeton University Press, Princeton, NJ, 1997.  R. E. Schapire and Y. Singer. BoosTexter: A boosting-based system for text categorization.  Machine Learning, 39(2):135-168, 2000.  I. Steinwart. Consistency of support vector machines and other regularized kernel classifiers.  IEEE Transactions on Information Theory, 51(1):128-142, 2005.  B. Taskar, C. Guestrin, and D. Koller. Max-margin markov networks. In S. Thrun, L. Saul, and B. Sch¨olkopf, editors, Advances in Neural Information Processing Systems 16. MIT Press, Cambridge, MA, 2004.  A. Tewari and P. L. Bartlett. On the consistency of multiclass classification methods.  Journal of Machine Learning Research, 8:1007-1025, 2007.  F. Xia, T. Y. Liu, J. Wang, W. Zhang, and H. Li. Listwise approach to learning to rank: Theory and algorithm. In Proceedings of the 25th International Conference on Machine Learning, pages 1192-1199, Helsinki, Finland, 2008.  M.-L. Zhang and Z.-H. Zhou. Multi-label neural network with applications to functional ge- nomics and text categorization. IEEE Transactions on Knowledge and Data Engineering, 18(10):1338-1351, 2006.  M.-L. Zhang and Z.-H. Zhou. ML-KNN: A lazy learning approach to multi-label learning.  Pattern Recognition, 40(7):2038-2048, 2007.  T. Zhang. Statistical analysis of some multi-category large margin classification methods.  Journal of Machine Learning Research, 5:1225-1251, 2004a.  T. Zhang. Statistical behavior and consistency of classification methods based on convex  risk minimization. Annals of Statistics, 32(1):56-85, 2004b.  Z.-H. Zhou and M.-L. Zhang. Multi-instance multi-label learning with application to scene classification. In B. Sch¨olkopf, J. Platt, and T. Hofmann, editors, Advances in Neural Information Processing Systems 19, pages 1609-1616. MIT Press, Cambridge, MA, 2007."}