{"1": "135-158, 2012.  P.-A. Absil and J. Malick. Projection-like retractions on matrix manifolds. SIAM J. Optim., 22(1):  P-A Absil, R. Mahony, and R. Sepulchre. Riemannian geometry of Grassmann manifolds with a  view on algorithmic computation. Acta Applicandae Mathematicae, 80(2):199-220, 2004.  P.-A. Absil, C.G. Baker, and K.A. Gallivan. Trust-region methods on Riemannian manifolds. Foun-  dations of Computational Mathematics, 7(3):303-330, Jul 2007.  P-A Absil, R. Mahony, and R. Sepulchre. Optimization Algorithms on Matrix Manifolds. Princeton  University Press, 2009.  Soc., 139(2):655-673, 2011.  B. Afsari. Riemannian Lp center of mass: existence, uniqueness, and convexity. Proc. Amer. Math.  Z. Allen-Zhu and Y. Li. First efficient convergence for streaming k-PCA: a global, gap-free, and near-optimal rate. In Proceedings of the 58th Symposium on Foundations of Computer Science, FOCS ’17, 2017.  A. Aswani, P. Bickel, and C. Tomlin. Regression on manifolds: estimation of the exterior derivative.  Ann. Statist., 39(1):48-81, 2011.  F. Bach and E. Moulines. Non-asymptotic analysis of stochastic approximation algorithms for machine learning. In Advances in Neural Information Processing Systems, pages 451-459, 2011.  A. Benveniste, P. Priouret, and M. M´etivier. Adaptive Algorithms and Stochastic Approximations.  Springer, 1990.  D. A Bini and B. Iannazzo. Computing the Karcher mean of symmetric positive definite matrices.  Linear Algebra and its Applications, 438(4):1700-1710, 2013.  S. Bonnabel. Stochastic gradient descent on Riemannian manifolds. IEEE Transactions on Auto-  matic Control, 58(9):2217-2229, 2013.  L. Bottou. Online algorithms and stochastic approximations. In Online Learning and Neural Net-  works. Cambridge University Press, Cambridge, UK, 1998.  P. Bougerol and J. Lacroix. Products of Random Matrices with Applications to Schr¨odinger Oper-  ators, volume 8 of Progress in Probability and Statistics. Birkh¨auser, 1985.  N. Boumal. On intrinsic Cram´er-Rao bounds for Riemannian submanifolds and quotient manifolds.  IEEE Trans. Signal Process., 61(7):1809-1821, 2013.  N. Boumal and P.-A. Absil. RTRMC: A Riemannian trust-region method for low-rank matrix com-  pletion. In Advances in Neural Information Processing Systems 24, pages 406-414. 2011.  13   AVERAGING ON MANIFOLDS  acknowledges support from the Mathematical Data Science program of the Office of Naval Research under grant number N00014-15-1-2670.  References  135-158, 2012.  P.-A. Absil and J. Malick. Projection-like retractions on matrix manifolds. SIAM J. Optim., 22(1):  P-A Absil, R. Mahony, and R. Sepulchre. Riemannian geometry of Grassmann manifolds with a  view on algorithmic computation. Acta Applicandae Mathematicae, 80(2):199-220, 2004.  P.-A. Absil, C.G. Baker, and K.A. Gallivan. Trust-region methods on Riemannian manifolds. Foun-  dations of Computational Mathematics, 7(3):303-330, Jul 2007.  P-A Absil, R. Mahony, and R. Sepulchre. Optimization Algorithms on Matrix Manifolds. Princeton  University Press, 2009.  Soc., 139(2):655-673, 2011.  B. Afsari. Riemannian Lp center of mass: existence, uniqueness, and convexity. Proc. Amer. Math.  Z. Allen-Zhu and Y. Li. First efficient convergence for streaming k-PCA: a global, gap-free, and near-optimal rate. In Proceedings of the 58th Symposium on Foundations of Computer Science, FOCS ’17, 2017.  A. Aswani, P. Bickel, and C. Tomlin. Regression on manifolds: estimation of the exterior derivative.  Ann. Statist., 39(1):48-81, 2011.  F. Bach and E. Moulines. Non-asymptotic analysis of stochastic approximation algorithms for machine learning. In Advances in Neural Information Processing Systems, pages 451-459, 2011.  A. Benveniste, P. Priouret, and M. M´etivier. Adaptive Algorithms and Stochastic Approximations.  Springer, 1990.  D. A Bini and B. Iannazzo. Computing the Karcher mean of symmetric positive definite matrices.  Linear Algebra and its Applications, 438(4):1700-1710, 2013.  S. Bonnabel. Stochastic gradient descent on Riemannian manifolds. IEEE Transactions on Auto-  matic Control, 58(9):2217-2229, 2013.  L. Bottou. Online algorithms and stochastic approximations. In Online Learning and Neural Net-  works. Cambridge University Press, Cambridge, UK, 1998.  P. Bougerol and J. Lacroix. Products of Random Matrices with Applications to Schr¨odinger Oper-  ators, volume 8 of Progress in Probability and Statistics. Birkh¨auser, 1985.  N. Boumal. On intrinsic Cram´er-Rao bounds for Riemannian submanifolds and quotient manifolds.  IEEE Trans. Signal Process., 61(7):1809-1821, 2013.  N. Boumal and P.-A. Absil. RTRMC: A Riemannian trust-region method for low-rank matrix com-  pletion. In Advances in Neural Information Processing Systems 24, pages 406-414. 2011. AVERAGING ON MANIFOLDS  T. T. Cai, Z. Ma, and Y. Wu. Sparse PCA: optimal rates and adaptive estimation. Ann. Statist., 41  (6):3074-3110, 2013.  M. P. Do Carmo. Differential Geometry of Curves and Surfaces. Courier Dover Publications, 2016.  A. Edelman, T. A. Arias, and S. T. Smith. The geometry of algorithms with orthogonality con-  straints. SIAM journal on Matrix Analysis and Applications, 20(2):303-353, 1998.  V. Fabian. On asymptotic normality in stochastic approximation. Ann. Math. Statist, 39:1327-1332,  1968.  N. Flammarion and F. Bach. Stochastic composite least-squares regression with convergence rate O(1/n). In Proceedings of the 2017 Conference on Learning Theory, volume 65 of Proceedings of Machine Learning Research, pages 831-875. PMLR, 07-10 Jul 2017.  R. A. Horn and C. R. Johnson. Matrix Analysis. Cambridge University Press, 1990.  R. Hosseini and S. Sra. Matrix manifold optimization for Gaussian mixtures. In Advances in Neural  Information Processing Systems, pages 910-918, 2015.  W. Huang, K. A Gallivan, and P-A Absil. A Broyden class of quasi-Newton methods for Rieman-  nian optimization. SIAM Journal on Optimization, 25(3):1660-1685, 2015.  M. Ishteva, P.-A. Absil, S. Van Huffel, and L. De Lathauwer. Best low multilinear rank approxima- tion of higher-order tensors, based on the Riemannian trust-region scheme. SIAM J. Matrix Anal. Appl., 32(1):115-135, 2011.  P. Jain, C. Jin, S. M. Kakade, P. Netrapalli, and A. Sidford. Streaming PCA: matching matrix Bern- stein and near-optimal finite sample guarantees for Oja’s algorithm. In Conference on Learning Theory, pages 1147-1164, 2016.  H. Kushner and G G. Yin. Stochastic Approximation and Recursive Algorithms and Applications.  Springer, 2003.  Applications, 24(1):1-16, 2002.  M. Moakher. Means and averaging in the group of rotations. SIAM Journal on Matrix Analysis and  A. Nemirovski, A. Juditsky, G. Lan, and A. Shapiro. Robust stochastic approximation approach to  stochastic programming. SIAM J. Optim., 19(4):1574-1609, 2008.  Y. Nesterov and J.-P. Vial. Confidence level solutions for stochastic programming. Automatica J.  IFAC, 44(6):1559-1568, 2008.  can Mathematical Society, 1973.  M. B. Nevelson and R. Z. Hasminski. Stochastic Approximation and Recursive Estimation. Ameri-  E. Oja. Simplified neuron model as a principal component analyzer. Journal of Mathematical  Biology, 15(3):267-273, Nov 1982.  E. Oja and J. Karhunen. On stochastic approximation of the eigenvectors and eigenvalues of the  expectation of a random matrix. J. Math. Anal. Appl., 106(1):69-84, 1985. AVERAGING ON MANIFOLDS  B. T. Polyak. A new method of stochastic approximation type. Avtomatika i Telemekhanika, 51(7):  98-107, 1990.  B. T. Polyak and A. B. Juditsky. Acceleration of stochastic approximation by averaging. SIAM  Journal on Control and Optimization, 30(4):838-855, 1992.  M. Reiß and M. Wahl. Non-asymptotic upper bounds for the reconstruction error of PCA. arXiv  preprint arXiv:1609.03779, 2016.  W. Ring and B. Wirth. Optimization methods on Riemannian manifolds and their application to  shape space. SIAM Journal on Optimization, 22(2):596-627, 2012.  H. Robbins and S. Monro. A stochastic approximation method. The Annals of Mathematical Statis-  tics, pages 400-407, 1951.  D. Ruppert. Efficient estimations from a slowly convergent robbins-monro process. Technical  report, Cornell University Operations Research and Industrial Engineering, 1988.  T. Sakai. Riemannian Geometry, volume 149 of Translations of Mathematical Monographs. Amer-  ican Mathematical Society, 1996.  arXiv:1702.05594, 2017.  H. Sato, H. Kasai, and B. Mishra. Riemannian stochastic variance reduced gradient. arXiv preprint  S. Shalev-Shwartz, O. Shamir, N. Srebro, and K. Sridharan. Stochastic convex optimization. In  Proceedings of the International Conference on Learning Theory (COLT), 2009.  O. Shamir. Convergence of stochastic gradient descent for PCA.  In Proceedings of The 33rd International Conference on Machine Learning, volume 48 of Proceedings of Machine Learning Research, pages 257-265. PMLR, 20-22 Jun 2016a.  O. Shamir. Fast stochastic algorithms for SVD and PCA: convergence properties and convexity. In  International Conference on Machine Learning, pages 248-256, 2016b.  S. T. Smith. Covariance, subspace, and intrinsic Cram´er-Rao bounds. IEEE Trans. Signal Process.,  53(5):1610-1630, 2005.  J. Sun, Q. Qu, and J. Wright. Complete dictionary recovery over the sphere II: recovery by Rieman-  nian trust-region method. IEEE Trans. Inform. Theory, 63(2):885-914, 2017.  C. Udriste. Convex Functions and Optimization Methods on Riemannian Manifolds, volume 297.  Springer Science & Business Media, 1994.  Aad W Van der Vaart. Asymptotic statistics, volume 3. Cambridge university press, 1998.  S. Waldmann. Geometric wave equations. arXiv preprint arXiv:1208.4706, 2012.  B. Yang. Projection approximation subspace tracking. Trans. Sig. Proc., 43(1):95-107, January  1995.  H. Zhang and S. Sra. First-order methods for geodesically convex optimization. In Conference on  Learning Theory, pages 1617-1638, 2016. AVERAGING ON MANIFOLDS  H. Zhang, S. J. Reddi, and S. Sra. Riemannian SVRG: fast stochastic optimization on Riemannian manifolds. In Advances in Neural Information Processing Systems, pages 4592-4600, 2016. AVERAGING ON MANIFOLDS"}