{"1": "Michael Aizenman, Joel L Lebowitz, and David Ruelle. Some rigorous results on the Sherrington- Kirkpatrick spin glass model. Communications in Mathematical Physics, 112(1):3-20, 1987.  Arash A. Amini and Martin J. Wainwright. High-dimensional analysis of semidefinite relaxations  for sparse principal components. Annals of Statistics, 37(5B):2877-2921, 10 2009.  Antonio Auffinger and Wei-Kuo Chen. Free energy and complexity of spherical bipartite models.  Journal of Statistical Physics, 157(1):40-59, 2014.  Zhidong Bai and Jian-feng Yao. Central limit theorems for eigenvalues in a spiked population model. Annales de l’Institut Henri Poincar´e, Probabilit´es et Statistiques, 44(3):447-474, 2008.  Zhidong Bai and Jianfeng Yao. On sample eigenvalues in a generalized spiked population model.  Journal of Multivariate Analysis, 106:167-177, 2012.  Jinho Baik and Ji Oon Lee. Fluctuations of the free energy of the spherical Sherrington-Kirkpatrick  model. Journal of Statistical Physics, 165(2):185-224, 2016.  Jinho Baik and Ji Oon Lee. Fluctuations of the free energy of the spherical Sherrington-Kirkpatrick model with ferromagnetic interaction. In Annales Henri Poincar´e, volume 18, pages 1867-1917. Springer, 2017a.  Jinho Baik and Ji Oon Lee. Free energy of bipartite spherical Sherrington-Kirkpatrick model. arXiv  preprint arXiv:1711.06364, 2017b.  Jinho Baik and Jack W Silverstein. Eigenvalues of large sample covariance matrices of spiked  population models. Journal of Multivariate Analysis, 97(6):1382-1408, 2006.  Jinho Baik, G´erard Ben Arous, and Sandrine P´ech´e. Phase transition of the largest eigenvalue for nonnull complex sample covariance matrices. Annals of Probability, 33(5):1643-1697, 2005.  Jess Banks, Cristopher Moore, Roman Vershynin, Nicolas Verzelen, and Jiaming Xu. Information- theoretic bounds and phase transitions in clustering, sparse PCA, and submatrix localization. In IEEE International Symposium on Information Theory (ISIT), pages 1137-1141. IEEE, 2017.  Jean Barbier, Mohamad Dia, Nicolas Macris, Florent Krzakala, Thibault Lesieur, and Lenka Zde- borov´a. Mutual information for symmetric rank-one matrix estimation: A proof of the replica formula. In Advances in Neural Information Processing Systems (NIPS), pages 424-432, 2016.  Jean Barbier, Florent Krzakala, Nicolas Macris, L´eo Miolane, and Lenka Zdeborov´a. Phase tran- sitions, optimal errors and optimality of message-passing in generalized linear models. arXiv preprint arXiv:1708.03395, 2017.  Adriano Barra, Giuseppe Genovese, and Francesco Guerra. Equilibrium statistical mechanics of bipartite spin systems. Journal of Physics A: Mathematical and Theoretical, 44(24):245002, 2011.  13   DETECTION LIMITS IN SPIKED MODELS  References  Michael Aizenman, Joel L Lebowitz, and David Ruelle. Some rigorous results on the Sherrington- Kirkpatrick spin glass model. Communications in Mathematical Physics, 112(1):3-20, 1987.  Arash A. Amini and Martin J. Wainwright. High-dimensional analysis of semidefinite relaxations  for sparse principal components. Annals of Statistics, 37(5B):2877-2921, 10 2009.  Antonio Auffinger and Wei-Kuo Chen. Free energy and complexity of spherical bipartite models.  Journal of Statistical Physics, 157(1):40-59, 2014.  Zhidong Bai and Jian-feng Yao. Central limit theorems for eigenvalues in a spiked population model. Annales de l’Institut Henri Poincar´e, Probabilit´es et Statistiques, 44(3):447-474, 2008.  Zhidong Bai and Jianfeng Yao. On sample eigenvalues in a generalized spiked population model.  Journal of Multivariate Analysis, 106:167-177, 2012.  Jinho Baik and Ji Oon Lee. Fluctuations of the free energy of the spherical Sherrington-Kirkpatrick  model. Journal of Statistical Physics, 165(2):185-224, 2016.  Jinho Baik and Ji Oon Lee. Fluctuations of the free energy of the spherical Sherrington-Kirkpatrick model with ferromagnetic interaction. In Annales Henri Poincar´e, volume 18, pages 1867-1917. Springer, 2017a.  Jinho Baik and Ji Oon Lee. Free energy of bipartite spherical Sherrington-Kirkpatrick model. arXiv  preprint arXiv:1711.06364, 2017b.  Jinho Baik and Jack W Silverstein. Eigenvalues of large sample covariance matrices of spiked  population models. Journal of Multivariate Analysis, 97(6):1382-1408, 2006.  Jinho Baik, G´erard Ben Arous, and Sandrine P´ech´e. Phase transition of the largest eigenvalue for nonnull complex sample covariance matrices. Annals of Probability, 33(5):1643-1697, 2005.  Jess Banks, Cristopher Moore, Roman Vershynin, Nicolas Verzelen, and Jiaming Xu. Information- theoretic bounds and phase transitions in clustering, sparse PCA, and submatrix localization. In IEEE International Symposium on Information Theory (ISIT), pages 1137-1141. IEEE, 2017.  Jean Barbier, Mohamad Dia, Nicolas Macris, Florent Krzakala, Thibault Lesieur, and Lenka Zde- borov´a. Mutual information for symmetric rank-one matrix estimation: A proof of the replica formula. In Advances in Neural Information Processing Systems (NIPS), pages 424-432, 2016.  Jean Barbier, Florent Krzakala, Nicolas Macris, L´eo Miolane, and Lenka Zdeborov´a. Phase tran- sitions, optimal errors and optimality of message-passing in generalized linear models. arXiv preprint arXiv:1708.03395, 2017.  Adriano Barra, Giuseppe Genovese, and Francesco Guerra. Equilibrium statistical mechanics of bipartite spin systems. Journal of Physics A: Mathematical and Theoretical, 44(24):245002, 2011. DETECTION LIMITS IN SPIKED MODELS  Adriano Barra, Andrea Galluzzi, Francesco Guerra, Andrea Pizzoferrato, and Daniele Tantari. Mean field bipartite spin models treated with mechanical techniques. The European Physical Journal B, 87(3):74, 2014.  Florent Benaych-Georges and Raj Rao Nadakuditi. The eigenvalues and eigenvectors of finite, low rank perturbations of large random matrices. Advances in Mathematics, 227(1):494-521, 2011.  Florent Benaych-Georges and Raj Rao Nadakuditi. The singular values and vectors of low rank perturbations of large rectangular random matrices. Journal of Multivariate Analysis, 111:120- 135, 2012.  Quentin Berthet and Philippe Rigollet. Optimal detection of sparse principal components in high  dimension. Annals of Statistics, 41(4):1780-1815, 2013.  St´ephane Boucheron, G´abor Lugosi, and Pascal Massart. Concentration Inequalities: A Nonasymp-  totic Theory of Independence. Oxford University Press, 2013.  Mireille Capitaine, Catherine Donati-Martin, and Delphine F´eral. The largest eigenvalues of finite rank deformation of large Wigner matrices: convergence and nonuniversality of the ﬂuctuations. Annals of Probability, pages 1-47, 2009.  Sourav Chatterjee. Superconcentration and Related Topics. Springer, 2014.  Yash Deshpande, Emmanuel Abb´e, and Andrea Montanari. Asymptotic mutual information for the binary stochastic block model. In IEEE International Symposium on Information Theory (ISIT), pages 185-189. IEEE, 2016.  Edgar Dobriban. Sharp detection in PCA under correlations: all eigenvalues matter. Annals of  Statistics, 45(4):1810-1833, 2017.  Ahmed El Alaoui, Florent Krzakala, and Michael I Jordan. Finite size corrections and likelihood  ratio ﬂuctuations in the spiked Wigner model. arXiv preprint arXiv:1710.02903, 2017.  Delphine F´eral and Sandrine P´ech´e. The largest eigenvalue of rank one deformation of large Wigner  matrices. Communications in Mathematical Physics, 272(1):185-228, 2007.  Francesco Guerra. Broken replica symmetry bounds in the mean field spin glass model. Communi-  cations in Mathematical Physics, 233(1):1-12, 2003.  Francesco Guerra and Fabio Lucio Toninelli. Quadratic replica coupling in the Sherrington- Kirkpatrick mean field spin glass model. Journal of Mathematical Physics, 43(7):3704-3716, 2002.  Iain M Johnstone. On the distribution of the largest eigenvalue in principal components analysis.  Annals of Statistics, pages 295-327, 2001.  Iain M Johnstone and Arthur Yu Lu. On consistency and sparsity for principal components analysis in high dimensions. Journal of the American Statistical Association, 104(486):682-693, 2009.  Iain M Johnstone and Alexei Onatski. Testing in high-dimensional spiked models. arXiv preprint  arXiv:1509.07269, 2015. DETECTION LIMITS IN SPIKED MODELS  Satish Babu Korada and Nicolas Macris. Exact solution of the gauge symmetric p-spin glass model  on a complete graph. Journal of Statistical Physics, 136(2):205-230, 2009.  Florent Krzakala, Jiaming Xu, and Lenka Zdeborov´a. Mutual information in rank-one matrix esti-  mation. In Information Theory Workshop (ITW), pages 71-75. IEEE, 2016.  Olivier Ledoit and Michael Wolf. Some hypothesis tests for the covariance matrix when the dimen-  sion is large compared to the sample size. Annals of Statistics, pages 1081-1102, 2002.  Marc Lelarge and L´eo Miolane. Fundamental limits of symmetric low-rank matrix estimation. In Proceedings of the 30th Conference on Learning Theory, volume 65, pages 1297-1301. PMLR. arXiv preprint:1611.03888, 2017.  Thibault Lesieur, Florent Krzakala, and Lenka Zdeborov´a. MMSE of probabilistic low-rank matrix In Communication, Control, and estimation: Universality with respect to the output channel. Computing (Allerton), 2015 53rd Annual Allerton Conference on, pages 680-687. IEEE, 2015a.  Thibault Lesieur, Florent Krzakala, and Lenka Zdeborov´a. Phase transitions in sparse PCA.  In  IEEE International Symposium on Information Theory (ISIT), pages 1635-1639. IEEE, 2015b.  Thibault Lesieur, Florent Krzakala, and Lenka Zdeborov´a. Constrained low-rank matrix estima- tion: Phase transitions, approximate message passing and applications. Journal of Statistical Mechanics: Theory and Experiment, 2017(7), 2017.  L´eo Miolane. Fundamental limits of low-rank matrix estimation. arXiv preprint arXiv:1702.00473,  2017.  Andrea Montanari, Daniel Reichman, and Ofer Zeitouni. On the limitation of spectral methods: From the gaussian hidden clique problem to rank-one perturbations of gaussian tensors. In Ad- vances in Neural Information Processing Systems, pages 217-225, 2015.  Boaz Nadler. Finite sample approximation results for principal component analysis: A matrix  perturbation approach. Annals of Statistics, pages 2791-2817, 2008.  Hidetoshi Nishimori. Statistical physics of spin glasses and information processing: an introduc-  tion, volume 111. Clarendon Press, 2001.  Alexei Onatski, Marcelo J Moreira, and Marc Hallin. Asymptotic power of sphericity tests for  high-dimensional data. Annals of Statistics, 41(3):1204-1231, 2013.  Alexei Onatski, Marcelo J Moreira, and Marc Hallin. Signal detection in high dimension: The  multispiked case. Annals of Statistics, 42(1):225-254, 2014.  Dmitry Panchenko. The free energy in a multi-species Sherrington-Kirkpatrick model. Annals of  Probability, 43(6):3494-3513, 2015.  Debashis Paul. Asymptotics of sample eigenstructure for a large dimensional spiked covariance  model. Statistica Sinica, pages 1617-1642, 2007.  Sandrine P´ech´e. The largest eigenvalue of small rank perturbations of Hermitian random matrices.  Probability Theory and Related Fields, 134(1):127-173, 2006. DETECTION LIMITS IN SPIKED MODELS  Sandrine P´ech´e. Deformed ensembles of random matrices.  In Proceedings of the International  Congress of Mathematicians, Seoul, volume III, pages 1059-1174. ICM, 2014.  Amelia Perry, Alexander S Wein, Afonso S Bandeira, and Ankur Moitra. On the optimality and sub-optimality of PCA for spiked random matrix models. Annals of Statistics (to appear). arXiv preprint:1609.05573, 2016.  Gilles Pisier. Probabilistic methods in the geometry of Banach spaces, pages 167-241. Springer,  Berlin, Heidelberg, 1986.  pages 63-80. Springer, 2007.  Michel Talagrand. Mean field models for spin glasses: some obnoxious problems. In Spin Glasses,  Michel Talagrand. Mean field models for spin glasses. Volume I: Basic examples, volume 54.  Springer Science & Business Media, 2011a.  Michel Talagrand. Mean field models for spin glasses. Volume II: Advanced replica-symmetry and  low temperature, volume 55. Springer Science & Business Media, 2011b.  Aad W Van der Vaart. Asymptotic Statistics. Cambridge University Press, 2000."}