{"1": "3(1):9-44, 1988.  Richard S Sutton. Learning to predict by the methods of temporal differences. Machine Learning,  John N Tsitsiklis and Benjamin Van Roy. An analysis of temporal-difference learning with function  approximation. IEEE TRANSACTIONS ON AUTOMATIC CONTROL, 42(5), 1997.  2   FINITE TIME ANALYSIS OF TD  precise conditions for the asymptotic convergence of TD with linear function approximation, and provided counterexamples when these conditions are violated. With guarantees of asymptotic con- vergence in place, a natural next step is to understand the algorithm’s statistical efficiency. How much data is required to reach a given level of accuracy? Can one give uniform bounds on this, or could data-requirements explode depending on the problem instance? Twenty years after the work of Tsitsiklis and Van Roy (1997), such questions remain largely unsettled.  In this work, we take a step toward correcting this by providing a simple and explicit finite time analysis of temporal difference learning. We draw inspiration from the analysis of projected stochastic gradient descent. These analyses are simple-enough so that they are frequently taught in machine learning courses-and the explicit bounds they produce provide clear assurance of the robustness of SGD. Unfortunately, there are critical differences between TD and SGD, and as such these simple analyses do not apply to TD. Instead, past work on TD has needed to invoke powerful results from the theory of stochastic approximation. In this work, we uncover an approach to ana- lyzing TD which, except for a few crucial steps, leverages the standard tools for finite time analysis of SGD. In addition to the several novel guarantees we derive in the paper, we feel the analysis offers insight into the dynamics of TD, and we hope our approach helps future researchers derive stronger bounds and principled improvements to the algorithm.  References  3(1):9-44, 1988.  Richard S Sutton. Learning to predict by the methods of temporal differences. Machine Learning,  John N Tsitsiklis and Benjamin Van Roy. An analysis of temporal-difference learning with function  approximation. IEEE TRANSACTIONS ON AUTOMATIC CONTROL, 42(5), 1997."}