{"1": "Albert, A.E., The sequential design of experiments for infinitely many states of nature The Annals  of Mathematical Statistics, pp.774-799. 1961.  Jean-Yves Audibert and Sébastien Bubeck. Best arm identification in multi-armed bandits.  In  COLT-23th Conference on Learning Theory-2010, pages 13-p, 2010.  Robert Eric Bechhofer, Jack Kiefer, and Milton Sobel. Sequential identification and ranking proce- dures: with special reference to Koopman-Darmois populations, volume 3. University of Chicago Press, 1968.  Mark Broadie, Yiping Du, and Ciamac C Moallemi. Efficient risk estimation via nested sequential  simulation. Management Science, 57(6):1172-1194, 2011.  Sébastien Bubeck, Rémi Munos, and Gilles Stoltz.  Pure exploration in finitely-armed and  continuous-armed bandits. Theor. Comput. Sci., 412(19):1832-1852, 2011.  A.N. Burnetas and M.N. Katehakis. Optimal adaptive policies for sequential allocation problems.  Advances in Applied Mathematics, 17(2):122-142, 1996.  Olivier Cappé, Aurélien Garivier, Odalric-Ambrym Maillard, Rémi Munos, Gilles Stoltz, et al. Kullback-leibler upper confidence bounds for optimal sequential allocation. The Annals of Statis- tics, 41(3):1516-1541, 2013.  C.H. Chen, J. Lin, E. Yucesan, and S.E. Chick. Simulation budget allocation for further enhancing the efficiency of ordinal optimization. Discrete Event Dynamic Systems, 10(3):251-270, 2000.  Herman Chernoff. Sequential design of experiments. The Annals of Mathematical Statistics, 30(3):  755-770, 1959.  L Dai. Convergence properties of ordinal comparison in the simulation of discrete event dynamic  systems. Journal of Optimization Theory and Applications, 91(2):363-388, 1996.  Amir Dembo and Ofer Zeitouni. Large deviations techniques and applications. 1998. Applications  of Mathematics, 38, 2011.  Darrell Duffie. Dynamic asset pricing theory. Princeton University Press, 2010.  Eyal Even-Dar, Shie Mannor, and Yishay Mansour. Action elimination and stopping conditions for the multi-armed bandit and reinforcement learning problems. Journal of Machine Learning Research, 7(Jun):1079-1105, 2006.  Anthony V. Fiacco and Yo Ishizuka. Sensitivity and stability analysis for nonlinear programming.  Annals of Operations Research, 27(1):215-235, Dec 1990.  Aurélien Garivier and Emilie Kaufmann. Optimal best arm identification with fixed confidence. In  Conference on Learning Theory, pages 998-1027, 2016.  Peter Glynn and Sandeep Juneja. A large deviations perspective on ordinal optimization. In Pro- ceedings of the 36th conference on Winter simulation, pages 577-585. Winter Simulation Con- ference, 2004.  13   SAMPLE COMPLEXITY OF PARTITION IDENTIFICATION  References  Albert, A.E., The sequential design of experiments for infinitely many states of nature The Annals  of Mathematical Statistics, pp.774-799. 1961.  Jean-Yves Audibert and Sébastien Bubeck. Best arm identification in multi-armed bandits.  In  COLT-23th Conference on Learning Theory-2010, pages 13-p, 2010.  Robert Eric Bechhofer, Jack Kiefer, and Milton Sobel. Sequential identification and ranking proce- dures: with special reference to Koopman-Darmois populations, volume 3. University of Chicago Press, 1968.  Mark Broadie, Yiping Du, and Ciamac C Moallemi. Efficient risk estimation via nested sequential  simulation. Management Science, 57(6):1172-1194, 2011.  Sébastien Bubeck, Rémi Munos, and Gilles Stoltz.  Pure exploration in finitely-armed and  continuous-armed bandits. Theor. Comput. Sci., 412(19):1832-1852, 2011.  A.N. Burnetas and M.N. Katehakis. Optimal adaptive policies for sequential allocation problems.  Advances in Applied Mathematics, 17(2):122-142, 1996.  Olivier Cappé, Aurélien Garivier, Odalric-Ambrym Maillard, Rémi Munos, Gilles Stoltz, et al. Kullback-leibler upper confidence bounds for optimal sequential allocation. The Annals of Statis- tics, 41(3):1516-1541, 2013.  C.H. Chen, J. Lin, E. Yucesan, and S.E. Chick. Simulation budget allocation for further enhancing the efficiency of ordinal optimization. Discrete Event Dynamic Systems, 10(3):251-270, 2000.  Herman Chernoff. Sequential design of experiments. The Annals of Mathematical Statistics, 30(3):  755-770, 1959.  L Dai. Convergence properties of ordinal comparison in the simulation of discrete event dynamic  systems. Journal of Optimization Theory and Applications, 91(2):363-388, 1996.  Amir Dembo and Ofer Zeitouni. Large deviations techniques and applications. 1998. Applications  of Mathematics, 38, 2011.  Darrell Duffie. Dynamic asset pricing theory. Princeton University Press, 2010.  Eyal Even-Dar, Shie Mannor, and Yishay Mansour. Action elimination and stopping conditions for the multi-armed bandit and reinforcement learning problems. Journal of Machine Learning Research, 7(Jun):1079-1105, 2006.  Anthony V. Fiacco and Yo Ishizuka. Sensitivity and stability analysis for nonlinear programming.  Annals of Operations Research, 27(1):215-235, Dec 1990.  Aurélien Garivier and Emilie Kaufmann. Optimal best arm identification with fixed confidence. In  Conference on Learning Theory, pages 998-1027, 2016.  Peter Glynn and Sandeep Juneja. A large deviations perspective on ordinal optimization. In Pro- ceedings of the 36th conference on Winter simulation, pages 577-585. Winter Simulation Con- ference, 2004. SAMPLE COMPLEXITY OF PARTITION IDENTIFICATION  Peter Glynn and Sandeep Juneja. arXiv:1507.04564v3, 1, 2018.  Selecting the best system and multi-armed bandits.  Michael B Gordy and Sandeep Juneja. Nested simulation in portfolio risk measurement. Manage-  ment Science, 56(10):1833-1848, 2010.  Yu-Chi Ho, R_S Sreenivas, and P Vakili. Ordinal optimization of deds. Discrete Event Dynamic  Systems, 2(1):61-88, 1992.  Kevin Jamieson, Matthew Malloy, Robert Nowak, and Sébastien Bubeck.  lil’ucb: An optimal exploration algorithm for multi-armed bandits. In Conference on Learning Theory, pages 423- 439, 2014.  Christopher Jennison, Iain M Johnstone, and Bruce W Turnbull. Asymptotically optimal procedures for sequential adaptive selection of the best of several normal means. In Statistical decision theory and related topics III, pages 55-86. Elsevier, 1982.  Shivaram Kalyanakrishnan, Ambuj Tewari, Peter Auer, and Peter Stone. PAC subset selection in  stochastic multi-armed bandits. In ICML, volume 12, pages 655-662, 2012.  Emilie Kaufmann and Shivaram Kalyanakrishnan. Information complexity in bandit subset selec-  tion. In Conference on Learning Theory, pages 228-251, 2013.  Emilie Kaufmann, Olivier Cappé, and Aurélien Garivier. On the complexity of best-arm identifi- cation in multi-armed bandit models. The Journal of Machine Learning Research, 17(1):1-42, 2016.  Emilie Kaufmann, W. M. Koolen, and Aurélien Garivier. Sequential test for the lowest mean: From Thompson to Murphy sampling. In Advances in Neural Information Processing Systems, pages 6332-6342, 2018.  Seong-Hee Kim and Barry L Nelson. A fully sequential procedure for indifference-zone selection in simulation. ACM Transactions on Modeling and Computer Simulation (TOMACS), 11(3): 251-273, 2001.  Tze Leung Lai and Herbert Robbins. Asymptotically efficient adaptive allocation rules. Advances  in Applied Mathematics, 6(1):4-22, 1985.  Marco López and Georg Still. Semi-infinite programming. European Journal of Operational Re-  search, 180(2):491-518, 2007.  S. Magureanu, R. Combes, and A. Proutiere. Lipschitz bandits: Regret lower bounds and optimal  algorithms. In 27th Conference on Learning Theory, 2014.  Shie Mannor and John N Tsitsiklis. The sample complexity of exploration in the multi-armed bandit  problem. Journal of Machine Learning Research, 5:623-648, 2004.  Edward Paulson. A sequential procedure for selecting the population with the largest mean from k  normal populations. The Annals of Mathematical Statistics, 35(1):174-180, 1964. SAMPLE COMPLEXITY OF PARTITION IDENTIFICATION  Walter Rudin. Principles of mathematical analysis. McGraw-Hill Book Co., New York, third  edition, 1976. International Series in Pure and Applied Mathematics.  Daniel Russo. Simple Bayesian algorithms for best arm identification. In Conference on Learning  Theory, pages 1417-1418, 2016.  Science & Business Media, 2004.  S. E. Shreve. Stochastic calculus for finance II: Continuous-time models, volume 11. Springer  Acknowledgments  We thank the referees for their helpful comments."}