{"1": "David J. Aldous. The ζ(2) limit in the random assignment problem. Random Structures Algorithms, 18(4):381-418, 2001. ISSN 1042-9832. URL https://doi.org/10.1002/rsa.1015.  Zeyuan Allen-Zhu, Yuanzhi Li, Rafael Oliveira, and Avi Wigderson. Much faster algorithms In Chris Umans, editor, 58th IEEE Annual Symposium on Foundations for matrix scaling. of Computer Science, FOCS 2017, Berkeley, CA, USA, October 15-17, 2017, pages 890-901. IEEE Computer Society, 2017. ISBN 978-1-5386-3464-6. doi: 10.1109/FOCS.2017.87. URL https://doi.org/10.1109/FOCS.2017.87.  Jason Altschuler, Jonathan Weed, and Philippe Rigollet. Near-linear time approximation algo- rithms for optimal transport via sinkhorn iteration. In Isabelle Guyon, Ulrike von Luxburg, Samy Bengio, Hanna M. Wallach, Rob Fergus, S. V. N. Vishwanathan, and Roman Garnett, editors, Advances in Neural Information Processing Systems 30: Annual Conference on Neural Information Processing Systems 2017, 4-9 December 2017, Long Beach, CA, USA, pages 1961- 1971, 2017. URL http://papers.nips.cc/paper/6792-near-linear-time- approximation-algorithms-for-optimal-transport-via-sinkhorn- iteration.  12   THE ENTROPIC PENALTY IN LINEAR PROGRAMMING  Proof [Proof of Lemma 8] By definition h(ρ) = ρ log 1 that  ρ + (1 − ρ) log 1  1−ρ , so it suffices to show  (1 − ρ) ρ  log  1 1 − ρ  ≤ 1  ∀ρ ∈ [0, 1] .  (1−ρ) ρ  This inequality is easily verified by noting that the derivative of the left side is nonpositive on (0, 1) and limρ→0+ Proof [Proof of Lemma 15] It is trivial to see that all X ∈ B satisfy (cid:80) any X ∈ B,  ij Xij = n, so R1 = n. For  1−ρ = 1.  log 1  H(X) =  Xij log  1 Xij  (cid:88)  ij (cid:88)  i (cid:88)  i  =  =  (cid:88)  j  Xij log  1 Xij  H(Xi) ,  where Xi denotes the ith row of X. Since each row of X is a nonnegative vector of dimension n whose entries sum to 1, for each 1 ≤ i ≤ n the bound 0 ≤ H(Xi) ≤ log n holds. Therefore 0 ≤ H(X) ≤ n log n for all X ∈ B, which proves that RH ≤ n log n.  This work was supported in part by NSF Graduate Research Fellowship DGE-1122374. The author would like to thank J. Altschuler and P. Rigollet for useful discussions, as well as the anonymous referees for their suggestions.  Acknowledgments  References  David J. Aldous. The ζ(2) limit in the random assignment problem. Random Structures Algorithms, 18(4):381-418, 2001. ISSN 1042-9832. URL https://doi.org/10.1002/rsa.1015.  Zeyuan Allen-Zhu, Yuanzhi Li, Rafael Oliveira, and Avi Wigderson. Much faster algorithms In Chris Umans, editor, 58th IEEE Annual Symposium on Foundations for matrix scaling. of Computer Science, FOCS 2017, Berkeley, CA, USA, October 15-17, 2017, pages 890-901. IEEE Computer Society, 2017. ISBN 978-1-5386-3464-6. doi: 10.1109/FOCS.2017.87. URL https://doi.org/10.1109/FOCS.2017.87.  Jason Altschuler, Jonathan Weed, and Philippe Rigollet. Near-linear time approximation algo- rithms for optimal transport via sinkhorn iteration. In Isabelle Guyon, Ulrike von Luxburg, Samy Bengio, Hanna M. Wallach, Rob Fergus, S. V. N. Vishwanathan, and Roman Garnett, editors, Advances in Neural Information Processing Systems 30: Annual Conference on Neural Information Processing Systems 2017, 4-9 December 2017, Long Beach, CA, USA, pages 1961- 1971, 2017. URL http://papers.nips.cc/paper/6792-near-linear-time- approximation-algorithms-for-optimal-transport-via-sinkhorn- iteration. THE ENTROPIC PENALTY IN LINEAR PROGRAMMING  Jean-Yves Audibert, Sébastien Bubeck, and Gábor Lugosi. Regret in online combinatorial opti-  mization. Mathematics of Operations Research, 39(1):31-45, 2013.  Jean-David Benamou, Guillaume Carlier, Marco Cuturi, Luca Nenna, and Gabriel Peyré.  Itera- tive bregman projections for regularized transportation problems. SIAM Journal on Scientific Computing, 37(2):A1111-A1138, 2015.  Jean-David Benamou, Guillaume Carlier, and Luca Nenna. A numerical method to solve multi- marginal optimal transport problems with Coulomb cost. In Splitting Methods in Communication, Imaging, Science, and Engineering, Sci. Comput., pages 577-601. Springer, Cham, 2016.  Mathieu Blondel, Vivien Seguy, and Antoine Rolet. Smooth and sparse optimal transport. arXiv  preprint arXiv:1710.06276, 2017.  bridge, 2004. ISBN 0-521-83378-7.  Stephen Boyd and Lieven Vandenberghe. Convex Optimization. Cambridge University Press, Cam-  L. M. Brègman. A relaxation method of finding a common point of convex sets and its application to the solution of problems in convex programming. Ž. Vyˇcisl. Mat. i Mat. Fiz., 7:620-631, 1967. ISSN 0044-4669.  Richard A. Brualdi. Combinatorial Matrix Classes, volume 108 of Encyclopedia of Mathematics and its Applications. Cambridge University Press, Cambridge, 2006. ISBN 978-0-521-86565- 4; 0-521-86565-4. doi: 10.1017/CBO9780511721182. URL http://dx.doi.org/10. 1017/CBO9780511721182.  Sébastien Bubeck. Convex optimization: Algorithms and complexity. Foundations and Trends in Machine Learning, 8(3-4):231-357, 2015. doi: 10.1561/2200000050. URL https://doi. org/10.1561/2200000050.  Guillaume Carlier, Vincent Duval, Gabriel Peyré, and Bernhard Schmitzer. Convergence of entropic schemes for optimal transport and gradient ﬂows. SIAM Journal on Mathematical Analysis, 49 (2):1385-1418, 2017.  Nicolò Cesa-Bianchi and Gábor Lugosi. Prediction, Learning, and Games. Cambridge Uni- ISBN 978-0-521-84108-5; 0-521-84108-9. doi: 10.1017/  versity Press, Cambridge, 2006. CBO9780511546921. URL http://dx.doi.org/10.1017/CBO9780511546921.  Stéphane Chrétien and Alfred O. Hero, III. Kullback proximal algorithms for maximum-likelihood estimation. IEEE Trans. Inform. Theory, 46(5):1800-1810, 2000. ISSN 0018-9448. doi: 10. 1109/18.857792. URL http://dx.doi.org/10.1109/18.857792.  Michael B. Cohen, Aleksander M ˛adry, Dimitris Tsipras, and Adrian Vladu. Matrix scaling and bal- ancing via box constrained newton’s method and interior point methods. In Chris Umans, editor, 58th IEEE Annual Symposium on Foundations of Computer Science, FOCS 2017, Berkeley, CA, USA, October 15-17, 2017, pages 902-913. IEEE Computer Society, 2017. ISBN 978-1-5386- 3464-6. doi: 10.1109/FOCS.2017.88. URL https://doi.org/10.1109/FOCS.2017. 88. THE ENTROPIC PENALTY IN LINEAR PROGRAMMING  R. Cominetti and J. San Martín. Asymptotic analysis of the exponential penalty trajectory in linear programming. Math. Programming, 67(2, Ser. A):169-187, 1994. ISSN 0025-5610. doi: 10. 1007/BF01582220. URL http://dx.doi.org/10.1007/BF01582220.  Marco Cuturi. Sinkhorn distances: Lightspeed computation of optimal transport. In Christopher J. C. Burges, Léon Bottou, Zoubin Ghahramani, and Kilian Q. Weinberger, editors, Advances in Neural Information Processing Systems 26: 27th Annual Conference on Neural Information Pro- cessing Systems 2013. Proceedings of a meeting held December 5-8, 2013, Lake Tahoe, Nevada, United States., pages 2292-2300, 2013. URL http://papers.nips.cc/paper/4927- sinkhorn-distances-lightspeed-computation-of-optimal-transport.  Marco Cuturi and Arnaud Doucet. Fast computation of Wasserstein barycenters. In Proceedings of the 31th International Conference on Machine Learning, ICML 2014, Beijing, China, 21-26 June 2014, volume 32 of JMLR Workshop and Conference Proceedings, pages 685-693. JMLR.org, 2014. URL http://jmlr.org/proceedings/papers/v32/cuturi14.html.  Andreea Denitiu, Stefania Petra, Claudius Schnörr, and Christoph Schnörr. An entropic perturbation approach to TV-minimization for limited-data tomography. In Elena Barcucci, Andrea Frosini, and Simone Rinaldi, editors, Discrete Geometry for Computer Imagery - 18th IAPR International Conference, DGCI 2014, Siena, Italy, September 10-12, 2014. Proceedings, volume 8668 of Lecture Notes in Computer Science, pages 262-274. Springer, 2014. ISBN 978-3-319-09954-5. doi: 10.1007/978-3-319-09955-2_22. URL https://doi.org/10.1007/978-3-319- 09955-2_22.  Arnaud Dessein, Nicolas Papadakis, and Jean-Luc Rouas. Regularized optimal transport and the  ROT mover’s distance. arXiv preprint arXiv:1610.06447, 2016.  Simone Di Marino, Augusto Gerolin, and Luca Nenna. Optimal transportation theory with repulsive costs. In Topological optimization and optimal transport, volume 17 of Radon Ser. Comput. Appl. Math., pages 204-256. De Gruyter, Berlin, 2017.  Juan Díaz, Tomás Rau, and Jorge Rivera. A matching estimator based on a bilevel optimization  problem. Review of Economics and Statistics, 97(4):803-812, 2015.  S. C. Fang. An unconstrained convex programming view of linear programming. Z. Oper. Res., 36 (2):149-161, 1992. ISSN 0340-9422. URL https://doi.org/10.1007/BF01417214.  S.-C. Fang, J. R. Rajasekera, and H.-S. J. Tsao. Entropy optimization and mathematical pro- gramming, volume 8 of International Series in Operations Research & Management Science. ISBN 0-7923-9939-0. URL https: Kluwer Academic Publishers, Boston, MA, 1997. //doi.org/10.1007/978-1-4615-6131-6.  Shu-Cherng Fang and H-S Jacob Tsao. Linear programming with entropic perturbation. Zeitschrift  für Operations Research, 37(2):171-186, 1993.  Yoav Freund and Robert E Schapire. A decision-theoretic generalization of on-line learning and an  application to boosting. Journal of Computer and System Sciences, 55(1):119-139, 1997. THE ENTROPIC PENALTY IN LINEAR PROGRAMMING  Aude Genevay, Marco Cuturi, Gabriel Peyré, and Francis R. Bach. Stochastic optimization for large-scale optimal transport. In Daniel D. Lee, Masashi Sugiyama, Ulrike von Luxburg, Is- abelle Guyon, and Roman Garnett, editors, Advances in Neural Information Processing Systems 29: Annual Conference on Neural Information Processing Systems 2016, December 5-10, 2016, Barcelona, Spain, pages 3432-3440, 2016. URL http://papers.nips.cc/paper/ 6566-stochastic-optimization-for-large-scale-optimal-transport.  David P Helmbold and Manfred K Warmuth. Learning permutations with exponential weights.  Journal of Machine Learning Research, 10(Jul):1705-1736, 2009.  Edwin T Jaynes. On the rationale of maximum-entropy methods. Proceedings of the IEEE, 70(9):  939-952, 1982.  Anatoli Juditsky, Philippe Rigollet, and Alexandre Tsybakov. Learning by mirror averaging. Ann.  Statist., 36(5):2183-2206, 2008. ISSN 0090-5364.  Wouter M. Koolen, Manfred K. Warmuth, and Jyrki Kivinen. Hedging structured concepts. In Adam Tauman Kalai and Mehryar Mohri, editors, COLT 2010 - The 23rd Conference on Learning Theory, Haifa, Israel, June 27-29, 2010, pages 93-105. Omnipress, 2010. ISBN 978-0-9822529-2-5. URL http://colt2010.haifa.il.ibm.com/papers/ COLT2010proceedings.pdf#page=101.  JJ Kosowsky and Alan L Yuille. The invisible hand algorithm: Solving the assignment problem  with statistical physics. Neural Networks, 7(3):477-490, 1994.  Christian Léonard. A survey of the Schrödinger problem and some of its connections with optimal transport. Discrete Contin. Dyn. Syst., 34(4):1533-1574, 2014. ISSN 1078-0947. doi: 10.3934/ dcds.2014.34.1533. URL http://dx.doi.org/10.3934/dcds.2014.34.1533.  Giulia Luise, Alessandro Rudi, Massimiliano Pontil, and Carlo Ciliberto. Differential prop- arXiv preprint  erties of Sinkhorn approximation for learning with Wasserstein distance. arXiv:1805.11897, 2018.  Marc Mézard and Andrea Montanari.  Information, physics, and computation. Oxford Grad- uate Texts. Oxford University Press, Oxford, 2009. doi: 10. 1093/acprof:oso/9780198570837.001.0001. URL https://doi.org/10.1093/acprof: oso/9780198570837.001.0001.  ISBN 978-0-19-857083-7.  Aleksander M ˛adry. Navigating central path with electrical ﬂows: From ﬂows to matchings, and back. In 54th Annual IEEE Symposium on Foundations of Computer Science, FOCS 2013, 26-29 October, 2013, Berkeley, CA, USA, pages 253-262. IEEE Computer Society, 2013. ISBN 978- 0-7695-5135-7. doi: 10.1109/FOCS.2013.35. URL https://doi.org/10.1109/FOCS. 2013.35.  Gabriel Peyré and Marco Cuturi. Computational optimal transport. Book draft, 2017.  Philippe Rigollet. Personal communication, 2017. THE ENTROPIC PENALTY IN LINEAR PROGRAMMING  Philippe Rigollet and Alexandre Tsybakov. Exponential screening and optimal rates of sparse esti- mation. Ann. Statist., 39(2):731-771, 2011. ISSN 0090-5364. doi: 10.1214/10-AOS854. URL http://dx.doi.org/10.1214/10-AOS854.  Bernhard Schmitzer. Stabilized sparse scaling algorithms for entropy regularized transport prob-  lems. arXiv preprint arXiv:1610.06519, 2016.  Alexander Schrijver. Combinatorial optimization. Polyhedra and efficiency. Vol. A, volume 24 of  Algorithms and Combinatorics. Springer-Verlag, Berlin, 2003. ISBN 3-540-44389-4.  Erwin Schrödinger. Über die Umkehrung der Naturgesetze. Angewandte Chemie, 44(30):636-636,  1931.  Meisam Sharify, Stéphane Gaubert, and Laura Grigori. Solution of the optimal assignment problem  by diagonal scaling algorithms. arXiv preprint arXiv:1104.3830, 2011.  Richard Sinkhorn. Diagonal equivalence to matrices with prescribed row and column sums. The  American Mathematical Monthly, 74(4):402-405, 1967.  Justin Solomon, Fernando De Goes, Gabriel Peyré, Marco Cuturi, Adrian Butscher, Andy Nguyen, Tao Du, and Leonidas Guibas. Convolutional wasserstein distances: Efficient optimal transporta- tion on geometric domains. ACM Transactions on Graphics (TOG), 34(4):66, 2015."}