{"1": "Jacob D. Abernethy and Rafael M. Frongillo. A characterization of scoring rules for linear proper-  ties. In Proceedings of the 25th Annual Conference on Learning Theory, 2012.  Peter L. Bartlett, Michael Jordan, and Jon McAuliffe. Convexity, classification and risk bounds.  Journal of the American Statistical Association, 101(473):138-156, 2006.  David Buffoni, Cl´ement Calauz`enes, Patrick Gallinari, and Nicolas Usunier. Learning scoring func- tions with order-preserving losses and standardized supervision. In Proceedings of the 28th In- ternational Conference on Machine Learning, 2011.  Cl´ement Calauz`enes, Nicolas Usunier, and Patrick Gallinari. On the (non-)existence of convex, calibrated surrogate losses for ranking. In Advances in Neural Information Processing Systems, 2012.  David Cossock and Tong Zhang. Statistical analysis of Bayes optimal subset ranking. IEEE Trans-  actions on Information Theory, 54(11):5140-5154, 2008.  John Duchi, Lester Mackey, and Michael Jordan. On the consistency of ranking algorithms. In  Proceedings of the 27th International Conference on Machine Learning, 2010.  Rafael Frongillo and Ian Kash. Vector-valued property elicitation.  In Proceedings of the 28th  Annual Conference on Learning Theory, 2015.  Tilmann Gneiting. Quantiles as optimal point forecasts. International Journal of Forecasting, 27  (2):197-207, 2011.  Tilmann Gneiting and Adrian E. Raftery. Strictly proper scoring rules, prediction, and estimation.  Journal of the American Statistical Association, 102(477):359-378, 2007.  Kyrill Grant and Tilmann Gneiting. Consistent scoring functions for quantiles. In From Probability to Statistics and Back: High-Dimensional Models and Processes-A Festschrift in Honor of Jon A. Wellner, pages 163-173. Institute of Mathematical Statistics, 2013.  Nicholas M. Kiefer.  Incentive-compatible  elicitation of quantiles,  2010.  URL  https://www.american.edu/cas/economics/info-metrics/pdf/upload/ Working-Paper-Kiefer.pdf.  Nicolas Lambert and Yoav Shoham. Eliciting truthful answers to multiple-choice questions.  In  ACM Conference on Electronic Commerce, 2009.  Nicolas S. Lambert, David M. Pennock, and Yoav Shoham. Eliciting properties of probability  distributions. In Proceedings of the 9th ACM Conference on Electronic Commerce, 2008.  Yanyan Lan, Jiafeng Guo, Xueqi Cheng, and Tie-Yan Liu. Statistical consistency of ranking meth- In Advances in Neural Information Processing  ods in a rank-differentiable probability space. Systems, 2012.  Harish G. Ramaswamy and Shivani Agarwal. Classification calibration dimension for general mul-  ticlass losses. In Advances in Neural Information Processing Systems, 2012.  13   ON CONSISTENT SURROGATE RISK MINIMIZATION AND PROPERTY ELICITATION  References  Jacob D. Abernethy and Rafael M. Frongillo. A characterization of scoring rules for linear proper-  ties. In Proceedings of the 25th Annual Conference on Learning Theory, 2012.  Peter L. Bartlett, Michael Jordan, and Jon McAuliffe. Convexity, classification and risk bounds.  Journal of the American Statistical Association, 101(473):138-156, 2006.  David Buffoni, Cl´ement Calauz`enes, Patrick Gallinari, and Nicolas Usunier. Learning scoring func- tions with order-preserving losses and standardized supervision. In Proceedings of the 28th In- ternational Conference on Machine Learning, 2011.  Cl´ement Calauz`enes, Nicolas Usunier, and Patrick Gallinari. On the (non-)existence of convex, calibrated surrogate losses for ranking. In Advances in Neural Information Processing Systems, 2012.  David Cossock and Tong Zhang. Statistical analysis of Bayes optimal subset ranking. IEEE Trans-  actions on Information Theory, 54(11):5140-5154, 2008.  John Duchi, Lester Mackey, and Michael Jordan. On the consistency of ranking algorithms. In  Proceedings of the 27th International Conference on Machine Learning, 2010.  Rafael Frongillo and Ian Kash. Vector-valued property elicitation.  In Proceedings of the 28th  Annual Conference on Learning Theory, 2015.  Tilmann Gneiting. Quantiles as optimal point forecasts. International Journal of Forecasting, 27  (2):197-207, 2011.  Tilmann Gneiting and Adrian E. Raftery. Strictly proper scoring rules, prediction, and estimation.  Journal of the American Statistical Association, 102(477):359-378, 2007.  Kyrill Grant and Tilmann Gneiting. Consistent scoring functions for quantiles. In From Probability to Statistics and Back: High-Dimensional Models and Processes-A Festschrift in Honor of Jon A. Wellner, pages 163-173. Institute of Mathematical Statistics, 2013.  Nicholas M. Kiefer.  Incentive-compatible  elicitation of quantiles,  2010.  URL  https://www.american.edu/cas/economics/info-metrics/pdf/upload/ Working-Paper-Kiefer.pdf.  Nicolas Lambert and Yoav Shoham. Eliciting truthful answers to multiple-choice questions.  In  ACM Conference on Electronic Commerce, 2009.  Nicolas S. Lambert, David M. Pennock, and Yoav Shoham. Eliciting properties of probability  distributions. In Proceedings of the 9th ACM Conference on Electronic Commerce, 2008.  Yanyan Lan, Jiafeng Guo, Xueqi Cheng, and Tie-Yan Liu. Statistical consistency of ranking meth- In Advances in Neural Information Processing  ods in a rank-differentiable probability space. Systems, 2012.  Harish G. Ramaswamy and Shivani Agarwal. Classification calibration dimension for general mul-  ticlass losses. In Advances in Neural Information Processing Systems, 2012. AGARWAL AGARWAL  Harish G. Ramaswamy and Shivani Agarwal. Convex calibration dimension for multiclass loss  matrices. Journal of Machine Learning Research. To appear, 2015.  Harish G. Ramaswamy, Shivani Agarwal, and Ambuj Tewari. Convex calibrated surrogates for low- rank loss matrices with applications to subset ranking losses. In Advances in Neural Information Processing Systems, 2013.  Pradeep Ravikumar, Ambuj Tewari, and Eunho Yang. On NDCG consistency of listwise ranking In Proceedings of the 14th International Conference on Artificial Intelligence and  methods. Statistics, 2011.  Leonard J. Savage. Elicitation of personal probabilities and expectations. Journal of the American  Statistical Association, 66(336):783-801, 1971.  Mark J. Schervish. A general method for comparing probability assessors. The Annals of Statistics,  17(4):1856-1879, 1989.  Mark J. Schervish, Joseph B. Kadane, and Teddy Seidenfeld. Characterization of proper and strictly  proper scoring rules for quantiles. Preprint, Carnegie Mellon University, March 2012.  Ingo Steinwart. How to compare different loss functions and their risks. Constructive Approxima-  tion, 26:225-287, 2007.  Ingo Steinwart, Chlo´e Pasin, Robert Williamson, and Siyu Zhang. Elicitation and identification of  properties. In Proceedings of the 27th Annual Conference on Learning Theory, 2014.  Ambuj Tewari and Peter L. Bartlett. On the consistency of multiclass classification methods. Journal  of Machine Learning Research, 8:1007-1025, 2007.  Elodie Vernet, Robert C. Williamson, and Mark D. Reid. Composite multiclass losses. In Advances  in Neural Information Processing Systems, 2011.  Fen Xia, Tie-Yan Liu, Jue Wang, Wensheng Zhang, and Hang Li. Listwise approach to learning to rank: Theory and algorithm. In Proceedings of the 25th International Conference on Machine Learning, 2008.  Tong Zhang. Statistical behavior and consistency of classification methods based on convex risk  minimization. Annals of Statistics, 32(1):56-134, 2004a.  Tong Zhang. Statistical analysis of some multi-category large margin classification methods. Jour-  nal of Machine Learning Research, 5:1225-1251, 2004b. ON CONSISTENT SURROGATE RISK MINIMIZATION AND PROPERTY ELICITATION"}