{"1": "Rudolf Ahlswede and Andreas Winter. Strong converse for identification via quantum channels.  IEEE Transactions on Information Theory, 48(3):569-579, 2002.  Maria-Florina Balcan, Simon S. Du, Yining Wang, and Adams W. Yu. An improved gap-dependency analysis of the noisy power method. In Conference on Learning Theory, pages 284-309, 2016.  Peter J. Bickel and Elizaveta Levina. Regularized estimation of large covariance matrices. The  Annals of Statistics, 36(1):199-227, 2008.  Brendan O. Bradley and Murad S. Taqqu. Financial risk and heavy tails. Handbook of Heavy-Tailed  Distributions in Finance, ST Rachev, ed. Elsevier, Amsterdam, pages 35-103, 2003.  T. Tony Cai, Cun-Hui Zhang, and Harrison H. Zhou. Optimal rates of convergence for covariance  matrix estimation. Ann. Statist., 38(4):2118-2144, 2010. doi: 10.1214/09-AOS752.  Norm A. Campbell. Robust procedures in multivariate analysis I: Robust covariance estimation.  Applied statistics, pages 231-237, 1980.  Andrea Caponnetto and Ernesto De Vito. Optimal rates for the regularized least-squares algorithm.  Foundations of Computational Mathematics, 7(3):331-368, 2007.  Jerome Friedman, Trevor Hastie, and Robert Tibshirani. The elements of statistical learning, volume 1.  Springer series in statistics New York, NY, USA:, 2001.  Gene H. Golub and Charles F. Van Loan. Matrix computations, volume 3. JHU Press, 2012.  Nathan Halko, Per-Gunnar Martinsson, and Joel A. Tropp. Finding structure with randomness: Probabilistic algorithms for constructing approximate matrix decompositions. SIAM review, 53(2): 217-288, 2011.  Lars P. Hansen. Large sample properties of generalized method of moments estimators. Econometrica:  Journal of the Econometric Society, pages 1029-1054, 1982.  Moritz Hardt and Eric Price. The noisy power method: A meta algorithm with applications. In  Advances in Neural Information Processing Systems, pages 2861-2869, 2014.  Daniel Hsu, Sham M. Kakade, and Tong Zhang. Random design analysis of ridge regression. The  Journal of Machine Learning Research, 23(9):1-24, 2012.  Ian Jolliffe. Principal component analysis. In International encyclopedia of statistical science, pages  1094-1096. Springer, 2002.  2841-2871, 2014.  Bryan Kelly and Hao Jiang. Tail risk and asset prices. The Review of Financial Studies, 27(10):  Vladimir Koltchinskii and Karim Lounici. Concentration inequalities and moment bounds for sample  covariance operators. Bernoulli, 23(1):110-133, 02 2017.  Michel Ledoux and Michel Talagrand. Probability in Banach Spaces: isoperimetry and processes.  Springer Science & Business Media, 2013.  13   AFFINE INVARIANT COVARIANCE ESTIMATION FOR HEAVY-TAILED DISTRIBUTIONS  References  Rudolf Ahlswede and Andreas Winter. Strong converse for identification via quantum channels.  IEEE Transactions on Information Theory, 48(3):569-579, 2002.  Maria-Florina Balcan, Simon S. Du, Yining Wang, and Adams W. Yu. An improved gap-dependency analysis of the noisy power method. In Conference on Learning Theory, pages 284-309, 2016.  Peter J. Bickel and Elizaveta Levina. Regularized estimation of large covariance matrices. The  Annals of Statistics, 36(1):199-227, 2008.  Brendan O. Bradley and Murad S. Taqqu. Financial risk and heavy tails. Handbook of Heavy-Tailed  Distributions in Finance, ST Rachev, ed. Elsevier, Amsterdam, pages 35-103, 2003.  T. Tony Cai, Cun-Hui Zhang, and Harrison H. Zhou. Optimal rates of convergence for covariance  matrix estimation. Ann. Statist., 38(4):2118-2144, 2010. doi: 10.1214/09-AOS752.  Norm A. Campbell. Robust procedures in multivariate analysis I: Robust covariance estimation.  Applied statistics, pages 231-237, 1980.  Andrea Caponnetto and Ernesto De Vito. Optimal rates for the regularized least-squares algorithm.  Foundations of Computational Mathematics, 7(3):331-368, 2007.  Jerome Friedman, Trevor Hastie, and Robert Tibshirani. The elements of statistical learning, volume 1.  Springer series in statistics New York, NY, USA:, 2001.  Gene H. Golub and Charles F. Van Loan. Matrix computations, volume 3. JHU Press, 2012.  Nathan Halko, Per-Gunnar Martinsson, and Joel A. Tropp. Finding structure with randomness: Probabilistic algorithms for constructing approximate matrix decompositions. SIAM review, 53(2): 217-288, 2011.  Lars P. Hansen. Large sample properties of generalized method of moments estimators. Econometrica:  Journal of the Econometric Society, pages 1029-1054, 1982.  Moritz Hardt and Eric Price. The noisy power method: A meta algorithm with applications. In  Advances in Neural Information Processing Systems, pages 2861-2869, 2014.  Daniel Hsu, Sham M. Kakade, and Tong Zhang. Random design analysis of ridge regression. The  Journal of Machine Learning Research, 23(9):1-24, 2012.  Ian Jolliffe. Principal component analysis. In International encyclopedia of statistical science, pages  1094-1096. Springer, 2002.  2841-2871, 2014.  Bryan Kelly and Hao Jiang. Tail risk and asset prices. The Review of Financial Studies, 27(10):  Vladimir Koltchinskii and Karim Lounici. Concentration inequalities and moment bounds for sample  covariance operators. Bernoulli, 23(1):110-133, 02 2017.  Michel Ledoux and Michel Talagrand. Probability in Banach Spaces: isoperimetry and processes.  Springer Science & Business Media, 2013. AFFINE INVARIANT COVARIANCE ESTIMATION FOR HEAVY-TAILED DISTRIBUTIONS  Oleg V. Lepskii. On a problem of adaptive estimation in Gaussian white noise. Theory of Probability  & Its Applications, 35(3):454-466, 1991.  Hendrik P. Lopuhaa and Peter J. Rousseeuw. Breakdown points of affine equivariant estimators of multivariate location and covariance matrices. The Annals of Statistics, 19(1):229-248, 1991.  Karim Lounici. High-dimensional covariance matrix estimation with missing observations. Bernoulli,  20(3):1029-1058, 08 2014.  Harry Markowitz. Portfolio selection. The Journal of Finance, 7(1):77-91, 1952.  Shahar Mendelson and Nikita Zhivotovskiy. Robust covariance estimation under L4 − L2 norm  equivalence. arXiv:1809.10462, 2018.  Stanislav Minsker. Sub-gaussian estimators of the mean of a random matrix with heavy-tailed entries.  The Annals of Statistics, 46(6A):2871-2903, 2018.  Stanislav Minsker and Xiaohan Wei. Estimation of the covariance structure of heavy-tailed distribu-  tions. arXiv:1708.00502, 2017.  Ioannis Mitliagkas, Constantine Caramanis, and Prateek Jain. Memory limited, streaming pca. In  Advances in Neural Information Processing Systems, pages 2886-2894, 2013.  Roberto I. Oliveira. Sums of random Hermitian matrices and an inequality by Rudelson. Electron.  Commun. Probab., 15(26):203-212, 2010.  Roberto I. Oliveira. The lower tail of random quadratic forms with applications to ordinary least  squares. Probability Theory and Related Fields, 166(3-4):1175-1194, 2016.  Peter J. Rousseeuw and Katrien Van Driessen. A fast algorithm for the minimum covariance  determinant estimator. Technometrics, 41(3):212-223, 1999.  Joel A. Tropp. User-friendly tail bounds for sums of random matrices. Foundations of Computational  Mathematics, 12(4):389-434, 2012.  Joel A. Tropp. An introduction to matrix concentration inequalities. Foundations and Trends in  Machine Learning, 8(1-2):1-230, 2015.  Roman Vershynin. Introduction to the non-asymptotic analysis of random matrices. In Compressed  Sensing: Theory and Applications, pages 210-268. Cambridge University Press, 2012.  Xiaohan Wei and Stanislav Minsker. Estimation of the covariance structure of heavy-tailed distribu-  tions. In Advances in Neural Information Processing Systems, pages 2859-2868, 2017. AFFINE INVARIANT COVARIANCE ESTIMATION FOR HEAVY-TAILED DISTRIBUTIONS"}