{"1": "N. Alon, C. Avin, M. Kouck´y, G. Kozma, Z. Lotker, and M. Tuttle. Many random walks  are faster than one. Comb. Probab. Comput., 20(4):481-502, 2011.  J. Basilico and T. Hofmann. Unifying collaborative and content-based filtering. In Proc of  the 21st ICML, ICML, 2004.  graphs. In COLT 2004, 2004.  M. Belkin, I. Matveeva, and P. Niyogi. Regularization and semi-supervised learning on large  A. Ben-Dor, R. Shamir, and Z. Yakhini. Clustering gene expression patterns. Journal of  Computational Biology, 6(3/4), 1999.  A. Broder. Generating random spanning trees. In Proceedings of the 30th Annual Symposium on Foundations of Computer Science, SFCS ’89, pages 442-447. IEEE Computer Society, 1989.  C. Brunner, A. Fischer, K. Luig, and T. Thies. Pairwise support vector machines and their application to large scale problems. Journal of Machine Learning Research, 13:2279-2292, 2012.  E. Candes and B. Recht. Exact matrix completion via convex optimization. Foundations  of Computational Mathematics, 9(6):717-772, 2009.  E. Candes and T. Tao. The power of convex relaxation: near-optimal matrix completion.  IEEE Transactions on Information Theory, 56:2053-2080, 2010.  Q. Cao, Z. Guo, and Y. Ying. Generalization bounds for metric and similarity learning.  CoRR, abs/1207.5437, 2012.  G. Cavallanti, N. Cesa-Bianchi, and C. Gentile. Linear algorithms for online multitask  classification. Journal of Machine Learning Research, 11:2901-2934, 2010.  N. Cesa-Bianchi, C. Gentile, and F. Vitale. Fast and optimal prediction on a labeled tree.  In Proceedings of the 22nd Annual Conference on Learning. Omnipress, 2009.  N. Cesa-Bianchi, C Gentile, F. Vitale, and G. Zappella. Random spanning trees and the prediction of weighted graphs. In Proceedings of the 27th International Conference on Machine Learning (27th ICML), pages 175-182, 2010a.  N. Cesa-Bianchi, C. Gentile, F. Vitale, and G. Zappella. Active learning on trees and graphs. In Proceedings of the 23rd Conference on Learning Theory (23rd COLT), pages 320-332, 2010b.  T. H. Cormen, C. Stein, R. L. Rivest, and C. E. Leiserson. Introduction to Algorithms.  McGraw-Hill Higher Education, 2001. ISBN 0070131511.  A. Demiriz, K. Bennett, and M.J. Embrechts. Semi-supervised clustering using genetic algorithms. In In Artificial Neural Networks in Engineering (ANNIE-99), pages 809-814, 1999.  14   Gentile Herbster Pasteris  References  N. Alon, C. Avin, M. Kouck´y, G. Kozma, Z. Lotker, and M. Tuttle. Many random walks  are faster than one. Comb. Probab. Comput., 20(4):481-502, 2011.  J. Basilico and T. Hofmann. Unifying collaborative and content-based filtering. In Proc of  the 21st ICML, ICML, 2004.  graphs. In COLT 2004, 2004.  M. Belkin, I. Matveeva, and P. Niyogi. Regularization and semi-supervised learning on large  A. Ben-Dor, R. Shamir, and Z. Yakhini. Clustering gene expression patterns. Journal of  Computational Biology, 6(3/4), 1999.  A. Broder. Generating random spanning trees. In Proceedings of the 30th Annual Symposium on Foundations of Computer Science, SFCS ’89, pages 442-447. IEEE Computer Society, 1989.  C. Brunner, A. Fischer, K. Luig, and T. Thies. Pairwise support vector machines and their application to large scale problems. Journal of Machine Learning Research, 13:2279-2292, 2012.  E. Candes and B. Recht. Exact matrix completion via convex optimization. Foundations  of Computational Mathematics, 9(6):717-772, 2009.  E. Candes and T. Tao. The power of convex relaxation: near-optimal matrix completion.  IEEE Transactions on Information Theory, 56:2053-2080, 2010.  Q. Cao, Z. Guo, and Y. Ying. Generalization bounds for metric and similarity learning.  CoRR, abs/1207.5437, 2012.  G. Cavallanti, N. Cesa-Bianchi, and C. Gentile. Linear algorithms for online multitask  classification. Journal of Machine Learning Research, 11:2901-2934, 2010.  N. Cesa-Bianchi, C. Gentile, and F. Vitale. Fast and optimal prediction on a labeled tree.  In Proceedings of the 22nd Annual Conference on Learning. Omnipress, 2009.  N. Cesa-Bianchi, C Gentile, F. Vitale, and G. Zappella. Random spanning trees and the prediction of weighted graphs. In Proceedings of the 27th International Conference on Machine Learning (27th ICML), pages 175-182, 2010a.  N. Cesa-Bianchi, C. Gentile, F. Vitale, and G. Zappella. Active learning on trees and graphs. In Proceedings of the 23rd Conference on Learning Theory (23rd COLT), pages 320-332, 2010b.  T. H. Cormen, C. Stein, R. L. Rivest, and C. E. Leiserson. Introduction to Algorithms.  McGraw-Hill Higher Education, 2001. ISBN 0070131511.  A. Demiriz, K. Bennett, and M.J. Embrechts. Semi-supervised clustering using genetic algorithms. In In Artificial Neural Networks in Engineering (ANNIE-99), pages 809-814, 1999. Similarity Prediction of Networked Data  C. Gentile. The robustness of the p-norm algorithms. Machine Learning, 53:265-299, 2003.  D. Gross. Recovering low-rank matrices from few coeﬃcients in any basis. IEEE Transac-  tions on Information Theory, 57/3:1548-1566, 2011.  J. L. Gross and J. Yellen. Handbook of graph theory. CRC Press, 2003. ISBN 1584880902.  A. J. Grove, N. Littlestone, and D. Schuurmans. General convergence results for linear  discriminant updates. Machine Learning, 43:173-210, 2001.  E. Hazan, S. Kale, and S. Shalev-Shwartz. Near-optimal algorithms for online matrix prediction. In Proceedings of the 25th Annual Conference on Learning Theory (COLT’12), 2012.  M. Hein, J.Y. Audibert, and U. von Luxburg. Graph laplacians and their convergence on random neighborhood graphs. Journal of Machine Learning Research, 8:1325-1368, 2007.  M. Herbster. Exploiting cluster-structure to predict the labeling of a graph. In Proceedings of the 19th International Conference on Algorithmic Learning Theory, pages 54-69, 2008.  M. Herbster and G. Lever. Predicting the labelling of a graph via minimum p-seminorm In Proceedings of the 22nd Annual Conference on Learning Theory  interpolation. (COLT’09), 2009.  M. Herbster and M. Pontil. Prediction on a graph with a perceptron. In Advances in Neural Information Processing Systems 19, pages 577-584. MIT Press, Cambridge, MA, 2007.  M. Herbster and M. K. Warmuth. Tracking the best expert. Machine Learning, 32(2):  151-178, 1998. ISSN 0885-6125.  M. Herbster, M. Pontil, and L. Wainer. Online learning over graphs. In ICML ’05: Pro- ceedings of the 22nd international conference on Machine learning, pages 305-312, New York, NY, USA, 2005. ACM.  M. Herbster, M. Pontil, and S. R. Galeano. Fast prediction on a tree.  In Proc. of the 22nd Annual Conference on Neural Information Processing Systems, pages 657-664. MIT Press, 2008.  M. Herbster, G. Lever, and M. Pontil. Online prediction on large diameter graphs.  In Advances in Neural Information Processing Systems (NIPS 22), pages 649-656. MIT Press, 2009.  M. Jerrum and A. Sinclair. Polynomial-time approximation algorithms for the ising model.  SIAM J. Comput., 22(5):1087-1116, 1993.  S. M. Kakade, S. Shalev-Shwartz, and A. Tewari. Regularization techniques for learning  with matrices. The Journal of Machine Learning Research, pages 1865-1890, 2012.  V. Koltchinskii and P. Rangel. Low rank estimation of similarities on graphs. CoRR, 2012. Gentile Herbster Pasteris  V. Koltchinskii, K. Lounici, and A. Tsybakov. Nuclear norm penalization and optimal rates  for noisy matrix completion. Annals of Statistics, 39(5):2302-2329, 2011.  R. Kondor, N. Shervashidze, and K. M. Borgwardt. The graphlet spectrum. In ICML 2009,  2009.  Z. Li, J. Liu, and X. Tang. Pairwise constraint propagation by semidefinite programming  for semi-supervised classification. In Proc of the 25th ICML, ICML, 2008.  N. Littlestone. Learning quickly when irrelevant attributes abound: A new linear-threshold  algorithm. Machine Learning, 2:285-318, April 1988.  N. Littlestone and M. K. Warmuth. The weighted majority algorithm. Inf. Comput., 108  (2):212-261, 1994.  R. Lyons and Y. Peres. Probability on Trees and Networks. Cambridge University Press, 2012. In preparation. Current version available at http://mypage.iu.edu/~rdlyons/.  A. Maurer. Learning similarity with operator-valued large-margin classifiers. Journal of  Machine Learning Research, 9:1049-1082, 2008.  S. Negahban and M. Wainwright. Restricted strong convexity and weighted matrix com-  pletion with noise. Preprint, 2010.  A.B. Novikoﬀ. On convergence proofs on perceptrons. In Proceedings of the Symposium on  the Mathematical Theory of Automata, pages 615-622, 1962.  J. Pearl. Reverend Bayes on inference engines: A distributed hierarchical approach.  In  Proc. Natl. Conf. on AI, pages 133-136, 1982.  S. S. Rangapuram and M. Hein. Constrained 1-spectral clustering. In Proc. 15th Interna-  tional Conference on Artificial Intelligence and Statistics, AISTATS, 2012.  A. Rohde and A. Tsybakov. Estimation of high-dimensional low rank matrices. Annals of  Statistics, 39(2):887-930, 2011.  S. Shalev-Shwartz, Y. Singer, and A. Ng. Online and batch learning of pseudo-metrics. In Proceedings of the twenty-first international conference on Machine learning, ICML ’04. ACM, 2004.  K. Tsuda, G. R¨atsch, and M. K. Warmuth. Matrix exponentiated gradient updates for on-line learning and bregman projections. Journal of Machine Learning Research, 6: 995-1018, 2005.  F. Vitale, N. Cesa-Bianchi, C. Gentile, and G. Zappella. See the tree through the lines:  The shazoo algorithm. In NIPS, pages 1584-1592, 2011.  M. K. Warmuth. Winnowing subspaces. In Proceedings of the 24th International Conference  on Machine Learning, pages 999-1006. ACM, 2007. Similarity Prediction of Networked Data  D. B. Wilson. Generating random spanning trees more quickly than the cover time. In Proceedings of the twenty-eighth annual ACM symposium on Theory of computing, pages 296-303. ACM, 1996.  E. P. Xing, A. Y. Ng, M. I. Jordan, and J. Russell S. Distance metric learning with  application to clustering with side-information. In NIPS, pages 505-512, 2002.  J. Zhang and R. Yan. On the value of pairwise constraints in classification and consistency.  In Proc of the 24th ICML, ICML, 2007."}