{"1": "versity Press, 1999.  M. Anthony and P. Bartlett. Neural Network Learning: Theoretical Foundations. Cambridge Uni-  M. Babaioff, N. Immorlica, and R. Kleinberg. Matroids, secretary problems, and online mecha- nisms. In Proceedings of the Annual ACM-SIAM Symposium on Discrete Algorithms, 2007.  M. Babaioff, M. Dinitz, A. Gupta, N. Immorlica, and K. Talwar. Secretary problems: weights and discounts. In Proceedings of the Annual ACM-SIAM Symposium on Discrete Algorithms, 2009.  A. Badanidiyuru, S. Dobzinski, H. Fu, R. D. Kleinberg, N. Nisan, and T. Roughgarden. Sketching In Proceedings of the Annual ACM-SIAM Symposium on Discrete Algo-  valuation functions. rithms, 2012.  M. F. Balcan and N. Harvey. Learning submodular functions. In Proceedings of 43rd ACM Sympo-  sium on Theory of Computing, 2011.  K. Bhawalkar and T. Roughgarden. Welfare guarantees for combinatorial auctions with item bid-  ding. In Proceedings of the Annual ACM-SIAM Symposium on Discrete Algorithms, 2011.  A. Blum, M. Zinkevich, and T. Sandholm. On polynomial-time preference elicitation with value  queries. In ACM Conference on Electronic Commerce, 2003.  D. Buchfuhrer, S. Dughmi, H. Fu, R. Kleinberg, E. Mossel, C. H. Papadimitriou, M. Schapira, Y. Singer, and C. Umans. Inapproximability for vcg-based combinatorial auctions. In Proceed- ings of the Annual ACM-SIAM Symposium on Discrete Algorithms, 2010a.  D. Buchfuhrer, M. Schapira, and Y. Singer. Computation and incentives in combinatorial public  projects. In Proc. of the ACM conference on Electronic commerce, pages 33-42, 2010b.  R. Day and S. Raghavan. Assignment preferences and combinatorial auctions. Working paper,  University of Connecticut, April 2006.  S. Dobzinski. Two randomized mechanisms for combinatorial auctions. In APPROX, 2007.  S. Dobzinski, N. Nisan, and M. Schapira. Approximation algorithms for combinatorial auctions  with complement-free bidders. STOC ’05, pages 610-618, 2005.  S. Dobzinski, N. Nisan, and M. Schapira. Truthful randomized mechanisms for combinatorial  auctions. STOC ’06, pages 644-652, 2006.  U. Feige. On maximizing welfare when utility functions are subadditive. In STOC ’06: Proceedings  of the thirty-eighth annual ACM symposium on Theory of computing, pages 41-50, 2006.  G. Goel, C. Karande, P. Tripathi, and L. Wang. Approximability of combinatorial problems with multi-agent submodular cost functions. In Proceedings of the 50th Annual Symposium on Foun- dations of Computer Science, 2009.  M. Goemans, N. Harvey, S. Iwata, and V. Mirrokni. Approximating submodular functions every-  where. In Proceedings of the ACM-SIAM Symposium on Discrete Algorithms, 2009.  4.13   LEARNING VALUATION FUNCTIONS  References  versity Press, 1999.  M. Anthony and P. Bartlett. Neural Network Learning: Theoretical Foundations. Cambridge Uni-  M. Babaioff, N. Immorlica, and R. Kleinberg. Matroids, secretary problems, and online mecha- nisms. In Proceedings of the Annual ACM-SIAM Symposium on Discrete Algorithms, 2007.  M. Babaioff, M. Dinitz, A. Gupta, N. Immorlica, and K. Talwar. Secretary problems: weights and discounts. In Proceedings of the Annual ACM-SIAM Symposium on Discrete Algorithms, 2009.  A. Badanidiyuru, S. Dobzinski, H. Fu, R. D. Kleinberg, N. Nisan, and T. Roughgarden. Sketching In Proceedings of the Annual ACM-SIAM Symposium on Discrete Algo-  valuation functions. rithms, 2012.  M. F. Balcan and N. Harvey. Learning submodular functions. In Proceedings of 43rd ACM Sympo-  sium on Theory of Computing, 2011.  K. Bhawalkar and T. Roughgarden. Welfare guarantees for combinatorial auctions with item bid-  ding. In Proceedings of the Annual ACM-SIAM Symposium on Discrete Algorithms, 2011.  A. Blum, M. Zinkevich, and T. Sandholm. On polynomial-time preference elicitation with value  queries. In ACM Conference on Electronic Commerce, 2003.  D. Buchfuhrer, S. Dughmi, H. Fu, R. Kleinberg, E. Mossel, C. H. Papadimitriou, M. Schapira, Y. Singer, and C. Umans. Inapproximability for vcg-based combinatorial auctions. In Proceed- ings of the Annual ACM-SIAM Symposium on Discrete Algorithms, 2010a.  D. Buchfuhrer, M. Schapira, and Y. Singer. Computation and incentives in combinatorial public  projects. In Proc. of the ACM conference on Electronic commerce, pages 33-42, 2010b.  R. Day and S. Raghavan. Assignment preferences and combinatorial auctions. Working paper,  University of Connecticut, April 2006.  S. Dobzinski. Two randomized mechanisms for combinatorial auctions. In APPROX, 2007.  S. Dobzinski, N. Nisan, and M. Schapira. Approximation algorithms for combinatorial auctions  with complement-free bidders. STOC ’05, pages 610-618, 2005.  S. Dobzinski, N. Nisan, and M. Schapira. Truthful randomized mechanisms for combinatorial  auctions. STOC ’06, pages 644-652, 2006.  U. Feige. On maximizing welfare when utility functions are subadditive. In STOC ’06: Proceedings  of the thirty-eighth annual ACM symposium on Theory of computing, pages 41-50, 2006.  G. Goel, C. Karande, P. Tripathi, and L. Wang. Approximability of combinatorial problems with multi-agent submodular cost functions. In Proceedings of the 50th Annual Symposium on Foun- dations of Computer Science, 2009.  M. Goemans, N. Harvey, S. Iwata, and V. Mirrokni. Approximating submodular functions every-  where. In Proceedings of the ACM-SIAM Symposium on Discrete Algorithms, 2009.  4.13   BALCAN CONSTANTIN IWATA WANG  S. Iwata and K. Nagano. Submodular function minimization under covering constraints. In Pro-  ceedings of the 50th Annual Symposium on Foundations of Computer Science, 2009.  F. John. Extremum problems with inequalities as subsidiary conditions. presented to R. Courant on his 60th Birthday, January 8, 1948, 1948.  In Studies and Essays,  M. Kearns and U. Vazirani. An Introduction to Computational Learning Theory. MIT Press, 1994.  S. Lahaie and D. C. Parkes. Applying learning algorithms to preference elicitation. In ACM Con-  ference on Electronic Commerce, pages 180-188, 2004.  S. Lahaie, F. Constantin, and D. Parkes. More on the power of demand queries in combinatorial auctions: learning atomic languages and handling incentives. In Proceedings of the 19th interna- tional joint conference on Artificial intelligence, pages 959-964, 2005.  B. Lehmann, D. Lehmann, and N. Nisan. Combinatorial auctions with decreasing marginal utilities.  In ACM Conference on Electronic Commerce, pages 18-28, 2001.  K. Murota. Discrete Convex Analysis. SIAM, 2003.  N. Nisan. Chapter 9: Bidding Languages for Combinatorial Auctions . In P. Cramton, Y. Shoham,  and R. Steinberg, editors, Combinatorial Auctions. MIT Press, 2006.  N. Nisan, T. Roughgarden, E. Tardos, and V. Vazirani, editors. Algorithmic Game Theory. Cam-  bridge, 2007.  T. Sandholm. Algorithm for optimal winner determination in combinatorial auctions. Artificial  Intelligence, pages 542-547, 2001.  Y. Singer. Budget feasible mechanisms. FOCS ’10, pages 765-774, 2010.  Z. Svitkina and L. Fleischer. Submodular approximation: Sampling-based algorithms and lower bounds. In Proceedings of the 49th Annual IEEE Symposium onFoundations of Computer Sci- ence, 2008.  D. Vainsencher, O. Dekel, and S. Mannor. Bundle selling by online estimation of valuation func-  tions. In ICML, 2011.  L.G. Valiant. A theory of the learnable. Commun. ACM, 27(11):1134-1142, 1984.  V. N. Vapnik. Statistical Learning Theory. Wiley and Sons, 1998."}