{"1": "J. Y. Audibert, S. Bubeck, and G. Lugosi. Minimax policies for combinatorial prediction games. In Conference on Learning Theory, 2011. URL http://arxiv.org/abs/1105. 4871.  J. Y. Audibert, S. Bubeck, and G. Lugosi. Regret in online combinatorial optimization.  Manuscript, 2012. URL http://arxiv.org/abs/1204.4710.  S. Boucheron, G. Lugosi, and P. Massart. Concentration inequalities: A Nonasymptotic  Theory of Independence. Oxford University Press, 2013.  N. Cesa-Bianchi and G. Lugosi. Prediction, Learning, and Games. Cambridge University  Press, New York, NY, USA, 2006.  N. Cesa-Bianchi and G. Lugosi. Combinatorial bandits. Journal of Computer and System  Sciences, 78:1404-1422, 2012.  E. Even-Dar, S. Kakade, and Y. Mansour. Online Markov decision processes. Mathematics of Operations Research, 34(3):726-736, 2009. ISSN 0364-765X. doi: http://dx.doi.org/ 10.1287/moor.1090.0396.  W. Feller. An Introduction to Probability Theory and its Applications, Vol. 1. John Wiley,  New York, 1968.  Y. Freund and R. Schapire. A decision-theoretic generalization of on-line learning and an application to boosting. Journal of Computer and System Sciences, 55:119-139, 1997.  C. Gentile and M. Warmuth. Linear hinge loss and average margin. In Advances in Neural  Information Processing Systems (NIPS), pages 225-231, 1998.  S. Geulen, B. Voecking, and M. Winkler. Regret minimization for online buﬀering problems using the weighted majority algorithm. In Proceedings of the Twenty-Third Conference on Computational Learning Theory, pages 132-143, 2010.  A. Grove, N. Littlestone, and D. Schuurmans. General convergence results for linear dis-  criminant updates. Machine Learning, 43:173-210, 2001.  A. Gy¨orgy and G. Neu. Near-optimal rates for limited-delay universal lossy source coding. In Proceedings of the IEEE International Symposium on Information Theory (ISIT), pages 2344-2348, 2011.  J. Hannan. Approximation to Bayes risk in repeated play. Contributions to the theory of  games, 3:97-139, 1957.  E. Hazan, S. Kale, and M. Warmuth. Learning rotations with little regret. In Proceedings  of the 23rd Annual Conference on Learning Theory (COLT), pages 144-154, 2010.  D. P. Helmbold and M. Warmuth. Learning permutations with exponential weights. Journal  of Machine Learning Research, 10:1705-1736, 2009.  13   Prediction by random-walk perturbation  References  J. Y. Audibert, S. Bubeck, and G. Lugosi. Minimax policies for combinatorial prediction games. In Conference on Learning Theory, 2011. URL http://arxiv.org/abs/1105. 4871.  J. Y. Audibert, S. Bubeck, and G. Lugosi. Regret in online combinatorial optimization.  Manuscript, 2012. URL http://arxiv.org/abs/1204.4710.  S. Boucheron, G. Lugosi, and P. Massart. Concentration inequalities: A Nonasymptotic  Theory of Independence. Oxford University Press, 2013.  N. Cesa-Bianchi and G. Lugosi. Prediction, Learning, and Games. Cambridge University  Press, New York, NY, USA, 2006.  N. Cesa-Bianchi and G. Lugosi. Combinatorial bandits. Journal of Computer and System  Sciences, 78:1404-1422, 2012.  E. Even-Dar, S. Kakade, and Y. Mansour. Online Markov decision processes. Mathematics of Operations Research, 34(3):726-736, 2009. ISSN 0364-765X. doi: http://dx.doi.org/ 10.1287/moor.1090.0396.  W. Feller. An Introduction to Probability Theory and its Applications, Vol. 1. John Wiley,  New York, 1968.  Y. Freund and R. Schapire. A decision-theoretic generalization of on-line learning and an application to boosting. Journal of Computer and System Sciences, 55:119-139, 1997.  C. Gentile and M. Warmuth. Linear hinge loss and average margin. In Advances in Neural  Information Processing Systems (NIPS), pages 225-231, 1998.  S. Geulen, B. Voecking, and M. Winkler. Regret minimization for online buﬀering problems using the weighted majority algorithm. In Proceedings of the Twenty-Third Conference on Computational Learning Theory, pages 132-143, 2010.  A. Grove, N. Littlestone, and D. Schuurmans. General convergence results for linear dis-  criminant updates. Machine Learning, 43:173-210, 2001.  A. Gy¨orgy and G. Neu. Near-optimal rates for limited-delay universal lossy source coding. In Proceedings of the IEEE International Symposium on Information Theory (ISIT), pages 2344-2348, 2011.  J. Hannan. Approximation to Bayes risk in repeated play. Contributions to the theory of  games, 3:97-139, 1957.  E. Hazan, S. Kale, and M. Warmuth. Learning rotations with little regret. In Proceedings  of the 23rd Annual Conference on Learning Theory (COLT), pages 144-154, 2010.  D. P. Helmbold and M. Warmuth. Learning permutations with exponential weights. Journal  of Machine Learning Research, 10:1705-1736, 2009. Devroye Lugosi Neu  M. Hutter and J. Poland. Prediction with expert advice by following the perturbed leader for general weights. In Algorithmic Learning Theory, pages 279-293. Springer, 2004.  A. Kalai and S. Vempala. Eﬃcient algorithms for the online decision problem.  In B. Sch¨olkopf and M. Warmuth, editors, Proceedings of the 16th Annual Conference on Learning Theory and the 7th Kernel Workshop, COLT-Kernel 2003, pages 26-40, New York, USA, Aug. 2003. Springer.  A. Kalai and S. Vempala. Eﬃcient algorithms for online decision problems. Journal of  Computer and System Sciences, 71:291-307, 2005.  J. Kivinen and M. Warmuth. Relative loss bounds for multidimensional regression problems.  Machine Learning, 45:301-329, 2001.  W. Koolen, M. Warmuth, and J. Kivinen. Hedging structured concepts. In Proceedings of  the 23rd Annual Conference on Learning Theory (COLT), pages 93-105, 2010.  N. Littlestone and M. Warmuth. The weighted majority algorithm. Information and Com-  putation, 108:212-261, 1994.  G. Neu, A. Gy¨orgy, Cs. Szepesv´ari, and A. Antos. Online Markov decision processes under  bandit feedback. In Advances in Neural Information Processing Systems 23, 2010.  J. Poland. FPL analysis for adaptive bandits. In In 3rd Symposium on Stochastic Algo-  rithms, Foundations and Applications (SAGA’05), pages 58-69, 2005.  A. Rakhlin, O. Shamir, and K. Sridharan. Relax and randomize : From value to algorithms.  In Advances in Neural Information Processing Systems 25, pages 2150-2158, 2012.  E. Takimoto and M. Warmuth. Paths kernels and multiplicative updates. Journal of  Machine Learning Research, 4:773-818, 2003.  V. Vovk. Aggregating strategies. In Proceedings of the third annual workshop on Compu-  tational learning theory (COLT), pages 371-386, 1990.  M. Warmuth and D. Kuzmin. Randomized online pca algorithms with regret bounds that are logarithmic in the dimension. Journal of Machine Learning Research, 9:2287-2320, 2008."}