{"1": "Independence. 2013.  S. Boucheron, G. Lugosi, and P. Massart. Concentration Inequalities: A Nonasymptotic Theory of  Marco C Campi and Erik Weyer. Finite Sample Properties of System Identification Methods. IEEE  Transactions on Automatic Control, 47(8), 2002.  Sarah Dean, Horia Mania, Nikolai Matni, Benjamin Recht, and Stephen Tu. On the Sample Com-  plexity of the Linear Quadratic Regulator. arXiv:1710.01688, 2017.  Mohamad Kazem Shirani Faradonbeh, Ambuj Tewari, and George Michailidis. Finite Time Identi-  fication in Unstable Linear Systems. arXiv:1710.01852, 2017a.  Mohamad Kazem Shirani Faradonbeh, Ambuj Tewari, and George Michailidis. Finite Time Analy-  sis of Optimal Adaptive Policies for Linear-Quadratic Systems. arXiv:1711.07230, 2017b.  Moritz Hardt, Tengyu Ma, and Benjamin Recht. Gradient Descent Learns Linear Dynamical Sys-  tems. arXiv:1609.05191, 2016.  Elad Hazan, Karan Singh, and Cyril Zhang. Learning Linear Dynamical Systems via Spectral  Filtering. In Neural Information Processing Systems, 2017.  Elad Hazan, Holden Lee, Karan Singh, Cyril Zhang, and Yi Zhang. Spectral Filtering for General  Linear Dynamical Systems. 2018.  Daniel Hsu, Sham M. Kakade, and Tong Zhang. Random Design Analysis of Ridge Regression.  Foundations of Computational Mathematics, 14, 2014.  Anthony W Knapp. Representation Theory of Semisimple Groups: An Overview Based on Examples  (PMS-36). Princeton University Press, 2016.  Vitaly Kuznetsov and Mehryar Mohri. Generalization Bounds for Non-Stationary Mixing Pro-  cesses. Machine Learning, 106(1), 2017.  Daniel J. McDonald, Cosma R. Shalizi, and Mark Schervish. Nonparametric Risk Bounds for  Time-Series Forecasting. Journal of Machine Learning Research, 18, 2017.  Shahar Mendelson. Learning without Concentration. In Conference on Learning Theory, 2014.  Mehryar Mohri and Afshin Rostamizadeh. Stability Bounds for Non-i.i.d. Processes. In Neural  Information Processing Systems, 2007a.  Mehryar Mohri and Afshin Rostamizadeh. Rademacher Complexity Bounds for Non-I.I.D. Pro-  cesses. In Neural Information Processing Systems, 2007b.  Anders Rantzer. Concentration Bounds for Single Parameter Adaptive Control. In American Control  Conference, 2018.  Parikshit Shah, Badri Narayan Bhaskar, Gongguo Tang, and Benjamin Recht. Linear System Iden-  tification via Atomic Norm Regularization. In Conference on Decision and Control, 2012.  13   LEARNING WITHOUT MIXING  References  Independence. 2013.  S. Boucheron, G. Lugosi, and P. Massart. Concentration Inequalities: A Nonasymptotic Theory of  Marco C Campi and Erik Weyer. Finite Sample Properties of System Identification Methods. IEEE  Transactions on Automatic Control, 47(8), 2002.  Sarah Dean, Horia Mania, Nikolai Matni, Benjamin Recht, and Stephen Tu. On the Sample Com-  plexity of the Linear Quadratic Regulator. arXiv:1710.01688, 2017.  Mohamad Kazem Shirani Faradonbeh, Ambuj Tewari, and George Michailidis. Finite Time Identi-  fication in Unstable Linear Systems. arXiv:1710.01852, 2017a.  Mohamad Kazem Shirani Faradonbeh, Ambuj Tewari, and George Michailidis. Finite Time Analy-  sis of Optimal Adaptive Policies for Linear-Quadratic Systems. arXiv:1711.07230, 2017b.  Moritz Hardt, Tengyu Ma, and Benjamin Recht. Gradient Descent Learns Linear Dynamical Sys-  tems. arXiv:1609.05191, 2016.  Elad Hazan, Karan Singh, and Cyril Zhang. Learning Linear Dynamical Systems via Spectral  Filtering. In Neural Information Processing Systems, 2017.  Elad Hazan, Holden Lee, Karan Singh, Cyril Zhang, and Yi Zhang. Spectral Filtering for General  Linear Dynamical Systems. 2018.  Daniel Hsu, Sham M. Kakade, and Tong Zhang. Random Design Analysis of Ridge Regression.  Foundations of Computational Mathematics, 14, 2014.  Anthony W Knapp. Representation Theory of Semisimple Groups: An Overview Based on Examples  (PMS-36). Princeton University Press, 2016.  Vitaly Kuznetsov and Mehryar Mohri. Generalization Bounds for Non-Stationary Mixing Pro-  cesses. Machine Learning, 106(1), 2017.  Daniel J. McDonald, Cosma R. Shalizi, and Mark Schervish. Nonparametric Risk Bounds for  Time-Series Forecasting. Journal of Machine Learning Research, 18, 2017.  Shahar Mendelson. Learning without Concentration. In Conference on Learning Theory, 2014.  Mehryar Mohri and Afshin Rostamizadeh. Stability Bounds for Non-i.i.d. Processes. In Neural  Information Processing Systems, 2007a.  Mehryar Mohri and Afshin Rostamizadeh. Rademacher Complexity Bounds for Non-I.I.D. Pro-  cesses. In Neural Information Processing Systems, 2007b.  Anders Rantzer. Concentration Bounds for Single Parameter Adaptive Control. In American Control  Conference, 2018.  Parikshit Shah, Badri Narayan Bhaskar, Gongguo Tang, and Benjamin Recht. Linear System Iden-  tification via Atomic Norm Regularization. In Conference on Decision and Control, 2012. LEARNING WITHOUT MIXING  Stephen Tu, Ross Boczar, Andrew Packard, and Benjamin Recht. Non-Asymptotic Analysis of  Robust Control from Coarse-Grained Identification. arXiv:1707.04791, 2017.  Roman Vershynin.  Introduction to the Non-Asymptotic Analysis of Random Matrices.  arXiv:1011.3027, 2011.  Mathukumalli Vidyasagar and Rajeeva L Karandikar. A learning theory approach to system identi-  fication and stochastic adaptive control. Journal of Process Control, 18(3), 2008.  John S White. The limiting distribution of the serial correlation coefficient in the explosive case.  The Annals of Mathematical Statistics, pages 1188-1197, 1958.  Bin Yu. Rates of Convergence for Empirical Processes of Stationary Mixing Sequences. The Annals  of Probability, 22(1), 1994. LEARNING WITHOUT MIXING"}