{"1": "18(4):697-712, 2005.  N. Alon and V. Asodi. Learning a hidden subgraph. SIAM Journal on Discrete Mathematics,  N. Alon, R. Beigel, S. Kasif, S. Rudich, and B. Sudakov. Learning a hidden matching.  SIAM Journal on Computing, 33(2):487-501, 2004.  D. Angluin and J. Chen. Learning a hidden graph using O(log n) queries per edge.  In Proceedings of the 17th Annual Conference on Learning Theory (COLT 2004), pages 210-223, Banﬀ, Canada, 2004.  D. Angluin and J. Chen. Learning a hidden hypergraph. Journal of Machine Learning  Research, 7:2215-2236, 2006.  R. Beigel, N. Alon, M. S. Apaydin, L. Fortnow, and S. Kasif. An optimal procedure for gap closing in whole genome shotgun sequencing. In Proceedings of the Fifth Annual International Conference on Computational Molecular Biology (RECOMB 2001), pages 22-30, 2001.  R. Berinde, A. C. Gilbert, P. Indyk, H. J. Karloﬀ, and M. J. Strauss. Combining geometry  and combinatorics: A unified approach to sparse signal recovery. Allerton, 2008.  N. H. Bshouty. Optimal algorithms for the coin weighing problem with a spring scale. In Proceedings of the 22nd Annual Conference on Learning Theory (COLT 2009), Montreal, Canada, 2009.  N. H. Bshouty and H. Mazzawi. Toward a deterministic polynomial time algorithm with optimal additive query complexity. In Proceedings of the 35th International Symposium on Mathematical Foundations of Computer Science (MFCS 2010), pages 221-232, Brno, Czech Republic, 2010a.  N. H. Bshouty and H. Mazzawi. Optimal query complexity for reconstructing hypergraphs. In Proceedings of the 27th International Symposium on Theoretical Aspects of Computer Science (STACS 2010), pages 143-154, Nancy, France, 2010b.  N. H. Bshouty and H. Mazzawi. On parity check (0, 1)-matrix over Zp. In Proceedings of the ACM-SIAM Symposium on Discrete Algorithms (SODA 2011), pages 1383-1394, San Francisco, USA, 2011a.  N. H. Bshouty and H. Mazzawi. Reconstructing weighted graphs with minimal query com-  plexity. Theoretical Computer Science, 412(19):1782-1790, 2011b.  D. G. Cantor. Determining a set from the cardinalities of its intersections with other sets.  Canadian Journal of Mathematics, 16:94-97, 1964.  D. G. Cantor and W. H. Mills. Determination of a subset from certain combinatorial  properties. Canadian Journal of Mathematics, 18:42-48, 1966.  J. Capetanakis. Tree algorithms for packet broadcast channels.  IEEE Transactions on  Information Theory, 25(5):505-515, 1979a.  14   Choi  References  18(4):697-712, 2005.  N. Alon and V. Asodi. Learning a hidden subgraph. SIAM Journal on Discrete Mathematics,  N. Alon, R. Beigel, S. Kasif, S. Rudich, and B. Sudakov. Learning a hidden matching.  SIAM Journal on Computing, 33(2):487-501, 2004.  D. Angluin and J. Chen. Learning a hidden graph using O(log n) queries per edge.  In Proceedings of the 17th Annual Conference on Learning Theory (COLT 2004), pages 210-223, Banﬀ, Canada, 2004.  D. Angluin and J. Chen. Learning a hidden hypergraph. Journal of Machine Learning  Research, 7:2215-2236, 2006.  R. Beigel, N. Alon, M. S. Apaydin, L. Fortnow, and S. Kasif. An optimal procedure for gap closing in whole genome shotgun sequencing. In Proceedings of the Fifth Annual International Conference on Computational Molecular Biology (RECOMB 2001), pages 22-30, 2001.  R. Berinde, A. C. Gilbert, P. Indyk, H. J. Karloﬀ, and M. J. Strauss. Combining geometry  and combinatorics: A unified approach to sparse signal recovery. Allerton, 2008.  N. H. Bshouty. Optimal algorithms for the coin weighing problem with a spring scale. In Proceedings of the 22nd Annual Conference on Learning Theory (COLT 2009), Montreal, Canada, 2009.  N. H. Bshouty and H. Mazzawi. Toward a deterministic polynomial time algorithm with optimal additive query complexity. In Proceedings of the 35th International Symposium on Mathematical Foundations of Computer Science (MFCS 2010), pages 221-232, Brno, Czech Republic, 2010a.  N. H. Bshouty and H. Mazzawi. Optimal query complexity for reconstructing hypergraphs. In Proceedings of the 27th International Symposium on Theoretical Aspects of Computer Science (STACS 2010), pages 143-154, Nancy, France, 2010b.  N. H. Bshouty and H. Mazzawi. On parity check (0, 1)-matrix over Zp. In Proceedings of the ACM-SIAM Symposium on Discrete Algorithms (SODA 2011), pages 1383-1394, San Francisco, USA, 2011a.  N. H. Bshouty and H. Mazzawi. Reconstructing weighted graphs with minimal query com-  plexity. Theoretical Computer Science, 412(19):1782-1790, 2011b.  D. G. Cantor. Determining a set from the cardinalities of its intersections with other sets.  Canadian Journal of Mathematics, 16:94-97, 1964.  D. G. Cantor and W. H. Mills. Determination of a subset from certain combinatorial  properties. Canadian Journal of Mathematics, 18:42-48, 1966.  J. Capetanakis. Tree algorithms for packet broadcast channels.  IEEE Transactions on  Information Theory, 25(5):505-515, 1979a. Polynomial Time Optimal Query Algorithms for Finding Graphs  J. Capetanakis. Generalized TDMA: The multi-accessing tree protocol. IEEE Transactions  on Communications, 27(10):1476-1484, 1979b.  S. S. Choi and J. H. Kim. Optimal query complexity bounds for finding graphs. In Proceed- ings of the 40th ACM Symposium on Theory of Computing (STOC 2008), pages 749-758, Victoria, Canada, 2008.  S. S. Choi and J. H. Kim. Optimal query complexity bounds for finding graphs. Artificial  Intelligence, 174(9-10):551-569, 2010.  S. S. Choi, K. Jung, and J. H. Kim. Almost tight upper bound for finding Fourier coeﬃcients of k-bounded pseudo-Boolean functions. In Proceedings of the 21st Annual Conference on Learning Theory (COLT 2008), pages 123-134, Helsinki, Finland, 2008.  S. S. Choi, K. Jung, and B. R. Moon. Lower and upper bounds for linkage discovery. IEEE  Trans. on Evolutionary Computation, 13(2):201-216, 2009.  S. S. Choi, K. Jung, and J. H. Kim. Almost tight upper bound for finding Fourier coeﬃcients of k-bounded pseudo-Boolean functions. Journal of Computer and System Sciences, 77 (6):1039-1053, 2011a.  S. S. Choi, J. H. Kim, and J. Oh. Randomized polynomial time algorithms for finding  weighted graphs with optimal additive query complexity. Manuscript, 2011b.  D. Du and F. K. Hwang. Combinatorial group testing and its application. In V. 3 of Series  on applied mathematics, chapter 10. World Science, 1993.  P. Erd˝os and A. R´enyi. On two problems of information theory. Publications of the Math-  ematical Institute of the Hungarian Academy of Sciences, 8:241-254, 1963.  A. Gilbert and P. Indyk. Sparse recovery using sparse matrices. Proceedings of the IEEE,  98(6):937-947, 2010.  V. Grebinski. On the power of additive combinatorial search model.  In Proceedings of the 4th Annual International Conference on Computing and Combinatorics (COCOON 1998), pages 194-203, Taipei, Taiwan, 1998.  V. Grebinski and G. Kucherov. Reconstructing a Hamiltonian cycle by querying the graph: Application to DNA physical mapping. Discrete Applied Mathematics, 88:147-165, 1998.  V. Grebinski and G. Kucherov. Optimal reconstruction of graphs under the additive model.  Algorithmica, 28:104-124, 2000.  R. B. Heckendorn and A. H. Wright. Eﬃcient linkage discovery by limited probing. Evolu-  tionary Computation, 12(4):517-545, 2004.  J. J. Hein. An optimal algorithm to reconstruct trees from additive distance data. Bulletin  of Mathematical Biology, 51(5):597-603, 1989. Choi  P. Indyk and M. Ruzic. Near-optimal sparse recovery in the L1 norm. In Proceedings of the 49th Annual IEEE Symposium on Foundations of Computer Science (FOCS 2008), pages 199-207, 2008.  H. Kargupta and B. Park. Gene expression and fast construction of distributed evolutionary  representation. Evolutionary Computation, 9(1):1-32, 2001.  J. H. Kim. Finding weighted graphs by combinatorial search. arXiv:1201.3793, 2012.  V. King, L. Zhang, and Y. Zhou. On the complexity of distance-based evolutionary tree reconstruction. In Proceedings of the 14th Annual ACM-SIAM Symposium on Discrete Algorithms (SODA 2003), pages 444-453, 2003.  B. Lindstr¨om. On a combinatory detection problem I. Publications of the Mathematical  Institute of the Hungarian Academy of Sciences, 9:195-207, 1964.  B. Lindstr¨om. On a combinatorial problem in number theory. Canadian Mathematical  Bulletin, 8(4):477-490, 1965.  B. Lindstr¨om. On M¨obius functions and a problem in combinatorial number theory. Cana-  dian Mathematical Bulletin, 14(4):513-516, 1971.  B. Lindstr¨om. Determining subsets by unramified experiments. In J. N. Srivastava, editor, A Survey of Statistical Designs and Linear Models, pages 407-418. North Holland, 1975.  J. L. Massey. Collision-resolution algorithms and random-access communications.  In G. Longo, editor, Multi-user communications systems, CISM Courses and Lecture Notes No. 265, pages 73-137. Springer, Wien and New York, 1981.  H. Mazzawi. Optimally reconstructing weighted graphs using queries. In Proceedings of the ACM-SIAM Symposium on Discrete Algorithms (SODA 2010), pages 608-615, Austin, USA, 2010.  C. McDiarmid. On the method of bounded diﬀerences. In J. Siemons, editor, Surveys in Combinatorics, London Mathematical Society Lecture Note Series 141, pages 148-188. Cambridge University Press, 1989.  L. Moser. The second moment method in combinatorial analysis. In Combinatorial Struc- tures and Their Applications. Proceedings of the Calgary International Conference on Combinatorial Structures and Their Applications held at the University of Calgary. June 1969, pages 283-384. Gordon and Breach, New York, 1970.  N. Pippenger. Bounds on the performance of protocols for a multiple-access broadcast  channel. IEEE Trans. on Information Theory, 27(2):145-151, 1981.  L. Reyzin and N. Srivastava. Learning and verifying graphs using queries with a focus on edge counting. In Proceedings of the 18th International Conference on Algorithmic Learning Theory (ALT 2007), pages 285-297, Sendai, Japan, 2007a.  L. Reyzin and N. Srivastava. On the longest path algorithm for reconstructing trees from  distance matrices. Information Processing Letters, 101(3):98-100, 2007b. Polynomial Time Optimal Query Algorithms for Finding Graphs  M. Ruszink´o and P. Vanroose. How an Erd¨os-R´enyi-type search approach gives an explicit code construction of rate 1 for random access with multiplicity feedback. IEEE Trans. on Information Theory, 43(1):368-373, 1997.  S. S¨oderberg and H. S. Shapiro. A combinatory detection problem. American Mathematical  Monthly, 70:1066-1070, 1963.  B. Tsybakov and V. Mikhailov. Free synchronous packet access in a broadcast channel with  feedback. Problemy Peredachi Informassi, 14(4):259-280, 1978.  R. Uehara, K. Tsuchida, and I. Wegener. Identification of partial disjunction, parity, and  threshold functions. Theoretical Computer Science, 210(1-2):131-147, 2000."}