{"1": "Muhammad Abulaish, Mohammad Najmud Doja, Tanvir Ahmad, et al. Feature and opinion min- ing for customer review summarization. In Proceedings of the 3rd International Conference on Pattern Recognition and Machine Intelligence, pages 219-224. Springer, 2009.  S´ebastien Bubeck and Nicol`o Cesa-Bianchi. Regret analysis of stochastic and nonstochastic multi- armed bandit problems. Foundations and Trends R(cid:13) in Machine Learning, 5(1):1-122, 2012.  Peter Frazier, David Kempe, Jon Kleinberg, and Robert Kleinberg. Incentivizing exploration. In Proceedings of the 15th ACM conference on Economics and Computation (EC), pages 5-22. ACM, 2014.  Li Han, David Kempe, and Ruixin Qiang. Incentivizing exploration with heterogeneous value of In Proceedings of the 11th International Conference on Web and Internet Economics  money. (WINE), pages 370-383. Springer, 2015.  Ilan Kremer, Yishay Mansour, and Motty Perry. Implementing the “wisdom of the crowd”. Journal  of Political Economy, 122(5):988-1012, 2014.  6. This will lead to a different dependence on N in the regret bound as well as the payment bound  12   INCENTIVIZING EXPLORATION BY HETEROGENEOUS USERS  5. Conclusion  We study the problem of incentivizing exploration with heterogeneous user preferences. We pro- posed an algorithm that achieves expected cumulative regret O(N e2/p+N log3(T )), using expected cumulative payments of O(N 2e2/p). It is possible to improve these bounds to polynomial (in N and 1/p) when p is known or the preference distribution is discrete. In fact, we conjecture that this should be possible even in the full generality of our model. As a first step towards such a polynomial bound, we can obtain an exponential dependence on 1/(pN ) by changing the probability threshold 6, which gives polynomial dependence unless some arm has a much smaller fraction to be of the population preferring it.  1 N log(s)  Taking this goal one step further, we would like to develop algorithms that do not require all arms to be preferred by a strictly positive fraction of agents. An alternate algorithm might only incentivize an arm if its estimated attribute vector is close enough to a Pareto frontier. The regret will then be Ω(log(T )) when at least one arm falls below the Pareto frontier, as we no longer have free exploration of all arms. It is likely that a bound will deteriorate as the number of such unpreferred arms increases.  Finally, it would be desirable to generalize to utility functions beyond inner products. We believe that similar results hold for arbitrary Lipschitz-continuous utility functions of the arm’s attribute vector, and that only minor modifications are necessary to the algorithm and proofs.  PF and BC were partially supported by NSF CMMI-1254298 and AFOSR FA9550-15-1-0038. DK was supported in part by NSF grant 1423618.  Acknowledgments  References  Muhammad Abulaish, Mohammad Najmud Doja, Tanvir Ahmad, et al. Feature and opinion min- ing for customer review summarization. In Proceedings of the 3rd International Conference on Pattern Recognition and Machine Intelligence, pages 219-224. Springer, 2009.  S´ebastien Bubeck and Nicol`o Cesa-Bianchi. Regret analysis of stochastic and nonstochastic multi- armed bandit problems. Foundations and Trends R(cid:13) in Machine Learning, 5(1):1-122, 2012.  Peter Frazier, David Kempe, Jon Kleinberg, and Robert Kleinberg. Incentivizing exploration. In Proceedings of the 15th ACM conference on Economics and Computation (EC), pages 5-22. ACM, 2014.  Li Han, David Kempe, and Ruixin Qiang. Incentivizing exploration with heterogeneous value of In Proceedings of the 11th International Conference on Web and Internet Economics  money. (WINE), pages 370-383. Springer, 2015.  Ilan Kremer, Yishay Mansour, and Motty Perry. Implementing the “wisdom of the crowd”. Journal  of Political Economy, 122(5):988-1012, 2014.  6. This will lead to a different dependence on N in the regret bound as well as the payment bound INCENTIVIZING EXPLORATION BY HETEROGENEOUS USERS  Chris J. Lintott, Kevin Schawinski, An ˚Ae Slosar, Kate Land, Steven Bamford, Daniel Thomas, M. Jordan Raddick, Robert C. Nichol, Alex Szalay, Dan Andreescu, Phil Murray, and Jan Vanden- berg. Galaxy zoo: morphologies derived from visual inspection of ga laxies from the sloan digital sky survey. Monthly Notices of the Royal Astronomical Society, 389(3):1179-1189, September 2008.  Chien-Liang Liu, Wen-Hoar Hsaio, Chia-Hoang Lee, Gen-Chi Lu, and Emery Jou. Movie rating IEEE Transactions on Systems, Man, and  and review summarization in mobile environment. Cybernetics, Part C (Applications and Reviews), 42(3):397-407, 2012.  Yishay Mansour, Aleksandrs Slivkins, and Vasilis Syrgkanis. Bayesian incentive-compatible bandit exploration. In Proceedings of the 16th ACM Conference on Economics and Computation (EC), pages 565-582. ACM, 2015.  Yishay Mansour, Aleksandrs Slivkins, Vasilis Syrgkanis, and Zhiwei Steven Wu. Bayesian explo- ration: Incentivizing exploration in bayesian games. In Proceedings of the 17th ACM Conference on Economics and Computation (EC), 2016.  Yishay Mansour, Aleksandrs Slivkins, and Zhiwei Steven Wu. Bayesian exploration: Incentivizing exploration in bayesian games. In Proceedings of the 9th Innovations in Theoretical Computer Science (ITCS) conference, 2018.  Sven Schmit and Carlos Riquelme. Human interaction with recommendation systems: On bias and exploration. In Proceedings of the 21st International Conference on Artificial Intelligence and Statistics (AISTATS), 2018.  Aleksandrs Slivkins. Incentivizing exploration via information asymmetry. ACM Crossroads, 24  (1):38-41, 2017.  Brian L. Sullivan, Christopher L. Wood, Marshall J. Iliff, Rick E. Bonney, Daniel Fink, and Steve Kelling. ebird: A citizen-based bird observation network in the biological sciences. Biological Conservation, 142(10):2282-2292, 2009.  Ye-Yi Wang and Sibel Yaman. Product or service review summarization using attributes, July 1  2010. US Patent App. 12/346,903.  Yexiang Xue, Bistra N. Dilkina, Theodoros Damoulas, Daniel Fink, Carla P. Gomes, and Steve Kelling. Improving your chances: Boosting citizen science discovery. In Proceedings of the 1st Conference on Human Computation and Crowdsourcing, 2013.  Shengjia Zhao, Enze Zhou, Ashish Sabharwal, and Stefano Ermon. Adaptive concentration inequal- ities for sequential decision problems. In Proceedings of the 30th Advances In Neural Information Processing Systems (NIPS), pages 1343-1351, 2016."}