{"1": "J. Abernethy, A. Agarwal, P. L. Bartlett, and A. Rakhlin. A stochastic view of optimal regret through minimax duality. In Proceedings of the 22nd Annual Conference on Learning Theory, 2009.  J. D. Abernethy, C. Lee, A. Sinha, and A. Tewari. Online linear optimization via smoothing. In M. F. Balcan, V. Feldman, and Cs. Szepesv´ari, editors, Proceedings of The 27th Conference on Learning Theory, volume 35 of Proceedings of Machine Learning Research, pages 807-823, Barcelona, Spain, 13-15 Jun 2014. PMLR.  S. Agrawal and N. Goyal. Further optimal regret bounds for Thompson sampling. In C. M. Carvalho and P. Ravikumar, editors, Proceedings of the 16th International Conference on Artificial Intel- ligence and Statistics, volume 31 of Proceedings of Machine Learning Research, pages 99-107, Scottsdale, Arizona, USA, 29 Apr-01 May 2013. PMLR.  N. Alon, N. Cesa-Bianchi, O. Dekel, and T. Koren. Online learning with feedback graphs: Beyond In Peter Gr¨unwald, Elad Hazan, and Satyen Kale, editors, Proceedings of The 28th bandits. Conference on Learning Theory, volume 40 of Proceedings of Machine Learning Research, pages 23-35, Paris, France, 03-06 Jul 2015. PMLR.  A. Antos, G. Bart´ok, D. P´al, and Cs. Szepesv´ari. Toward a classification of finite partial-monitoring  games. Theoretical Computer Science, 473:77-99, 2013.  G. Bart´ok, D. P´al, and Cs. Szepesv´ari. Minimax regret of finite partial-monitoring games in stochas- In Proceedings of the 24th Annual Conference on Learning Theory, pages  tic environments. 133-154, 2011.  G. Bart´ok, N. Zolghadr, and Cs. Szepesv´ari. An adaptive algorithm for finite stochastic partial monitoring. In Proceedings of the 29th International Coference on International Conference on Machine Learning, ICML, pages 1779-1786, USA, 2012. Omnipress.  G. Bart´ok, D. P. Foster, D. P´al, A. Rakhlin, and Cs. Szepesv´ari. Partial monitoring—classification, regret bounds, and algorithms. Mathematics of Operations Research, 39(4):967-997, 2014.  P. Bernhard. Information and strategies in dynamic games. SIAM Journal on Control and Optimiza-  tion, 30(1):212-228, 1992.  V. I. Bogachev. Measure theory, volume 2. Springer Science & Business Media, 2007.  S. Bubeck and N. Cesa-Bianchi. Regret Analysis of Stochastic and Nonstochastic Multi-armed Bandit Problems. Foundations and Trends in Machine Learning. Now Publishers Incorporated, 2012.  S. Bubeck, N. Cesa-Bianchi, and S. Kakade. Towards minimax policies for online linear optimiza- tion with bandit feedback. In Annual Conference on Learning Theory, volume 23, pages 41-1. Microtome, 2012.  S. Bubeck, O. Dekel, T. Koren, and Y. Peres. Bandit convex optimization:  T regret in one dimension. In P. Gr¨unwald, E. Hazan, and S. Kale, editors, Proceedings of The 28th Conference on Learning Theory, volume 40 of Proceedings of Machine Learning Research, pages 266-278, Paris, France, 03-06 Jul 2015. PMLR.  √  13   AN INFORMATION-THEORETIC APPROACH TO MINIMAX REGRET IN PARTIAL MONITORING  References  J. Abernethy, A. Agarwal, P. L. Bartlett, and A. Rakhlin. A stochastic view of optimal regret through minimax duality. In Proceedings of the 22nd Annual Conference on Learning Theory, 2009.  J. D. Abernethy, C. Lee, A. Sinha, and A. Tewari. Online linear optimization via smoothing. In M. F. Balcan, V. Feldman, and Cs. Szepesv´ari, editors, Proceedings of The 27th Conference on Learning Theory, volume 35 of Proceedings of Machine Learning Research, pages 807-823, Barcelona, Spain, 13-15 Jun 2014. PMLR.  S. Agrawal and N. Goyal. Further optimal regret bounds for Thompson sampling. In C. M. Carvalho and P. Ravikumar, editors, Proceedings of the 16th International Conference on Artificial Intel- ligence and Statistics, volume 31 of Proceedings of Machine Learning Research, pages 99-107, Scottsdale, Arizona, USA, 29 Apr-01 May 2013. PMLR.  N. Alon, N. Cesa-Bianchi, O. Dekel, and T. Koren. Online learning with feedback graphs: Beyond In Peter Gr¨unwald, Elad Hazan, and Satyen Kale, editors, Proceedings of The 28th bandits. Conference on Learning Theory, volume 40 of Proceedings of Machine Learning Research, pages 23-35, Paris, France, 03-06 Jul 2015. PMLR.  A. Antos, G. Bart´ok, D. P´al, and Cs. Szepesv´ari. Toward a classification of finite partial-monitoring  games. Theoretical Computer Science, 473:77-99, 2013.  G. Bart´ok, D. P´al, and Cs. Szepesv´ari. Minimax regret of finite partial-monitoring games in stochas- In Proceedings of the 24th Annual Conference on Learning Theory, pages  tic environments. 133-154, 2011.  G. Bart´ok, N. Zolghadr, and Cs. Szepesv´ari. An adaptive algorithm for finite stochastic partial monitoring. In Proceedings of the 29th International Coference on International Conference on Machine Learning, ICML, pages 1779-1786, USA, 2012. Omnipress.  G. Bart´ok, D. P. Foster, D. P´al, A. Rakhlin, and Cs. Szepesv´ari. Partial monitoring—classification, regret bounds, and algorithms. Mathematics of Operations Research, 39(4):967-997, 2014.  P. Bernhard. Information and strategies in dynamic games. SIAM Journal on Control and Optimiza-  tion, 30(1):212-228, 1992.  V. I. Bogachev. Measure theory, volume 2. Springer Science & Business Media, 2007.  S. Bubeck and N. Cesa-Bianchi. Regret Analysis of Stochastic and Nonstochastic Multi-armed Bandit Problems. Foundations and Trends in Machine Learning. Now Publishers Incorporated, 2012.  S. Bubeck, N. Cesa-Bianchi, and S. Kakade. Towards minimax policies for online linear optimiza- tion with bandit feedback. In Annual Conference on Learning Theory, volume 23, pages 41-1. Microtome, 2012.  S. Bubeck, O. Dekel, T. Koren, and Y. Peres. Bandit convex optimization:  T regret in one dimension. In P. Gr¨unwald, E. Hazan, and S. Kale, editors, Proceedings of The 28th Conference on Learning Theory, volume 40 of Proceedings of Machine Learning Research, pages 266-278, Paris, France, 03-06 Jul 2015. PMLR.  √ AN INFORMATION-THEORETIC APPROACH TO MINIMAX REGRET IN PARTIAL MONITORING  S. Bubeck, M. Cohen, and Y. Li. Sparsity, variance and curvature in multi-armed bandits.  In F. Janoos, M. Mohri, and K. Sridharan, editors, Proceedings of Algorithmic Learning Theory, volume 83 of Proceedings of Machine Learning Research, pages 111-127. PMLR, 07-09 Apr 2018.  N. Cesa-Bianchi and G. Lugosi. Prediction, learning, and games. Cambridge university press,  2006.  N. Cesa-Bianchi, G. Lugosi, and G. Stoltz. Regret minimization under partial monitoring. Mathe-  matics of Operations Research, 31:562-580, 2006.  D. Foster and A. Rakhlin. No internal regret via neighborhood watch.  In N. D. Lawrence and M. Girolami, editors, Proceedings of the 15th International Conference on Artificial Intelligence and Statistics, volume 22 of Proceedings of Machine Learning Research, pages 382-390, La Palma, Canary Islands, 21-23 Apr 2012. PMLR.  S. Ghosal and A. van der Vaart. Fundamentals of nonparametric Bayesian inference, volume 44.  Cambridge University Press, 2017.  M. K. Ghosh, D. McDonald, and S. Sinha. Zero-sum stochastic games with partial information.  Journal of optimization theory and applications, 121(1):99-118, 2004.  N. Gravin, Y. Peres, and B. Sivan. Towards optimal algorithms for prediction with expert advice. In Proceedings of the twenty-seventh annual ACM-SIAM symposium on Discrete algorithms, pages 528-547. SIAM, 2016.  O. Kallenberg. Foundations of modern probability. Springer-Verlag, 2002.  E. Kaufmann, N. Korda, and R. Munos. Thompson sampling: An asymptotically optimal finite-time analysis. In NaderH. Bshouty, Gilles Stoltz, Nicolas Vayatis, and Thomas Zeugmann, editors, Algorithmic Learning Theory, volume 7568 of Lecture Notes in Computer Science, pages 199- 213. Springer Berlin Heidelberg, 2012. ISBN 978-3-642-34105-2.  J. Komiyama, J. Honda, and H. Nakagawa. Regret lower bound and optimal algorithm in finite stochastic partial monitoring. In C. Cortes, N. D. Lawrence, D. D. Lee, M. Sugiyama, and R. Garnett, editors, Advances in Neural Information Processing Systems 28, NIPS, pages 1792- 1800. Curran Associates, Inc., 2015.  H.W. Kuhn. Extensive games and the problem of information, contributions to the theory of games  II. Annals of Mathematics Studies, 28:193-216, 1953.  T. Lattimore and Cs. Szepesv´ari. Cleaning up the neighbourhood: A full classification for adversar-  ial partial monitoring. In International Conference on Algorithmic Learning Theory, 2019.  T. Lattimore and Cs. Szepesv´ari. Bandit Algorithms. Cambridge University Press (preprint), 2019.  D. Leao, J. B. R. do Val, and M. D. Fragoso. Nonstationary zero sum stochastic games with in- In 39th IEEE Conference on Decision and Control, pages 2278-2283,  complete observation. 2000. AN INFORMATION-THEORETIC APPROACH TO MINIMAX REGRET IN PARTIAL MONITORING  S. Mannor and N. Shimkin. On-line learning with imperfect monitoring. In Learning Theory and  Kernel Machines, pages 552-566. Springer, 2003.  S. Mannor, V. Perchet, and G. Stoltz. Set-valued approachability and online learning with partial  monitoring. The Journal of Machine Learning Research, 15(1):3247-3295, 2014.  V. Perchet. Approachability of convex sets in games with partial monitoring. Journal of Optimiza-  tion Theory and Applications, 149(3):665-677, 2011.  D. Russo and B. Van Roy. Learning to optimize via information-directed sampling. In Z. Ghahra- mani, M. Welling, C. Cortes, N. D. Lawrence, and K. Q. Weinberger, editors, Advances in Neural Information Processing Systems 27, NIPS, pages 1583-1591. Curran Associates, Inc., 2014.  D. Russo and B. Van Roy. An information-theoretic analysis of Thompson sampling. Journal of  Machine Learning Research, 17(1):2442-2471, 2016. ISSN 1532-4435.  D. Russo and B. Van Roy. Learning to optimize via information-directed sampling. Operations  Research, 66(1):230-252, 2017.  A. Rustichini. Minimizing regret: The general case. Games and Economic Behavior, 29(1):224-  M. Sion. On general minimax theorems. Pacific Journal of mathematics, 8(1):171-176, 1958.  A. B. Tsybakov. Introduction to nonparametric estimation. Springer Science & Business Media,  243, 1999.  2008.  H. P. Vanchinathan, G. Bart´ok, and A. Krause. Efficient partial monitoring with prior information. In Z. Ghahramani, M. Welling, C. Cortes, N. D. Lawrence, and K. Q. Weinberger, editors, Advances in Neural Information Processing Systems 27, NIPS, pages 1691-1699. Curran Associates, Inc., 2014.  C-Y. Wei and H. Luo. More adaptive algorithms for adversarial bandits.  In S´ebastien Bubeck, Vianney Perchet, and Philippe Rigollet, editors, Proceedings of the 31st Conference On Learning Theory, volume 75 of Proceedings of Machine Learning Research, pages 1263-1291. PMLR, 06-09 Jul 2018."}