{"1": "Noga Alon, Konstantin Makarychev, Yury Makarychev, and Assaf Naor. Quadratic forms on graphs.  Inventiones mathematicae, 163(3):499-522, 2006.  Martin Anthony and Peter L Bartlett. Neural network learning: Theoretical foundations. Cambridge  University Press, 2009.  Pranjal Awasthi, Avrim Blum, and Or Sheffet. Center-based clustering under perturbation stability.  Information Processing Letters, 112(1):49-54, 2012.  Pranjal Awasthi, Maria-Florina Balcan, and Konstantin Voevodski. Local algorithms for interactive clustering. In Proceedings of the International Conference on Machine Learning (ICML), pages 550-558, 2014.  Maria-Florina Balcan and Yingyu Liang. Clustering under perturbation resilience. SIAM Journal  on Computing, 45(1):102-155, 2016.  Maria-Florina Balcan, Nika Haghtalab, and Colin White. k-center clustering under perturbation resilience. In Proceedings of the Annual International Colloquium on Automata, Languages, and Programming (ICALP), 2016.  Afonso S. Bandeira, Nicolas Boumal, and Vladislav Voroninski. On the low-rank approach for semidefinite programs arising in synchronization and community detection. In Proceedings of the Conference on Learning Theory (COLT), pages 361-382, 2016.  MohammadHossein Bateni, Aditya Bhaskara, Silvio Lattanzi, and Vahab Mirrokni. Distributed balanced clustering via mapping coresets. In Proceedings of the Annual Conference on Neural Information Processing Systems (NIPS), pages 2591-2599, 2014.  Ahron Ben-Tal and Arkadi Nemirovski. Lectures on modern convex optimization: analysis, algo-  rithms, and engineering applications, volume 2. Siam, 2001.  William Brendel and Sinisa Todorovic. Segmentation as maximum-weight independent set.  In Proceedings of the Annual Conference on Neural Information Processing Systems (NIPS), pages 307-315, 2010.  17   LEARNING-THEORETIC FOUNDATIONS OF ALGORITHM CONFIGURATION  the exact empirical cost of an algorithm on the training set. Could we still make strong, provable guarantees for application-specific algorithm configuration in this scenario? This work also leaves open the potential for data-dependent bounds over well-behaved distributions, such as those over clustering instances satisfying some form of stability, be it approximation stability, perturbation resilience, or so on.  Acknowledgments. This work was supported in part by grants NSF-CCF 1535967, NSF CCF- 1422910, NSF IIS-1618714, a Sloan Fellowship, a Microsoft Research Fellowship, a NSF Graduate Research Fellowship, a Microsoft Research Women’s Fellowship, and a National Defense Science and Engineering Graduate (NDSEG) fellowship.  We thank Sanjoy Dasgupta, Anupam Gupta, Carl Kingsford, and Ryan O’Donnell for useful  discussions.  References  Noga Alon, Konstantin Makarychev, Yury Makarychev, and Assaf Naor. Quadratic forms on graphs.  Inventiones mathematicae, 163(3):499-522, 2006.  Martin Anthony and Peter L Bartlett. Neural network learning: Theoretical foundations. Cambridge  University Press, 2009.  Pranjal Awasthi, Avrim Blum, and Or Sheffet. Center-based clustering under perturbation stability.  Information Processing Letters, 112(1):49-54, 2012.  Pranjal Awasthi, Maria-Florina Balcan, and Konstantin Voevodski. Local algorithms for interactive clustering. In Proceedings of the International Conference on Machine Learning (ICML), pages 550-558, 2014.  Maria-Florina Balcan and Yingyu Liang. Clustering under perturbation resilience. SIAM Journal  on Computing, 45(1):102-155, 2016.  Maria-Florina Balcan, Nika Haghtalab, and Colin White. k-center clustering under perturbation resilience. In Proceedings of the Annual International Colloquium on Automata, Languages, and Programming (ICALP), 2016.  Afonso S. Bandeira, Nicolas Boumal, and Vladislav Voroninski. On the low-rank approach for semidefinite programs arising in synchronization and community detection. In Proceedings of the Conference on Learning Theory (COLT), pages 361-382, 2016.  MohammadHossein Bateni, Aditya Bhaskara, Silvio Lattanzi, and Vahab Mirrokni. Distributed balanced clustering via mapping coresets. In Proceedings of the Annual Conference on Neural Information Processing Systems (NIPS), pages 2591-2599, 2014.  Ahron Ben-Tal and Arkadi Nemirovski. Lectures on modern convex optimization: analysis, algo-  rithms, and engineering applications, volume 2. Siam, 2001.  William Brendel and Sinisa Todorovic. Segmentation as maximum-weight independent set.  In Proceedings of the Annual Conference on Neural Information Processing Systems (NIPS), pages 307-315, 2010. BALCAN NAGARAJAN VITERCIK WHITE  Fazli Can. Incremental clustering for dynamic information processing. ACM Transactions on In-  formation Systems (TOIS), 11(2):143-164, 1993.  Yves Caseau, Franc¸ois Laburthe, and Glenn Silverstein. A meta-heuristic factory for vehicle routing problems. In International Conference on Principles and Practice of Constraint Programming (CP), pages 144-158. Springer, 1999.  Moses Charikar and Anthony Wirth. Maximizing quadratic programs: extending Grothendieck’s in- equality. In Proceedings of the Annual Symposium on Foundations of Computer Science (FOCS), pages 54-60, 2004.  Moses Charikar, Chandra Chekuri, Tom´as Feder, and Rajeev Motwani. Incremental clustering and dynamic information retrieval. In Proceedings of the Annual Symposium on Theory of Computing (STOC), pages 626-635, 1997.  Timothee Cour, Praveen Srinivasan, and Jianbo Shi. Balanced graph matching. In Proceedings of the Annual Conference on Neural Information Processing Systems (NIPS), pages 313-320, 2006.  Jim Demmel, Jack Dongarra, Victor Eijkhout, Erika Fuentes, Antoine Petitet, Rich Vuduc, R Clint Whaley, and Katherine Yelick. Self-adapting linear algebra algorithms and software. Proceedings of the IEEE, 93(2):293-312, 2005.  R.M Dudley. The sizes of compact subsets of Hilbert space and continuity of Gaussian processes.  Journal of Functional Analysis, 1(3):290 - 330, 1967.  Uriel Feige and Michael Langberg. The RPR2 rounding technique for semidefinite programs. Jour-  nal of Algorithms, 60(1):1-23, 2006.  Darya Filippova, Aashish Gadani, and Carl Kingsford. Coral: an integrated suite of visualizations  for comparing clusterings. BMC bioinformatics, 13(1):276, 2012.  Roy Frostig, Sida Wang, Percy S Liang, and Christopher D Manning. Simple MAP inference via low-rank relaxations. In Proceedings of the Annual Conference on Neural Information Processing Systems (NIPS), pages 3077-3085, 2014.  Michel X Goemans and David P Williamson. Improved approximation algorithms for maximum cut and satisfiability problems using semidefinite programming. Journal of the ACM (JACM), 42 (6):1115-1145, 1995.  Anna Grosswendt and Heiko Roeglin. Improved analysis of complete linkage clustering. In Euro-  pean Symposium of Algorithms, volume 23, pages 656-667. Springer, 2015.  Anupam Gupta and Kanat Tangwongsan. Simpler analyses of local search algorithms for facility  location. arXiv preprint arXiv:0809.2554, 2008.  Rishi Gupta and Tim Roughgarden. A PAC approach to application-specific algorithm selection. In Proceedings of the 2016 ACM Conference on Innovations in Theoretical Computer Science (ITCS), pages 123-134, 2016. LEARNING-THEORETIC FOUNDATIONS OF ALGORITHM CONFIGURATION  Qixing Huang, Yuxin Chen, and Leonidas Guibas. Scalable semidefinite relaxation for maximum In Proceedings of the International Conference on Machine Learning  a posterior estimation. (ICML), pages 64-72, 2014.  Fredrik D Johansson, Ankani Chattoraj, Chiranjib Bhattacharyya, and Devdatt Dubhashi. Weighted theta functions and embeddings with applications to max-cut, clustering and summarization. In Proceedings of the Annual Conference on Neural Information Processing Systems (NIPS), pages 1018-1026, 2015.  Subhash Khot, Guy Kindler, Elchanan Mossel, and Ryan O’Donnell. Optimal inapproximability results for MAX-CUT and other 2-variable CSPs? SIAM Journal on Computing, 37(1):319-357, 2007.  Kevin Leyton-Brown, Eugene Nudelman, and Yoav Shoham. Empirical hardness models: Method- ology and a case study on combinatorial auctions. Journal of the ACM (JACM), 56(4):22, 2009.  Marina Meil˘a. Comparing clusterings: an information based distance. Journal of multivariate  analysis, 98(5):873-895, 2007.  Ryan O’Donnell and Yi Wu. An optimal SDP algorithm for max-cut, and equally optimal long code tests. In Proceedings of the Annual Symposium on Theory of Computing (STOC), pages 335-344, 2008.  David Pollard. Convergence of stochastic processes. Springer-Verlag, 1984.  David Pollard. Empirical processes. Institute of Mathematical Statistics, 1990.  John R Rice. The algorithm selection problem. Advances in computers, 15:65-118, 1976.  Andrej Risteski and Yuanzhi Li. Approximate maximum entropy principles via Goemans- In Proceedings of the Annual  Williamson with applications to provable variational methods. Conference on Neural Information Processing Systems (NIPS), pages 4628-4636, 2016.  Mehreen Saeed, Onaiza Maqbool, Haroon Atique Babri, Syed Zahoor Hassan, and S Mansoor Sarwar. Software clustering techniques and the use of combined algorithm. In Proceedings of the European Conference on Software Maintenance and Reengineering, pages 301-306. IEEE, 2003.  Sagi Snir and Satish Rao. Using max cut to enhance rooted trees consistency. IEEE/ACM Transac-  tions on Computational Biology and Bioinformatics (TCBB), 3(4):323-333, 2006.  Timo Tossavainen. On the zeros of finite sums of exponential functions. Australian Mathematical  Society Gazette, 33(1):47-50, 2006.  Vijay V Vazirani. Approximation algorithms. Springer Science & Business Media, 2013.  Jun Wang, Tony Jebara, and Shih-Fu Chang. Semi-supervised learning using greedy max-cut. Jour-  nal of Machine Learning Research, 14(Mar):771-800, 2013. BALCAN NAGARAJAN VITERCIK WHITE  James R White, Saket Navlakha, Niranjan Nagarajan, Mohammad-Reza Ghodsi, Carl Kingsford, and Mihai Pop. Alignment and clustering of phylogenetic markers-implications for microbial diversity studies. BMC bioinformatics, 11(1):152, 2010.  David P Williamson and David B Shmoys. The design of approximation algorithms. Cambridge  University press, 2011.  Lin Xu, Frank Hutter, Holger H. Hoos, and Kevin Leyton-Brown. SATzilla: portfolio-based algo- rithm selection for SAT. Journal of Artificial Intelligence Research, 32:565-606, June 2008.  Chihiro Yoshimura, Masanao Yamaoka, Masato Hayashi, Takuya Okuyama, Hidetaka Aoki, Ken- ichi Kawarabayashi, and Hiroyuki Mizuno. Uncertain behaviours of integrated circuits improve computational performance. Scientific reports, 5, 2015.  Mingjun Zhong, Nigel Goddard, and Charles Sutton. Signal aggregate constraints in additive facto- rial HMMs, with application to energy disaggregation. In Proceedings of the Annual Conference on Neural Information Processing Systems (NIPS), pages 3590-3598, 2014.  Uri Zwick. Outward rotations: a tool for rounding solutions of semidefinite programming relax- ations, with applications to max cut and other problems. In Proceedings of the Annual Symposium on Theory of Computing (STOC), pages 679-687, 1999."}