{"1": "335-361, 1998.  F. Barthe. On a reverse form of the Brascamp-Lieb inequality.  Invent. Math., 134(2):  H. J. Brascamp and E. H. Lieb. Best constants in Young’s inequality, its converse, and its generalization to more than three functions. Advances in Math., 20(2):151-173, 1976.  E. Candes and B. Recht. Exact matrix completion via convex optimization. Foundations  of Comp. Math., pages 717-772, 2009.  E. Candes, X. Li, Y. Ma, and J. Wright. Robust principal component analysis? Journal of  the ACM, 2011.  E. Carlen and D. Cordero-Erausquin. Subadditivity of the entropy and its relation to brascamp-lieb type inequalities. Geometric and Functional Analysis, 19(2):373-405, 2009.  E. Carlen, E. H. Lieb, and M. Loss. A sharp analog of Young’s inequality on SN and related  entropy inequalities. J. Geom. Anal., 14(3):487-520, 2004.  V. Chandrasekaran, S. Sanghavi, P. Parrilo, and A. Willsky. Rank-sparsity incoherence for  matrix decomposition. SIAM J. Optim., pages 572-596, 2011.  W. Cunningham. Testing membership in matroid polyhedra. J. Combin. Theory Ser. B,  pages 161-188, 1984.  A. Deshpande, M. Tulsiani, and N. Vishnoi. Algorithms and hardness for subspace approx-  imation. SODA, pages 482-496, 2011.  D. Donoho and P. Huber. The notion of breakdown point. A Festshrift for Erich L.  Lehmann, pages 157-184, 1983.  J. Dunagan and S. Vempala. Optimal outlier removal in high-dimensional spaces. J. Com-  put. Syst. Sci., pages 335-373, 2000.  H. Edelsbrunner and D. Souvaine. Computing median-of-squares regression lines and guided  topological sweep. Journal of the Amer. Stat. Assoc., pages 115-119, 1990.  J. Edmonds. Submodular functions, matroids, and certain polyhedra. In Combinatorial  Structures, pages 69-87. 1970.  M. Fischler and R. Bolles. Random sample consensus: A paradigm for model fitting with applications to image analysis and automated cartography. Communications of the ACM, pages 381-395, 1981.  M. Gr´otschel, L. Lov´asz, and A. Schrijver. The ellipsoid method and its consequences in  combinatorial optimization. Combinatorica, pages 169-197, 1981.  V. Guruswami and P. Raghavendra. Hardness of solving sparse overdetermined linear sys- tems: A. pages 1-20, 2009. 3-query PCP over integers. ACM Trans. Comput. Theory.  13   Subspaces with Outliers  References  335-361, 1998.  F. Barthe. On a reverse form of the Brascamp-Lieb inequality.  Invent. Math., 134(2):  H. J. Brascamp and E. H. Lieb. Best constants in Young’s inequality, its converse, and its generalization to more than three functions. Advances in Math., 20(2):151-173, 1976.  E. Candes and B. Recht. Exact matrix completion via convex optimization. Foundations  of Comp. Math., pages 717-772, 2009.  E. Candes, X. Li, Y. Ma, and J. Wright. Robust principal component analysis? Journal of  the ACM, 2011.  E. Carlen and D. Cordero-Erausquin. Subadditivity of the entropy and its relation to brascamp-lieb type inequalities. Geometric and Functional Analysis, 19(2):373-405, 2009.  E. Carlen, E. H. Lieb, and M. Loss. A sharp analog of Young’s inequality on SN and related  entropy inequalities. J. Geom. Anal., 14(3):487-520, 2004.  V. Chandrasekaran, S. Sanghavi, P. Parrilo, and A. Willsky. Rank-sparsity incoherence for  matrix decomposition. SIAM J. Optim., pages 572-596, 2011.  W. Cunningham. Testing membership in matroid polyhedra. J. Combin. Theory Ser. B,  pages 161-188, 1984.  A. Deshpande, M. Tulsiani, and N. Vishnoi. Algorithms and hardness for subspace approx-  imation. SODA, pages 482-496, 2011.  D. Donoho and P. Huber. The notion of breakdown point. A Festshrift for Erich L.  Lehmann, pages 157-184, 1983.  J. Dunagan and S. Vempala. Optimal outlier removal in high-dimensional spaces. J. Com-  put. Syst. Sci., pages 335-373, 2000.  H. Edelsbrunner and D. Souvaine. Computing median-of-squares regression lines and guided  topological sweep. Journal of the Amer. Stat. Assoc., pages 115-119, 1990.  J. Edmonds. Submodular functions, matroids, and certain polyhedra. In Combinatorial  Structures, pages 69-87. 1970.  M. Fischler and R. Bolles. Random sample consensus: A paradigm for model fitting with applications to image analysis and automated cartography. Communications of the ACM, pages 381-395, 1981.  M. Gr´otschel, L. Lov´asz, and A. Schrijver. The ellipsoid method and its consequences in  combinatorial optimization. Combinatorica, pages 169-197, 1981.  V. Guruswami and P. Raghavendra. Hardness of solving sparse overdetermined linear sys- tems: A. pages 1-20, 2009. 3-query PCP over integers. ACM Trans. Comput. Theory. Hardt Moitra  V. Guruswami, P. Raghavendra, R. Saket, and Y. Wu. Bypassing UGC for some optimal  geometric inapproximability results. SODA, pages 699-717, 2012.  P. Huber. Robust Statistics. 1981. John Wiley & Sons.  S. Iwata, L. Fleischer, and S. Fujishige. A combinatorial strongly polynomial time algorithm  for minimizing submodular functions. JACM, pages 761-777, 2001.  V. Kabanets and R. Impagliazzo. Constructive proofs of concentration bounds. APPROX-  RANDOM, pages 617-631, 2010.  L. Khachiyan. On the complexity of approximating extremal determinants in matrices.  Journal of Complexity, pages 138-153, 1995.  S. Khot and D. Moshkovitz. Hardness of approximately solving linear equations over the  reals. STOC, pages 413-420, 2011.  P. Lax. Linear algebra. 2007. Wiley Interscience.  G. Lerman, M. McCoy, J. Tropp, and T. Zhang. Robust computation of linear models, or  how to find a needle in a haystack. Arxiv, 2012. .  J. Matousek. Lectures on Discrete Geometry. 2002. Springer-Verlag New York, Inc.  A. Naor, O. Regev, and T. Vidick. Eﬃcient rounding for the noncommutative grothendieck  inequality. STOC, 2013.  A. Nemirovski. Lectures on modern convex optimization. 2005.  http://www2.isye.gatech.edu/~nemirovs/.  P. Raghavendra and D. Steurer. Graph expansion and the unique games conjecture. STOC,  pages 755-764, 2010.  P. Raghavendra, D. Steurer, and M. Tulsiani. Reductions between expansion problems.  Electronic Colloquium on Computational Complexity (ECCC), 2010. 17:172.  B. Recht, M. Fazel, and P. Parrilo. Guaranteed minimum rank solutions of matrix equations  via nuclear norm minimization. SIAM Rev., pages 471-501, 2010.  P. Rousseeuw. Least median squares regression. Journal of the Amer. Stat. Assoc., pages  871-880, 1984.  Sons.  P. Rousseeuw and A. Leroy. Robust Regression and Outlier Detection. 1987. John Wiley &  A. Schrijver. A combinatorial algorithm for minimizing submodular functions in strongly  polynomial time. J. Combin. Theory Ser. B, pages 346-355, 2000.  M. Soltanolkotabi and E. Candes. A geometric analysis of subspace clustering with outliers.  Ann. of Stat., pages 2195-2238, 2012. Subspaces with Outliers  S. Vempala. The joy of PCA. 2010.  http://www.cc.gatech.edu/events/cse-seminar-santosh-vempala-0.  H. Xu, C. Carmanis, and S. Sanghavi. Robust PCA via outlier pursuit.  IEEE Trans.  Inform. Theory, pages 1-24, 2010.  H. Xu, C. Caramanis, and S. Mannor. Outlier-robust PCA: The high-dimensional case.  IEEE Transactions on Information Theory, 59(1):546-572, 2013.  T. Zhang and G. Lerman. A novel m-estimator for robust pca. Arxiv, 2011."}