{"1": "Jacob Abernethy, Yiling Chen, and Jennifer Wortman Vaughan. Efficient market making via con- vex optimization, and a connection to online learning. ACM Transactions on Economics and Computation, 1(2):12, 2013.  Jacob D Abernethy and Rafael M Frongillo. A characterization of scoring rules for linear properties. In Proceedings of the Conference on Learning Theory (COLT), volume 23 of JMLR WCP, pages 27-1, 2012.  Charalambos D. Aliprantis and Kim C. Border.  Infinite Dimensional Analysis: A Hitchhiker’s  Guide. Springer, 2007.  Katy S Azoury and Manfred K Warmuth. Relative loss bounds for on-line density estimation with  the exponential family of distributions. Machine Learning, 43(3):211-246, 2001.  Amir Beck and Marc Teboulle. Mirror descent and nonlinear projected subgradient methods for  convex optimization. Operations Research Letters, 31(3):167-175, 2003.  Nicolo Cesa-Bianchi and G´abor Lugosi. Potential-based algorithms in on-line prediction and game  theory. Machine Learning, 51(3):239-261, 2003.  Nicolo Cesa-Bianchi and G´abor Lugosi. Prediction, learning, and games. Cambridge University  Press, 2006.  regret learning. 189-198, 2010.  functions. IEEE, 1988.  matics, 2004.  Yiling Chen and Jennifer Wortman Vaughan. A new understanding of prediction markets via no- In Proceedings of the 11th ACM conference on Electronic commerce, pages  A Philip Dawid. The geometry of proper scoring rules. Annals of the Institute of Statistical Mathe-  matics, 59(1):77-93, 2007.  Alfredo DeSantis, George Markowsky, and Mark N Wegman. Learning probabilistic prediction In 29th Annual Symposium on Foundations of Computer Science, pages 110-119.  Hans F¨ollmer and Alexander Schied. Stochastic finance, volume 27 of de gruyter studies in mathe-  Rafael M. Frongillo. Eliciting Private Information from Selfish Agents. PhD thesis, University of  California, Berkeley, 2013.  Rafael M Frongillo, Nicol´as Della Penna, and Mark D Reid.  Interpreting prediction markets: a  stochastic approach. In Proceedings of Neural Information Processing Systems, 2012.  Tilmann Gneiting and Adrian E Raftery. Strictly proper scoring rules, prediction, and estimation.  Journal of the American Statistical Association, 102(477):359-378, 2007.  Nick Gravin, Yuval Peres, and Balasubramanian Sivan. Towards optimal algorithms for prediction  with expert advice, 2014. URL http://arxiv.org/abs/1409.3040.  13   MIXABILITY VIA ENTROPIC DUALITY  References  Jacob Abernethy, Yiling Chen, and Jennifer Wortman Vaughan. Efficient market making via con- vex optimization, and a connection to online learning. ACM Transactions on Economics and Computation, 1(2):12, 2013.  Jacob D Abernethy and Rafael M Frongillo. A characterization of scoring rules for linear properties. In Proceedings of the Conference on Learning Theory (COLT), volume 23 of JMLR WCP, pages 27-1, 2012.  Charalambos D. Aliprantis and Kim C. Border.  Infinite Dimensional Analysis: A Hitchhiker’s  Guide. Springer, 2007.  Katy S Azoury and Manfred K Warmuth. Relative loss bounds for on-line density estimation with  the exponential family of distributions. Machine Learning, 43(3):211-246, 2001.  Amir Beck and Marc Teboulle. Mirror descent and nonlinear projected subgradient methods for  convex optimization. Operations Research Letters, 31(3):167-175, 2003.  Nicolo Cesa-Bianchi and G´abor Lugosi. Potential-based algorithms in on-line prediction and game  theory. Machine Learning, 51(3):239-261, 2003.  Nicolo Cesa-Bianchi and G´abor Lugosi. Prediction, learning, and games. Cambridge University  Press, 2006.  regret learning. 189-198, 2010.  functions. IEEE, 1988.  matics, 2004.  Yiling Chen and Jennifer Wortman Vaughan. A new understanding of prediction markets via no- In Proceedings of the 11th ACM conference on Electronic commerce, pages  A Philip Dawid. The geometry of proper scoring rules. Annals of the Institute of Statistical Mathe-  matics, 59(1):77-93, 2007.  Alfredo DeSantis, George Markowsky, and Mark N Wegman. Learning probabilistic prediction In 29th Annual Symposium on Foundations of Computer Science, pages 110-119.  Hans F¨ollmer and Alexander Schied. Stochastic finance, volume 27 of de gruyter studies in mathe-  Rafael M. Frongillo. Eliciting Private Information from Selfish Agents. PhD thesis, University of  California, Berkeley, 2013.  Rafael M Frongillo, Nicol´as Della Penna, and Mark D Reid.  Interpreting prediction markets: a  stochastic approach. In Proceedings of Neural Information Processing Systems, 2012.  Tilmann Gneiting and Adrian E Raftery. Strictly proper scoring rules, prediction, and estimation.  Journal of the American Statistical Association, 102(477):359-378, 2007.  Nick Gravin, Yuval Peres, and Balasubramanian Sivan. Towards optimal algorithms for prediction  with expert advice, 2014. URL http://arxiv.org/abs/1409.3040. REID FRONGILLO WILLIAMSON MEHTA  David Haussler, Jyrki Kivinen, and Manfred K Warmuth. Sequential prediction of individual se- quences under general loss functions. IEEE Transactions on Information Theory, 44(5):1906- 1925, 1998.  Jean-Bapiste Hiriart-Urruty and Claude Lemar´echal. Fundamentals of convex analysis. Springer  Verlag, 2001.  Yuri Kalnishkan and Michael V. Vyugin. The weak aggregating algorithm and weak mixability.  Journal of Computer and System Sciences, 74:1228-1244, 2008.  Jyrki Kivinen and Manfred K Warmuth. Exponentiated gradient versus gradient descent for linear  predictors. Information and Computation, 132(1):1-63, 1997.  Jyrki Kivinen and Manfred K Warmuth. Averaging expert predictions.  In Proceedings of the 4th European Conference on Computational Learning Theory (EuroCOLT’99), pages 153-167. Springer, 1999.  Tomasz Maszczyk and Włodzisław Duch. Comparison of Shannon, R´enyi and Tsallis entropy used in decision trees. In Artificial Intelligence and Soft Computing-ICAISC 2008, pages 643-651. Springer, 2008.  Francesco Orabona, Koby Crammer, and Nicolo Cesa-Bianchi. A generalized online mirror descent with applications to classification and regression. Machine Learning, 99(3):411-435, June 2015.  R. Tyrell Rockafellar. Convex analysis. Princeton University Press, 1997.  Leonard J Savage. Elicitation of personal probabilities and expectations. Journal of the American  Statistical Association, 66(336):783-801, 1971.  Jacob Steinhardt and Percy Liang. Adaptivity and optimism: An improved exponentiated gradient algorithm. In Proceedings of the 31st International Conference on Machine Learning, 2014.  Frederick A. Valentine. Convex Sets. McGraw-Hill, New York, 1964.  Tim van Erven and Peter Harremo¨es. R´enyi divergence and Kullback-Leibler divergence. IEEE  Transactions on Information Theory, 60(7):3797-3820, 2014.  Tim van Erven, Mark D Reid, and Robert C Williamson. Mixability is Bayes risk curvature relative  to log loss. The Journal of Machine Learning Research, 13(1):1639-1663, 2012.  Elodie Vernet, Robert C Williamson, and Mark D Reid. Composite multiclass losses. In NIPS,  volume 24, pages 1224-1232, 2011.  Volodya Vovk. Aggregating strategies. In Proceedings of the Third Annual Workshop on Computa-  tional Learning Theory (COLT), pages 371-383, 1990.  Volodya Vovk. A game of prediction with expert advice. Journal of Computer and System Sciences,  Volodya Vovk. Competitive on-line statistics.  International Statistical Review, 69(2):213-248,  56(2):153-173, 1998.  2001. MIXABILITY VIA ENTROPIC DUALITY  Peter M Williams. Bayesian conditionalisation and the principle of minimum information. British  Journal for the Philosophy of Science, 31(2):131-144, 1980."}