{"1": "E. Abbe and C. Sandon. Community detection in general stochastic block models: fundamental  limits and efficient recovery algorithms. arXiv 1503.00609, March 2015.  E. Abbe, A. S. Bandeira, and G. Hall. Exact recovery in the stochastic block model.  arXiv  1405.3267, October 2014.  N. Agarwal, A. S. Bandeira, K. Koiliaris, and A. Kolla. Multisection in the stochastic block model  using semidefinite programming. arXiv 1507.02323, July 2015.  18   MOSSEL XU  We are ready to prove Theorem 3 by combing Lemma 15, Lemma 16, and Lemma 17.  Proof [Proof of Theorem 3] In view of Lemma 17, for t ≥ 0,  P  (cid:110) (cid:101)Γt u ≥ 0|τu = −  (cid:111)  lim n→∞  = lim n→∞  P  (cid:110) (cid:101)Γt u ≤ 0|τu = +  (cid:111)  √  = Q(  ut),  It follows from Lemma 16 that there exists an α ∈ [0, 1/2) such that  E (cid:2)O(σ, (cid:98)σt  BP)(cid:3) ≤ lim  n→∞ (cid:101)qT t,α = Q(  √  ut).  lim sup n→∞ √  4 (cid:101)h(v) > v for all v ∈ (0, v∗). Furthermore, (cid:101)h(v) ≤ 1 and hence µ2  Let (cid:101)h(v) = E [tanh(v + vZ)] . In view of Lemma 14, (cid:101)h is non-decreasing and concave in [0, ∞), and limv→0 (cid:101)h(cid:48)(v) = 1. Notice that h(0) = 0, and thus 0 is a fixed point of v = µ2 4 (cid:101)h(v). Moreover, by the mean value theorem, for v > 0, (cid:101)h(v) = h(0) + (cid:101)h(cid:48)(ξ)v for some ξ ∈ (0, v). Thus µ2 4 (cid:101)h(v) = µ2 4 (cid:101)h(cid:48)(ξ)v. By the assumption that µ > 2, and limv→0 (cid:101)h(cid:48)(v) = 1, it follows that there exists a v∗ > 0 such that µ2 4 (cid:101)h(v) < v for all v sufficiently large. Since (cid:101)h is continuous, v = µ2 4 (cid:101)h(v) must have nonzero fixed points. Let v denote the smallest nonzero fixed point. Then v > 0, µ2 4 (cid:101)h(cid:48)(v) < 1. Because (cid:101)h is concave, (cid:101)h(cid:48)(v) ≤ (cid:101)h(cid:48)(v) for all v ≥ v. Thus µ2 4 (cid:101)h(v) > v for all v > v. Therefore, v is the unique nonzero fixed point and also the largest fixed point. It follows that if u1 < v, then {ut} is a non-decreasing sequence upper bounded by v. If u1 > v, then {ut} is a non-increasing sequence lower bounded by v. Since u1 > 0, it follows that limt→∞ ut = v. Hence,  4 (cid:101)h(v) > v for all v ∈ (0, v), and µ2  lim sup n→∞  inf (cid:98)σ  E [O(σ, (cid:98)σ)] ≤ lim  t→∞  lim sup n→∞  E (cid:2)O(σ, (cid:98)σt  BP)(cid:3) ≤ lim  t→∞  n→∞ (cid:101)qT t,α = Q( lim  √  v).  (19)  It follows from Theorem 2 and Lemma 15 that  lim inf n→∞  inf (cid:98)σ  E [O(σ, (cid:98)σ)] ≥ lim  t→∞  lim n→∞  p∗ T t = Q(  √  v).  (20)  The theorem follows by combining the last two displayed equations.  Research supported by NSF grant CCF 1320105, DOD ONR grant N00014-14-1-0823, and grant 328025 from the Simons Foundation. J. Xu would like to thank Bruce Hajek and Yihong Wu for numerous discussions on belief propagation algorithms and density evolution analysis.  5. Acknowledgement  References  E. Abbe and C. Sandon. Community detection in general stochastic block models: fundamental  limits and efficient recovery algorithms. arXiv 1503.00609, March 2015.  E. Abbe, A. S. Bandeira, and G. Hall. Exact recovery in the stochastic block model.  arXiv  1405.3267, October 2014.  N. Agarwal, A. S. Bandeira, K. Koiliaris, and A. Kolla. Multisection in the stochastic block model  using semidefinite programming. arXiv 1507.02323, July 2015. DENSITY EVOLUTION IN STOCHASTIC BLOCK MODEL  A. Anandkumar, R. Ge, D. Hsu, and S. M. Kakade. A tensor spectral approach to learning mixed membership community models. Journal of Machine Learning Research, 15:2239-2312, June 2014.  A.S. Bandeira. Random Laplacian matrices and convex relaxations. arXiv 1504.03987, April 2015.  P. J. Bickel and A. Chen. A nonparametric view of network models and Newman-Girvan and other modularities. Proceedings of the National Academy of Science, 106(50):21068-21073, 2009.  C. Bordenave, M. Lelarge, and L. Massouli´e. Non-backtracking spectrum of random graphs: com- munity detection and non-regular Ramanujan graphs. ArXiv 1501.06087, January 2015. URL http://arxiv.org/abs/1501.06087.  T. Cai and X. Li. Robust and computationally feasible community detection in the presence of  arbitrary outlier nodes. arXiv preprint arXiv:1404.6000, 2014.  Y. Chen and J. Xu. Statistical-computational tradeoffs in planted problems and submatrix localiza- tion with a growing number of clusters and submatrices. In Proceedings of ICML 2014 (Also arXiv:1402.1267), Feb 2014.  Y. Chen, S. Sanghavi, and H. Xu. Improved graph clustering. IEEE Transactions on Information Theory. An earlier version of this work appeared under the title ”Clustering Sparse Graphs” at NIPS 2012, 60(10):6440-6455, Oct 2014. ISSN 0018-9448.  A. Coja-Oghlan. A spectral heuristic for bisecting random graphs. In Proceedings of the sixteenth annual ACM-SIAM symposium on Discrete algorithms, SODA ’05, pages 850-859, Philadelphia, PA, USA, 2005. Society for Industrial and Applied Mathematics.  A. Coja-Oghlan. Graph partitioning via adaptive spectral techniques. Comb. Probab. Comput., 19  (2):227-284, March 2010.  A. Condon and Richard M. Karp. Algorithms for graph partitioning on the planted partition model.  Random Structures and Algorithms, 18(2):116-140, 2001.  A. Decelle, F. Krzakala, C. Moore, and L. Zdeborov´a. Asymptotic analysis of the stochastic block model for modular networks and its algorithmic applications. Phys. Rev. E, 84:066106, Dec 2011a.  A. Decelle, F. Krzakala, C. Moore, and L. Zdeborov´a. Inference and phase transitions in the detec-  tion of modules in sparse networks. Phys. Rev. Lett., 107:065701, 2011b.  Y. Deshpande, E. Abbe, and A. Montanari. Asymptotic mutual information for the two-groups  stochastic block model. arXiv:1507.08685, July 2015.  M. E. Dyer and A. M. Frieze. The solution of some random NP-hard problems in polynomial  expected time. Journal of Algorithms, 10(4):451-489, 1989.  D. Gamarnik and M. Sudan. Limits of local algorithms over sparse random graphs. In Proceedings of the 5th conference on Innovations in theoretical computer science, pages 369-376. ACM, 2014. MOSSEL XU  C. Gao, Z. Ma, A. Y. Zhang, and H. H. Zhou. Achieving optimal misclassification proportion in  stochastic block model. arXiv:1505.03772, 2015.  B. Hajek, Y. Wu, and J. Xu. Achieving exact cluster recovery threshold via semidefinite program-  ming. arXiv1 412.6156, Nov. 2014.  B. Hajek, Y. Wu, and J. Xu. Achieving exact cluster recovery threshold via semidefinite program-  ming: Extensions. arXiv:1502.07738, 2015a.  B. Hajek, Y. Wu, and J. Xu. Recovering a hidden community beyond the spectral limit in  O(|E| log∗ |V |) time. arXiv 1510.02786, October 2015b.  H. Hatami, L. Lov´asz, and B. Szegedy. Limits of local-global convergent graph sequences. arXiv  preprint arXiv:1205.4356, 2012.  5(2):109-137, 1983.  P. W. Holland, K. B. Laskey, and S. Leinhardt. Stochastic blockmodels: First steps. Social Networks,  M. Jerrum and G. B. Sorkin. The Metropolis algorithm for graph bisection. Discrete Applied  Mathematics, 82(1-3):155-175, 1998.  V. Kanade, E. Mossel, and T. Schramm. Global and local information in clustering labeled block In Proceedings of Approximation, Randomization, and Combinatorial Optimization.  models. Algorithms and Techniques, pages 779-810, 2014.  H. Kesten and B. P. Stigum. Additional limit theorems for indecomposable multidimensional  Galton-Watson processes. Ann. Math. Statist., 37:1463-1481, 1966.  V. Korolev and I. Shevtsova. An improvement of the Berry-Esseen inequality with applications to Poisson and mixed Poisson random sums. Scandinavian Actuarial Journal, 2012(2):81-105, 2012.  R. Lyons and F. Nazarov. Perfect matchings as iid factors on non-amenable groups. European  Journal of Combinatorics, 32(7):1115-1125, 2011.  L. Massouli´e. Community detection thresholds and the weak Ramanujan property. In Proceedings  of the Symposium on the Theory of Computation (STOC), 2014.  F. McSherry. Spectral partitioning of random graphs. In Proceedings of IEEE Conference on the  Foundations of Computer Science (FOCS), pages 529-537, 2001.  M. Mezard and A. Montanari. Information, Physics, and Computation. Oxford University Press,  Inc., New York, NY, USA, 2009. ISBN 019857083X, 9780198570837.  A. Montanari. Tight bounds for LDPC and LDGM codes under MAP decoding. IEEE Transactions  on Information Theory, 51(9):3221-3246, Sept 2005.  A. Montanari. Finding one community in a sparse random graph. arXiv 1502.05680, Feb 2015.  A. Montanari and D. Tse. Analysis of belief propagation for non-linear problems: The example of cdma (or: How to prove tanaka’s formula). In Information Theory Workshop, 2006. ITW ’06 Punta del Este. IEEE, pages 160-164, March 2006. DENSITY EVOLUTION IN STOCHASTIC BLOCK MODEL  E. Mossel and J. Xu. Local algorithms for block models with side information. In Accepted to The 7th Innovations in Theoretical Computer Science (ITCS) conference. arXiv:1508.02344, 2015.  E. Mossel, J. Neeman, and A. Sly. Belief propogation, robust reconstruction, and optimal recovery  of block models. arXiv 1309.1380, 2013a.  E. Mossel, J. Neeman, and A. Sly. A proof of the block model threshold conjecture.  arXiv  1311.4115, 2013b.  arxiv:1311.4115, 2013c.  E. Mossel, J. Neeman, and A. Sly.  A proof of the block model  threshold conjecture.  E. Mossel, J. Neeman, and A. Sly. Reconstruction and estimation in the planted partition model. To appear in Probability Theory and Related Fields. The Arxiv version of this paper is titled Stochastic Block Models and Reconstruction, 2015a.  E. Mossel, J. Neeman, and A. Sly. Consistency thresholds for the planted bisection model.  In Proceedings of the Forty-Seventh Annual ACM on Symposium on Theory of Computing, STOC ’15, pages 69-75, New York, NY, USA, 2015b. ACM.  W. Perry and A. S. Wein. A semidefinite program for unbalanced multisection in the stochastic  block model. arXiv:1507.05605v1, 2015.  T. Richardson and R. Urbanke. Modern Coding Theory. Cambridge University Press, 2008. ISBN  9780511791338. Cambridge Books Online.  T. A. B. Snijders and K. Nowicki. Estimation and prediction for stochastic blockmodels for graphs  with latent block structure. Journal of Classification, 14(1):75-100, 1997.  S. Yun and A. Proutiere. Accurate community detection in the stochastic block model via spectral  algorithms. arXiv 1412.7335, 2014a.  S. Yun and A. Proutiere. Community detection via random and adaptive sampling. In Proceedings  of The 27th Conference on Learning Theory, 2014b.  A. Y. Zhang and H. H. Zhou. Minimax rates of community detection in stochastic block models.  arXiv:1507.05313, 2015.  P. Zhang, F. Krzakala, J. Reichardt, and L. Zdeborov´a. Comparitive study for inference of hidden classes in stochastic block models. Journal of Statistical Mechanics : Theory and Experiment, 2012.  P. Zhang, C. Moore, and M. E. J. Newman. Community detection in networks with unequal groups.  arXiv:1509.00107, Sep. 2015. MOSSEL XU"}