{"1": "Raja Hafiz Affandi, Alex Kulesza, Emily Fox, and Ben Taskar. Nystrom approximation for large- scale determinantal processes. In Carlos M. Carvalho and Pradeep Ravikumar, editors, Proceed- ings of the Sixteenth International Conference on Artificial Intelligence and Statistics, volume 31 of Proceedings of Machine Learning Research, pages 85-98, Scottsdale, Arizona, USA, 29 Apr- 01 May 2013. PMLR. URL http://proceedings.mlr.press/v31/affandi13a. html.  Ahmed El Alaoui and Michael W. Mahoney. Fast randomized kernel ridge regression with sta- tistical guarantees. In Proceedings of the 28th International Conference on Neural Information Processing Systems, pages 775-783, Montreal, Canada, December 2015.  Nima Anari, Shayan Oveis Gharan, and Alireza Rezaei. Monte carlo markov chain algorithms for sampling strongly rayleigh distributions and determinantal point processes. In Vitaly Feldman, Alexander Rakhlin, and Ohad Shamir, editors, 29th Annual Conference on Learning Theory, volume 49 of Proceedings of Machine Learning Research, pages 103-115, Columbia University, New York, New York, USA, 23-26 Jun 2016. PMLR. URL http://proceedings.mlr. press/v49/anari16.html.  Haim Avron and Christos Boutsidis. Faster subset selection for matrices and applications. SIAM  Journal on Matrix Analysis and Applications, 34(4):1464-1499, 2013.  R´emi Bardenet and Adrien Hardy. Monte Carlo with Determinantal Point Processes. work- ing paper or preprint, May 2016. URL https://hal.archives-ouvertes.fr/ hal-01311263.  R´emi Bardenet, Fr´ed´eric Lavancier, Xavier Mary, and Aur´elien Vasseur. On a few statisti- cal applications of determinantal point processes. ESAIM: Procs, 60:180-202, 2017. doi: 10.1051/proc/201760180. URL https://doi.org/10.1051/proc/201760180.  Christos Boutsidis and David P. Woodruff. Optimal cur matrix decompositions. SIAM Journal on Computing, 46(2):543-589, 2017. doi: 10.1137/140977898. URL https://doi.org/10. 1137/140977898.  Christos Boutsidis, Petros Drineas, and Malik Magdon-Ismail. Near optimal column-based matrix In 2011 IEEE 52nd Annual Symposium on Foundations of Computer Science,  reconstruction. pages 305-314, Oct 2011. doi: 10.1109/FOCS.2011.21.  Cl´ement Canonne. A short note on poisson tail bounds. Technical report, Columbia University,  2017.  Kenneth L. Clarkson and David P. Woodruff. Low-rank approximation and regression in input sparsity time. J. ACM, 63(6):54:1-54:45, January 2017. ISSN 0004-5411. doi: 10.1145/3019134. URL http://doi.acm.org/10.1145/3019134.  13   FAST DETERMINANTAL POINT PROCESSES  We thank the NSF for funding via the NSF TRIPODS program. Part of this work was done while MD was visiting the Simons Institute for the Theory of Computing.  Acknowledgments  References  Raja Hafiz Affandi, Alex Kulesza, Emily Fox, and Ben Taskar. Nystrom approximation for large- scale determinantal processes. In Carlos M. Carvalho and Pradeep Ravikumar, editors, Proceed- ings of the Sixteenth International Conference on Artificial Intelligence and Statistics, volume 31 of Proceedings of Machine Learning Research, pages 85-98, Scottsdale, Arizona, USA, 29 Apr- 01 May 2013. PMLR. URL http://proceedings.mlr.press/v31/affandi13a. html.  Ahmed El Alaoui and Michael W. Mahoney. Fast randomized kernel ridge regression with sta- tistical guarantees. In Proceedings of the 28th International Conference on Neural Information Processing Systems, pages 775-783, Montreal, Canada, December 2015.  Nima Anari, Shayan Oveis Gharan, and Alireza Rezaei. Monte carlo markov chain algorithms for sampling strongly rayleigh distributions and determinantal point processes. In Vitaly Feldman, Alexander Rakhlin, and Ohad Shamir, editors, 29th Annual Conference on Learning Theory, volume 49 of Proceedings of Machine Learning Research, pages 103-115, Columbia University, New York, New York, USA, 23-26 Jun 2016. PMLR. URL http://proceedings.mlr. press/v49/anari16.html.  Haim Avron and Christos Boutsidis. Faster subset selection for matrices and applications. SIAM  Journal on Matrix Analysis and Applications, 34(4):1464-1499, 2013.  R´emi Bardenet and Adrien Hardy. Monte Carlo with Determinantal Point Processes. work- ing paper or preprint, May 2016. URL https://hal.archives-ouvertes.fr/ hal-01311263.  R´emi Bardenet, Fr´ed´eric Lavancier, Xavier Mary, and Aur´elien Vasseur. On a few statisti- cal applications of determinantal point processes. ESAIM: Procs, 60:180-202, 2017. doi: 10.1051/proc/201760180. URL https://doi.org/10.1051/proc/201760180.  Christos Boutsidis and David P. Woodruff. Optimal cur matrix decompositions. SIAM Journal on Computing, 46(2):543-589, 2017. doi: 10.1137/140977898. URL https://doi.org/10. 1137/140977898.  Christos Boutsidis, Petros Drineas, and Malik Magdon-Ismail. Near optimal column-based matrix In 2011 IEEE 52nd Annual Symposium on Foundations of Computer Science,  reconstruction. pages 305-314, Oct 2011. doi: 10.1109/FOCS.2011.21.  Cl´ement Canonne. A short note on poisson tail bounds. Technical report, Columbia University,  2017.  Kenneth L. Clarkson and David P. Woodruff. Low-rank approximation and regression in input sparsity time. J. ACM, 63(6):54:1-54:45, January 2017. ISSN 0004-5411. doi: 10.1145/3019134. URL http://doi.acm.org/10.1145/3019134. FAST DETERMINANTAL POINT PROCESSES  Michael B. Cohen, Sam Elder, Cameron Musco, Christopher Musco, and Madalina Persu. Dimen- sionality reduction for k-means clustering and low rank approximation. In Proceedings of the Forty-seventh Annual ACM Symposium on Theory of Computing, STOC ’15, pages 163-172, New York, NY, USA, 2015. ACM. ISBN 978-1-4503-3536-2. doi: 10.1145/2746539.2746569. URL http://doi.acm.org/10.1145/2746539.2746569.  Michał Derezi´nski and Manfred K. Warmuth. Reverse iterative volume sampling for linear regres- sion. Journal of Machine Learning Research, 19(23):1-39, 2018. URL http://jmlr.org/ papers/v19/17-781.html.  Michał Derezi´nski, Manfred K. Warmuth, and Daniel Hsu. Leveraged volume sampling for In S. Bengio, H. Wallach, H. Larochelle, K. Grauman, N. Cesa-Bianchi, linear regression. and R. Garnett, editors, Advances in Neural Information Processing Systems 31, pages 2510-2519. Curran Associates, Inc., 2018. URL http://papers.nips.cc/paper/ 7517-leveraged-volume-sampling-for-linear-regression.pdf.  Michał Derezi´nski, Manfred K. Warmuth, and Daniel Hsu. Correcting the bias in least squares regression with volume-rescaled sampling. In Proceedings of the 22nd International Conference on Artificial Intelligence and Statistics, 2019.  Amit Deshpande and Luis Rademacher. Efficient volume sampling for row/column subset selection. In Proceedings of the 2010 IEEE 51st Annual Symposium on Foundations of Computer Science, pages 329-338, Las Vegas, USA, October 2010.  Amit Deshpande, Luis Rademacher, Santosh Vempala, and Grant Wang. Matrix approximation and projective clustering via volume sampling. In Proceedings of the Seventeenth Annual ACM-SIAM Symposium on Discrete Algorithm, pages 1117-1126, Miami, FL, USA, January 2006.  Petros Drineas, Malik Magdon-Ismail, Michael W. Mahoney, and David P. Woodruff. Fast approx- imation of matrix coherence and statistical leverage. J. Mach. Learn. Res., 13(1):3475-3506, December 2012.  Jennifer Gillenwater, Alex Kulesza, and Ben Taskar. Discovering diverse and salient threads in In Proceedings of the 2012 Joint Conference on Empirical Methods in document collections. Natural Language Processing and Computational Natural Language Learning, EMNLP-CoNLL ’12, pages 710-720, Stroudsburg, PA, USA, 2012. Association for Computational Linguistics. URL http://dl.acm.org/citation.cfm?id=2390948.2391026.  Boqing Gong, Wei-Lun Chao, Kristen Grauman, and Fei Sha. Diverse sequential subset selection for supervised video summarization. In Z. Ghahramani, M. Welling, C. Cortes, N. D. Lawrence, and K. Q. Weinberger, editors, Advances in Neural Information Processing Systems 27, pages 2069-2077. Curran Associates, Inc., 2014.  A Guenoche. Random spanning tree. doi:  0196-6774. sciencedirect.com/science/article/pii/0196677483900226.  https://doi.org/10.1016/0196-6774(83)90022-6.  Journal of Algorithms, 4(3):214 - 220, 1983.  ISSN URL http://www.  Venkatesan Guruswami and Ali K. Sinop. Optimal column-based low-rank matrix reconstruction. In Proceedings of the Twenty-third Annual ACM-SIAM Symposium on Discrete Algorithms, pages 1207-1214, Kyoto, Japan, January 2012. FAST DETERMINANTAL POINT PROCESSES  J Ben Hough, Manjunath Krishnapur, Yuval Peres, B´alint Vir´ag, et al. Determinantal processes and  independence. Probability surveys, 3:206-229, 2006.  Alex Kulesza and Ben Taskar. Structured determinantal point processes. In J. D. Lafferty, C. K. I. Williams, J. Shawe-Taylor, R. S. Zemel, and A. Culotta, editors, Advances in Neural Information Processing Systems 23, pages 1171-1179. Curran Associates, Inc., 2010.  Alex Kulesza and Ben Taskar. k-DPPs: Fixed-Size Determinantal Point Processes. In Proceedings of the 28th International Conference on Machine Learning, pages 1193-1200, Bellevue, WA, USA, June 2011.  Alex Kulesza and Ben Taskar. Determinantal Point Processes for Machine Learning. Now Publish-  ers Inc., Hanover, MA, USA, 2012.  Chengtao Li, Stefanie Jegelka, and Suvrit Sra. Efficient sampling for k-determinantal point pro- In Arthur Gretton and Christian C. Robert, editors, Proceedings of the 19th Interna- cesses. tional Conference on Artificial Intelligence and Statistics, volume 51 of Proceedings of Ma- chine Learning Research, pages 1328-1337, Cadiz, Spain, 09-11 May 2016. PMLR. URL http://proceedings.mlr.press/v51/li16f.html.  Hui Lin and Jeff Bilmes. A class of submodular functions for document summarization. In Pro- ceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Hu- man Language Technologies - Volume 1, HLT ’11, pages 510-520, Stroudsburg, PA, USA, ISBN 978-1-932432-87-9. URL http: 2011. Association for Computational Linguistics. //dl.acm.org/citation.cfm?id=2002472.2002537.  Odile Macchi. The coincidence approach to stochastic point processes. Advances in Applied Prob- ISSN 00018678. URL http://www.jstor.org/stable/  ability, 7(1):83-122, 1975. 1425855.  Avner Magen and Anastasios Zouzias. Near optimal dimensionality reductions that preserve vol- umes. In Ashish Goel, Klaus Jansen, Jos´e D. P. Rolim, and Ronitt Rubinfeld, editors, Approxima- tion, Randomization and Combinatorial Optimization. Algorithms and Techniques, pages 523- 534, Berlin, Heidelberg, 2008. Springer Berlin Heidelberg. ISBN 978-3-540-85363-3.  Xiangrui Meng and Michael W. Mahoney. Low-distortion subspace embeddings in input-sparsity time and applications to robust linear regression. In Proceedings of the Forty-fifth Annual ACM Symposium on Theory of Computing, STOC ’13, pages 91-100, New York, NY, USA, 2013. ACM. ISBN 978-1-4503-2029-0. doi: 10.1145/2488608.2488621. URL http://doi.acm. org/10.1145/2488608.2488621.  Jelani Nelson and Huy L. Nguyˆen. Osnap: Faster numerical linear algebra algorithms via sparser subspace embeddings. In Proceedings of the 2013 IEEE 54th Annual Symposium on Foundations of Computer Science, FOCS ’13, pages 117-126, Washington, DC, USA, 2013. IEEE Computer ISBN 978-0-7695-5135-7. doi: 10.1109/FOCS.2013.21. URL http://dx.doi. Society. org/10.1109/FOCS.2013.21.  Robin Pemantle and Yuval Peres. Concentration of lipschitz functionals of determinantal and other strong rayleigh measures. Combinatorics, Probability and Computing, 23(1):140-160, 2014. doi: 10.1017/S0963548313000345. FAST DETERMINANTAL POINT PROCESSES  Joel A. Tropp. User-friendly tail bounds for sums of random matrices. Foundations of Computa-  tional Mathematics, 12(4):389-434, August 2012.  H. Robert van der Vaart. A note on wilks’ internal scatter. Ann. Math. Statist., 36(4):1308-1312, 08 1965. doi: 10.1214/aoms/1177700006. URL https://doi.org/10.1214/aoms/ 1177700006.  Cheng Zhang, Hedvig Kjellstr¨om, and Stephan Mandt. Determinantal point processes for mini- In 33rd Conference on Uncertainty in Artificial Intelligence, UAI 2017,  batch diversification. Sydney, Australia, 11 August 2017 through 15 August 2017. AUAI Press Corvallis, 2017. FAST DETERMINANTAL POINT PROCESSES"}