{"1": "M. Alekhnovich, M. Braverman, V. Feldman, A. R. Klivans, and T. Pitassi. The complexity of  properly learning simple concept classes. J. Comp. Sys. Sci., 74(1):16-34, 2008.  E. Amaldi and V. Kann. On the approximability of minimizing nonzero variables or unsatisfied  relations in linear systems. Theoret. Comput. Sci., 209(1-2):237-260, 1998.  B. Applebaum, B. Barak, and D. Xiao. On basing lower-bounds for learning on worst-case as- sumptions. In Proc. 49th Annual IEEE Symposium on Foundations of Computer Science, pages 211-220, 2008.  R. I. Arriaga and S. Vempala. An algorithmic theory of learning: Robust concepts and random  projection. Machine Learning, 63(2):161-182, 2006.  P. Awasthi, M. F. Balcan, and P. M. Long. The power of localization for efficiently learning linear  separators with noise. J. ACM, 63(6):50:1-50:27, 2017.  S. Ben-David, N. Eiron, and P. M. Long. On the difficulty of approximately maximizing agree- ments. J. Comp. Sys. Sci., 66(3):496 - 514, 2003. ISSN 0022-0000. doi: http://dx.doi.org/ 10.1016/S0022-0000(03)00038-2. URL http://www.sciencedirect.com/science/ article/pii/S0022000003000382.  A. Blum and R. Kannan. Learning an intersection of a constant number of halfspaces over a uniform  distribution. J. Comp. Sys. Sci., 54(2):371-380, 1997.  A. Blum and R. L. Rivest. Training a 3-node neural network is NP-complete. In Machine Learning: From Theory to Applications - Cooperative Research at Siemens and MIT, pages 9-28, 1993.  A. Blum, A. Frieze, R. Kannan, and S. Vempala. A polynomial-time algorithm for learning noisy  linear threshold functions. Algorithmica, 22(1):35-52, 1998.  A. Blum, A. Kalai, and H. Wasserman. Noise-tolerant learning, the parity problem, and the statisti-  cal query model. J. ACM, 50(4):506-519, 2003.  A. Blumer, A. Ehrenfeucht, D. Haussler, and M. K. Warmuth. Learnability and the Vapnik-  Chervonenkis dimension. J. ACM, 36(4):929-965, 1989.  N. H. Bshouty and L. Burroughs. Maximizing agreements and coagnostic learning. Theoret. Com-  put. Sci., 350(1):24-39, 2006.  A. Carbery and J. Wright. Distributional and lq norm inequalities for polynomials over convex  bodies in Rn. Math. Res. Lett., 8(3):233-248, 2001.  E. Cohen. Learning noisy perceptrons by a perceptron in polynomial time. In Proc. 38th Annual  IEEE Symposium on Foundations of Computer Science, pages 514-523, 1997.  C. Cortes and V. Vapnik. Support-Vector networks. Machine Learning, 20(3):273-297, 1995.  A. Daniely. A PTAS for agnostically learning halfspaces. In Proc. 28th Annual ACM Workshop on  Computational Learning Theory, pages 484-502, 2015.  13   HARDNESS OF LEARNING HALFSPACES USING PTFS  References  M. Alekhnovich, M. Braverman, V. Feldman, A. R. Klivans, and T. Pitassi. The complexity of  properly learning simple concept classes. J. Comp. Sys. Sci., 74(1):16-34, 2008.  E. Amaldi and V. Kann. On the approximability of minimizing nonzero variables or unsatisfied  relations in linear systems. Theoret. Comput. Sci., 209(1-2):237-260, 1998.  B. Applebaum, B. Barak, and D. Xiao. On basing lower-bounds for learning on worst-case as- sumptions. In Proc. 49th Annual IEEE Symposium on Foundations of Computer Science, pages 211-220, 2008.  R. I. Arriaga and S. Vempala. An algorithmic theory of learning: Robust concepts and random  projection. Machine Learning, 63(2):161-182, 2006.  P. Awasthi, M. F. Balcan, and P. M. Long. The power of localization for efficiently learning linear  separators with noise. J. ACM, 63(6):50:1-50:27, 2017.  S. Ben-David, N. Eiron, and P. M. Long. On the difficulty of approximately maximizing agree- ments. J. Comp. Sys. Sci., 66(3):496 - 514, 2003. ISSN 0022-0000. doi: http://dx.doi.org/ 10.1016/S0022-0000(03)00038-2. URL http://www.sciencedirect.com/science/ article/pii/S0022000003000382.  A. Blum and R. Kannan. Learning an intersection of a constant number of halfspaces over a uniform  distribution. J. Comp. Sys. Sci., 54(2):371-380, 1997.  A. Blum and R. L. Rivest. Training a 3-node neural network is NP-complete. In Machine Learning: From Theory to Applications - Cooperative Research at Siemens and MIT, pages 9-28, 1993.  A. Blum, A. Frieze, R. Kannan, and S. Vempala. A polynomial-time algorithm for learning noisy  linear threshold functions. Algorithmica, 22(1):35-52, 1998.  A. Blum, A. Kalai, and H. Wasserman. Noise-tolerant learning, the parity problem, and the statisti-  cal query model. J. ACM, 50(4):506-519, 2003.  A. Blumer, A. Ehrenfeucht, D. Haussler, and M. K. Warmuth. Learnability and the Vapnik-  Chervonenkis dimension. J. ACM, 36(4):929-965, 1989.  N. H. Bshouty and L. Burroughs. Maximizing agreements and coagnostic learning. Theoret. Com-  put. Sci., 350(1):24-39, 2006.  A. Carbery and J. Wright. Distributional and lq norm inequalities for polynomials over convex  bodies in Rn. Math. Res. Lett., 8(3):233-248, 2001.  E. Cohen. Learning noisy perceptrons by a perceptron in polynomial time. In Proc. 38th Annual  IEEE Symposium on Foundations of Computer Science, pages 514-523, 1997.  C. Cortes and V. Vapnik. Support-Vector networks. Machine Learning, 20(3):273-297, 1995.  A. Daniely. A PTAS for agnostically learning halfspaces. In Proc. 28th Annual ACM Workshop on  Computational Learning Theory, pages 484-502, 2015. HARDNESS OF LEARNING HALFSPACES USING PTFS  A. Daniely. Complexity theoretic limitations on learning halfspaces. In Proc. 48th Annual ACM  Symposium on the Theory of Computing, pages 105-117, 2016.  A. Daniely and S. Shalev-Shwartz. Complexity theoretic limitations on learning DNF’s. In Proc.  29th Annual ACM Workshop on Computational Learning Theory, pages 815-830, 2016.  I. Diakonikolas, R. O’Donnell, R. A. Servedio, and Y. Wu. Hardness results for agnostically learning low-degree polynomial threshold functions. In Proc. 22nd ACM-SIAM Symposium on Discrete Algorithms, pages 1590-1606, 2011.  V. Feldman, P. Gopalan, S. Khot, and A. K. Ponnuswami. On agnostic learning of parities, mono-  mials, and halfspaces. SIAM J. Comput., 39(2):606-645, 2009.  V. Feldman, V. Guruswami, P. Raghavendra, and Y. Wu. Agnostic learning of monomials by halfs-  paces is hard. SIAM J. Comput., 41(6):1558-1590, 2012.  P. Gopalan, S. Khot, and R. Saket. Hardness of reconstructing multivariate polynomials over finite  fields. SIAM J. Comput., 39(6):2598-2621, 2010.  V. Guruswami and P. Raghavendra. Hardness of learning halfspaces with noise. SIAM J. Comput.,  39(2):742-765, 2009.  V. Guruswami, P. Raghavendra, R. Saket, and Yi Wu. Bypassing UGC from some optimal geometric  inapproximability results. ACM Trans. Algorithms, 12(1):6:1-6:25, 2016.  J. H˚astad. Some optimal inapproximability results. J. ACM, 48(4):798-859, 2001.  D. Haussler. Decision theoretic generalizations of the pac model for neural net and other learning  applications. Inform. and Comp., 100(1):78-150, 1992.  D. S. Johnson and F. P. Preparata. The densest hemisphere problem. Theoret. Comput. Sci., 6:  93-107, 1978.  A. T. Kalai, A. R. Klivans, Y. Mansour, and R. A. Servedio. Agnostically learning halfspaces. In  Proc. 46th Annual IEEE Symposium on Foundations of Computer Science, 2005.  A. T. Kalai, Y. Mansour, and E. Verbin. On agnostic boosting and parity learning. In Proc. 40th  Annual ACM Symposium on the Theory of Computing, pages 629-638, 2008.  M.J. Kearns, R.E. Schapire, and L.M. Sellie. Toward efficient agnostic learning. Machine Learning,  17(2-3):115-141, 1994.  S. Khot. On the power of unique 2-prover 1-round games. In Proc. 34th Annual ACM Symposium  on the Theory of Computing, pages 767-775, 2002.  S. Khot. personal communication, 2009.  S. Khot and R. Saket. On the hardness of learning intersections of two halfspaces. J. Comp. Sys.  Sci., 77(1):129-141, 2011.  A. R. Klivans and P. Kothari. Embedding hard learning problems into gaussian space. In Proc. 18th International Workshop on Randomization and Computation (RANDOM), pages 793-809, 2014. HARDNESS OF LEARNING HALFSPACES USING PTFS  A. R. Klivans and R. A. Servedio. Learning intersections of halfspaces with a margin. J. Comp.  Sys. Sci., 74(1):35-48, 2008.  A. R. Klivans and A. A. Sherstov. Cryptographic hardness for learning intersections of halfspaces.  J. Comp. Sys. Sci., 75(1):2-12, 2009.  A. R. Klivans, R. O’Donnell, and R. A. Servedio. Learning intersections and thresholds of halfs-  paces. J. Comp. Sys. Sci., 68(4):808-840, 2004.  A. R. Klivans, P. M. Long, and R. A. Servedio. Learning halfspaces with malicious noise. J. Mach.  Learn. Res., 10:2715-2740, 2009.  M. Minsky and S. Papert. Perceptrons: an introduction to computational geometry. MIT Press,  Cambridge, MA, 1969.  1595-1598, 1990.  O.J. Murphy. Nearest neighbor pattern classification perceptrons. Proceedings of the IEEE, 78(10):  F. Rosenblatt. Principles of Neurodynamics. Spartan, New York, 1962.  U. R¨ukert, L. Richter, and S. Kramer. Quantitative association rules based on half-spaces. In Proc.  4th IEEE International Conference on Data Mining, pages 507-510, 2004.  S. Vempala. A random sampling based algorithm for learning the intersection of half-spaces. In Proc. 38th Annual IEEE Symposium on Foundations of Computer Science, pages 508-513, 1997.  E. Viola. The sum of D small-bias generators fools polynomials of degree D. Comput. Complexity,  18(2):209-217, 2009."}