{"1": "Mohsen Bayati, Jeong Han Kim, and Amin Saberi. A sequential algorithm for generating random  graphs. Algorithmica, 4(58):860-910, 2010.  Srinadh Bhojanapalli and Prateek Jain. Universal matrix completion. In Proceedings of The 31st  International Conference on Machine Learning, pages 1881-1889, 2014.  Jian-Feng Cai, Emmanuel J Cand`es, and Zuowei Shen. A singular value thresholding algorithm for  matrix completion. SIAM Journal on Optimization, 20(4):1956-1982, 2010.  Emmanuel J Candes and Yaniv Plan. Matrix completion with noise. Proceedings of the IEEE, 98  (6):925-936, 2010.  7   MATRIX COMPLETION FROM O(n) SAMPLES IN LINEAR TIME  the operations T2 to lift the small singular values and truncate the large singular values of U t St+1,L ∀j ∈ [n], before each row vector of ˜V t+1 = (˜vt+1,T , 1 ≤ j ≤ n) is computed. This singular value thresholding step enforces that all the singular values of the Gramian matrix inverted in (8) deviate from their expected values by at most 1 − β after proper normalization, and as a result, guarantees the nonsingularity of this (adjusted) Gramian matrix. The convergence of the algorithm relies on the fact that w.h.p. the number of times the algorithm applies the operation T2 in each iteration is a small fraction of n. Also, the operators T1 are applied at the end of each iteration to guarantee the incoherence of the input V t+1 (or U t+1) for the next iteration while maintaining that V t+1 (or U t+1) is still close enough to V ∗ (or U ∗).  ,  j  j  Our main result concerns the performance of the algorithm T AM under Assumption 1 and  under both Assumptions 1 and 2, respectively. We recall that T AM is parameterized by δ and β.  Theorem 1 Suppose M ∈ Rn×n is a rank-k matrix satisfying Assumption 1. Suppose the observed index set Ω is sampled according to the model RRG(d, n, N ) in (6). Given any δ ∈ (0, 1), β ∈ (0, 1 − δ) and (cid:15) ∈ (0, 2/3), there exists a C(δ, β) > 0 such that for  d ≥ C(δ, β)k4µ2 0  (cid:19)2  (cid:18) σ∗ 1 σ∗ k  +  5µ0k(1 + δ/3) δ2  log  (cid:19)  (cid:18) 1 (cid:15)  and N ≥ 1 + (cid:100)log( 2 MN (cid:107)F ≤ (cid:15)(cid:107)M (cid:107)F w.h.p.  (cid:15) )/ log 4(cid:101), the T AM algorithm produces a matrix MN satisfying (cid:107)M −  Furthermore, suppose M satisfies both Assumptions 1 and 2. Then for δ ∈ (0, 1) as defined in  Assumption 2 and β ∈ (0, 1 − δ), the same result holds when  (11)  (12)  d ≥ C(δ, β)k4µ2 0  (cid:19)2  ,  (cid:18) σ∗ 1 σ∗ k  for the same constant C(δ, β) in (11).  Theorem 1 states that under Assumption 1 the T AM algorithm produces a rank-k (cid:15)-approximation  of matrix M using O(dn log(1/(cid:15))) samples for d satisfying (11). Furthermore, under both Assump- tion 1 and Assumption 2 the T AM algorithm produces a rank-k (cid:15)-approximation of matrix M using O(dn log(1/(cid:15))) samples for d satisfying (12).  References  Mohsen Bayati, Jeong Han Kim, and Amin Saberi. A sequential algorithm for generating random  graphs. Algorithmica, 4(58):860-910, 2010.  Srinadh Bhojanapalli and Prateek Jain. Universal matrix completion. In Proceedings of The 31st  International Conference on Machine Learning, pages 1881-1889, 2014.  Jian-Feng Cai, Emmanuel J Cand`es, and Zuowei Shen. A singular value thresholding algorithm for  matrix completion. SIAM Journal on Optimization, 20(4):1956-1982, 2010.  Emmanuel J Candes and Yaniv Plan. Matrix completion with noise. Proceedings of the IEEE, 98  (6):925-936, 2010. GAMARNIK LI ZHANG  Emmanuel J Cand`es and Benjamin Recht. Exact matrix completion via convex optimization. Foun-  dations of computational mathematics, 9(6):717-772, 2009.  Emmanuel J Cand`es and Terence Tao. The power of convex relaxation: Near-optimal matrix com-  pletion. IEEE Transactions on Information Theory, 56(5):2053-2080, 2010.  David Gross. Recovering low-rank matrices from few coefficients in any basis. IEEE Transactions  on Information Theory, 57(3):1548-1566, 2011.  Moritz Hardt. Understanding alternating minimization for matrix completion. In Foundations of Computer Science (FOCS), 2014 IEEE 55th Annual Symposium on, pages 651-660. IEEE, 2014.  Prateek Jain, Praneeth Netrapalli, and Sujay Sanghavi. Low-rank matrix completion using alternat-  ing minimization. arXiv preprint arXiv:1212.0467, 2012.  Raghunandan H Keshavan, Andrea Montanari, and Sewoong Oh. Matrix completion from a few  entries. IEEE Transactions on Information Theory, 56(6):2980-2998, 2010.  Jeong Han Kim. Poisson cloning model for random graphs. In Proceedings of the International  Congress of Mathematicians, pages 873-897, 2006.  Franz J Kir´aly, Louis Theran, and Ryota Tomioka. The algebraic combinatorial approach for low-  rank matrix completion. Journal of Machine Learning Research, 16:1391-1436, 2015.  Raghu Meka, Prateek Jain, and Inderjit S Dhillon. Matrix completion from power-law distributed  samples. In Advances in neural information processing systems, pages 1258-1266, 2009.  Daniel L Pimentel-Alarc´on, Nigel Boston, and Robert D Nowak. A characterization of deterministic sampling patterns for low-rank matrix completion. IEEE Journal of Selected Topics in Signal Processing, 10(4):623-636, 2016.  Benjamin Recht. A simpler approach to matrix completion. Journal of Machine Learning Research,  12(Dec):3413-3430, 2011."}