{"1": "J. Ba and R. Caruana. Do deep nets really need to be deep? In Advances in Neural Information  Processing Systems, pages 2654-2662, 2014.  M.-F Balcan and P. Long. Active and passive learning of linear separators under log-concave distri-  butions. In Conference on Learning Theory, pages 288-316, 2013.  M.-F Balcan, E. Blais, A. Blum, and L. Yang. Active property testing.  In IEEE 53rd Annual  Symposium onFoundations of Computer Science (FOCS), 2012 , pages 21-30, 2012.  Mihir Bellare, Oded Goldreich, and Madhu Sudan. Free bits, PCPs, and nonapproximability-  towards tight results. SIAM Journal on Computing, 27(3):804-915, 1998.  A. Bhattacharyya, S. Kopparty, G. Schoenebeck, M. Sudan, and D. Zuckerman. Optimal testing In Foundations of Computer Science (FOCS), 2010 51st Annual IEEE  of reed-muller codes. Symposium on, pages 488-497. IEEE, 2010.  A. Bhattacharyya, E. Fischer, H. Hatami, P. Hatami, and S. Lovett. Every locally characterized affine-invariant property is testable. In Proceedings of the forty-fifth annual ACM symposium on Theory of computing, pages 429-436. ACM, 2013.  A. Bhattacharyya, E. Grigorescu, and A. Shapira. A unified framework for testing linear-invariant  properties. Random Structures & Algorithms, 46(2):232-260, 2015.  E. Blais. Testing juntas nearly optimally. In Proceedings of the forty-first annual ACM symposium  on Theory of computing, pages 151-158. ACM, 2009.  Eric Blais, Joshua Brody, and Kevin Matulef. Property testing lower bounds via communication  complexity. Computational Complexity, 21(2):311-358, 2012.  A. Blum. Relevant examples and relevant features: Thoughts from computational learning theory.  in AAAI Fall Symposium on ‘Relevance’, 1994.  A. Blum and R. Kannan. Learning an intersection of a constant number of halfspaces under a  uniform distribution. Journal of Computer and System Sciences, 54(2):371-380, 1997.  A. Blum and P. Langley. Selection of relevant features and examples in machine learning. Artificial  Intelligence, 97(1-2):245-271, 1997.  M. Blum, M. Luby, and R. Rubinfeld. Self-testing/correcting with applications to numerical prob-  lems. J. Comp. Sys. Sci., 47:549-595, 1993. Earlier version in STOC’90.  C. Bucilu˘a, R. Caruana, and A. Niculescu-Mizil. Model compression. In Proceedings of the 12th ACM SIGKDD International Conference on Knowledge discovery and Data mining, pages 535- 541, 2006.  D. Chakrabarty and C. Seshadhri. An o(n) monotonicity tester for boolean functions over the hy-  percube. SIAM Journal on Computing, 45(2):461-472, 2016.  13   IS YOUR FUNCTION LOW-DIMENSIONAL?  References  J. Ba and R. Caruana. Do deep nets really need to be deep? In Advances in Neural Information  Processing Systems, pages 2654-2662, 2014.  M.-F Balcan and P. Long. Active and passive learning of linear separators under log-concave distri-  butions. In Conference on Learning Theory, pages 288-316, 2013.  M.-F Balcan, E. Blais, A. Blum, and L. Yang. Active property testing.  In IEEE 53rd Annual  Symposium onFoundations of Computer Science (FOCS), 2012 , pages 21-30, 2012.  Mihir Bellare, Oded Goldreich, and Madhu Sudan. Free bits, PCPs, and nonapproximability-  towards tight results. SIAM Journal on Computing, 27(3):804-915, 1998.  A. Bhattacharyya, S. Kopparty, G. Schoenebeck, M. Sudan, and D. Zuckerman. Optimal testing In Foundations of Computer Science (FOCS), 2010 51st Annual IEEE  of reed-muller codes. Symposium on, pages 488-497. IEEE, 2010.  A. Bhattacharyya, E. Fischer, H. Hatami, P. Hatami, and S. Lovett. Every locally characterized affine-invariant property is testable. In Proceedings of the forty-fifth annual ACM symposium on Theory of computing, pages 429-436. ACM, 2013.  A. Bhattacharyya, E. Grigorescu, and A. Shapira. A unified framework for testing linear-invariant  properties. Random Structures & Algorithms, 46(2):232-260, 2015.  E. Blais. Testing juntas nearly optimally. In Proceedings of the forty-first annual ACM symposium  on Theory of computing, pages 151-158. ACM, 2009.  Eric Blais, Joshua Brody, and Kevin Matulef. Property testing lower bounds via communication  complexity. Computational Complexity, 21(2):311-358, 2012.  A. Blum. Relevant examples and relevant features: Thoughts from computational learning theory.  in AAAI Fall Symposium on ‘Relevance’, 1994.  A. Blum and R. Kannan. Learning an intersection of a constant number of halfspaces under a  uniform distribution. Journal of Computer and System Sciences, 54(2):371-380, 1997.  A. Blum and P. Langley. Selection of relevant features and examples in machine learning. Artificial  Intelligence, 97(1-2):245-271, 1997.  M. Blum, M. Luby, and R. Rubinfeld. Self-testing/correcting with applications to numerical prob-  lems. J. Comp. Sys. Sci., 47:549-595, 1993. Earlier version in STOC’90.  C. Bucilu˘a, R. Caruana, and A. Niculescu-Mizil. Model compression. In Proceedings of the 12th ACM SIGKDD International Conference on Knowledge discovery and Data mining, pages 535- 541, 2006.  D. Chakrabarty and C. Seshadhri. An o(n) monotonicity tester for boolean functions over the hy-  percube. SIAM Journal on Computing, 45(2):461-472, 2016. IS YOUR FUNCTION LOW-DIMENSIONAL?  X. Chen, A. Freilich, R. Servedio, and T. Sun. Sample-based high-dimensional convexity testing. Approximation, Randomization, and Combinatorial Optimization. Algorithms and Techniques, 2017a.  X. Chen, Z. Liu, Rocco A. Servedio, Y. Sheng, and J. Xie. Distribution free junta testing.  In  Proceedings of the ACM STOC 2018, 2018.  Xi Chen, Rocco A. Servedio, Li-Yang Tan, Erik Waingarten, and Jinyu Xie. Settling the query complexity of non-adaptive junta testing. In Proceedings of the 32Nd Computational Complexity Conference, pages 26:1-26:19, 2017b.  I. Diakonikolas, D. Kane, and A. Stewart. Learning geometric concepts with nasty noise. In Pro- ceedings of the 50th Annual ACM SIGACT Symposium on Theory of Computing, pages 1061- 1073, 2018.  E. Fischer, E. Lehman, I. Newman, S. Raskhodnikova, R. Rubinfeld, and A. Samrodnitsky. Mono- tonicity testing over general poset domains. In Proc. 34th Annual ACM Symposium on the Theory of Computing, pages 474-483, 2002.  E. Fischer, G. Kindler, D. Ron, S. Safra, and A. Samorodnitsky. Testing juntas. J. Computer &  System Sciences, 68(4):753-787, 2004.  Oded Goldreich. Introduction to Property Testing. Cambridge University Press, 2017. doi: 10.  1017/9781108135252.  P. Gopalan, A. Klivans, and R. Meka. Learning functions of halfspaces using prefix covers.  In  Conference on Learning Theory, pages 15-1, 2012.  Parikshit Gopalan, Ryan O’Donnell, Rocco A Servedio, Amir Shpilka, and Karl Wimmer. Testing fourier dimensionality and sparsity. In International Colloquium on Automata, Languages, and Programming, pages 500-512. Springer, 2009.  N. Harms. Testing halfspaces over rotationally invariant distributions.  In Proceedings of SODA  2019, 2019.  (JACM), 59(6):29, 2012.  P. Harsha, A. Klivans, and R. Meka. An invariance principle for polytopes. Journal of the ACM  Charanjit S. Jutla, Anindya C. Patthak, Atri Rudra, and David Zuckerman. Testing low-degree In Proc. 45th IEEE Symposium on Foundations of Computer  polynomials over prime fields. Science (FOCS), pages 423-432. IEEE Computer Society Press, 2004.  T. Kaufman and M. Sudan. Algebraic property testing: the role of invariance. In Proc. 40th Annual  ACM Symposium on Theory of Computing (STOC), pages 403-412, 2008.  S. Khot, D. Minzer, and M. Safra. On monotonicity testing and Boolean isoperimetric type the- orems. In Foundations of Computer Science (FOCS), 2015 IEEE 56th Annual Symposium on, pages 52-58. IEEE, 2015. IS YOUR FUNCTION LOW-DIMENSIONAL?  A. Klivans, R. O’Donnell, and R. Servedio. Learning intersections and thresholds of halfspaces. In Proceedings of the 43rd Annual Symposium on Foundations of Computer Science, pages 177- 186, 2002.  A. Klivans, R. O’Donnell, and R. Servedio. Learning geometric concepts via Gaussian surface area. In Proc. 49th IEEE Symposium on Foundations of Computer Science (FOCS), pages 541-550, 2008.  P. Kothari, A. Nayyeri, R. O’Donnell, and C. Wu. Testing surface area.  In Proceedings of the twenty-fifth annual ACM-SIAM symposium on Discrete algorithms, pages 1204-1214. SIAM, 2014.  K. Matulef, R. O’Donnell, R. Rubinfeld, and R. Servedio. Testing halfspaces. In Proc. 20th Annual  Symposium on Discrete Algorithms (SODA), 2009.  K. Matulef, R. O’Donnell, R. Rubinfeld, and R. Servedio. Testing halfspaces. SIAM J. on Comput.,  39(5):2004-2047, 2010.  E. Mossel and J. Neeman. Robust optimality of gaussian noise stability. Journal of the European  Mathematical Society, 17(2):433-482, 2015.  J. Neeman. Testing surface area with arbitrary accuracy. In Proceedings of the forty-sixth annual  ACM symposium on Theory of computing, pages 393-397. ACM, 2014.  Ryan O’Donnell. Analysis of Boolean Functions. Cambridge University Press, 2014.  M. Parnas, D. Ron, and A. Samorodnitsky. Testing basic boolean formulae. SIAM J. Disc. Math.,  16:20-46, 2002. URL citeseer.ifi.unizh.ch/parnas02testing.html.  D. Ron and R. Servedio. Exponentially Improved Algorithms and Lower Bounds for Testing Signed  Majorities. Algorithmica, 72(2):400-429, 2015.  Dana Ron et al. Algorithmic and analysis techniques in property testing. Foundations and Trends R(cid:13)  in Theoretical Computer Science, 5(2):73-205, 2010.  R. Rubinfeld and M. Sudan. Robust characterizations of polynomials with applications to program  testing. SIAM J. on Comput., 25:252-271, 1996.  S. Vempala. Learning convex concepts from gaussian distributions with PCA. In 2010 IEEE 51st  Annual Symposium on Foundations of Computer Science, pages 124-130, 2010a.  S. Vempala. A random-sampling-based algorithm for learning intersections of halfspaces. Journal  of the ACM (JACM), 57(6):32, 2010b.  S. Vempala and Y. Xiao. Complexity of learning subspace juntas and ICA.  In 2013 Asilomar Conference on Signals, Systems and Computers, Pacific Grove, CA, USA, November 3-6, 2013, pages 320-324, 2013."}