{"1": "Erin L. Allwein, Robert E. Schapire, and Yoram Singer. Reducing multiclass to binary: A unifying  approach for margin classifiers. Journal of Machine Learning Research, 1:113-141, 2000.  Peter L. Bartlett, Michael Jordan, and Jon McAuliffe. Convexity, classification and risk bounds.  Journal of the American Statistical Association, 101(473):138-156, 2006.  David Buffoni, Cl´ement Calauz`enes, Patrick Gallinari, and Nicolas Usunier. Learning scoring func- tions with order-preserving losses and standardized supervision. In International Conference on Machine Learning, 2011.  Andreas Buja, Werner Stuetzle, and Yi Shen. Loss functions for binary class probability estimation:  Structure and applications. Technical report, University of Pennsylvania, November 2005.  Cl´ement Calauz`enes, Nicolas Usunier, and Patrick Gallinari. On the (non-)existence of convex, calibrated surrogate losses for ranking. In Advances in Neural Information Processing Systems 25, pages 197-205. 2012.  David Cossock and Tong Zhang. Statistical analysis of bayes optimal subset ranking. IEEE Trans-  actions on Information Theory, 54(11):5140-5154, 2008.  Koby Crammer and Yoram Singer. On the learnability and design of output codes for multiclass  problems. Machine Learning, 47:201-233, 2002.  Ofer Dekel and Yoram Singer. Multiclass learning by probabilistic embeddings. In Neural Infor-  mation Processing Systems, 2002.  Thomas G. Dietterich and Ghulum Bakiri. Solving multiclass learning problems via error-correcting  output codes. Journal of Artificial Intelligence Research, 2:263-286, 1995.  John Duchi, Lester Mackey, and Michael Jordan. On the consistency of ranking algorithms. In  International Conference on Machine Learning, 2010.  Wei Gao and Zhi-Hua Zhou. On the consistency of multi-label learning. In Conference on Learning  Theory, 2011.  Venkatesan Guruswami and Amit Sahai. Multiclass learning, boosting and error-correcting codes.  In Conference on Learning Theory, 1999.  Yanyan Lan, Jiafeng Guo, Xueqi Cheng, and Tie-Yan Liu. Statistical consistency of ranking meth- In Advances in Neural Information Processing  ods in a rank-differentiable probability space. Systems 25, pages 1241-1249. 2012.  John Langford and Alina Beygelzimer. Sensitive error correcting output codes. In Conference on  Learning Theory, 2005.  Yoonkyung Lee, Yi Lin, and Grace Wahba. Multicategory support vector machines: Theory and ap- plication to the classification of microarray data. Journal of the American Statistical Association, 99(465):67-81, 2004.  14   RAMASWAMY BABU AGARWAL WILLIAMSON  References  Erin L. Allwein, Robert E. Schapire, and Yoram Singer. Reducing multiclass to binary: A unifying  approach for margin classifiers. Journal of Machine Learning Research, 1:113-141, 2000.  Peter L. Bartlett, Michael Jordan, and Jon McAuliffe. Convexity, classification and risk bounds.  Journal of the American Statistical Association, 101(473):138-156, 2006.  David Buffoni, Cl´ement Calauz`enes, Patrick Gallinari, and Nicolas Usunier. Learning scoring func- tions with order-preserving losses and standardized supervision. In International Conference on Machine Learning, 2011.  Andreas Buja, Werner Stuetzle, and Yi Shen. Loss functions for binary class probability estimation:  Structure and applications. Technical report, University of Pennsylvania, November 2005.  Cl´ement Calauz`enes, Nicolas Usunier, and Patrick Gallinari. On the (non-)existence of convex, calibrated surrogate losses for ranking. In Advances in Neural Information Processing Systems 25, pages 197-205. 2012.  David Cossock and Tong Zhang. Statistical analysis of bayes optimal subset ranking. IEEE Trans-  actions on Information Theory, 54(11):5140-5154, 2008.  Koby Crammer and Yoram Singer. On the learnability and design of output codes for multiclass  problems. Machine Learning, 47:201-233, 2002.  Ofer Dekel and Yoram Singer. Multiclass learning by probabilistic embeddings. In Neural Infor-  mation Processing Systems, 2002.  Thomas G. Dietterich and Ghulum Bakiri. Solving multiclass learning problems via error-correcting  output codes. Journal of Artificial Intelligence Research, 2:263-286, 1995.  John Duchi, Lester Mackey, and Michael Jordan. On the consistency of ranking algorithms. In  International Conference on Machine Learning, 2010.  Wei Gao and Zhi-Hua Zhou. On the consistency of multi-label learning. In Conference on Learning  Theory, 2011.  Venkatesan Guruswami and Amit Sahai. Multiclass learning, boosting and error-correcting codes.  In Conference on Learning Theory, 1999.  Yanyan Lan, Jiafeng Guo, Xueqi Cheng, and Tie-Yan Liu. Statistical consistency of ranking meth- In Advances in Neural Information Processing  ods in a rank-differentiable probability space. Systems 25, pages 1241-1249. 2012.  John Langford and Alina Beygelzimer. Sensitive error correcting output codes. In Conference on  Learning Theory, 2005.  Yoonkyung Lee, Yi Lin, and Grace Wahba. Multicategory support vector machines: Theory and ap- plication to the classification of microarray data. Journal of the American Statistical Association, 99(465):67-81, 2004. CONSISTENCY OF OUTPUT CODE BASED LEARNING ALGORITHMS  Bernardo ´A. Pires, Csaba Szepesvari, and Mohammad Ghavamzadeh. Cost-sensitive multiclass  classification risk bounds. In International Conference on Machine Learning, 2013.  Harish G. Ramaswamy and Shivani Agarwal. Classification calibration dimension for general mul- In Advances in Neural Information Processing Systems 25, pages 2087-2095.  ticlass losses. 2012.  Harish G. Ramaswamy, Shivani Agarwal, and Ambuj Tewari. Convex calibrated surrogates for low- rank loss matrices with applications to subset ranking losses. In Advances in Neural Information Processing Systems 26. 2013.  Pradeep Ravikumar, Ambuj Tewari, and Eunho Yang. On NDCG consistency of listwise ranking  methods. In International Conference on Artificial Intelligence and Statistics, 2011.  Mark D. Reid and Robert C. Williamson. Composite binary losses. Journal of Machine Learning  Research, 11:2387-2422, 2010.  Robert E. Schapire. Using output codes to boost multiclass learning problems. In International  Conference on Machine Learning, 1997.  Robert E. Schapire and Yoram Singer. Improved boosting algorithms using confidence-rated pre-  dictions. Machine Learning, 37(3):297-336, 1999.  Terrence J. Sejnowski and Charles R. Rosenberg. Parallel networks that learn to pronounce English  text. Complex Systems, 1:145-168, 1987.  Ingo Steinwart. How to compare different loss functions and their risks. Constructive Approxima-  tion, 26:225-287, 2007.  Ambuj Tewari and Peter L. Bartlett. On the consistency of multiclass classification methods. Journal  of Machine Learning Research, 8:1007-1025, 2007.  Fen Xia, Tie-Yan Liu, Jue Wang, Wensheng Zhang, and Hang Li. Listwise approach to learning to  rank: Theory and algorithm. In International Conference on Machine Learning, 2008.  Tong Zhang. Statistical behavior and consistency of classification methods based on convex risk  minimization. Annals of Statistics, 32(1):56-134, 2004a.  Tong Zhang. Statistical analysis of some multi-category large margin classification methods. Jour-  nal of Machine Learning Research, 5:1225-1251, 2004b."}