{"1": "D. Aldous and U. Vazirani. A markovian extension of valiant’s learning model. In Proceed-  ings of the 31st Annual Symposium on Foundations of Computer Science, 1990.  D. Angluin. Queries and concept learning. Machine Learning, 2:319-342, 1988.  Dana Angluin. Learning regular sets from queries and counterexamples. Inf. Comput., 75  (2):87-106, 1987.  values. In STOC, 2006.  Dana Angluin, James Aspnes, Jiang Chen, and Wu Yinghua. Learning a circuit by injecting  A. Blum, A. Kalai, and H. Wasserman. Noise-tolerant learning, the parity problem, and  the statistical query model. Journal of the ACM, 50(4):506-519, 2003.  Avrim Blum, Prasad Chalasani, Sally A. Goldman, and Donna K. Slonim. Learning with  unreliable boundary queries. J. Comput. Syst. Sci., 56, April 1998.  Avrim Blum, Merrick Furst, Jeﬀrey Jackson, Michael Kearns, Yishay Mansour, and Steven Rudich. Weakly learning dnf and characterizing statistical query learning using fourier analysis. In Proceedings of the twenty-sixth annual ACM symposium on Theory of com- puting, STOC ’94, 1994.  R. C. Bose and D. K. Ray-Chaudhuri. On a class of error correcting binary group codes.  Information and Control, 3(1):68-79, 1960.  Nader H. Bshouty. Exact learning via the monotone theory (extended abstract). In FOCS,  1993.  Nader H. Bshouty, Elchanan Mossel, Ryan O’Donnell, and Rocco A. Servedio. Learning  dnf from random walks. J. Comput. Syst. Sci., 71, October 2005.  Z. Dvir, A. Rao, A. Wigderson, and A. Yehudayoﬀ. Restriction access. In ITCS, 2012.  Dan Feldman and Leonard J. Schulman. Data reduction for weighted and outlier-resistant clustering. In Proceedings of the Twenty-Third Annual ACM-SIAM Symposium on Dis- crete Algorithms, SODA ’12, 2012.  V. Feldman. Learning dnf expressions from fourier spectrum. In COLT, 2012.  V. Feldman, P. Gopalan, S. Khot, and A. Ponnuswami. New results for learning noisy  parities and halfspaces. In FOCS, 2006.  Vitaly Feldman. On the power of membership queries in agnostic learning. In COLT, 2008.  Vitaly Feldman. Distribution-specific agnostic boosting. In ICS, 2010.  Oded Goldreich, Shafi Goldwasser, and Silvio Micali. How to construct random functions. J. ACM, 33:792-807, 1986. ISSN 0004-5411. URL http://doi.acm.org/10.1145/6490. 6503.  13   Learning using Local Membership Queries  References  D. Aldous and U. Vazirani. A markovian extension of valiant’s learning model. In Proceed-  ings of the 31st Annual Symposium on Foundations of Computer Science, 1990.  D. Angluin. Queries and concept learning. Machine Learning, 2:319-342, 1988.  Dana Angluin. Learning regular sets from queries and counterexamples. Inf. Comput., 75  (2):87-106, 1987.  values. In STOC, 2006.  Dana Angluin, James Aspnes, Jiang Chen, and Wu Yinghua. Learning a circuit by injecting  A. Blum, A. Kalai, and H. Wasserman. Noise-tolerant learning, the parity problem, and  the statistical query model. Journal of the ACM, 50(4):506-519, 2003.  Avrim Blum, Prasad Chalasani, Sally A. Goldman, and Donna K. Slonim. Learning with  unreliable boundary queries. J. Comput. Syst. Sci., 56, April 1998.  Avrim Blum, Merrick Furst, Jeﬀrey Jackson, Michael Kearns, Yishay Mansour, and Steven Rudich. Weakly learning dnf and characterizing statistical query learning using fourier analysis. In Proceedings of the twenty-sixth annual ACM symposium on Theory of com- puting, STOC ’94, 1994.  R. C. Bose and D. K. Ray-Chaudhuri. On a class of error correcting binary group codes.  Information and Control, 3(1):68-79, 1960.  Nader H. Bshouty. Exact learning via the monotone theory (extended abstract). In FOCS,  1993.  Nader H. Bshouty, Elchanan Mossel, Ryan O’Donnell, and Rocco A. Servedio. Learning  dnf from random walks. J. Comput. Syst. Sci., 71, October 2005.  Z. Dvir, A. Rao, A. Wigderson, and A. Yehudayoﬀ. Restriction access. In ITCS, 2012.  Dan Feldman and Leonard J. Schulman. Data reduction for weighted and outlier-resistant clustering. In Proceedings of the Twenty-Third Annual ACM-SIAM Symposium on Dis- crete Algorithms, SODA ’12, 2012.  V. Feldman. Learning dnf expressions from fourier spectrum. In COLT, 2012.  V. Feldman, P. Gopalan, S. Khot, and A. Ponnuswami. New results for learning noisy  parities and halfspaces. In FOCS, 2006.  Vitaly Feldman. On the power of membership queries in agnostic learning. In COLT, 2008.  Vitaly Feldman. Distribution-specific agnostic boosting. In ICS, 2010.  Oded Goldreich, Shafi Goldwasser, and Silvio Micali. How to construct random functions. J. ACM, 33:792-807, 1986. ISSN 0004-5411. URL http://doi.acm.org/10.1145/6490. 6503. Awasthi Feldman Kanade  A. Hocquenghem. Codes correcteurs d’erreurs (in french). Chiﬀres, 2:147-156, 1959.  J. Jackson. An eﬃcient membership-query algorithm for learning DNF with respect to the  uniform distribution. Journal of Computer and System Sciences, 55:414-440, 1997.  Jeﬀrey C. Jackson and Karl Wimmer. New results for random walk learning. In COLT,  Adam Kalai and Varun Kanade. Potential-based agnostic boosting. In NIPS, 2009.  Adam Kalai, Varun Kanade, and Yishay Mansour. Reliable agnostic learning. In COLT,  2009.  2009a.  Adam Tauman Kalai, Alex Samorodnitsky, and Shang-Hua Teng. Learning and smoothed  analysis. In FOCS, 2009b.  Vladlen Koltun and Christos H. Papadimitriou. Approximately dominating representatives.  Theor. Comput. Sci., 371(3), February 2007.  E. Kushilevitz and Y. Mansour. Learning decision trees using the Fourier spectrum. SIAM  Journal on Computing, 22(6):1331-1348, 1993.  K. Lang and E. Baum. Query learning can work poorly when a human oracle is used. IEEE  Intl. Joint Conference on Neural Networks, 1992.  L. Levin. Randomness and non-determinism. Journal of Symbolic Logic, 58(3):1102-1103,  Y. Mansour. An o(nlog log n) learning algorithm for dnf under the uniform distribution. In  Yishay Mansour. Learning boolean functions via the fourier transform. Survey, 1994.  J. Massey. Shift-register synthesis and BCH decoding. IEEE Trans. Inform. Theory, 15:  Robert E. Schapire and Linda M. Sellie. Learning sparse multivariate polynomials over a  field with queries and counterexamples. In COLT, pages 17-26, 1996.  Rocco A. Servedio. Smooth boosting and learning with malicious noise. J. Mach. Learn. Res., 4:633-648, December 2003. ISSN 1532-4435. URL http://dx.doi.org/10.1162/ 153244304773936072.  Daniel A. Spielman and Shang-Hua Teng. Smoothed analysis of algorithms: Why the  simplex algorithm usually takes polynomial time. J. ACM, 51(3), 2004.  L. G. Valiant. A theory of the learnable. In STOC, 1984.  1993.  COLT, 1992.  122-127, 1969. Learning using Local Membership Queries"}