{"1": "Rados(cid:32)law Adamczak, Alexander E. Litvak, Alain Pajor, and Nicole Tomczak-Jaegermann. Quantitative estimates of the convergence of the empirical covariance matrix in ISSN 0894- log-concave ensembles. 0347. 10.1090/S0894-0347-09-00650-X. URL http://dx.doi.org/10.1090/ S0894-0347-09-00650-X.  J. Amer. Math. Soc., 23(2):535-561, 2010.  doi:  Anima Anandkumar, Rong Ge, Daniel Hsu, Sham M. Kakade, and Matus Telgarsky. Tensor  decompositions for learning latent variable models. CoRR, abs/1210.7559, 2012a.  13   Efficient Learning of Simplices  7. Conclusion  We showed, in two diﬀerent ways, that the problem of learning simplices can be solved eﬃciently using techniques for ICA. We also showed that when the sample is one that may not satisfy the requirement of independent components, we can eﬃciently obtain from it a sample that guarantees this property and from which the original distribution can be estimated. Many questions remain: Can we do this for other polytopes? Can we do this when the points come from the Gaussian distribution with labels instead of the uniform distribution in the polytope? In particular, does any one of the two techniques that we used in this paper for learning simplices extend to learning polytopes or to latent variable models?  It is not clear how to extend our method to learn intersections of more than n + 1 half-spaces. The main hurdle seems to be that the nice symmetric form of the moment polynomial that we get for the simplex is no longer there, and it’s not clear how the polyno- mial is related to the features of the polytope. We don’t even know whether or not there is a one-to-one correspondence between polytopes and the moment polynomials (of low constant degree). Interestingly, it is also not clear how to learn intersections of n (or fewer, but not much fewer) half-spaces, for similar reasons: First note that we cannot consider uniform distributions over such sets because they are unbounded. As mentioned before, there is considerable literature when one considers other distributions, such as the Gaussian distri- bution. However, our moment-based method runs into the same diﬃculty as before, namely the relation between the moment polynomial and the half-spaces defining the polyhedron is not clear.  As pointed out by a COLT referee, our second method for learning simplices, namely direct reduction to ICA, can possibly be used to learn the more general Dirichlet distribution on the simplex when combined with the results of Barthe et al. (2010). This is an interesting direction for future work.  Acknowledgments  We thank Santosh Vempala for telling us about the polytope learning problem, the approach of using higher-order moments and for helpful discussions. We also thank Keith Ball, Alexander Barvinok, Franck Barthe, Mikhail Belkin, Adam Kalai, Assaf Naor, Aaditya Ramdas, Roman Vershynin and James Voss for helpful discussions. We thank anonymous COLT referees for useful remarks and pointers to the literature.  References  Rados(cid:32)law Adamczak, Alexander E. Litvak, Alain Pajor, and Nicole Tomczak-Jaegermann. Quantitative estimates of the convergence of the empirical covariance matrix in ISSN 0894- log-concave ensembles. 0347. 10.1090/S0894-0347-09-00650-X. URL http://dx.doi.org/10.1090/ S0894-0347-09-00650-X.  J. Amer. Math. Soc., 23(2):535-561, 2010.  doi:  Anima Anandkumar, Rong Ge, Daniel Hsu, Sham M. Kakade, and Matus Telgarsky. Tensor  decompositions for learning latent variable models. CoRR, abs/1210.7559, 2012a. Anderson Goyal Rademacher  Animashree Anandkumar, Daniel Hsu, and Sham M. Kakade.  moments http://arxiv.org/abs/1203.0683.  for mixture models and hidden markov models.  A method of In COLT, 2012b.  Sanjeev Arora, Rong Ge, Ankur Moitra, and Sushant Sachdeva. Provable ICA with un- known Gaussian noise, and implications for Gaussian mixtures and autoencoders. In NIPS, 2012. arXiv:1206.5349.  F. Barthe, O. Gu´edon, S. Mendelson, and A. Naor. A probabilistic approach to the geometry  of the (cid:96)n  p -ball. The Annals of Probability, 33(2):480-513, 2005.  F. Barthe, F. Gamboa, L. Lozada-Chang, and A. Rouault. Generalized Dirichlet distribu- tions on the ball and moments. ALEA Lat. Am. J. Probab. Math. Stat., 7:319-340, 2010. ISSN 1980-0436.  Patrick Billingsley. Probability and measure. Wiley Series in Probability and Mathematical Statistics. John Wiley & Sons Inc., New York, third edition, 1995. ISBN 0-471-00710-2. A Wiley-Interscience Publication.  P. Comon.  Independent component analysis, a new concept? Signal processing, 36(3):  287-314, 1994.  demic Press, 2010.  pages 359-368, 1996.  Pierre Comon and Christian Jutten, editors. Handbook of Blind Source Separation. Aca-  Alan M. Frieze, Mark Jerrum, and Ravi Kannan. Learning linear transformations. In FOCS,  Navin Goyal and Luis Rademacher. Learning convex bodies is hard. In COLT, 2009.  Nick Gravin, Jean Lasserre, Dmitrii V. Pasechnik, and Sinai Robins. The inverse moment problem for convex polytopes. Discrete & Computational Geometry, 48(3):596-621, 2012.  A. Grundmann and H. M. Moeller.  Invariant integration formulas for the n-simplex by  combinatorial methods. SIAM J. Numer. Anal., 15:282-290, 1978.  A. K. Gupta and D. Song. Lp-norm spherical distribution. J. Statist. Plann. Inference, 60 (2):241-260, 1997. ISSN 0378-3758. doi: 10.1016/S0378-3758(96)00129-2. URL http: //dx.doi.org/10.1016/S0378-3758(96)00129-2.  Aapo Hyv¨arinen. Fast and robust fixed-point algorithms for independent component anal-  ysis. IEEE Transactions on Neural Networks, 10(3):626-634, 1999.  Aapo Hyv¨arinen, Juha Karhunen, and Erkki Oja. Independent Component Analysis. Wiley,  2001.  Adam R. Klivans and Alexander A. Sherstov. A lower bound for agnostically learning  disjunctions. In COLT, pages 409-423, 2007.  Adam R. Klivans and Alexander A. Sherstov. Cryptographic hardness for learning inter-  sections of halfspaces. J. Comput. Syst. Sci., 75(1):2-12, 2009. Efficient Learning of Simplices  Adam R. Klivans, Ryan O’Donnell, and Rocco A. Servedio. Learning geometric concepts  via Gaussian surface area. In FOCS, pages 541-550, 2008.  Stephen Kwek and Leonard Pitt. PAC learning intersections of halfspaces with membership  queries. Algorithmica, 22(1/2):53-75, 1998.  Jean B. Lasserre and Konstantin E. Avrachenkov. The multi-dimensional version of  (cid:82) abxpdx. American Math. Month., 108(2):151-154, 2001.  David G. Luenberger and Yinyu Ye. Linear and nonlinear programming.  International Series in Operations Research & Management Science, 116. Springer, New York, third edition, 2008. ISBN 978-0-387-74502-2.  Phong Q. Nguyen and Oded Regev. Learning a parallelepiped: Cryptanalysis of GGH and  NTRU signatures. J. Cryptology, 22(2):139-160, 2009.  Asa Packer. NP-hardness of largest contained and smallest containing simplices for V- and  H-polytopes. Discrete & Computational Geometry, 28(3):349-377, 2002.  S.T. Rachev and L. Ruschendorf. Approximate independence of distributions on spheres  and their stability properties. The Annals of Probability, 19(3):1311-1337, 1991.  G. Schechtman and J. Zinn. On the volume of the intersection of two ln  p balls. In Proc.  Amer. Math. Soc, volume 110, pages 217-224, 1990.  Bernhard Sch¨olkopf, John C. Platt, John Shawe-Taylor, Alex J. Smola, and Robert C. Williamson. Estimating the support of a high-dimensional distribution. Neural Compu- tation, 13(7):1443-1471, 2001.  Fabian Sinz and Matthias Bethge. Lp-nested symmetric distributions. J. Mach. Learn.  Res., 11:3409-3451, 2010. ISSN 1532-4435.  Fabian H. Sinz and Matthias Bethge. The conjoint eﬀect of divisive normalization and  orientation selectivity on redundancy reduction. In NIPS, pages 1521-1528, 2008.  D. Song and A. K. Gupta. Lp-norm uniform distribution. Proc. Amer. Math. Soc., 125 (2):595-601, 1997. ISSN 0002-9939. doi: 10.1090/S0002-9939-97-03900-2. URL http: //dx.doi.org/10.1090/S0002-9939-97-03900-2.  Nikhil Srivastava and Roman Vershynin. Covariance estimation for distributions with 2 + (cid:15)  moments, 2011.  paces. J. ACM, 57(6):32, 2010a.  FOCS, pages 124-130, 2010b.  Santosh Vempala. A random-sampling-based algorithm for learning intersections of halfs-  Santosh Vempala. Learning convex concepts from Gaussian distributions with PCA. In  Santosh S. Vempala and Ying Xiao. Structure from local optima: Learning subspace juntas  via higher order PCA. CoRR, abs/1108.3329, 2011. Anderson Goyal Rademacher"}