{"1": "FOCS, pages 20-39, 2015.  Nima Anari and Shayan Oveis Gharan. Effective-Resistance-Reducing Flows and Asymmetric TSP.  In  Julius Borcea, Petter Branden, and Thomas M. Liggett. Negative dependence and the geometry of polyno-  mials. Journal of American Mathematical Society, 22:521-567, 2009.  Christos Boutsidis, Michael W Mahoney, and Petros Drineas. An improved approximation algorithm for  the column subset selection problem. In SODA, pages 968-977, 2009.  Petter Br¨and´en. Polynomials with the half-plane property and matroid theory. Advances in Mathematics,  216(1):302-320, 2007.  Ali C¸ ivril and Malik Magdon-Ismail. On selecting a maximum volume sub-matrix of a matrix and related  problems. Theoretical Computer Science, 410(47):4801-4811, 2009.  Ali C¸ ivril and Malik Magdon-Ismail. Exponential inapproximability of selecting a maximum volume sub-  matrix. Algorithmica, 65(1):159-176, 2013.  Amit Deshpande and Luis Rademacher. Efficient volume sampling for row/column subset selection.  In  FOCS, pages 329-338. IEEE, 2010.  Amit Deshpande, Luis Rademacher, Santosh Vempala, and Grant Wang. Matrix approximation and projec-  tive clustering via volume sampling. In SODA, pages 1117-1126, 2006.  Persi Diaconis and Laurent Saloff-Coste. Comparison theorems for reversible markov chains. The Annals  of Applied Probability, pages 696-730, 1993.  Persi Diaconis and Daniel Stroock. Geometric bounds for eigenvalues of markov chains. The Annals of  Applied Probability, pages 36-61, 1991.  Tom´as Feder and Milena Mihail. Balanced matroids.  In Proceedings of the twenty-fourth annual ACM  symposium on Theory of Computing, pages 26-38, New York, NY, USA, 1992. ACM.  J.B. Hough, M. Krishnapur, Y. Peres, and B. Vir´ag. Determinantal processes and independence. Probability  Surveys, (3):206-229, 2006.  12   c(X, Y ) = (cid:80)  x∈X,y∈Y cx,y. We have  c(B, B) ≥ c(s, Ω1 \\ B1) + c(B0, t) µ(Ω1 \\ B1) µ(Ω1)  =  +  µ(B0) µ(Ω0) µ(B0) µ(Ω0)  = 1 −  µ(B1) µ(Ω1)  +  ≥ 1 −  µ(N (B1)) µ(Ω0)  +  µ(B0) µ(Ω0)  ,  (3.6)  where the inequality follows by Lemma 13. If there are any edge from B1 to Ω0 \\ B0, then c(B, B) = ∞ and we are done. Otherwise, N (B1) ⊆ B0. Therefore, µ(N (B1)) ≤ µ(B0), and the RHS of the above inequality is at least 1. So, c(B, B) ≥ 1 as desired.  References  FOCS, pages 20-39, 2015.  Nima Anari and Shayan Oveis Gharan. Effective-Resistance-Reducing Flows and Asymmetric TSP.  In  Julius Borcea, Petter Branden, and Thomas M. Liggett. Negative dependence and the geometry of polyno-  mials. Journal of American Mathematical Society, 22:521-567, 2009.  Christos Boutsidis, Michael W Mahoney, and Petros Drineas. An improved approximation algorithm for  the column subset selection problem. In SODA, pages 968-977, 2009.  Petter Br¨and´en. Polynomials with the half-plane property and matroid theory. Advances in Mathematics,  216(1):302-320, 2007.  Ali C¸ ivril and Malik Magdon-Ismail. On selecting a maximum volume sub-matrix of a matrix and related  problems. Theoretical Computer Science, 410(47):4801-4811, 2009.  Ali C¸ ivril and Malik Magdon-Ismail. Exponential inapproximability of selecting a maximum volume sub-  matrix. Algorithmica, 65(1):159-176, 2013.  Amit Deshpande and Luis Rademacher. Efficient volume sampling for row/column subset selection.  In  FOCS, pages 329-338. IEEE, 2010.  Amit Deshpande, Luis Rademacher, Santosh Vempala, and Grant Wang. Matrix approximation and projec-  tive clustering via volume sampling. In SODA, pages 1117-1126, 2006.  Persi Diaconis and Laurent Saloff-Coste. Comparison theorems for reversible markov chains. The Annals  of Applied Probability, pages 696-730, 1993.  Persi Diaconis and Daniel Stroock. Geometric bounds for eigenvalues of markov chains. The Annals of  Applied Probability, pages 36-61, 1991.  Tom´as Feder and Milena Mihail. Balanced matroids.  In Proceedings of the twenty-fourth annual ACM  symposium on Theory of Computing, pages 26-38, New York, NY, USA, 1992. ACM.  J.B. Hough, M. Krishnapur, Y. Peres, and B. Vir´ag. Determinantal processes and independence. Probability  Surveys, (3):206-229, 2006. Mark Jerrum and Jung Bae Son. Spectral gap and log-sobolev constant for balanced matroids. In FOCS,  pages 721-729, 2002.  Mark Jerrum, Jung-Bae Son, Prasad Tetali, and Eric Vigoda. Elementary bounds on poincar´e and log- sobolev constants for decomposable markov chains. Annals of Applied Probability, pages 1741-1765, 2004.  Byungkon Kang. Fast determinantal point process sampling with application to clustering. In NIPS, pages  2319-2327, 2013.  4:157-288, 2009.  R. Kannan and S. Vempala. Spectral algorithms. Foundations and Trends in Theoretical Computer Science,  Alex Kulesza and Ben Taskar. Determinantal point processes for machine learning. 2013. URL http:  //arxiv.org/abs/1207.6083.  David A. Levin, Yuval Peres, and Elizabeth L. Wilmer. Markov Chains and Mixing Times. American  Mathematical Society, 2006.  Chengtao Li, Stefanie Jegelka, and Suvrit Sra. Efficient sampling for k-determinantal point processes. 2015.  URL http://arxiv.org/abs/1509.01618.  Ravi Montenegro and Prasad Tetali. Mathematical aspects of mixing times in Markov chains. Found. Trends  Theor. Comput. Sci., 1(3):237-354, May 2006. ISSN 1551-305X.  Aleksandar Nikolov. Randomized rounding for the largest simplex problem.  In STOC, pages 861-870,  Shayan Oveis Gharan, Amin Saberi, and Mohit Singh. A Randomized Rounding Approach to the Traveling  Salesman Problem. In FOCS, pages 550-559, 2011.  Robin Pemantle and Yuval Peres. Concentration of Lipschitz Functionals of Determinantal and Other Strong  Rayleigh Measures. Combinatorics, Probability and Computing, 23:140-160, 1 2014.  Patrick Rebeschini and Amin Karbasi. Fast mixing for discrete point processes. In COLT, pages 1480-1500,  2015.  2015."}