{"1": "E. Abbe, A. S. Bandeira, and G. Hall. Exact Recovery in the Stochastic Block Model. ArXiv  e-prints, 1405.3267, May 2014.  Emmanuel Abbe, Afonso S. Bandeira, Annina Bracher, and Amit Singer. Decoding binary node labels from censored edge measurements: Phase transition and efficient recovery. CoRR, abs/1404.4749, 2014.  12   CHIN RAO VU  Figure 9: On the left is the density plot of the input (unclustered) matrix with parameters n = 3000, a = 22, b = 2 and on the right is the density plot of the permuted matrix after running the algorithm described above. This took less than 1sec in Matlab running on a 2009 MacPro.  Spectral Partition II.  1. Input the adjacency matrix Y, p.  2. Zero out all the rows and columns of Y corresponding to vertices whose degree is bigger than  20pn, to obtain the matrix Y0.  3. Find the eigenspace U corresponding to the top two eigenvalues of Y0.  6. Sort the vertices according to their values in v 2, and let V (cid:48)  1 ⊂ V be the top n vertices, and  4. Compute v 1, the projection of all-ones vector on to U  5. Let v 2 be the unit vector in W perpendicular to v 1.  V (cid:48) 2 ⊂ V be the remaining n vertices  7. Output (V (cid:48)  1, V (cid:48)  2).  Figure 10: Algorithm 3  References  E. Abbe, A. S. Bandeira, and G. Hall. Exact Recovery in the Stochastic Block Model. ArXiv  e-prints, 1405.3267, May 2014.  Emmanuel Abbe, Afonso S. Bandeira, Annina Bracher, and Amit Singer. Decoding binary node labels from censored edge measurements: Phase transition and efficient recovery. CoRR, abs/1404.4749, 2014. SPECTRAL ALGORITHM FOR SPARSE GRAPHS  N. Alon and J.H. Spencer. The Probabilistic Method. Wiley-Interscience series in discrete mathematics and optimization. Wiley, 2004. ISBN 9780471653981. URL http://books. google.com/books?id=q3lUjheWiMoC.  Noga Alon and Nabil Kahale. A spectral technique for coloring random 3-colorable graphs. In  SIAM Journal on Computing, pages 346-355, 1994.  Rajendra Bhatia. Matrix Analysis, volume 169. Springer, 1997. ISBN 0387948465.  B. Bollobas. Random Graphs. Cambridge University Press, 2001.  Ravi B. Boppana. Eigenvalues and graph bisection: An average-case analysis. In Proceedings of the 28th Annual Symposium on Foundations of Computer Science, SFCS ’87, pages 280-285, Washington, DC, USA, 1987. IEEE Computer Society. ISBN 0-8186-0807-2. doi: 10.1109/ SFCS.1987.22. URL http://dx.doi.org/10.1109/SFCS.1987.22.  S. Boucheron, G. Lugosi, and P. Massart. Concentration inequalities. A nonasymptotic theory of in- dependence, 2013. URL halv3-preprod.archives-ouvertes.fr/hal-00794821.  T.N. Bui, S. Chaudhuri, F.T. Leighton, and M. Sipser. Graph bisection algorithms with good av- ISSN 0209-9683. doi: 10.1007/  erage case behavior. Combinatorica, 7(2):171-191, 1987. BF02579448. URL http://dx.doi.org/10.1007/BF02579448.  Amin Coja-Oghlan. Graph partitioning via adaptive spectral techniques. Combinatorics, Probability and Computing, 19:227-284, 3 2010. ISSN 1469-2163. doi: 10.1017/S0963548309990514. URL http://journals.cambridge.org/article_S0963548309990514.  Chandler Davis. The rotation of eigenvectors by a perturbation.  Journal of Mathematical Analysis and Applications, 6(2):159 - 173, 1963. ISSN 0022-247X. doi: http://dx.doi.org/ 10.1016/0022-247X(63)90001-5. URL http://www.sciencedirect.com/science/ article/pii/0022247X63900015.  Aurelien Decelle, Florent Krzakala, Cristopher Moore, and Lenka Zdeborov´a. Asymptotic analysis of the stochastic block model for modular networks and its algorithmic applications. Phys. Rev. E, 84:066106, Dec 2011. doi: 10.1103/PhysRevE.84.066106. URL http://link.aps.org/ doi/10.1103/PhysRevE.84.066106.  M. E. Dyer and A. M. Frieze. The solution of some random np-hard problems in polynomial expected time. J. Algorithms, 10(4):451-489, December 1989. ISSN 0196-6774. doi: 10. 1016/0196-6774(89)90001-1. URL http://dx.doi.org/10.1016/0196-6774(89) 90001-1.  Uriel Feige and Eran Ofek. Spectral techniques applied to sparse random graphs. Random Structures & Algorithms, 27(2):251-275, 2005. ISSN 1098-2418. doi: 10.1002/rsa.20089. URL http: //dx.doi.org/10.1002/rsa.20089.  J. Friedman, J. Kahn, and E. Szemer´edi. On the second eigenvalue of random regular graphs. In Proceedings of the Twenty-first Annual ACM Symposium on Theory of Computing, STOC ’89, pages 587-598, New York, NY, USA, 1989. ACM. ISBN 0-89791-307-8. doi: 10.1145/73007. 73063. URL http://doi.acm.org/10.1145/73007.73063. CHIN RAO VU  O. Gu´edon and R. Vershynin. Community detection in sparse networks via Grothendieck’s inequal-  ity. ArXiv e-prints, 1411.4686, November 2014.  Mark Jerrum and G.B. Sorkin. Simulated annealing for graph bisection. In Foundations of Computer Science, 1993. Proceedings., 34th Annual Symposium on, pages 94-103, Nov 1993. doi: 10.1109/ SFCS.1993.366878.  M. Lelarge, L. Massoulie, and Jiaming Xu. Reconstruction in the labeled stochastic block model. In Information Theory Workshop (ITW), 2013 IEEE, pages 1-5, Sept 2013. doi: 10.1109/ITW. 2013.6691264.  Laurent Massouli´e. Community detection thresholds and the weak ramanujan property. CoRR,  abs/1311.3085, 2013.  F. McSherry. Spectral partitioning of random graphs. In Foundations of Computer Science, 2001. Proceedings. 42nd IEEE Symposium on, pages 529-537, Oct 2001. doi: 10.1109/SFCS.2001. 959929.  E. Mossel, J. Neeman, and A. Sly. Stochastic Block Models and Reconstruction. ArXiv e-prints,  1202.1499, February 2012.  E. Mossel, J. Neeman, and A. Sly. A Proof Of The Block Model Threshold Conjecture. ArXiv  e-prints, 1311.4115, November 2013a.  E. Mossel, J. Neeman, and A. Sly. Belief Propagation, Robust Reconstruction, and Optimal Recov-  ery of Block Models. ArXiv e-prints, 1309.1380, September 2013b.  E. Mossel, J. Neeman, and A. Sly. Consistency Thresholds for Binary Symmetric Block Models.  ArXiv e-prints, 1407.1591, July 2014.  JoelA. Tropp. User-friendly tail bounds for sums of random matrices. Foundations of Computa- tional Mathematics, 12(4):389-434, 2012. ISSN 1615-3375. doi: 10.1007/s10208-011-9099-z. URL http://dx.doi.org/10.1007/s10208-011-9099-z.  V. Vu. A simple SVD algorithm for finding hidden partitions. ArXiv e-prints, 1404.3918, April  2014.  Se-Young Yun and Alexandre Proutiere. Accurate community detection in the stochastic block model via spectral algorithms. CoRR, abs/1412.7335, 2014. URL http://arxiv.org/ abs/1412.7335.  Y. Zhang and H. Zhou. Minimax rates of community detection in stochastic block model."}