{"1": "tions. In SODA, 2014.  Ashwinkumar Badanidiyuru and Jan Vondr´ak. Fast algorithms for maximizing submodular func-  Niv Buchbinder and Moran Feldman. Constrained submodular maximization via a non-symmetric  technique. CoRR, abs/1611.03253, 2016a.  Niv Buchbinder and Moran Feldman. Deterministic algorithms for submodular maximization prob-  lems. In SODA, 2016b.  Niv Buchbinder, Moran Feldman, Joesph (Seffi) Naor, and Roy Schwartz. Submodular maximiza-  tion with cardinality constrains. In SODA, 2014.  Niv Buchbinder, Moran Feldman, and Roy Schwartz. Comparing apples and oranges: Query trade-  off in submodular maximization. In SODA, 2015.  N. Buchdiner, M. Feldman, N.S. Joseph, and R. Schwartz. A tight linear time (1/2)-approximatoin  for unconstrained submodular maximization. SIAM Journal on Computing, 2015.  Gruia C˘alinescu, Chandra Chekuri, Martin P´al, and Jan Vondr´ak. Maximizing a monotone submod-  ular function subject to a matroid constraint. SIAM Journal on Computing, 2011.  E. Cand´es and B. Recht. Exact matrix completion via convex optimization.  In Foundations of  Computational Mathematics, 2008.  14   FELDMAN HARSHAW KARBASI  solution so we can observe this phenomenon. See Figure 2 for the movies recommended by the different algorithms. Because mg = 1, we are constrained here to have at most one movie from Adventure, Animation and Fantasy. As seen in Figure 2, FANTOM and SAMPLEGREEDY return maximum size solution sets that are both diverse and representative of these genres. On the other hand, Greedy gets stuck choosing a single movie that belongs to all three genres, thus, precluding any other choice of movie from the solution set.  Finally, we would like to make a short remark on the relation between our theoretical analy- sis and experimental results. In our analysis, we showed that SAMPLEGREEDY achieves a better expected approximation ratio than the worst-case approximation ratio of REPEATEDGREEDY and FANTOM. However, there are many problem instances which are “not hard”, and do not make the algorithms exhibit their worst-case behavior. For such instances, REPEATEDGREEDY and FAN- TOM may out-perform SAMPLEGREEDY. Our experiments demonstrate that even in usual “not hard” problem instances, SAMPLEGREEDY performs competitively at a fraction of the computa- tional cost, indicating its potential for real-world large scale applications.  Acknowledgments  This material is based upon work supported by the National Science Foundation Graduate Re- search Fellowship under Grant No. (DGE1122492), DARPA Young Faculty Award (D16AP00046), Simons-Berkeley Fellowship, and Israel Science Foundation (ISF grant number 1357/16). The au- thors would like to thank Eric Lindgren for kindly sharing processed movieLens data.  References  tions. In SODA, 2014.  Ashwinkumar Badanidiyuru and Jan Vondr´ak. Fast algorithms for maximizing submodular func-  Niv Buchbinder and Moran Feldman. Constrained submodular maximization via a non-symmetric  technique. CoRR, abs/1611.03253, 2016a.  Niv Buchbinder and Moran Feldman. Deterministic algorithms for submodular maximization prob-  lems. In SODA, 2016b.  Niv Buchbinder, Moran Feldman, Joesph (Seffi) Naor, and Roy Schwartz. Submodular maximiza-  tion with cardinality constrains. In SODA, 2014.  Niv Buchbinder, Moran Feldman, and Roy Schwartz. Comparing apples and oranges: Query trade-  off in submodular maximization. In SODA, 2015.  N. Buchdiner, M. Feldman, N.S. Joseph, and R. Schwartz. A tight linear time (1/2)-approximatoin  for unconstrained submodular maximization. SIAM Journal on Computing, 2015.  Gruia C˘alinescu, Chandra Chekuri, Martin P´al, and Jan Vondr´ak. Maximizing a monotone submod-  ular function subject to a matroid constraint. SIAM Journal on Computing, 2011.  E. Cand´es and B. Recht. Exact matrix completion via convex optimization.  In Foundations of  Computational Mathematics, 2008. V. Chv´atal. The tail of the hypergeometric distribution. Discrete Mathematics, 25(3):285-287,  Jack Edmonds. Matroids and the greedy algorithm. Mathematical programming, 1971.  Khalid El-Arini, Gaurav Veda, Dafna Shahaf, and Carlos Guestrin. Turning down the noise in the  blogosphere. In KDD, 2009.  Alina Ene and Huy L. Nguyen. Constrained submodular maximization: Beyond 1/e. In FOCS,  1979.  2016.  Uriel Feige, Vahab S. Mirrokni, and Jan Vondr´ak. Maximizing non-monotone submodular func-  tions. SIAM Journal on Computing, 2011.  Moran Feldman, Joseph Naor, and Roy Schwartz. A unified continuous greedy algorithm for sub-  modular maximization. In FOCS, 2011a.  Moran Feldman, Joseph Naor, Roy Schwartz, and Justin Ward. Improved approximations for k-  exchange systems - (extended abstract). In ESA, 2011b.  M. Fisher, G. Nemhauser, and L. Wolsey. An analysis of approximations for maximizing submod-  ular set functions—ii. Mathematical Programming, 8:73-87, 1978.  Satoru Fujishige. Submodular functions and optimization. Elsevier Science, 2nd edition, 2005.  Shayan Oveis Gharan and Jan Vondr´ak. Submodular maximization by simulated annealing.  In  SODA, 2011.  point processes. In NIPS, 2012.  and inﬂuence. In KDD, 2010.  processes. In ICML, 2005.  Jennifer Gillenwater, Alex Kulesza, and Ben Taskar. Near-optimal MAP inference for determinantal  Manuel Gomez Rodriguez, Jure Leskovec, and Andreas Krause. Inferring networks of diffusion  Carlos Guestrin, Andreas Krause, and Ajit Paul Singh. Near-optimal sensor placements in gaussian  Anupam Gupta, Aaron Roth, Grant Schoenebeck, and Kunal Talwar. Constrained non-monotone  submodular maximization: Ofﬂine and secretary algorithms. In WINE, 2010.  Trevor Hastie, Rahul Mazumder, Jason D. Lee, and Rexa Zadeh. Matrix completion and low-rank  svd via fast alternating least squares. In Journal of Machine Learning Research, 2015.  Wassily Hoeffding. Probability inequalities for sums of bounded random variables. Journal of the  American Statistical Association, 1963.  T. A. Jenkyns. The efficacy of the “greedy” algorithm. In South Eastern Conference on Combina-  torics, Graph Theory and Computing, 1976.  David Kempe, Jon Kleinberg, and ´Eva Tardos. Maximizing the spread of inﬂuence through a social  network. In KDD, 2003. FELDMAN HARSHAW KARBASI  Katrin Kirchhoff and Jeff Bilmes. Submodularity for data selection in statistical machine translation.  In EMNLP, 2014.  Jon Lee, Maxim Sviridenko, and Jan Vondr´ak. Submodular maximization over multiple matroids  via generalized exchange properties. Mathematics of Operations Research, 2010.  Jure Leskovec, Andreas Krause, Carlos Guestrin, Christos Faloutsos, Jeanne Van Briesen, and Na-  talie Glance. Cost-effective outbreak detection in networks. In KDD, 2007.  Hui Lin and Jeff Bilmes. A class of submodular functions for document summarization. In ACL,  2011.  Erik M Lindgren, Shanshan Wu, and Alexandros G Dimakis. Sparse and greedy: Sparsifying submodular facility location problems. In NIPS Workshop on Optimization for Machine Learning, 2015.  Juli´an Mestre. Greedy in approximation algorithms. In ESA, 2006.  Baharan Mirzasoleiman, Amin Karbasi, Rik Sarkar, and Andreas Krause. Distributed submodular  maximization: Identifying representative elements in massive data. In NIPS, 2013.  Baharan Mirzasoleiman, Ashwinkumar Badanidiyuru, Amin Karbasi, Jan Vondrak, and Andreas  Krause. Lazier than lazy greedy. In AAAI, 2015a.  Baharan Mirzasoleiman, Amin Karbasi, Ashwinkumar Badanidiyuru, and Andreas Krause. Dis-  tributed submodular cover: Succinctly summarizing massive data. In NIPS, 2015b.  Baharan Mirzasoleiman, Ashwinkumar Badanidiyuru, and Amin Karbasi. Fast constrained sub-  modular maximization: Personalized data summarization. In ICML, 2016a.  Baharan Mirzasoleiman, Morteza Zadimoghaddam, and Amin Karbasi. Fast distributed submod- ular cover: Public-private data summarization. In Advances in Neural Information Processing Systems, pages 3594-3602, 2016b.  G. L. Nemhauser and L. A. Wolsey. Best algorithms for approximating the maximum of a submod-  ular set function. Mathematics of Operations Research, 1978.  G. L. Nemhauser, L. A. Wolsey, and M. L. Fisher. An analysis of approximations for maximizing  submodular set functions—i. Mathematical Programming, 1978.  Colorado Reed and Zoubin Ghahramani. Scaling the indian buffet process via submodular maxi-  mization. In ICML, 2013.  Adish Singla, Ilija Bogunovic, G´abor Bart´ok, Amin Karbasi, and Andreas Krause. Near-optimally  teaching the crowd to classify. In ICML, 2014.  Ruben Sipos, Adith Swaminathan, Pannaga Shivaswamy, and Thorsten Joachims. Temporal corpus  summarization using submodular word coverage. In CIKM, 2012.  Matthew Skala. Hypergeometric tail inequalities: ending the insanity. CoRR, abs/1311.5939, 2013. Jan Vondr´ak. Symmetry and approximability of submodular maximization problems. SIAM Journal  on Computing, 2013.  Justin Ward. A (k+3)/2-approximation algorithm for monotone submodular k-set packing and gen-  eral k-exchange systems. In STACS, 2012."}