{"1": "IEEE International Symposium on Information Theory, ISIT 2015, Hong Kong, China, June 14- 19, 2015, 2015. IEEE. ISBN 978-1-4673-7704-1. URL http://ieeexplore.ieee.org/ xpl/mostRecentIssue.jsp?punumber=7270906.  Emmanuel Abbe and Colin Sandon. Detection in the stochastic block model with multiple clusters: proof of the achievability conjectures, acyclic bp, and the information-computation gap. arXiv preprint arXiv:1512.09080, 2015.  Michael Aizenman, Robert Sims, and Shannon L Starr. Extended variational principle for the  sherrington-kirkpatrick spin-glass model. Physical Review B, 68(21):214403, 2003.  Jinho Baik, G´erard Ben Arous, and Sandrine P´ech´e. Phase transition of the largest eigenvalue for nonnull complex sample covariance matrices. Annals of Probability, pages 1643-1697, 2005.  Afonso S Bandeira, Nicolas Boumal, and Amit Singer. Tightness of the maximum likelihood semidefinite relaxation for angular synchronization. Mathematical Programming, pages 1-23, 2016.  Jess Banks, Cristopher Moore, Nicolas Verzelen, Roman Vershynin, and Jiaming Xu. Information- theoretic bounds and phase transitions in clustering, sparse pca, and submatrix localization. arXiv preprint arXiv:1607.05222v2, 2016.  Jean Barbier, Mohamad Dia, Nicolas Macris, Florent Krzakala, Thibault Lesieur, and Lenka Zde- borov´a. Mutual information for symmetric rank-one matrix estimation: A proof of the replica formula. In Advances in Neural Information Processing Systems, pages 424-432, 2016.  Florent Benaych-Georges and Raj Rao Nadakuditi. The eigenvalues and eigenvectors of finite, low rank perturbations of large random matrices. Advances in Mathematics, 227(1):494-521, 2011.  St´ephane Boucheron, G´abor Lugosi, and Pascal Massart. Concentration inequalities: A nonasymp-  totic theory of independence. Oxford university press, 2013.  Francesco Caltagirone, Marc Lelarge, and L´eo Miolane. Recovering asymmetric communities in  the stochastic block model. arXiv preprint arXiv:1610.03680, 2016.  Amin Coja-Oghlan, Florent Krzakala, Will Perkins, and Lenka Zdeborova. Information-theoretic  thresholds from the cavity method. arXiv preprint arXiv:1611.00814, 2016.  Aurelien Decelle, Florent Krzakala, Cristopher Moore, and Lenka Zdeborov´a. Asymptotic analysis of the stochastic block model for modular networks and its algorithmic applications. Physical Review E, 84(6):066106, 2011.  Yash Deshpande and Emmanuel Abbe. Asymptotic mutual information for the balanced binary  stochastic block model. Information and Inference, page iaw017, 2016.  Yash Deshpande and Andrea Montanari.  Information-theoretically optimal sparse pca. IEEE International Symposium on Information Theory, pages 2197-2201. IEEE, 2014.  In 2014  3   FUNDAMENTAL LIMITS OF SYMMETRIC LOW-RANK MATRIX ESTIMATION  References  IEEE International Symposium on Information Theory, ISIT 2015, Hong Kong, China, June 14- 19, 2015, 2015. IEEE. ISBN 978-1-4673-7704-1. URL http://ieeexplore.ieee.org/ xpl/mostRecentIssue.jsp?punumber=7270906.  Emmanuel Abbe and Colin Sandon. Detection in the stochastic block model with multiple clusters: proof of the achievability conjectures, acyclic bp, and the information-computation gap. arXiv preprint arXiv:1512.09080, 2015.  Michael Aizenman, Robert Sims, and Shannon L Starr. Extended variational principle for the  sherrington-kirkpatrick spin-glass model. Physical Review B, 68(21):214403, 2003.  Jinho Baik, G´erard Ben Arous, and Sandrine P´ech´e. Phase transition of the largest eigenvalue for nonnull complex sample covariance matrices. Annals of Probability, pages 1643-1697, 2005.  Afonso S Bandeira, Nicolas Boumal, and Amit Singer. Tightness of the maximum likelihood semidefinite relaxation for angular synchronization. Mathematical Programming, pages 1-23, 2016.  Jess Banks, Cristopher Moore, Nicolas Verzelen, Roman Vershynin, and Jiaming Xu. Information- theoretic bounds and phase transitions in clustering, sparse pca, and submatrix localization. arXiv preprint arXiv:1607.05222v2, 2016.  Jean Barbier, Mohamad Dia, Nicolas Macris, Florent Krzakala, Thibault Lesieur, and Lenka Zde- borov´a. Mutual information for symmetric rank-one matrix estimation: A proof of the replica formula. In Advances in Neural Information Processing Systems, pages 424-432, 2016.  Florent Benaych-Georges and Raj Rao Nadakuditi. The eigenvalues and eigenvectors of finite, low rank perturbations of large random matrices. Advances in Mathematics, 227(1):494-521, 2011.  St´ephane Boucheron, G´abor Lugosi, and Pascal Massart. Concentration inequalities: A nonasymp-  totic theory of independence. Oxford university press, 2013.  Francesco Caltagirone, Marc Lelarge, and L´eo Miolane. Recovering asymmetric communities in  the stochastic block model. arXiv preprint arXiv:1610.03680, 2016.  Amin Coja-Oghlan, Florent Krzakala, Will Perkins, and Lenka Zdeborova. Information-theoretic  thresholds from the cavity method. arXiv preprint arXiv:1611.00814, 2016.  Aurelien Decelle, Florent Krzakala, Cristopher Moore, and Lenka Zdeborov´a. Asymptotic analysis of the stochastic block model for modular networks and its algorithmic applications. Physical Review E, 84(6):066106, 2011.  Yash Deshpande and Emmanuel Abbe. Asymptotic mutual information for the balanced binary  stochastic block model. Information and Inference, page iaw017, 2016.  Yash Deshpande and Andrea Montanari.  Information-theoretically optimal sparse pca. IEEE International Symposium on Information Theory, pages 2197-2201. IEEE, 2014.  In 2014 LELARGE MIOLANE  Delphine F´eral and Sandrine P´ech´e. The largest eigenvalue of rank one deformation of large wigner  matrices. Communications in mathematical physics, 272(1):185-228, 2007.  Francesco Guerra. Broken replica symmetry bounds in the mean field spin glass model. Communi-  cations in mathematical physics, 233(1):1-12, 2003.  Dongning Guo, Shlomo Shamai, and Sergio Verd´u. Mutual information and minimum mean-square error in gaussian channels. IEEE Transactions on Information Theory, 51(4):1261-1282, 2005.  Bruce Hajek, Yihong Wu, and Jiaming Xu. Information limits for recovering a hidden community. In Information Theory (ISIT), 2016 IEEE International Symposium on, pages 1894-1898. IEEE, 2016.  Yukito Iba. The nishimori line and bayesian statistics. Journal of Physics A: Mathematical and  General, 32(21):3875, 1999.  Satish Babu Korada and Nicolas Macris. Exact solution of the gauge symmetric p-spin glass model  on a complete graph. Journal of Statistical Physics, 136(2):205-230, 2009.  Satish Babu Korada and Nicolas Macris. Tight bounds on the capacity of binary input random cdma  systems. IEEE Transactions on Information Theory, 56(11):5590-5613, 2010.  Satish Babu Korada and Andrea Montanari. Applications of the lindeberg principle in communi- IEEE Transactions on Information Theory, 57(4):2440-2450,  cations and statistical learning. 2011.  Florent Krzakala, Jiaming Xu, and Lenka Zdeborov´a. Mutual information in rank-one matrix esti-  mation. In Information Theory Workshop (ITW), 2016 IEEE, pages 71-75. IEEE, 2016.  Thibault Lesieur, Florent Krzakala, and Lenka Zdeborov´a. MMSE of probabilistic low-rank matrix estimation: Universality with respect to the output channel. In 53rd Annual Allerton Conference on Communication, Control, and Computing, Allerton 2015, Allerton Park & Retreat Center, Monticello, IL, USA, September 29 - October 2, 2015, pages 680-687. IEEE, 2015a. ISBN 978- 1-5090-1824-6. doi: 10.1109/ALLERTON.2015.7447070. URL http://dx.doi.org/10. 1109/ALLERTON.2015.7447070.  Thibault Lesieur, Florent Krzakala, and Lenka Zdeborov´a. Phase transitions in sparse PCA.  In IEEE International Symposium on Information Theory, ISIT 2015, Hong Kong, China, June 14- 19, 2015 DBL (2015), pages 1635-1639. ISBN 978-1-4673-7704-1. doi: 10.1109/ISIT.2015. 7282733. URL http://dx.doi.org/10.1109/ISIT.2015.7282733.  Cyril M´easson, Andrea Montanari, Thomas J Richardson, and R¨udiger Urbanke. The generalized area theorem and some of its consequences. IEEE Transactions on Information Theory, 55(11): 4793-4821, 2009.  Marc M´ezard, Giorgio Parisi, and Miguel Virasoro. Spin glass theory and beyond: An Introduction to the Replica Method and Its Applications, volume 9. World Scientific Publishing Co Inc, 1987.  Paul Milgrom and Ilya Segal. Envelope theorems for arbitrary choice sets. Econometrica, 70(2):  583-601, 2002. FUNDAMENTAL LIMITS OF SYMMETRIC LOW-RANK MATRIX ESTIMATION  Andrea Montanari. Estimating random variables from random sparse observations. European Trans-  actions on Telecommunications, 19(4):385-403, 2008.  Andrea Montanari. Finding one community in a sparse graph. Journal of Statistical Physics, 161  (2):273-299, 2015.  preprint arXiv:1404.6304, 2014.  Joe Neeman and Praneeth Netrapalli. Non-reconstructability in the stochastic block model. arXiv  Hidetoshi Nishimori. Statistical physics of spin glasses and information processing: an introduc-  tion, volume 111. Clarendon Press, 2001.  Dmitry Panchenko. The Sherrington-Kirkpatrick model. Springer Science & Business Media, 2013.  Amelia Perry, Alexander S Wein, Afonso S Bandeira, and Ankur Moitra. Optimality and arXiv preprint  sub-optimality of pca for spiked random matrices and synchronization. arXiv:1609.05573, 2016.  Sundeep Rangan and Alyson K Fletcher. Iterative estimation of constrained rank-one matrices in noise. In Information Theory Proceedings (ISIT), 2012 IEEE International Symposium on, pages 1246-1250. IEEE, 2012.  Alaa Saade, Marc Lelarge, Florent Krzakala, and Lenka Zdeborov´a. Spectral detection in the cen- sored block model. In 2015 IEEE International Symposium on Information Theory (ISIT), pages 1184-1188. IEEE, 2015.  Alaa Saade, Marc Lelarge, Florent Krzakala, and Lenka Zdeborov´a. Clustering from sparse pairwise In Information Theory (ISIT), 2016 IEEE International Symposium on, pages  measurements. 780-784. IEEE, 2016.  Michel Talagrand. Mean field models for spin glasses: Volume I: Basic examples, volume 54.  Springer Science & Business Media, 2010.  Michel Talagrand. Mean field models for spin glasses: Volume II: Advanced Replica-Symmetry and  Low Temperature, volume 55. Springer Science & Business Media, 2011.  Lenka Zdeborov´a and Florent Krzakala. Statistical physics of inference: Thresholds and algorithms.  Advances in Physics, 65(5):453-552, 2016."}