{"1": "Y. Arjevani, O. Shamir, and R. Shiff. Oracle complexity of second-order methods for smooth convex  optimization. Mathematical Programming, published online, 2018.  M. Baes. Estimate sequence methods: extensions and approximations.  Institute for Operations  Research, ETH, Zrich, Switzerland, 2009.  S. Bubeck, Q. Jiang, Y.T. Lee, Y. Li, and A. Sidford. Near-optimal method for highly smooth convex  optimization. ArXiv Preprint: 1812.08026, 2018.  B. Bullins. Fast minimization of structured convex quartics. ArXiv Preprint: 1812.10349, 2018.  A. Gasnikov, P. Dvurechensky, E. Gorbunov, D. Kovalev, A. Mohhamed, E. Chernousova, and C.A. Uribe. The global rate of convergence for optimal tensor methods in smooth convex optimization. arXiv:1809.00382, 2018.  B. Jiang, T. Lin, and S. Zhang. A unified adaptive tensor approximation scheme to accelerate  composite convex optimization. arxiv:1811.02427, 2018.  R.D.C. Monteiro and B.F. Svaiter. An accelerated hybrid proximal extragradient method for convex optimization and its implications to second-order methods. SIAM Journal on Optimization, 23(2): 1092-1125, 2013.  Yu. Nesterov. A method for unconstrained convex minimization problem with the rate of conver-  gence o(1/k2). Doklady AN SSSR, translated as Soviet Math.Docl., 269:543-547, 1983.  Yu. Nesterov. Accelerating the cubic regularization of newton’s method on convex problems. Math-  ematical Programming, 112(1):159-181, 2008.  Yu. Nesterov. Implementable tensor methods in unconstrained convex optimization. CORE Dis- cussion Paper 2018/05, Catholic University of Louvain, Center for Operations Research and Econometrics (CORE), 2018.  3   AN OPTIMAL HIGH-ORDER TENSOR METHOD FOR CONVEX OPTIMIZATION  of bisection steps - each calling to solve a convex tensor subproblem - is upper bounded by a logarithmic factor in the inverse of the required precision. Our bisection procedure is similar to the one proposed in Monteiro and Svaiter (2013) for the case d = 2; however, a key modification is applied which enables the removal of the so-called “bracketing stage” used in Monteiro and Svaiter (2013).  References  Y. Arjevani, O. Shamir, and R. Shiff. Oracle complexity of second-order methods for smooth convex  optimization. Mathematical Programming, published online, 2018.  M. Baes. Estimate sequence methods: extensions and approximations.  Institute for Operations  Research, ETH, Zrich, Switzerland, 2009.  S. Bubeck, Q. Jiang, Y.T. Lee, Y. Li, and A. Sidford. Near-optimal method for highly smooth convex  optimization. ArXiv Preprint: 1812.08026, 2018.  B. Bullins. Fast minimization of structured convex quartics. ArXiv Preprint: 1812.10349, 2018.  A. Gasnikov, P. Dvurechensky, E. Gorbunov, D. Kovalev, A. Mohhamed, E. Chernousova, and C.A. Uribe. The global rate of convergence for optimal tensor methods in smooth convex optimization. arXiv:1809.00382, 2018.  B. Jiang, T. Lin, and S. Zhang. A unified adaptive tensor approximation scheme to accelerate  composite convex optimization. arxiv:1811.02427, 2018.  R.D.C. Monteiro and B.F. Svaiter. An accelerated hybrid proximal extragradient method for convex optimization and its implications to second-order methods. SIAM Journal on Optimization, 23(2): 1092-1125, 2013.  Yu. Nesterov. A method for unconstrained convex minimization problem with the rate of conver-  gence o(1/k2). Doklady AN SSSR, translated as Soviet Math.Docl., 269:543-547, 1983.  Yu. Nesterov. Accelerating the cubic regularization of newton’s method on convex problems. Math-  ematical Programming, 112(1):159-181, 2008.  Yu. Nesterov. Implementable tensor methods in unconstrained convex optimization. CORE Dis- cussion Paper 2018/05, Catholic University of Louvain, Center for Operations Research and Econometrics (CORE), 2018."}