{"1": "Arpit Agarwal and Shivani Agarwal. On consistent surrogate risk minimization and property elici-  tation. In JMLR Workshop and Conference Proceedings, volume 40, pages 1-19, 2015.  M. F. Atiyah and I. G. Macdonald. Introduction to commutative algebra. Addison-Wesley Publish-  ing Co., Reading, Mass.-London-Don Mills, Ont., 1969.  Peter L Bartlett and Shahar Mendelson. Rademacher and gaussian complexities: Risk bounds and  structural results. Journal of Machine Learning Research, 3(Nov):463-482, 2002.  Hans-Georg Beyer and Bernhard Sendhoff. Robust optimization-a comprehensive survey. Com-  puter methods in applied mechanics and engineering, 196(33):3190-3218, 2007.  Jacek Bochnak, Michel Coste, and Marie-Françoise Roy. Real algebraic geometry, volume 36 of Ergebnisse der Mathematik und ihrer Grenzgebiete (3) [Results in Mathematics and Related Areas (3)]. Springer-Verlag, Berlin, 1998. ISBN 3-540-64663-9. Translated from the 1987 French original, Revised by the authors.  Andrew Browder. Mathematical analysis: An introduction. Undergraduate Texts in Mathematics.  Springer-Verlag, New York, 1996. ISBN 0-387-94614-4.  14   CASALAINA-MARTIN FRONGILLO MORGAN WAGGONER  Figure 5: The mean squared error of the two regression strategies for estimating Var(y|x), where x ∼ Unif(0, 1) and y ∼ a sin(4πx) + N (0, 1), for a = 1 (left) and a = 10 (right). The single-observation loss function approach fails because it tries to fit to the complex underlying model of y|x, while the two- observation loss approach is able to directly model the simple relationship between Var(y) and x.  We thank Karthik Kannan for contributing the upper bound for central moments. Sebastian Casalaina- Martin was partially supported by NSA grant H98230-16-1-0053. Tom Morgan was funded in part by NSF grants CCF-1320231 and CNS-1228598. Bo Waggoner is supported by the Warren Center for Network and Data Sciences at the University of Pennsylvania.  Acknowledgments  References  Arpit Agarwal and Shivani Agarwal. On consistent surrogate risk minimization and property elici-  tation. In JMLR Workshop and Conference Proceedings, volume 40, pages 1-19, 2015.  M. F. Atiyah and I. G. Macdonald. Introduction to commutative algebra. Addison-Wesley Publish-  ing Co., Reading, Mass.-London-Don Mills, Ont., 1969.  Peter L Bartlett and Shahar Mendelson. Rademacher and gaussian complexities: Risk bounds and  structural results. Journal of Machine Learning Research, 3(Nov):463-482, 2002.  Hans-Georg Beyer and Bernhard Sendhoff. Robust optimization-a comprehensive survey. Com-  puter methods in applied mechanics and engineering, 196(33):3190-3218, 2007.  Jacek Bochnak, Michel Coste, and Marie-Françoise Roy. Real algebraic geometry, volume 36 of Ergebnisse der Mathematik und ihrer Grenzgebiete (3) [Results in Mathematics and Related Areas (3)]. Springer-Verlag, Berlin, 1998. ISBN 3-540-64663-9. Translated from the 1987 French original, Revised by the authors.  Andrew Browder. Mathematical analysis: An introduction. Undergraduate Texts in Mathematics.  Springer-Verlag, New York, 1996. ISBN 0-387-94614-4. MULTI-OBSERVATION ELICITATION  David A. Cox, John Little, and Donal O’Shea. Ideals, varieties, and algorithms. Undergraduate Texts in Mathematics. Springer, Cham, fourth edition, 2015. ISBN 978-3-319-16720-6; 978-3- 319-16721-3. An introduction to computational algebraic geometry and commutative algebra.  David R Cox and Peter AW Lewis. The statistical analysis of series of events. Monographs on  Applied Probability and Statistics, 1966.  Ronald A. Fisher, A. Steven Corbet, and Carrington B. Williams. The relation between the number of species and the number of individuals in a random sample of an animal population. The Journal of Animal Ecology, 12(1):42-58, 1943.  Rafael Frongillo and Ian Kash. General truthfulness characterizations via convex analysis. In Web  and Internet Economics, pages 354-370. Springer, 2014.  Rafael Frongillo and Ian Kash. Vector-Valued Property Elicitation.  In Proceedings of the 28th  Conference on Learning Theory, pages 1-18, 2015a.  Rafael Frongillo and Ian A. Kash. On Elicitation Complexity and Conditional Elicitation. arXiv  preprint arXiv:1506.07212, 2015b.  Processing Systems 29, 2015c.  Rafael Frongillo and Ian A. Kash. On Elicitation Complexity. In Advances in Neural Information  Rafael M. Frongillo, Yiling Chen, and Ian A. Kash. Elicitation for Aggregation. Proceedings of the  29th AAAI Conference on Artificial Intelligence, 2015.  William Fulton. Intersection theory, volume 2 of Ergebnisse der Mathematik und ihrer Grenzgebi- ete. 3. Folge. A Series of Modern Surveys in Mathematics [Results in Mathematics and Related Areas. 3rd Series. A Series of Modern Surveys in Mathematics]. Springer-Verlag, Berlin, second edition, 1998. ISBN 3-540-62046-X; 0-387-98549-2.  T. Gneiting. Making and Evaluating Point Forecasts. Journal of the American Statistical Associa-  tion, 106(494):746-762, 2011.  Raia Hadsell, Sumit Chopra, and Yann LeCun. Dimensionality reduction by learning an invariant mapping. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, volume 2, pages 1735-1742. IEEE, 2006.  Nicolas S. Lambert and Yoav Shoham. Eliciting truthful answers to multiple-choice questions. In  Proceedings of the 10th ACM Conference on Electronic Commerce, pages 109-118, 2009.  Nicolas S. Lambert, David M. Pennock, and Yoav Shoham. Eliciting properties of probability distributions. In Proceedings of the 9th ACM Conference on Electronic Commerce, pages 129- 138, 2008.  N.S. Lambert. Elicitation and Evaluation of Statistical Forecasts. Preprint, 2011.  Kent Harold Osband. Providing Incentives for Better Cost Forecasting. University of California,  Berkeley, 1985. CASALAINA-MARTIN FRONGILLO MORGAN WAGGONER  Florian Schroff, Dmitry Kalenichenko, and James Philbin. Facenet: A unified embedding for face In Proceedings of the IEEE Conference on Computer Vision and  recognition and clustering. Pattern Recognition, pages 815-823, 2015.  William F Sharpe. Mutual fund performance. Journal of Business, 39(1):119-138, 1966.  Ingo Steinwart, Chloé Pasin, Robert Williamson, and Siyu Zhang. Elicitation and Identification of Properties. In Proceedings of The 27th Conference on Learning Theory, pages 482-526, 2014.  Evgeniya Ustinova and Victor Lempitsky. Learning deep embeddings with histogram loss.  In  Advances in Neural Information Processing Systems, pages 4170-4178, 2016."}