{"1": "Radosław Adamczak, Rafał Latała, Alexander E Litvak, Alain Pajor, and Nicole Tomczak- Jaegermann. Chevet type inequality and norms of submatrices. arXiv preprint arXiv:1107.4066, 2011.  A. Agarwal, A. Anandkumar, P. Jain, P. Netrapalli, and R. Tandon. Learning Sparsely Used Over- complete Dictionaries via Alternating Minimization. Available on arXiv:1310.7991, Oct. 2013.  A. Anandkumar, D. P. Foster, D. Hsu, S. M. Kakade, and Y. K. Liu. Two SVDs Suffice: Spectral to appear Decompositions for Probabilistic Topic Modeling and Latent Dirichlet Allocation. in the special issue of Algorithmica on New Theoretical Challenges in Machine Learning, July 2013a.  A. Anandkumar, R. Ge, D. Hsu, and S. M. Kakade. A Tensor Spectral Approach to Learning Mixed Membership Community Models. In Conference on Learning Theory (COLT), June 2013b.  A. Anandkumar, D. Hsu, M. Janzamin, and S. M. Kakade. When are Overcomplete Topic Models Identifiable? Uniqueness of Tensor Tucker Decompositions with Structured Sparsity. In Neural Information Processing (NIPS), Dec. 2013c.  A. Anandkumar, R. Ge, D. Hsu, S. M. Kakade, and M. Telgarsky. Tensor Methods for Learning  Latent Variable Models. J. of Machine Learning Research, 15:2773-2832, 2014a.  Anima Anandkumar, Rong Ge, and Majid Janzamin. Guaranteed Non-Orthogonal Tensor Decom-  position via Alternating Rank-1 Updates. arXiv preprint arXiv:1402.5180, Feb. 2014b.  J. Anderson, M. Belkin, N. Goyal, L. Rademacher, and J. Voss. The More, the Merrier: the Blessing of Dimensionality for Learning Large Gaussian Mixtures. arXiv preprint arXiv:1311.2891, Nov. 2013.  S. Arora, R. Ge, and A. Moitra. New Algorithms for Learning Incoherent and Overcomplete Dic-  tionaries. ArXiv e-prints, August 2013.  Boaz Barak, Jonathan Kelner, and David Steurer. Dictionary learning and tensor decomposition via  the sum-of-squares method. arXiv preprint arXiv:1407.1543, 2014.  Y. Bengio, A. Courville, and P. Vincent. Unsupervised feature learning and deep learning: A review  and new perspectives. arXiv preprint arXiv:1206.5538, 2012.  A. Bhaskara, M. Charikar, A. Moitra, and A. Vijayaraghavan. Smoothed analysis of tensor decom-  positions. arXiv preprint arXiv:1311.3651, 2013.  Emmanuel J Candes and Terence Tao. Near-optimal signal recovery from random projections: Universal encoding strategies? Information Theory, IEEE Transactions on, 52(12):5406-5425, 2006.  J. F. Cardoso and Pierre Comon.  Independent component analysis, a survey of some algebraic  methods. In IEEE International Symposium on Circuits and Systems, pages 93-96, 1996.  13   LEARNING OVERCOMPLETE LVMS THROUGH TENSOR METHODS  References  Radosław Adamczak, Rafał Latała, Alexander E Litvak, Alain Pajor, and Nicole Tomczak- Jaegermann. Chevet type inequality and norms of submatrices. arXiv preprint arXiv:1107.4066, 2011.  A. Agarwal, A. Anandkumar, P. Jain, P. Netrapalli, and R. Tandon. Learning Sparsely Used Over- complete Dictionaries via Alternating Minimization. Available on arXiv:1310.7991, Oct. 2013.  A. Anandkumar, D. P. Foster, D. Hsu, S. M. Kakade, and Y. K. Liu. Two SVDs Suffice: Spectral to appear Decompositions for Probabilistic Topic Modeling and Latent Dirichlet Allocation. in the special issue of Algorithmica on New Theoretical Challenges in Machine Learning, July 2013a.  A. Anandkumar, R. Ge, D. Hsu, and S. M. Kakade. A Tensor Spectral Approach to Learning Mixed Membership Community Models. In Conference on Learning Theory (COLT), June 2013b.  A. Anandkumar, D. Hsu, M. Janzamin, and S. M. Kakade. When are Overcomplete Topic Models Identifiable? Uniqueness of Tensor Tucker Decompositions with Structured Sparsity. In Neural Information Processing (NIPS), Dec. 2013c.  A. Anandkumar, R. Ge, D. Hsu, S. M. Kakade, and M. Telgarsky. Tensor Methods for Learning  Latent Variable Models. J. of Machine Learning Research, 15:2773-2832, 2014a.  Anima Anandkumar, Rong Ge, and Majid Janzamin. Guaranteed Non-Orthogonal Tensor Decom-  position via Alternating Rank-1 Updates. arXiv preprint arXiv:1402.5180, Feb. 2014b.  J. Anderson, M. Belkin, N. Goyal, L. Rademacher, and J. Voss. The More, the Merrier: the Blessing of Dimensionality for Learning Large Gaussian Mixtures. arXiv preprint arXiv:1311.2891, Nov. 2013.  S. Arora, R. Ge, and A. Moitra. New Algorithms for Learning Incoherent and Overcomplete Dic-  tionaries. ArXiv e-prints, August 2013.  Boaz Barak, Jonathan Kelner, and David Steurer. Dictionary learning and tensor decomposition via  the sum-of-squares method. arXiv preprint arXiv:1407.1543, 2014.  Y. Bengio, A. Courville, and P. Vincent. Unsupervised feature learning and deep learning: A review  and new perspectives. arXiv preprint arXiv:1206.5538, 2012.  A. Bhaskara, M. Charikar, A. Moitra, and A. Vijayaraghavan. Smoothed analysis of tensor decom-  positions. arXiv preprint arXiv:1311.3651, 2013.  Emmanuel J Candes and Terence Tao. Near-optimal signal recovery from random projections: Universal encoding strategies? Information Theory, IEEE Transactions on, 52(12):5406-5425, 2006.  J. F. Cardoso and Pierre Comon.  Independent component analysis, a survey of some algebraic  methods. In IEEE International Symposium on Circuits and Systems, pages 93-96, 1996. ANANDKUMAR GE JANZAMIN  A. Coates, H. Lee, and A. Y. Ng. An analysis of single-layer networks in unsupervised feature  learning. Journal of Machine Learning Research - Proceedings Track, 15:215-223, 2011.  P. Comon. Independent component analysis, a new concept? Signal Processing, 36(3):287-314,  P. Comon. Tensor decompositions. Mathematics in Signal Processing V, pages 1-24, 2002.  P. Comon and C. Jutten. Handbook of Blind Source Separation: Independent Component Analysis  and Applications. Academic Press. Elsevier, 2010.  Sanjoy Dasgupta, Daniel Hsu, and Nakul Verma. A concentration theorem for projections.  In  Twenty-Second Conference on Uncertainty in Artificial Intelligence, 2006.  L. De Lathauwer, J. Castaing, and J.-F. Cardoso. Fourth-order cumulant-based blind identification of underdetermined mixtures. Signal Processing, IEEE Transactions on, 55(6):2965-2973, 2007.  D. Donoho. Compressed sensing. Information Theory, IEEE Transactions on, 52(4):1289-1306,  1994.  2006.  N. Goyal, S. Vempala, and Y. Xiao. Fourier pca. arXiv preprint arXiv:1306.5825, 2013.  Olivier Gu´edon and Mark Rudelson. Lp-moments of random vectors via majorizing measures.  Advances in Mathematics, 208(2):798-823, 2007.  D. Hsu and S. M. Kakade. Learning Mixtures of Spherical Gaussians: Moment Methods and  Spectral Decompositions. arXiv preprint arXiv:1206.5766, 2012.  F. Huang, U. N. Niranjan, M. Hakeem, and A. Anandkumar. Fast Detection of Overlapping Com-  munities via Online Tensor Methods. ArXiv 1309.0787, Sept. 2013.  A. Hyvarinen and E. Oja. Independent component analysis: algorithms and applications. Neural  Networks, 13(4-5):411-430, 2000.  R. Latala. Estimates of moments and tails of Gaussian chaoses. Ann. Prob., 34(6):2315-2331, 2006.  Q. V. Le, A. Karpenko, J. Ngiam, and A. Y. Ng. ICA with Reconstruction Cost for Efficient Over-  complete Feature Learning. In NIPS, pages 1017-1025, 2011.  M. S. Lewicki and T. J. Sejnowski. Learning overcomplete representations. Neural computation,  12(2):337-365, 2000.  N. H. Nguyen, P. Drineas, and T. D. Tran. Tensor sparsification via a bound on the spectral norm  of random tensors. arXiv preprint arXiv:1005.4732, May 2010.  M. Rudelson and R. Vershynin. The smallest singular value of a random rectangular matrix. Com-  munications on Pure and Applied Mathematics, 62(12):1707-1739, 2009.  L. Song, A. Anandkumar, B. Dai, and B. Xie. Nonparametric estimation of multi-view latent vari-  able models. Available on arXiv:1311.3287, Nov. 2013. LEARNING OVERCOMPLETE LVMS THROUGH TENSOR METHODS  Joel A. Tropp. User-friendly tail bounds for sums of random matrices. Foundations of Computa-  tional Mathematics, 12(4):389-434, 2012.  M. A. O. Vasilescu and D. Terzopoulos. Multilinear subspace analysis of image ensembles. In Com- puter Vision and Pattern Recognition, 2003. Proceedings. 2003 IEEE Computer Society Confer- ence on, volume 2, pages II-93. IEEE, 2003.  Eugene P Wigner. Characteristic vectors of bordered matrices with infinite dimensions. The Annals  of Mathematics, 62(3):548-564, 1955.  T. Zhang and G. Golub. Rank-one approximation to high order tensors. SIAM Journal on Matrix  Analysis and Applications, 23:534-550, 2001.  J. Y. Zou, D. Hsu, D. C. Parkes, and R. P. Adams. Contrastive learning using spectral methods. In  Advances in Neural Information Processing Systems, pages 2238-2246, 2013."}