{"1": "N. Alon, M. Krivelevich, and B. Sudakov. Finding a large hidden clique in a random graph. Random  Structures and Algorithms, 13:457-466, 1998.  Boaz Barak, Samuel B. Hopkins, Jonathan A. Kelner, Pravesh Kothari, Ankur Moitra, and Aaron Potechin. A nearly tight sum-of-squares lower bound for the planted clique problem. CoRR, abs/1604.03084, 2016. URL http://arxiv.org/abs/1604.03084.  Aditya Bhaskara, Moses Charikar, Eden Chlamtac, Uriel Feige, and Aravindan Vijayaraghavan. Detecting high log-densities: an O(n1/4) approximation for densest k-subgraph. In Proceedings of the 42nd ACM Symposium on Theory of Computing, STOC 2010, Cambridge, Massachusetts, USA, 5-8 June 2010, pages 201-210, 2010. doi: 10.1145/1806689.1806718. URL http:// doi.acm.org/10.1145/1806689.1806718.  Avrim Blum, Merrick Furst, Jeffrey Jackson, Michael Kearns, Yishay Mansour, and Steven Rudich. Weakly learning DNF and characterizing statistical query learning using Fourier analysis. In STOC, pages 253-262, 1994.  R. Boppana. Eigenvalues and graph bisection: An average-case analysis. Proceedings of the 28th  IEEE Symposium on Foundations of Computer Science, pages 280-285, 1987.  S. Charles Brubaker and Santosh Vempala. Random tensors and planted cliques. In Approximation, Randomization, and Combinatorial Optimization. Algorithms and Techniques, 12th International Workshop, APPROX 2009, and 13th International Workshop, RANDOM 2009, Berkeley, CA, USA, August 21-23, 2009. Proceedings, pages 406-419, 2009. doi: 10.1007/978-3-642-03685-9 31. URL http://dx.doi.org/10.1007/978-3-642-03685-9_31.  Yael Dekel, Ori Gurel-Gurevich, and Yuval Peres. Finding hidden cliques in linear time with high probability. In Proceedings of the Meeting on Analytic Algorithmics and Combinatorics, ANALCO ’11, pages 67-75, Philadelphia, PA, USA, 2011. Society for Industrial and Applied Mathematics. URL http://dl.acm.org/citation.cfm?id=2790409.2790417.  22   KANNAN VEMPALA  SDA(P, ¯γ) ≥ nδ(cid:96).  and for any δ > 0, with k = n0.5−δ, (cid:96) = 8δ/Cα, we have ¯γ = 2n−δ−1 and  Hence any statistical algorithm that solves P with probability at least 3/4 needs nω(1) calls to VSTAT(n1+δ).  Corollary 26 For σ1 = σ0,  k2 n2 exp √ and for any δ > 0, with k = n0.5−δ, µ2 = cσ2 ln(  ¯γ = 2  (cid:18) µ2(cid:96) σ2  (cid:19)  .  n/k), we have ¯γ = 2ncδ(cid:96)−2δ−1 and  SDA(P, ¯γ) = Ω(n2δ(cid:96)).  n/k)), any statistical algorithm that solves P with probability at least 3/4 needs  √  If µ2 = o(σ2 ln( nω(1) calls to VSTAT(n1+δ).  References  N. Alon, M. Krivelevich, and B. Sudakov. Finding a large hidden clique in a random graph. Random  Structures and Algorithms, 13:457-466, 1998.  Boaz Barak, Samuel B. Hopkins, Jonathan A. Kelner, Pravesh Kothari, Ankur Moitra, and Aaron Potechin. A nearly tight sum-of-squares lower bound for the planted clique problem. CoRR, abs/1604.03084, 2016. URL http://arxiv.org/abs/1604.03084.  Aditya Bhaskara, Moses Charikar, Eden Chlamtac, Uriel Feige, and Aravindan Vijayaraghavan. Detecting high log-densities: an O(n1/4) approximation for densest k-subgraph. In Proceedings of the 42nd ACM Symposium on Theory of Computing, STOC 2010, Cambridge, Massachusetts, USA, 5-8 June 2010, pages 201-210, 2010. doi: 10.1145/1806689.1806718. URL http:// doi.acm.org/10.1145/1806689.1806718.  Avrim Blum, Merrick Furst, Jeffrey Jackson, Michael Kearns, Yishay Mansour, and Steven Rudich. Weakly learning DNF and characterizing statistical query learning using Fourier analysis. In STOC, pages 253-262, 1994.  R. Boppana. Eigenvalues and graph bisection: An average-case analysis. Proceedings of the 28th  IEEE Symposium on Foundations of Computer Science, pages 280-285, 1987.  S. Charles Brubaker and Santosh Vempala. Random tensors and planted cliques. In Approximation, Randomization, and Combinatorial Optimization. Algorithms and Techniques, 12th International Workshop, APPROX 2009, and 13th International Workshop, RANDOM 2009, Berkeley, CA, USA, August 21-23, 2009. Proceedings, pages 406-419, 2009. doi: 10.1007/978-3-642-03685-9 31. URL http://dx.doi.org/10.1007/978-3-642-03685-9_31.  Yael Dekel, Ori Gurel-Gurevich, and Yuval Peres. Finding hidden cliques in linear time with high probability. In Proceedings of the Meeting on Analytic Algorithmics and Combinatorics, ANALCO ’11, pages 67-75, Philadelphia, PA, USA, 2011. Society for Industrial and Applied Mathematics. URL http://dl.acm.org/citation.cfm?id=2790409.2790417. HIDDEN HUBS  Yash Deshpande and Andrea Montanari. Improved sum-of-squares lower bounds for hidden clique and hidden submatrix problems. In Proceedings of The 28th Conference on Learning Theory, COLT 2015, Paris, France, July 3-6, 2015, pages 523-562, 2015a. URL http://jmlr.org/ proceedings/papers/v40/Deshpande15.html.  Yash Deshpande and Andrea Montanari. Finding hidden cliques of size (cid:112)N/e in nearly linear time. Found. Comput. Math., 15(4):1069-1128, August 2015b. ISSN 1615-3375. doi: 10.1007/ s10208-014-9215-y. URL http://dx.doi.org/10.1007/s10208-014-9215-y.  U. Feige and R. Krauthgamer. Finding and certifying a large hidden clique in a semirandom graph.  Random Structures and Algorithms, 16(2):195-208, 2000.  Uriel Feige and Dorit Ron. Finding hidden cliques in linear time. In 21st International Meeting on Probabilistic, Combinatorial, and Asymptotic Methods in the Analysis of Algorithms (AofA’10), pages 189-204. Discrete Mathematics and Theoretical Computer Science, 2010.  Vitaly Feldman, Elena Grigorescu, Lev Reyzin, Santosh Vempala, and Ying Xiao. Statistical algo- rithms and a lower bound for planted clique. In Proceedings of the 45th annual ACM symposium on Symposium on theory of computing, pages 655-664. ACM, 2013a.  Vitaly Feldman, Will Perkins, and Santosh Vempala. On the complexity of random satisfiability problems with planted solutions. CoRR, abs/1311.4821, 2013b. Extended abstract in STOC 2015.  Vitaly Feldman, Cristobal Guzman, and Santosh Vempala. Statistical query algorithms for mean In SIAM Symposium on Discrete Algorithms,  estimation and stochastic convex optimization. 2017. URL http://arxiv.org/abs/1512.09170.  Delphine F´eral and Sandrine P´ech´e. The largest eigenvalue of rank one deformation of large wigner matrices. Communications in Mathematical Physics, 272(1):185-228, 2007. ISSN 1432-0916. doi: 10.1007/s00220-007-0209-3. URL http://dx.doi.org/10.1007/ s00220-007-0209-3.  Alan M. Frieze and Ravi Kannan. A new approach to the planted clique problem. In IARCS Annual Conference on Foundations of Software Technology and Theoretical Computer Science, FSTTCS 2008, December 9-11, 2008, Bangalore, India, pages 187-198, 2008. doi: 10.4230/LIPIcs. FSTTCS.2008.1752. URL http://dx.doi.org/10.4230/LIPIcs.FSTTCS.2008. 1752.  Samuel B. Hopkins, Pravesh Kothari, Aaron Henry Potechin, Prasad Raghavendra, and Tselil Schramm. On the integrality gap of degree-4 sum of squares for planted clique. In Proceedings of the Twenty-Seventh Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2016, Arling- ton, VA, USA, January 10-12, 2016, pages 1079-1095, 2016. doi: 10.1137/1.9781611974331. ch76. URL http://dx.doi.org/10.1137/1.9781611974331.ch76.  M. Jerrum. Large cliques elude the metropolis process. Random Structures and Algorithms, 3(4):  347-360, 1992. KANNAN VEMPALA  Ravindran Kannan. A new probability inequality using typical moments and concentration results. In 50th Annual IEEE Symposium on Foundations of Computer Science, FOCS 2009, October 25-27, 2009, Atlanta, Georgia, USA, pages 211-220, 2009. doi: 10.1109/FOCS.2009.20. URL http://dx.doi.org/10.1109/FOCS.2009.20.  Michael Kearns. Efficient noise-tolerant learning from statistical queries. Journal of the ACM, 45  (6):983-1006, 1998.  Michael J. Kearns. Efficient noise-tolerant learning from statistical queries. In Proceedings of the Twenty-Fifth Annual ACM Symposium on Theory of Computing, May 16-18, 1993, San Diego, CA, USA, pages 392-401, 1993. doi: 10.1145/167088.167200. URL http://doi.acm. org/10.1145/167088.167200.  L. Kucera. Expected complexity of graph partitioning problems. Discrete Applied Mathematics,  57:193-212, 1995.  Zongming Ma and Yihong Wu. Computational barriers in minimax submatrix detection. Ann. Statist., 43(3):1089-1116, 06 2015. doi: 10.1214/14-AOS1300. URL http://dx.doi.org/ 10.1214/14-AOS1300.  Raghu Meka, Aaron Potechin, and Avi Wigderson. Sum-of-squares lower bounds for planted clique. In Proceedings of the Forty-Seventh Annual ACM on Symposium on Theory of Computing, STOC 2015, Portland, OR, USA, June 14-17, 2015, pages 87-96, 2015. doi: 10.1145/2746539.2746600. URL http://doi.acm.org/10.1145/2746539.2746600.  Andrea Montanari, Daniel Reichman, and Ofer Zeitouni. On the limitation of spectral methods: In From the gaussian hidden clique problem to rank-one perturbations of gaussian tensors. C. Cortes, N. D. Lawrence, D. D. Lee, M. Sugiyama, and R. Garnett, editors, Advances in Neural Information Processing Systems 28, pages 217-225. Curran Associates, Inc., 2015."}