{"1": "J. Abernethy and R. Frongillo. A characterization of scoring rules for linear properties. In Proceed-  ings of the 25th Conference on Learning Theory, pages 1-27, 2012.  Jacob Abernethy, Yiling Chen, and Jennifer Wortman Vaughan. Efficient market making via con- vex optimization, and a connection to online learning. ACM Transactions on Economics and Computation, 1(2):12, 2013.  Arpit Agarwal and Shivani Agarwal. On consistent surrogate risk minimization and property elici-  tation. In JMLR Workshop and Conference Proceedings, volume 40, pages 1-19, 2015.  G.W. Brier. Verification of forecasts expressed in terms of probability. Monthly weather review, 78  (1):1-3, 1950. ISSN 1520-0493.  Nicolo Cesa-Bianchi and Gábor Lugosi. Prediction, learning, and games. Cambridge university  press, 2006.  Nicolo Cesa-Bianchi, Gábor Lugosi, and others. On prediction of individual sequences. The Annals  of Statistics, 27(6):1865-1895, 1999.  Dean P Foster and Rakesh Vohra. Regret in the on-line decision problem. Games and Economic  Behavior, 29(1):7-35, 1999.  Rafael Frongillo and Ian Kash. Vector-Valued Property Elicitation.  In Proceedings of the 28th  Conference on Learning Theory, pages 1-18, 2015.  Rafael Frongillo and Bo Waggoner. An Axiomatic Study of Scoring Rule Markets. Preprint, 2017.  T. Gneiting. Making and Evaluating Point Forecasts. Journal of the American Statistical Associa-  tion, 106(494):746-762, 2011.  13   MEMORYLESS SEQUENCES FOR DIFFERENTIABLE LOSSES  such online settings, which could allow for a formal link to similar statements made in the literature on game-theoretic probability (Shafer and Vovk, 2005; Vovk, 2014).  6. Discussion and Future Work  We have generalized the notion of memoryless sequences of Nobel (2004) to higher dimensions and differentiable losses. We conclude that memoryless sequences are characterized by the stochas- tic behavior of their finite dimensional weak limits, and that the the distribution of these limits is governed by the property elicited by the loss function. In particular, the broad class of Bregman divergences share the same set of memoryless sequences with squared loss, and their weak limits form martingale difference sequences. Finally, we showed how these results can show that prices in prediction markets are calibrated (or traders can make infinite profits).  A promising future direction would be to extend these results to non-differentiable losses, if possible. This would allow for losses eliciting the median, as all losses eliciting the median, such as absolute loss (cid:96)(x, y) = |x−y|, are nondifferentiable (Gneiting, 2011). As mentioned in Section 5, it would also be interesting to extend our results to a more online setting, where the outcome sequence can adapt to the predictions adversarially, a setting closer to game-theoretic probability.  References  J. Abernethy and R. Frongillo. A characterization of scoring rules for linear properties. In Proceed-  ings of the 25th Conference on Learning Theory, pages 1-27, 2012.  Jacob Abernethy, Yiling Chen, and Jennifer Wortman Vaughan. Efficient market making via con- vex optimization, and a connection to online learning. ACM Transactions on Economics and Computation, 1(2):12, 2013.  Arpit Agarwal and Shivani Agarwal. On consistent surrogate risk minimization and property elici-  tation. In JMLR Workshop and Conference Proceedings, volume 40, pages 1-19, 2015.  G.W. Brier. Verification of forecasts expressed in terms of probability. Monthly weather review, 78  (1):1-3, 1950. ISSN 1520-0493.  Nicolo Cesa-Bianchi and Gábor Lugosi. Prediction, learning, and games. Cambridge university  press, 2006.  Nicolo Cesa-Bianchi, Gábor Lugosi, and others. On prediction of individual sequences. The Annals  of Statistics, 27(6):1865-1895, 1999.  Dean P Foster and Rakesh Vohra. Regret in the on-line decision problem. Games and Economic  Behavior, 29(1):7-35, 1999.  Rafael Frongillo and Ian Kash. Vector-Valued Property Elicitation.  In Proceedings of the 28th  Conference on Learning Theory, pages 1-18, 2015.  Rafael Frongillo and Bo Waggoner. An Axiomatic Study of Scoring Rule Markets. Preprint, 2017.  T. Gneiting. Making and Evaluating Point Forecasts. Journal of the American Statistical Associa-  tion, 106(494):746-762, 2011. FRONGILLO NOBEL  Tilmann Gneiting and Adrian E. Raftery. Strictly proper scoring rules, prediction, and estimation.  Journal of the American Statistical Association, 102(477):359-378, 2007.  Irving John Good. Rational decisions. Journal of the Royal Statistical Society. Series B (Method-  ological), pages 107-114, 1952.  R. Hanson. Combinatorial Information Market Design. Information Systems Frontiers, 5(1):107-  119, 2003.  David Haussler, Jyrki Kivinen, and Manfred K Warmuth. Sequential prediction of individual se- quences under general loss functions. IEEE Transactions on Information Theory, 44(5):1906- 1925, 1998.  Andrei N Kolmogorov. Three approaches to the quantitative definition ofinformation’. Problems of  information transmission, 1(1):1-7, 1965.  Nicolas S. Lambert and Yoav Shoham. Eliciting truthful answers to multiple-choice questions. In  Proceedings of the 10th ACM conference on Electronic commerce, pages 109-118, 2009.  Nicolas S. Lambert, David M. Pennock, and Yoav Shoham. Eliciting properties of probability distributions. In Proceedings of the 9th ACM Conference on Electronic Commerce, pages 129- 138, 2008.  N.S. Lambert. Elicitation and Evaluation of Statistical Forecasts. Preprint, 2011.  Per Martin-Löf. The definition of random sequences.  Information and Control, 9(6):602-619,  December 1966. ISSN 0019-9958.  J. McCarthy. Measures of the value of information. Proceedings of the National Academy of  Sciences of the United States of America, 42(9):654, 1956.  R v Mises. Grundlagen der wahrscheinlichkeitsrechnung. Mathematische Zeitschrift, 5(1-2):52-99,  1919.  Berkeley, 1985.  Andrew B. Nobel. Some stochastic properties of memoryless individual sequences. IEEE Transac-  tions on Information Theory, 50(7):1497-1505, 2004.  Kent Harold Osband. Providing Incentives for Better Cost Forecasting. University of California,  M.D. Reid and R.C. Williamson. Composite binary losses. The Journal of Machine Learning  Research, 9999:2387-2422, 2010.  L.J. Savage. Elicitation of personal probabilities and expectations. Journal of the American Statis-  tical Association, pages 783-801, 1971.  Glenn Shafer and Vladimir Vovk. Probability and finance: it’s only a game!, volume 491. John  Wiley & Sons, 2005.  Shai Shalev-Shwartz. Online learning and online convex optimization. Foundations and Trends R(cid:13)  in Machine Learning, 4(2):107-194, 2012. MEMORYLESS SEQUENCES FOR DIFFERENTIABLE LOSSES  Ingo Steinwart, Chloé Pasin, Robert Williamson, and Siyu Zhang. Elicitation and Identification of Properties. In Proceedings of The 27th Conference on Learning Theory, pages 482-526, 2014.  Vladimir Andreevich Uspenskii, Alexei L Semenov, and A Kh Shen. Can an individual sequence  of zeros and ones be random? Russian Mathematical Surveys, 45(1):121, 1990.  A. W. van der Vaart. Asymptotic Statistics. Cambridge University Press, June 2000. ISBN 978-0-  521-78450-4. Google-Books-ID: UEuQEM5RjWgC.  E. Vernet, R.C. Williamson, and M.D. Reid. Composite Multiclass Losses. NIPS, 2011.  V. Vovk. Probability theory for the Brier game. Theoretical Computer Science, 261(1):57-79, June  2001. ISSN 0304-3975.  Vladimir Vovk. Laws of probabilities in efficient markets, November 2014.  Vladimir V V’yugin. Effective convergence in probability and an ergodic theorem forindividual  random sequences. Theory of Probability & Its Applications, 42(1):39-50, 1998.  J. Wolfers and E. Zitzewitz. Prediction Markets. Journal of Economic Perspective, 18(2):107-126,  2004."}