{"1": "Jayadev Acharya, Ashkan Jafarpour, Alon Orlitsky, and Ananda Theertha Suresh. A com- petitive test for uniformity of monotone distributions. In Proceedings of the Sixteenth International Conference on Arti(cid:12)cial Intelligence and Statistics, AISTATS 2013, Scotts- dale, AZ, USA, April 29 - May 1, 2013, pages 57{65, 2013.  Jayadev Acharya, Constantinos Daskalakis, and Gautam Kamath. Optimal testing for prop- erties of distributions. In Advances in Neural Information Processing Systems 28: Annual  12   Testing Monotonicity of Distributions  dition is suﬃcient for the distribution to be monotone in the induced subgraph G[B [ T ]. The tester accepts when it cannot rule out the possibility that T has the maximum possible probability mass. Recall that if the distribution is ϵ-far from monotone, there must exist a large matching of \\violated\" edges. To this end, we show that the induced subgraph G[B [ T ] contains many disjoint violated edges, implying that there are many vertices in T outside of the support: the probability mass on T will be noticeably small and the tester will reject.  Upper bound via trying all matchings. In Section E.5 we give another upper bound for testing monotonicity of a distribution with respect to a bipartite graph which, in this case, has a small number of induced subgraphs that contains a perfect matching of their vertices. In particular, we show that O( log M ) samples are suﬃcient for this task, where M ϵ2 is the number of such induced subgraphs. We note that this bound matches the general learning upper bound of O(n=ϵ2) when M attains its maximum value of 2(cid:2)(n), but can potentially be better when M is asymptotically smaller. The main idea of our tester is as follows: if the distribution is ϵ-far from monotone, there exists a matching of violated edges that is (cid:2)(ϵ)-far from monotone. Hence, for each subgraph of G that admits a perfect matching, we may approximate the weight (violation amount) of this matching by simply comparing the total probability masses between the top part and the bottom part of the subgraph. We approximate these masses with error probability O(1=M ) for each subgraph, which allows us to apply a union bound over all subgraphs at the end. Our tester rejects if the weight of one such subgraph exceeds ϵ, or accepts otherwise.  Acknowledgments  MA is supported by funds from the MIT-IBM Watson AI Lab (Agreement No. W1771646), the NSF grants IIS-1741137, and CCF-1733808. TG is supported by the NSF grants CCF- 1740751, CCF-1650733, CCF-1733808, and IIS-1741137. Part of this work was done while TG was a postdoctoral researcher at USC supported by Ilias Diakonikolas’ USC startup grant. JP is supported by the NSF grants CCF-1565235, CCF-1650733, CCF-1733808, and IIS-1741137. RR is supported by by funds from the MIT-IBM Watson AI Lab (Agree- ment No. W1771646), the NSF grants CCF-1650733, CCF-1733808, IIS-1741137 and CCF- 1740751. AY is supported by the NSF grants CCF-1650733, CCF-1733808, IIS-1741137 and the DPST scholarship, Royal Thai Government. This work was completed while AY was at CSAIL, MIT.  References  Jayadev Acharya, Ashkan Jafarpour, Alon Orlitsky, and Ananda Theertha Suresh. A com- petitive test for uniformity of monotone distributions. In Proceedings of the Sixteenth International Conference on Arti(cid:12)cial Intelligence and Statistics, AISTATS 2013, Scotts- dale, AZ, USA, April 29 - May 1, 2013, pages 57{65, 2013.  Jayadev Acharya, Constantinos Daskalakis, and Gautam Kamath. Optimal testing for prop- erties of distributions. In Advances in Neural Information Processing Systems 28: Annual Testing Monotonicity of Distributions  Conference on Neural Information Processing Systems 2015, December 7-12, 2015, Mon- treal, Quebec, Canada, pages 3591{3599, 2015.  Michal Adamaszek, Artur Czumaj, and Christian Sohler. Testing monotone continuous distributions on high-dimensional real cubes. In Proceedings of the Twenty-First An- nual ACM-SIAM Symposium on Discrete Algorithms, SODA 2010, Austin, Texas, USA, January 17-19, 2010, pages 56{65, 2010.  Tugkan Batu, Ravi Kumar, and Ronitt Rubinfeld. Sublinear algorithms for testing mono- tone and unimodal distributions. In Proceedings of the Thirty-sixth Annual ACM Sym- posium on Theory of Computing, STOC ’04, pages 381{390, New York, NY, USA, 2004. ACM. ISBN 1-58113-852-0.  Tugkan Batu, Sanjoy Dasgupta, Ravi Kumar, and Ronitt Rubinfeld. The complex- doi:  ity of approximating the entropy. 10.1137/S0097539702403645. URL https://doi.org/10.1137/S0097539702403645.  SIAM J. Comput., 35(1):132{150, 2005.  Aleksandrs Belovs and Eric Blais. A polynomial lower bound for testing monotonicity. In Proceedings of the 48th Annual ACM SIGACT Symposium on Theory of Computing (STOC), pages 1021{1032, 2016.  Arnab Bhattacharyya, Eldar Fischer, Ronitt Rubinfeld, and Paul Valiant. Testing mono- tonicity of distributions over general partial orders. Electronic Colloquium on Computa- tional Complexity (ECCC), 17:27, 2010.  Hadley Black, Deeparnab Chakrabarty, and C. Seshadhri. A o(d ) (cid:1) polylog n monotonicity tester for boolean functions over the hypergrid [n]d . In Proceedings of the Twenty-Ninth Annual ACM-SIAM Symposium on Discrete Algorithms (SODA), pages 2133{2151, 2018.  Cl(cid:19)ement L. Canonne. Big data on the rise: Testing monotonicity of distributions. In ICALP,  2015.  Cl(cid:19)ement L. Canonne. A short note on Poisson tail bounds.  2017. URL http: //www.cs.columbia.edu/~ccanonne/files/misc/2017-poissonconcentration.pdf. ccanonne/(cid:12)les/misc/2017- http://www.cs.columbia.edu/ at Available poissonconcentration.pdf.  online  Cl(cid:19)ement L. Canonne, Ilias Diakonikolas, Themis Gouleakis, and Ronitt Rubinfeld. Testing shape restrictions of discrete distributions. Theory Comput. Syst., 62(1):4{62, 2018. doi: 10.1007/s00224-017-9785-6. URL https://doi.org/10.1007/s00224-017-9785-6.  Deeparnab Chakrabarty and C. Seshadhri. Optimal bounds for monotonicity and lips- chitz testing over hypercubes and hypergrids. In Symposium on Theory of Computing Conference (STOC), pages 419{428, 2013.  Deeparnab Chakrabarty and C. Seshadhri. An optimal lower bound for monotonicity testing  over hypergrids. Theory of Computing, 10:453{464, 2014. Testing Monotonicity of Distributions  Constantinos Daskalakis, Ilias Diakonikolas, and Rocco A. Servedio. Learning k-modal dis- tributions via testing. In Proceedings of the Twenty-third Annual ACM-SIAM Symposium on Discrete Algorithms, SODA ’12, pages 1371{1385, Philadelphia, PA, USA, 2012. Soci- ety for Industrial and Applied Mathematics. URL http://dl.acm.org/citation.cfm? id=2095116.2095224.  Constantinos Daskalakis, Ilias Diakonikolas, Rocco A. Servedio, Gregory Valiant, and Paul Valiant. Testing k-modal distributions: Optimal algorithms via reductions. In Proceedings of the Twenty-fourth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA ’13, pages 1833{1852, Philadelphia, PA, USA, 2013. Society for Industrial and Applied Mathematics. ISBN 978-1-611972-51-1. URL http://dl.acm.org/citation.cfm?id= 2627817.2627948.  Yevgeniy Dodis, Oded Goldreich, Eric Lehman, Sofya Raskhodnikova, Dana Ron, and Alex Samorodnitsky. Improved testing algorithms for monotonicity. In Randomization, Ap- proximation, and Combinatorial Algorithms and Techniques, Third International Work- shop on Randomization and Approximation Techniques in Computer Science, and Second International Workshop on Approximation (RANDOM-APPROX), pages 97{108, 1999.  Eldar Fischer, Eric Lehman, Ilan Newman, Sofya Raskhodnikova, Ronitt Rubinfeld, and Alex Samorodnitsky. Monotonicity testing over general poset domains. In Proceedings on 34th Annual ACM Symposium on Theory of Computing (STOC), pages 474{483, 2002.  Alain Ghouila-Houri. Caract(cid:19)erisation des matrices totalement unimodulaires. C. R. Acad.  Sci. Paris, 254:1192{1194, 1962.  Oded Goldreich, Sha(cid:12) Goldwasser, Eric Lehman, and Dana Ron. Testing monotonicity. In 39th Annual Symposium on Foundations of Computer Science (FOCS), pages 426{435, 1998.  Johannes Kraus, Panayot S. Vassilevski, and Ludmil Zikatanov. Polynomial of best uniform approximation to 1/x and smoothing in two-level methods. Comput. Meth. in Appl. Math., 12(4):448{468, 2012. URL http://www.degruyter.com/view/j/cmam.2012.12. issue-4/cmam-2012-0026/cmam-2012-0026.xml.  Eric Lehman and Dana Ron. On disjoint chains of subsets. J. Comb. Theory, Ser. A, 94  (2):399{404, 2001.  Sofya Raskhodnikova, Dana Ron, Amir Shpilka, and Adam D. Smith. Strong lower bounds for approximating distribution support size and the distinct elements problem. SIAM J. Comput., 39(3):813{842, 2009.  Ronitt Rubinfeld and Rocco A. Servedio. Testing monotone high-dimensional distributions. In Proceedings of the 37th Annual ACM Symposium on Theory of Computing, Baltimore, MD, USA, May 22-24, 2005, pages 147{156, 2005. doi: 10.1145/1060590.1060613. URL http://doi.acm.org/10.1145/1060590.1060613.  A.F. Timan. International Series of Monographs in Pure and Applied Mathematics. Number v. 34 in International Series of Monographs in Pure and Applied Mathematics. Pergamon Testing Monotonicity of Distributions  Press; [distributed in the Western Hemisphere by Macmillan, New York], 1963. URL https://books.google.com/books?id=2R-4AAAAIAAJ.  Gregory Valiant and Paul Valiant. Instance optimal learning of discrete distributions. In Proceedings of the 48th Annual ACM SIGACT Symposium on Theory of Computing, (STOC), pages 142{155, 2016.  Gregory Valiant and Paul Valiant. Estimating the unseen: Improved estimators for entropy and other properties. J. ACM, 64(6):37:1{37:41, 2017. doi: 10.1145/3125643. URL http://doi.acm.org/10.1145/3125643.  Paul Valiant. Testing symmetric properties of distributions.  In Proceedings of the 40th  Annual ACM Symposium on Theory of Computing (STOC), pages 383{392, 2008.  Yihong Wu and Pengkun Yang. Minimax rates of entropy estimation on large alphabets via best polynomial approximation. IEEE Transactions on Information Theory, 62(6): 3702{3720, 2016a.  Yihong Wu and Pengkun Yang. Chebyshev polynomials, moment matching, and optimal  estimation of the unseen. arXiv preprint arXiv:1504.01227v2, 2016b."}