{"1": "J. Abernethy and M.K. Warmuth. Repeated games against budgeted adversaries. Advances in Neural Infor-  mation Processing Systems, 22, 2010.  J. Abernethy, J. Langford, and M. K. Warmuth. Continuous experts and the Binning algorithm.  In Pro- ceedings of the 19th Annual Conference on Learning Theory (COLT06), pages 544-558. Springer, June 2007.  J. Abernethy, P. L. Bartlett, A. Rakhlin, and A. Tewari. Optimal strategies and minimax lower bounds for  online convex games. In COLT, 2008a.  J. Abernethy, M. K. Warmuth, and J. Yellin. Optimal strategies from random walks. In Proceedings of the  21st Annual Conference on Learning Theory (COLT 08), pages 437-445, July 2008b.  J. V. Baxley. Euler’s constant, Taylor’s formula, and slowly converging series. Mathematics Magazine, 65  (5):302-313, 1992.  N. Cesa-Bianchi and G. Lugosi. Prediction, learning, and games. Cambridge University Press, 2006.  K. Chaudhuri, Y. Freund, and D. Hsu. A parameter-free hedging algorithm. In Y. Bengio, D. Schuurmans, J. Lafferty, C. K. I. Williams, and A. Culotta, editors, Advances in Neural Information Processing Systems 22, pages 297-305. 2009.  C. Gentile. The robustness of the p-norm algorithms. Machine Learning, 53(3):265-299, 2003.  A. J. Grove, N. Littlestone, and D. Schuurmans. General convergence results for linear discriminant updates.  Machine Learning, 43(3):173-210, 2001.  J. Kivinen and M. K. Warmuth. Relative loss bounds for multidimensional regression problems. Machine  Learning, 45(3):301-329, 2001.  NIPS, 2013.  H. B. McMahan and J. Abernethy. Minimax optimal algorithms for unconstrained linear optimization. In  F. Orabona. Dimension-free exponentiated gradient. In NIPS, 2013.  F. Orabona, K. Crammer, and N. Cesa-Bianchi. A generalized online mirror descent with applications to  classification and regression, 2013. arXiv:1304.2994.  A. Rakhlin. Lecture notes on online learning. Technical report, 2009.  A. Rakhlin, O. Shamir, and K. Sridharan. Localization and adaptation in online learning. In AISTATS, 2013.  S. Rakhlin, O. Shamir, and K. Sridharan. Relax and randomize: From value to algorithms. In NIPS, 2012.  S. Shalev-Shwartz. Online learning: Theory, algorithms, and applications. Technical report, The Hebrew  University, 2007. PhD thesis.  S. Shalev-Shwartz. Online learning and online convex optimization. Foundations and Trends in Machine  Learning, 2012.  NIPS, 2012.  M. Streeter and H. B. McMahan. No-regret algorithms for unconstrained online convex optimization. In  L. Xiao. Dual averaging method for regularized stochastic learning and online optimization. In NIPS, 2009.  14   MCMAHAN ORABONA  We thank Jacob Abernethy for many useful conversations about this work.  Acknowledgments  References  J. Abernethy and M.K. Warmuth. Repeated games against budgeted adversaries. Advances in Neural Infor-  mation Processing Systems, 22, 2010.  J. Abernethy, J. Langford, and M. K. Warmuth. Continuous experts and the Binning algorithm.  In Pro- ceedings of the 19th Annual Conference on Learning Theory (COLT06), pages 544-558. Springer, June 2007.  J. Abernethy, P. L. Bartlett, A. Rakhlin, and A. Tewari. Optimal strategies and minimax lower bounds for  online convex games. In COLT, 2008a.  J. Abernethy, M. K. Warmuth, and J. Yellin. Optimal strategies from random walks. In Proceedings of the  21st Annual Conference on Learning Theory (COLT 08), pages 437-445, July 2008b.  J. V. Baxley. Euler’s constant, Taylor’s formula, and slowly converging series. Mathematics Magazine, 65  (5):302-313, 1992.  N. Cesa-Bianchi and G. Lugosi. Prediction, learning, and games. Cambridge University Press, 2006.  K. Chaudhuri, Y. Freund, and D. Hsu. A parameter-free hedging algorithm. In Y. Bengio, D. Schuurmans, J. Lafferty, C. K. I. Williams, and A. Culotta, editors, Advances in Neural Information Processing Systems 22, pages 297-305. 2009.  C. Gentile. The robustness of the p-norm algorithms. Machine Learning, 53(3):265-299, 2003.  A. J. Grove, N. Littlestone, and D. Schuurmans. General convergence results for linear discriminant updates.  Machine Learning, 43(3):173-210, 2001.  J. Kivinen and M. K. Warmuth. Relative loss bounds for multidimensional regression problems. Machine  Learning, 45(3):301-329, 2001.  NIPS, 2013.  H. B. McMahan and J. Abernethy. Minimax optimal algorithms for unconstrained linear optimization. In  F. Orabona. Dimension-free exponentiated gradient. In NIPS, 2013.  F. Orabona, K. Crammer, and N. Cesa-Bianchi. A generalized online mirror descent with applications to  classification and regression, 2013. arXiv:1304.2994.  A. Rakhlin. Lecture notes on online learning. Technical report, 2009.  A. Rakhlin, O. Shamir, and K. Sridharan. Localization and adaptation in online learning. In AISTATS, 2013.  S. Rakhlin, O. Shamir, and K. Sridharan. Relax and randomize: From value to algorithms. In NIPS, 2012.  S. Shalev-Shwartz. Online learning: Theory, algorithms, and applications. Technical report, The Hebrew  University, 2007. PhD thesis.  S. Shalev-Shwartz. Online learning and online convex optimization. Foundations and Trends in Machine  Learning, 2012.  NIPS, 2012.  M. Streeter and H. B. McMahan. No-regret algorithms for unconstrained online convex optimization. In  L. Xiao. Dual averaging method for regularized stochastic learning and online optimization. In NIPS, 2009. UNCONSTRAINED ONLINE LINEAR LEARNING IN HILBERT SPACES"}