{"1": "Jayadev Acharya, Alon Orlitsky, and Shengjun Pan. Recent results on pattern maximum likelihood. In Networking and Information Theory, 2009. ITW 2009. IEEE Information Theory Workshop on, pages 251-255. IEEE, 2009.  Jayadev Acharya, Alon Orlitsky, Ananda Theertha Suresh, and Himanshu Tyagi. The complexity  of estimating R´enyi entropy. SODA, 2015.  Jayadev Acharya, Hirakendu Das, Alon Orlitsky, and Ananda Theertha Suresh. A unified arXiv preprint  maximum likelihood approach for optimal distribution property estimation. arXiv:1611.02960, 2016.  Chris Anderson. The long tail. Wired magazine, 12(10):170-177, 2004.  Daniel Berend and Aryeh Kontorovich. A sharp estimate of the binomial mean absolute deviation  with applications. Statistics & Probability Letters, 83(4):1254-1259, 2013.  Yuheng Bu, Shaofeng Zou, Yingbin Liang, and Venugopal V Veeravalli. Estimation of KL diver- gence between large-alphabet distributions. In 2016 IEEE International Symposium on Informa- tion Theory (ISIT), pages 1118-1122. IEEE, 2016.  T Tony Cai and Mark G Low. Testing composite hypotheses, Hermite polynomials and optimal  estimation of a nonsmooth functional. The Annals of Statistics, 39(2):1012-1041, 2011.  Constantinos Daskalakis, Ilias Diakonikolas, and Rocco A Servedio. Learning k-modal distribu- tions via testing. In Proceedings of the Twenty-Third Annual ACM-SIAM Symposium on Discrete Algorithms, pages 1371-1385, 2012.  Ronald A DeVore. Degree of approximation. Approximation theory II, 241(242):117-161, 1976.  Ilias Diakonikolas. Beyond histograms: Structure and distribution estimation. In Workshop of the  46th ACM Symposium on Theory of Computing, 2014.  Zeev Ditzian and Vilmos Totik. Moduli of smoothness. Springer, 1987.  John C Duchi and Martin J Wainwright. Distance-based and continuum fano inequalities with  applications to statistical estimation. arXiv preprint arXiv:1311.2669, 2013.  Bradley Efron and Ronald Thisted. Estimating the number of unsen species: How many words did shakespeare know? Biometrika, 63(3):pp. 435-447, 1976. ISSN 00063444. URL http: //www.jstor.org/stable/2335721.  Yanjun Han, Jiantao Jiao, and Tsachy Weissman. Minimax estimation of discrete distributions under  (cid:96)1 loss. IEEE Transactions on Information Theory, 61(11):6343-6354, 2015.  Yanjun Han, Jiantao Jiao, and Tsachy Weissman. Minimax rate-optimal estimation of divergences  between discrete distributions. arXiv preprint arXiv:1605.09124, 2016.  Yanjun Han, Jiantao Jiao, Rajarshi Mukherjee, and Tsachy Weissman. On estimation of Lr-norms  in Gaussian white noise models. arXiv preprint arXiv:1710.03863, 2017a.  13   LOCAL MOMENT MATCHING  References  Jayadev Acharya, Alon Orlitsky, and Shengjun Pan. Recent results on pattern maximum likelihood. In Networking and Information Theory, 2009. ITW 2009. IEEE Information Theory Workshop on, pages 251-255. IEEE, 2009.  Jayadev Acharya, Alon Orlitsky, Ananda Theertha Suresh, and Himanshu Tyagi. The complexity  of estimating R´enyi entropy. SODA, 2015.  Jayadev Acharya, Hirakendu Das, Alon Orlitsky, and Ananda Theertha Suresh. A unified arXiv preprint  maximum likelihood approach for optimal distribution property estimation. arXiv:1611.02960, 2016.  Chris Anderson. The long tail. Wired magazine, 12(10):170-177, 2004.  Daniel Berend and Aryeh Kontorovich. A sharp estimate of the binomial mean absolute deviation  with applications. Statistics & Probability Letters, 83(4):1254-1259, 2013.  Yuheng Bu, Shaofeng Zou, Yingbin Liang, and Venugopal V Veeravalli. Estimation of KL diver- gence between large-alphabet distributions. In 2016 IEEE International Symposium on Informa- tion Theory (ISIT), pages 1118-1122. IEEE, 2016.  T Tony Cai and Mark G Low. Testing composite hypotheses, Hermite polynomials and optimal  estimation of a nonsmooth functional. The Annals of Statistics, 39(2):1012-1041, 2011.  Constantinos Daskalakis, Ilias Diakonikolas, and Rocco A Servedio. Learning k-modal distribu- tions via testing. In Proceedings of the Twenty-Third Annual ACM-SIAM Symposium on Discrete Algorithms, pages 1371-1385, 2012.  Ronald A DeVore. Degree of approximation. Approximation theory II, 241(242):117-161, 1976.  Ilias Diakonikolas. Beyond histograms: Structure and distribution estimation. In Workshop of the  46th ACM Symposium on Theory of Computing, 2014.  Zeev Ditzian and Vilmos Totik. Moduli of smoothness. Springer, 1987.  John C Duchi and Martin J Wainwright. Distance-based and continuum fano inequalities with  applications to statistical estimation. arXiv preprint arXiv:1311.2669, 2013.  Bradley Efron and Ronald Thisted. Estimating the number of unsen species: How many words did shakespeare know? Biometrika, 63(3):pp. 435-447, 1976. ISSN 00063444. URL http: //www.jstor.org/stable/2335721.  Yanjun Han, Jiantao Jiao, and Tsachy Weissman. Minimax estimation of discrete distributions under  (cid:96)1 loss. IEEE Transactions on Information Theory, 61(11):6343-6354, 2015.  Yanjun Han, Jiantao Jiao, and Tsachy Weissman. Minimax rate-optimal estimation of divergences  between discrete distributions. arXiv preprint arXiv:1605.09124, 2016.  Yanjun Han, Jiantao Jiao, Rajarshi Mukherjee, and Tsachy Weissman. On estimation of Lr-norms  in Gaussian white noise models. arXiv preprint arXiv:1710.03863, 2017a. HAN JIAO WEISSMAN  Yanjun Han, Jiantao Jiao, Tsachy Weissman, and Yihong Wu. Optimal rates of entropy estimation  over Lipschitz balls. arXiv preprint arXiv:1711.02141, 2017b.  Wassily Hoeffding. Probability inequalities for sums of bounded random variables. Journal of the  American statistical association, 58(301):13-30, 1963.  Jiantao Jiao, Kartik Venkat, Yanjun Han, and Tsachy Weissman. Minimax estimation of functionals of discrete distributions. Information Theory, IEEE Transactions on, 61(5):2835-2885, 2015.  Jiantao Jiao, Yanjun Han, and Tsachy Weissman. Minimax estimation of the L1 distance. In 2016  IEEE International Symposium on Information Theory (ISIT), pages 750-754. IEEE, 2016.  Jiantao Jiao, Yanjun Han, and Tsachy Weissman. Minimax estimation of the L1 distance. arXiv  preprint arXiv:1705.00807, 2017.  Sudeep Kamath, Alon Orlitsky, Venkatadheeraj Pichapati, and Ananda Theertha Suresh. On learn- ing distributions from their samples. In Proceedings of The 28th Conference on Learning Theory, pages 1066-1100, 2015.  Leonid Vasilevich Kantorovich and G Sh Rubinstein. On a space of completely additive functions.  Vestnik Leningrad. Univ, 13(7):52-59, 1958.  Weihao Kong and Gregory Valiant. Spectrum estimation from samples. The Annals of Statistics, 45  (5):2218-2247, 2017.  Oleg Lepski, Arkady Nemirovski, and Vladimir Spokoiny. On estimation of the Lr norm of a  regression function. Probability theory and related fields, 113(2):221-253, 1999.  George G Lorentz, Manfred von Golitschek, and Yuly Makovoz. Constructive approximation:  advanced problems, volume 304. Springer Berlin, 1996.  Michael Mitzenmacher and Eli Upfal. Probability and computing: Randomized algorithms and  probabilistic analysis. Cambridge University Press, 2005.  I. Olkin and M. Sobel. Admissible and minimax estimation for the multinomial distribution and for  independent binomial distributions. The Annals of Statistics, 7:284-290, 1979.  Alon Orlitsky and Ananda Theertha Suresh. Competitive distribution estimation: Why is good- turing good. In Advances in Neural Information Processing Systems, pages 2143-2151, 2015.  Alon Orlitsky, Narayana P Santhanam, Krishnamurthy Viswanathan, and Junan Zhang. On model- ing profiles instead of values. In Proceedings of the 20th conference on Uncertainty in artificial intelligence, pages 426-435. AUAI Press, 2004.  Alon Orlitsky, Ananda Theertha Suresh, and Yihong Wu. Optimal prediction of the number of unseen species. Proceedings of the National Academy of Sciences, 113(47):13283-13288, 2016.  Dmitri S Pavlichin, Jiantao Jiao, and Tsachy Weissman. Approximate profile maximum likelihood.  arXiv preprint arXiv:1712.07177, 2017. LOCAL MOMENT MATCHING  Giovanni Peccati and Murad S Taqqu. Some facts about charlier polynomials. In Wiener Chaos:  Moments, Cumulants and Diagrams, pages 171-175. Springer, 2011.  Aditi Raghunathan, Greg Valiant, and James Zou. Estimating the unseen from multiple populations.  arXiv preprint arXiv:1707.03854, 2017.  M. Rutkowska. Minimax estimation of the parameters of the multivariate hypergeometric and multi-  nomial distributions. Zastos. Mat., 16:9-21, 1977.  H. Steinhaus. The problem of estimation. The Annals of Mathematical Statistics, 28:633-648, 1957.  Kevin Tian, Weihao Kong, and Gregory Valiant. Learning populations of parameters. In Advances  in Neural Information Processing Systems, pages 5780-5789, 2017.  S. Trybula. Some problems of simultaneous minimax estimation. The Annals of Mathematical  Statistics, 29:245-253, 1958.  A. Tsybakov. Introduction to Nonparametric Estimation. Springer-Verlag, 2008.  Gregory Valiant and Paul Valiant. Estimating the unseen: an n/ log n-sample estimator for en- tropy and support size, shown optimal via new CLTs. In Proceedings of the 43rd annual ACM symposium on Theory of computing, pages 685-694. ACM, 2011a.  Gregory Valiant and Paul Valiant. The power of linear estimators. In Foundations of Computer  Science (FOCS), 2011 IEEE 52nd Annual Symposium on, pages 403-412. IEEE, 2011b.  Gregory Valiant and Paul Valiant.  Instance optimal learning. arXiv preprint arXiv:1504.05321,  2015.  Gregory Valiant and Paul Valiant. Estimating the unseen: Improved estimators for entropy and other  properties. Journal of the ACM (JACM), 64(6):37, 2017.  Paul Valiant and Gregory Valiant. Estimating the unseen: improved estimators for entropy and other properties. In Advances in Neural Information Processing Systems, pages 2157-2165, 2013.  Pascal O Vontobel. The bethe approximation of the pattern maximum likelihood distribution. In Information Theory Proceedings (ISIT), 2012 IEEE International Symposium on. IEEE, 2012.  Abraham Wald. Statistical decision functions. Wiley, 1950.  Christopher Stroude Withers. Bias reduction by Taylor series. Communications in Statistics-Theory  and Methods, 16(8):2369-2383, 1987.  Yihong Wu and Pengkun Yang. Chebyshev polynomials, moment matching, and optimal estimation  of the unseen. arXiv preprint arXiv:1504.01227, 2015.  Yihong Wu and Pengkun Yang. Minimax rates of entropy estimation on large alphabets via best polynomial approximation. IEEE Transactions on Information Theory, 62(6):3702-3720, 2016a.  Yihong Wu and Pengkun Yang. Sample complexity of the distinct elements problem. arXiv preprint  arXiv:1612.03375, 2016b. HAN JIAO WEISSMAN"}