{"1": "Jayadev Acharya, Ashkan Jafarpour, Alon Orlitsky, and Ananda Theerta Suresh. Near-optimal-  sample estimators for spherical Gaussian mixtures. Online manuscript, 2014a.  Jayadev Acharya, Ashkan Jafarpour, Alon Orlitsky, and Ananda Theertha Suresh. Sorting with adversarial comparators and application to density estimation. In Proceedings of the 2014 IEEE International Symposium on Information Theory, ISIT ’14, Washington, DC, USA, 2014b. IEEE Computer Society.  Dimitris Achlioptas and Frank McSherry. On spectral learning of mixtures of distributions.  In Proceedings of the 18th Annual Conference on Learning Theory, COLT ’05, pages 458-469. Springer, 2005.  Sanjeev Arora and Ravi Kannan. Learning mixtures of arbitrary Gaussians. In Proceedings of the 33rd Annual ACM Symposium on the Theory of Computing, STOC ’01, pages 247-257, New York, NY, USA, 2001. ACM.  Mikhail Belkin and Kaushik Sinha. Polynomial learning of distribution families. In Proceedings of the 51st Annual IEEE Symposium on Foundations of Computer Science, FOCS ’10, pages 103-112, Washington, DC, USA, 2010. IEEE Computer Society.  G. E. P. Box and Mervin E. Muller. A note on the generation of random normal deviates. The  Annals of Mathematical Statistics, 29(2):610-611, June 1958.  Spencer Charles Brubaker and Santosh Vempala. Isotropic PCA and affine-invariant clustering. In Proceedings of the 49th Annual IEEE Symposium on Foundations of Computer Science, FOCS ’08, pages 551-560, Washington, DC, USA, 2008. IEEE Computer Society.  Siu On Chan, Ilias Diakonikolas, Rocco A. Servedio, and Xiaorui Sun. Learning mixtures of struc- tured distributions over discrete domains. In Proceedings of the 24th Annual ACM-SIAM Sym- posium on Discrete Algorithms, SODA ’13, pages 1380-1394, Philadelphia, PA, USA, 2013. SIAM.  Siu On Chan, Ilias Diakonikolas, Rocco A. Servedio, and Xiaorui Sun. Efficient density estimation via piecewise polynomial approximation. In Proceedings of the 46th Annual ACM Symposium on the Theory of Computing, STOC ’14, New York, NY, USA, 2014. ACM.  Sanjoy Dasgupta. Learning mixtures of Gaussians. In Proceedings of the 40th Annual IEEE Sym- posium on Foundations of Computer Science, FOCS ’99, pages 634-644, Washington, DC, USA, 1999. IEEE Computer Society.  Constantinos Daskalakis, Ilias Diakonikolas, and Rocco A. Servedio. Learning Poisson binomial distributions. In Proceedings of the 44th Annual ACM Symposium on the Theory of Computing, STOC ’12, pages 709-728, New York, NY, USA, 2012. ACM.  Constantinos Daskalakis, Ilias Diakonikolas, Ryan O’Donnell, Rocco A. Servedio, and Li Yang Tan. Learning sums of independent integer random variables. In Proceedings of the 54th Annual IEEE Symposium on Foundations of Computer Science, FOCS ’13, pages 217-226, Washington, DC, USA, 2013. IEEE Computer Society.  14   DASKALAKIS KAMATH  References  Jayadev Acharya, Ashkan Jafarpour, Alon Orlitsky, and Ananda Theerta Suresh. Near-optimal-  sample estimators for spherical Gaussian mixtures. Online manuscript, 2014a.  Jayadev Acharya, Ashkan Jafarpour, Alon Orlitsky, and Ananda Theertha Suresh. Sorting with adversarial comparators and application to density estimation. In Proceedings of the 2014 IEEE International Symposium on Information Theory, ISIT ’14, Washington, DC, USA, 2014b. IEEE Computer Society.  Dimitris Achlioptas and Frank McSherry. On spectral learning of mixtures of distributions.  In Proceedings of the 18th Annual Conference on Learning Theory, COLT ’05, pages 458-469. Springer, 2005.  Sanjeev Arora and Ravi Kannan. Learning mixtures of arbitrary Gaussians. In Proceedings of the 33rd Annual ACM Symposium on the Theory of Computing, STOC ’01, pages 247-257, New York, NY, USA, 2001. ACM.  Mikhail Belkin and Kaushik Sinha. Polynomial learning of distribution families. In Proceedings of the 51st Annual IEEE Symposium on Foundations of Computer Science, FOCS ’10, pages 103-112, Washington, DC, USA, 2010. IEEE Computer Society.  G. E. P. Box and Mervin E. Muller. A note on the generation of random normal deviates. The  Annals of Mathematical Statistics, 29(2):610-611, June 1958.  Spencer Charles Brubaker and Santosh Vempala. Isotropic PCA and affine-invariant clustering. In Proceedings of the 49th Annual IEEE Symposium on Foundations of Computer Science, FOCS ’08, pages 551-560, Washington, DC, USA, 2008. IEEE Computer Society.  Siu On Chan, Ilias Diakonikolas, Rocco A. Servedio, and Xiaorui Sun. Learning mixtures of struc- tured distributions over discrete domains. In Proceedings of the 24th Annual ACM-SIAM Sym- posium on Discrete Algorithms, SODA ’13, pages 1380-1394, Philadelphia, PA, USA, 2013. SIAM.  Siu On Chan, Ilias Diakonikolas, Rocco A. Servedio, and Xiaorui Sun. Efficient density estimation via piecewise polynomial approximation. In Proceedings of the 46th Annual ACM Symposium on the Theory of Computing, STOC ’14, New York, NY, USA, 2014. ACM.  Sanjoy Dasgupta. Learning mixtures of Gaussians. In Proceedings of the 40th Annual IEEE Sym- posium on Foundations of Computer Science, FOCS ’99, pages 634-644, Washington, DC, USA, 1999. IEEE Computer Society.  Constantinos Daskalakis, Ilias Diakonikolas, and Rocco A. Servedio. Learning Poisson binomial distributions. In Proceedings of the 44th Annual ACM Symposium on the Theory of Computing, STOC ’12, pages 709-728, New York, NY, USA, 2012. ACM.  Constantinos Daskalakis, Ilias Diakonikolas, Ryan O’Donnell, Rocco A. Servedio, and Li Yang Tan. Learning sums of independent integer random variables. In Proceedings of the 54th Annual IEEE Symposium on Foundations of Computer Science, FOCS ’13, pages 217-226, Washington, DC, USA, 2013. IEEE Computer Society. FASTER AND SAMPLE NEAR-OPTIMAL ALGORITHMS FOR PROPER LEARNING MIXTURES OF GAUSSIANS  A. P. Dempster, N. M. Laird, and D. B. Rubin. Maximum Likelihood from Incomplete Data via the EM Algorithm. Journal of the Royal Statistical Society. Series B (Methodological), 39(1):1-38, 1977.  Luc Devroye and G´abor Lugosi. A universally acceptable smoothing factor for kernel density  estimation. The Annals of Statistics, 24:2499-2512, 1996.  Luc Devroye and G´abor Lugosi. Nonasymptotic universal smoothing factors, kernel complexity  and yatracos classes. The Annals of Statistics, 25:2626-2637, 1997.  Luc Devroye and G´abor Lugosi. Combinatorial methods in density estimation. Springer, 2001.  A. Dvoretzky, J. Kiefer, and J. Wolfowitz. Asymptotic minimax character of the sample distribution function and of the classical multinomial estimator. The Annals of Mathematical Statistics, 27 (3):642-669, 09 1956.  Jon Feldman, Ryan O’Donnell, and Rocco A. Servedio. PAC learning axis-aligned mixtures of In Proceedings of the 19th Annual Conference on  Gaussians with no separation assumption. Learning Theory, COLT ’06, pages 20-34, Berlin, Heidelberg, 2006. Springer-Verlag.  Alison L. Gibbs and Francis E. Su. On choosing and bounding probability metrics. International  Statistical Review, 70(3):419-435, December 2002.  Daniel Hsu and Sham M. Kakade. Learning mixtures of spherical Gaussians: Moment methods and spectral decompositions. In Proceedings of the 4th Conference on Innovations in Theoretical Computer Science, ITCS ’13, pages 11-20, New York, NY, USA, 2013. ACM.  Adam Tauman Kalai, Ankur Moitra, and Gregory Valiant. Efficiently learning mixtures of two Gaussians. In Proceedings of the 42nd Annual ACM Symposium on the Theory of Computing, STOC ’10, pages 553-562, New York, NY, USA, 2010. ACM.  Michael Kearns, Yishay Mansour, Dana Ron, Ronitt Rubinfeld, Robert E. Schapire, and Linda In Proceedings of the 26th Annual ACM Sellie. On the learnability of discrete distributions. Symposium on the Theory of Computing, STOC ’94, pages 273-282, New York, NY, USA, 1994. ACM.  P. Massart. The tight constant in the Dvoretzky-Kiefer-Wolfowitz inequality. The Annals of Proba-  bility, 18(3):1269-1283, 07 1990.  Ankur Moitra and Gregory Valiant. Settling the polynomial learnability of mixtures of Gaussians. In Proceedings of the 51st Annual IEEE Symposium on Foundations of Computer Science, FOCS ’10, pages 93-102, Washington, DC, USA, 2010. IEEE Computer Society.  Santosh Vempala and Grant Wang. A spectral algorithm for learning mixtures of distributions. In Proceedings of the 43rd Annual IEEE Symposium on Foundations of Computer Science, FOCS ’02, pages 113-123, Washington, DC, USA, 2002. IEEE Computer Society.  Yannis G. Yatracos. Rates of convergence of minimum distance estimators and Kolmogorov’s  entropy. The Annals of Statistics, 13(2):768-774, 1985. DASKALAKIS KAMATH"}