{"1": "E. Allender, M. Bauland, N. Immerman, H. Schnoor, and H. Vollmer. The Complexity of Satisfia- bility Problems: Refining Schaefer’s Theorem. Journal of Computer and System Sciences, 75(4): 245-254, 2009.  Dana Angluin. Queries and concept learning. Machine Learning, 2(4):319-342, 1987.  Dana Angluin and Michael Kharitonov. When won’t membership queries help? J. Comput. Syst.  Sci., 50(2):336-355, 1995.  Learning, 9:147-164, 1992.  Dana Angluin, Michael Frazier, and Leonard Pitt. Learning conjunctions of horn clauses. Machine  L. Barto. A proof of the Valeriote conjecture. 2014. Submitted.  Libor Barto and Marcin Kozik. Constraint satisfaction problems solvable by local consistency  methods. J. ACM, 61(1):3, 2014.  Arnab Bhattacharyya and Yuichi Yoshida. An algebraic characterization of testable boolean csps. In Automata, Languages, and Programming - 40th International Colloquium, ICALP 2013, Riga, Latvia, July 8-12, 2013, Proceedings, Part I, pages 123-134, 2013.  Simone Bova, Hubie Chen, and Matthew Valeriote. Generic expression hardness results for primi-  tive positive formula comparison. Inf. Comput., 222:108-120, 2013.  Nader H. Bshouty. Exact learning from membership queries: Some techniques, results and new di- rections. In Algorithmic Learning Theory - 24th International Conference, ALT 2013, Singapore, October 6-9, 2013. Proceedings, pages 33-52, 2013.  Nader H. Bshouty, Jeffrey C. Jackson, and Christino Tamon. Exploring learnability between exact  and PAC. J. Comput. Syst. Sci., 70(4):471-484, 2005.  A. Bulatov, P. Jeavons, and A. Krokhin. Classifying the Complexity of Constraints using Finite  Algebras. SIAM Journal on Computing, 34(3):720-742, 2005.  Andrei Bulatov, Hubie Chen, and Victor Dalmau. Learning intersection-closed classes with signa-  tures. Theoretical Computer Science, 382(3):209-220, 2007.  11   LEARNABILITY OF SOLUTIONS TO CONJUNCTIVE QUERIES  Essentially, Theorem 13 is proved in the following way. In order to translate a 2-sorted con- junctive query φ over pentagons to a conjunctive query φ(cid:48) over A, the relations β and γ are used to simulate the two sorts, and the relation α is used to simulate the behavior of the relation R. Also, in the resulting conjunctive query φ(cid:48), all of the variables are related by the relation DU (where U is the total number of variables), effectively localizing φ(cid:48) to the pentagons found in the set P.  The first author was supported by the Spanish project TIN2013-46181-C2-2-R, by the Basque project GIU12/26, and by the Basque grant UFI11/45. The second author was supported by the Natural Sciences and Engineering Research Council of Canada.  Acknowledgments  References  E. Allender, M. Bauland, N. Immerman, H. Schnoor, and H. Vollmer. The Complexity of Satisfia- bility Problems: Refining Schaefer’s Theorem. Journal of Computer and System Sciences, 75(4): 245-254, 2009.  Dana Angluin. Queries and concept learning. Machine Learning, 2(4):319-342, 1987.  Dana Angluin and Michael Kharitonov. When won’t membership queries help? J. Comput. Syst.  Sci., 50(2):336-355, 1995.  Learning, 9:147-164, 1992.  Dana Angluin, Michael Frazier, and Leonard Pitt. Learning conjunctions of horn clauses. Machine  L. Barto. A proof of the Valeriote conjecture. 2014. Submitted.  Libor Barto and Marcin Kozik. Constraint satisfaction problems solvable by local consistency  methods. J. ACM, 61(1):3, 2014.  Arnab Bhattacharyya and Yuichi Yoshida. An algebraic characterization of testable boolean csps. In Automata, Languages, and Programming - 40th International Colloquium, ICALP 2013, Riga, Latvia, July 8-12, 2013, Proceedings, Part I, pages 123-134, 2013.  Simone Bova, Hubie Chen, and Matthew Valeriote. Generic expression hardness results for primi-  tive positive formula comparison. Inf. Comput., 222:108-120, 2013.  Nader H. Bshouty. Exact learning from membership queries: Some techniques, results and new di- rections. In Algorithmic Learning Theory - 24th International Conference, ALT 2013, Singapore, October 6-9, 2013. Proceedings, pages 33-52, 2013.  Nader H. Bshouty, Jeffrey C. Jackson, and Christino Tamon. Exploring learnability between exact  and PAC. J. Comput. Syst. Sci., 70(4):471-484, 2005.  A. Bulatov, P. Jeavons, and A. Krokhin. Classifying the Complexity of Constraints using Finite  Algebras. SIAM Journal on Computing, 34(3):720-742, 2005.  Andrei Bulatov, Hubie Chen, and Victor Dalmau. Learning intersection-closed classes with signa-  tures. Theoretical Computer Science, 382(3):209-220, 2007. CHEN VALERIOTE  Andrei A. Bulatov. The complexity of the counting constraint satisfaction problem. J. ACM, 60(5):  34, 2013.  Stanley Burris and H. P. Sankappanavar. A Course in Universal Algebra. Springer, 1981.  Hubie Chen. Meditations on quantified constraint satisfaction. In Robert Constable and Alexandra Silva, editors, Logic and Program Semantics, volume 7230 of Lecture Notes in Computer Science, pages 35-49. Springer Berlin / Heidelberg, 2012. ISBN 978-3-642-29484-6.  N. Creignou, S. Khanna, and M. Sudan. Complexity Classification of Boolean Constraint Satis- faction Problems. SIAM Monographs on Discrete Mathematics and Applications. Society for Industrial and Applied Mathematics, 2001.  Victor Dalmau. A dichotomy theorem for learning quantified boolean formulas. Machine Learning,  35(3):207-224, 1999.  (1-3):485-511, 2003.  Victor Dalmau and Peter Jeavons. Learnability of quantified formulas. Theor. Comput. Sci., 306  Ralph Freese and Matthew A. Valeriote. On the complexity of some Maltsev conditions. Internat.  J. Algebra Comput., 19(1):41-77, 2009. ISSN 0218-1967.  P. Idziak, P. Markovic, R. McKenzie, M. Valeriote, and R. Willard. Tractability and learnability  arising from algebras with few subpowers. SIAM J. Comput., 39(7):3023-3037, 2010.  Jeffrey C. Jackson and Rocco A. Servedio. On learning random DNF formulas under the uniform  distribution. Theory of Computing, 2(1):147-172, 2006.  A. Kazda. Personal communication, 2014.  Michael J. Kearns and Leslie G. Valiant. Cryptographic limitations on learning boolean formulae  and finite automata. J. ACM, 41(1):67-95, 1994.  R. McKenzie, G. McNulty, and W. Taylor. Algebras, Lattices, Varieties, vol. 1. Wadsworth &  Brooks/Cole, 1987.  (3):430-467, 1990.  Leonard Pitt and Manfred K. Warmuth. Prediction-preserving reducibility. J. Comput. Syst. Sci., 41  Prasad Raghavendra. Optimal algorithms and inapproximability results for every csp? In Proceed- ings of the 40th Annual ACM Symposium on Theory of Computing, Victoria, British Columbia, Canada, May 17-20, 2008, pages 245-254, 2008.  T. J. Schaefer. The complexity of satisfiability problems. In Proceedings of STOC’78, pages 216-  226, 1978."}