{"1": "Emmanuel Abbe. Community detection and stochastic block models: Recent developments. Jour-  nal of Machine Learning Research, 18(177):1-86, 2018.  Emmanuel Abbe and Colin Sandon. Community detection in general stochastic block models: Fundamental limits and efficient algorithms for recovery. In IEEE 56th Annual Symposium on Foundations of Computer Science (FOCS), pages 670-688. IEEE, 2015a.  Emmanuel Abbe and Colin Sandon. Detection in the stochastic block model with multiple clusters: proof of the achievability conjectures, acyclic BP, and the information-computation gap. arXiv preprint arXiv:1512.09080, 2015b.  Emmanuel Abbe and Colin Sandon. Recovering communities in the general stochastic block model without knowing the parameters. In Advances in Neural Information Processing Systems, pages 676-684, 2015c.  Emmanuel Abbe, Afonso S. Bandeira, Annina Bracher, and Amit Singer. Decoding binary node labels from censored edge measurements: Phase transition and efficient recovery. IEEE Transac- tions on Network Science and Engineering, 1(1):10-22, 2014.  Emmanuel Abbe, Afonso S. Bandeira, and Georgina Hall. Exact recovery in the stochastic block  model. IEEE Transactions on Information Theory, 62(1):471-487, 2016.  Emmanuel Abbe, Jianqing Fan, Kaizheng Wang, and Yiqiao Zhong. Entrywise eigenvector analysis  of random matrices with low expected rank. arXiv preprint arXiv:1709.09565, 2017.  Emmanuel Abbe, Enric Boix, Peter Ralli, and Colin Sandon. Graph powering and spectral robust-  ness. arXiv preprint arXiv:1809.04818, 2018.  Naman Agarwal, Afonso S. Bandeira, Konstantinos Koiliaris, and Alexandra Kolla. Multisection in the stochastic block model using semidefinite programming. In Compressed Sensing and its Applications, pages 125-162. Springer, 2017.  Afonso S. Bandeira. Random laplacian matrices and convex relaxations. Foundations of Computa-  tional Mathematics, 18(2):345-379, 2018.  Debapratim Banerjee. Contiguity and non-reconstruction results for planted partition models: the  dense case. Electronic Journal of Probability, 23, 2018.  Avrim Blum and Joel Spencer. Coloring random and semi-random k-colorable graphs. Journal of  Algorithms, 19(2):204-234, 1995.  Charles Bordenave, Marc Lelarge, and Laurent Massouli´e. Nonbacktracking spectrum of random graphs: Community detection and nonregular ramanujan graphs. Annals of Probability, 46(1): 1-71, 2018.  T. Tony Cai and Xiaodong Li. Robust and computationally feasible community detection in the presence of arbitrary outlier nodes. Annals of Statistics, 43(3):1027-1059, 2015. URL http: //arxiv.org/abs/1404.6000.  13   ACHIEVING THE BAYES ERROR RATE IN STOCHASTIC BLOCK MODEL BY SDP, ROBUSTLY  References  Emmanuel Abbe. Community detection and stochastic block models: Recent developments. Jour-  nal of Machine Learning Research, 18(177):1-86, 2018.  Emmanuel Abbe and Colin Sandon. Community detection in general stochastic block models: Fundamental limits and efficient algorithms for recovery. In IEEE 56th Annual Symposium on Foundations of Computer Science (FOCS), pages 670-688. IEEE, 2015a.  Emmanuel Abbe and Colin Sandon. Detection in the stochastic block model with multiple clusters: proof of the achievability conjectures, acyclic BP, and the information-computation gap. arXiv preprint arXiv:1512.09080, 2015b.  Emmanuel Abbe and Colin Sandon. Recovering communities in the general stochastic block model without knowing the parameters. In Advances in Neural Information Processing Systems, pages 676-684, 2015c.  Emmanuel Abbe, Afonso S. Bandeira, Annina Bracher, and Amit Singer. Decoding binary node labels from censored edge measurements: Phase transition and efficient recovery. IEEE Transac- tions on Network Science and Engineering, 1(1):10-22, 2014.  Emmanuel Abbe, Afonso S. Bandeira, and Georgina Hall. Exact recovery in the stochastic block  model. IEEE Transactions on Information Theory, 62(1):471-487, 2016.  Emmanuel Abbe, Jianqing Fan, Kaizheng Wang, and Yiqiao Zhong. Entrywise eigenvector analysis  of random matrices with low expected rank. arXiv preprint arXiv:1709.09565, 2017.  Emmanuel Abbe, Enric Boix, Peter Ralli, and Colin Sandon. Graph powering and spectral robust-  ness. arXiv preprint arXiv:1809.04818, 2018.  Naman Agarwal, Afonso S. Bandeira, Konstantinos Koiliaris, and Alexandra Kolla. Multisection in the stochastic block model using semidefinite programming. In Compressed Sensing and its Applications, pages 125-162. Springer, 2017.  Afonso S. Bandeira. Random laplacian matrices and convex relaxations. Foundations of Computa-  tional Mathematics, 18(2):345-379, 2018.  Debapratim Banerjee. Contiguity and non-reconstruction results for planted partition models: the  dense case. Electronic Journal of Probability, 23, 2018.  Avrim Blum and Joel Spencer. Coloring random and semi-random k-colorable graphs. Journal of  Algorithms, 19(2):204-234, 1995.  Charles Bordenave, Marc Lelarge, and Laurent Massouli´e. Nonbacktracking spectrum of random graphs: Community detection and nonregular ramanujan graphs. Annals of Probability, 46(1): 1-71, 2018.  T. Tony Cai and Xiaodong Li. Robust and computationally feasible community detection in the presence of arbitrary outlier nodes. Annals of Statistics, 43(3):1027-1059, 2015. URL http: //arxiv.org/abs/1404.6000. ACHIEVING THE BAYES ERROR RATE IN STOCHASTIC BLOCK MODEL BY SDP, ROBUSTLY  Francesco Caltagirone, Marc Lelarge, and L´eo Miolane. Recovering asymmetric communities in the stochastic block model. IEEE Transactions on Network Science and Engineering, 5(3):237-246, 2018.  Yudong Chen, Sujay Sanghavi, and Huan Xu. Improved graph clustering. IEEE Transactions on  Information Theory, 60(10):6440-6455, 2014.  Amin Coja-Oghlan, Florent Krzakala, Will Perkins, and Lenka Zdeborova. Information-theoretic  thresholds from the cavity method. Advances in Mathematics, 333:694-795, 2018.  Yingjie Fei and Yudong Chen. Hidden integrality of SDP relaxation for sub-gaussian mixture mod-  els. arXiv preprint arXiv:1803.06510, 2018.  Yingjie Fei and Yudong Chen. Achieving the bayes error rate in synchronization and block models  by SDP, robustly. arXiv preprint arXiv:1904.09635, 2019a.  Yingjie Fei and Yudong Chen. Exponential error rates of SDP for block models: Beyond Grothendieck’s inequality. IEEE Transactions on Information Theory, 65(1):551-571, 2019b.  Uriel Feige and Joe Kilian. Heuristics for semirandom graph problems. Journal of Computer and  System Sciences, 63(4):639-671, 2001.  Chao Gao and Zongming Ma. Minimax rates in network analysis: Graphon estimation, community  detection and hypothesis testing. arXiv preprint arXiv:1811.06055, 2018.  Chao Gao, Zongming Ma, Anderson Y. Zhang, and Harrison H. Zhou. Achieving optimal misclas- sification proportion in stochastic block models. The Journal of Machine Learning Research, 18 (1):1980-2024, 2017.  Chao Gao, Zongming Ma, Anderson Y. Zhang, and Harrison H. Zhou. Community detection in  degree-corrected block models. The Annals of Statistics, 46(5):2153-2185, 2018.  Christophe Giraud and Nicolas Verzelen. Partial recovery bounds for clustering with the relaxed k  means. arXiv preprint arXiv:1807.07547, 2018.  Alexander Grothendieck. R´esum´e de la th´eorie m´etrique des produits tensoriels topologiques. Re- senhas do Instituto de Matem´atica e Estatistica da Universidade de S˜ao Paulo, 2(4):401-481, 1953.  Olivier Gu´edon and Roman Vershynin. Community detection in sparse networks via Grothendieck’s  inequality. Probability Theory and Related Fields, 165(3-4):1025-1049, 2016.  Bruce Hajek, Yihong Wu, and Jiaming Xu. Exact recovery threshold in the binary censored block  model. In IEEE Information Theory Workshop (ITW), pages 99-103, 2015.  Bruce Hajek, Yihong Wu, and Jiaming Xu. Achieving exact cluster recovery threshold via semidef-  inite programming. IEEE Transactions on Information Theory, 62(5):2788-2797, 2016a.  Bruce Hajek, Yihong Wu, and Jiaming Xu. Achieving exact cluster recovery threshold via semidef- inite programming: Extensions. IEEE Transactions on Information Theory, 62(10):5918-5937, 2016b. ACHIEVING THE BAYES ERROR RATE IN STOCHASTIC BLOCK MODEL BY SDP, ROBUSTLY  Varun Jog and Po-Ling Loh. Information-theoretic bounds for exact recovery in weighted stochastic  block models using the renyi divergence. arXiv preprint arXiv:1509.06418, 2015.  Marc Lelarge, Laurent Massouli´e, and Jiaming Xu. Reconstruction in the labelled stochastic block  model. IEEE Transactions on Network Science and Engineering, 2(4):152-163, 2015.  Xiaodong Li, Yudong Chen, and Jiaming Xu. Convex relaxation methods for community detection.  arXiv preprint arXiv:1810.00315, 2018.  Joram Lindenstrauss and Aleksander Pełczy´nski. Absolutely summing operators in Lp-spaces and  their applications. Studia Mathematica, 3(29):275-326, 1968.  Konstantin Makarychev, Yury Makarychev, and Aravindan Vijayaraghavan. Learning communities In 29th Annual Conference on Learning Theory, pages 1258-1291,  in the presence of errors. 2016.  Laurent Massouli´e. Community detection thresholds and the weak Ramanujan property. In Pro- ceedings of the 46th Annual ACM Symposium on Theory of Computing, pages 694-703. ACM, 2014.  Ankur Moitra, William Perry, and Alexander S. Wein. How robust are reconstruction thresholds for community detection? In Proceedings of the 48th Annual ACM SIGACT Symposium on Theory of Computing, pages 828-841. ACM, 2016.  Andrea Montanari and Subhabrata Sen. Semidefinite programs on sparse random graphs and their application to community detection. In Proceedings of the 48th Annual ACM SIGACT Symposium on Theory of Computing (STOC), pages 814-827, 2016.  Cristopher Moore. The computer science and physics of community detection: Landscapes, phase transitions, and hardness. Bulletin of European Association for Theoretical Computer Science (EATCS), 1(121), Februrary 2017.  Elchanan Mossel, Joe Neeman, and Allan Sly. A proof of the block model threshold conjecture.  arXiv preprint arXiv:1311.4115, 2013.  Elchanan Mossel, Joe Neeman, and Allan Sly. Reconstruction and estimation in the planted partition  model. Probability Theory and Related Fields, 162(3-4):431-461, 2015.  Elchanan Mossel, Joe Neeman, and Allan Sly. Consistency thresholds for the planted bisection model. Electronic Journal of Probability, 21(21):1-24, 2016. doi: 10.1214/16-EJP4185. URL http://dx.doi.org/10.1214/16-EJP4185.  Elchanan Mossel, Joe Neeman, and Allan Sly. A proof of the block model threshold conjecture.  Combinatorica, 38(3):665-708, 2018.  William Perry and Alexander S. Wein. A semidefinite program for unbalanced multisection in the  stochastic block model. arXiv preprint arXiv:1507.05605, 2015.  Elizaveta Rebrova and Roman Vershynin. Norms of random matrices: local and global problems.  arXiv preprint arXiv:1608.06953, 2016. ACHIEVING THE BAYES ERROR RATE IN STOCHASTIC BLOCK MODEL BY SDP, ROBUSTLY  Ludovic Stephan and Laurent Massouli´e. Robustness of spectral methods for community detection.  arXiv preprint arXiv:1811.05808, 2018.  Van Vu. Singular vectors under random perturbation. Random Structures & Algorithms, 39(4):  526-538, 2011.  Min Xu, Varun Jog, and Po-Ling Loh. Optimal rates for community estimation in the weighted  stochastic block model. arXiv preprint arXiv:1706.01175, 2017.  Se-Young Yun and Alexandre Proutiere. Accurate community detection in the stochastic block  model via spectral algorithms. arXiv preprint arXiv:1412.7335, 2014.  Se-Young Yun and Alexandre Proutiere. Optimal cluster recovery in the labeled stochastic block  model. In Advances in Neural Information Processing Systems, pages 965-973, 2016.  Anderson Y. Zhang and Harrison H. Zhou. Minimax rates of community detection in stochastic  block models. The Annals of Statistics, 44(5):2252-2280, 2016.  Anderson Y. Zhang and Harrison H. Zhou. Theoretical and computational guarantees of mean field  variational inference for community detection. arXiv preprint arXiv:1710.11268, 2017.  Zhixin Zhou and Ping Li. Non-asymptotic chernoff lower bound and its application to community  detection in stochastic block model. arXiv preprint arXiv:1812.11269, 2018."}