{"1": "Mathematical Logic, 2008.  The authors would like to thank Amir Globerson for some helpful comments and discussions, and to the first anonymous reviewer for some suggestions and simplifications in the proofs.  H. Adler. An introduction to theories without the independence property. Archive for  N. Alon and D.J. Kleitman. Piercing convex sets and the hadwiger-debrunner (p, q)-  problem. Advances in Mathematics, 96(1):103-112, 1992.  13   Honest Compressions  the trace of the concept class, then one can eﬃciently reconstruct. It would be surpris- ing if such a simple compression scheme would work for every concept class. Indeed, the compactness theorem of first order logic would imply the existence of a uniform formula defining a reconstruction function for all concept classes of given VC-dimension. One could however imagine such a uniform formula with, for example, quantifiers over the domain X. The computation would then involve queries on the whole underlying concept class (X, C). Its computational complexity would then depend on the concept class.  Our results apply to a wide family of concept classes, most notably, geometric concept classes and concept classes definable in the structure (cid:104)R; +, ·, ≤, exp, 0, 1(cid:105). One important family of concept classes for which we do not know if our theorem applies is the family of maximum concept classes, first studied by Floyd and Warmuth (1995). A concept class (X, C) is called maximum if for every finite set A, the number of concepts on A equals the upper bound attained by Sauer’s lemma. As discussed earlier, such concept classes always have a VC-dim compression scheme (in fact an unlabeled compression scheme).  Rubinstein and Rubinstein (2012) suggest studying compression schemes via operating on geometric representations. They study classes that correspond to Hyperbolic arrange- ments and PL hyperplanes. It is natural to ask what kind of compression schemes arise from general representations in NIP structures. If any maximal concept class can be represented in an NIP structure, this would give a positive solution to the problem of sample compres- sion (without O(d) bound however). On the other hand, a maximal concept class with VC-dim(ALT (X; C)) = ∞ cannot be embedded in an NIP structure without an increase in the VC-dimension.  Finally we wish to discuss further directions toward a complete solution to the problem. Due to our extensive use of Ramsey’s theorem, it would be challenging to use our methods to obtain VC-dim bounds on compression schemes. However the methods presented in this paper might be used for the construction of compression schemes in general, in particular definable compression schemes. Theorem 20 due to Matouˇsek is part of a family of Helly type theorems. An analogue theorem exists, for example, for convex sets whose VC-dimension is unbounded (see, Alon and Kleitman (1992)). Thus, our requirements from ALT (X; C) may be relaxed or altered. Other concept classes derived from the original concept class might also be exploited. Finally, it would be interesting to know if there are necessary conditions to the existence of compression schemes that relate to NIP structures. This might enable the construction of a counter example to the compression conjecture.  Acknowledgments  References  Mathematical Logic, 2008.  The authors would like to thank Amir Globerson for some helpful comments and discussions, and to the first anonymous reviewer for some suggestions and simplifications in the proofs.  H. Adler. An introduction to theories without the independence property. Archive for  N. Alon and D.J. Kleitman. Piercing convex sets and the hadwiger-debrunner (p, q)-  problem. Advances in Mathematics, 96(1):103-112, 1992. Livni Simon  S. Ben-David and A. Litman. Combinatorial variability of vapnik-chervonenkis classes with applications to sample compression schemes. Discrete Applied Mathematics, 86(1):3-25, 1998.  A. Chernikov and P. Simon. Externally definable sets and dependent pairs. Israel Journal  of Mathematics, pages 1-17, 2010.  A. Chernikov and P. Simon. Externally definable sets and dependent pairs ii. arXiv preprint  arXiv:1202.2650, 2012.  S. Floyd. Space-bounded learning and the vapnik-chervonenkis dimension. In Proceedings of the second annual workshop on Computational learning theory, pages 349-364. Morgan Kaufmann Publishers Inc., 1989.  S. Floyd and M. Warmuth. Sample compression, learnability, and the vapnik-chervonenkis  dimension. Machine Learning, 21(3):269-304, 1995.  Y. Freund. Boosting a weak learning algorithm by majority. Information and computation,  121(2):256-285, 1995.  R.L. Graham, B.L. Rothschild, and J.H. Spencer. Ramsey theory, volume 2. Wiley, 1990.  Vincent Guingona. On uniform definability of types over finite sets. Journal of Symbolic  Logic, 77(2):499-514, 2012.  H. R. Johnson and M. C. Laskowski. Compression schemes, stable definable families, and o- minimal structures. Discrete Comput. Geom., 43(4):914-926, 2010. ISSN 0179-5376. doi: 10.1007/s00454-009-9201-3. URL http://dx.doi.org/10.1007/s00454-009-9201-3.  M. Karpinski and A. Macintyre. Polynomial bounds for vc dimension of sigmoidal neural networks. In Proceedings of the twenty-seventh annual ACM symposium on Theory of computing, pages 200-208. ACM, 1995.  D. Kuzmin and M. Warmuth. Unlabeled compression schemes for maximum classes. Learn-  ing Theory, pages 801-814, 2005.  M.C Laskowski. Vapnik-chervonenkis classes of definable sets. J. London Math. Soc, 45:  377-384, 1992.  N. Littlestone and M. Warmuth. Relating data compression and learnability. Technical  report, Technical report, University of California, Santa Cruz, 1986.  A. Macintyre and E.D. Sontag. Finiteness results for sigmoidal “neural” networks.  In Proceedings of the twenty-fifth annual ACM symposium on Theory of computing, pages 325-334. ACM, 1993.  J. Matouˇsek. Bounded vc-dimension implies a fractional helly theorem. Discrete & Com-  putational Geometry, 31(2):251-255, 2004.  B.I.P. Rubinstein and J.H. Rubinstein. A geometric approach to sample compression. The  Journal of Machine Learning Research, 98888:1221-1261, 2012. Honest Compressions  B.I.P. Rubinstein, P.L. Bartlett, and J.H. Rubinstein. Shifting: One-inclusion mistake bounds and sample compression. Journal of Computer and System Sciences, 75(1):37- 59, 2009.  S. Shelah. Stability, the f.c.p., and superstability; model theoretic properties of formulas in  first order theory. Ann. Math. Logic, 3(3):271-362, 1971. ISSN 0168-0072.  P Simon. Lecture notes on nip theories. ArXiv: 1208.3944, 2012.  P. Speissegger. Pfaﬃan sets and o-minimality. In Chris Miller, Jean-Philippe Rolin, and Patrick Speissegger, editors, Lecture Notes on O-Minimal Structures and Real Analytic Geometry, volume 62 of Fields Institute Communications, pages 179-218. Springer New York, 2012. ISBN 978-1-4614-4041-3. doi: 10.1007/978-1-4614-4042-0 5. URL http: //dx.doi.org/10.1007/978-1-4614-4042-0_5.  V.N. Vapnik and A.Y. Chervonenkis. On the uniform convergence of relative frequencies of events to their probabilities. Theory of Probability & Its Applications, 16(2):264-280, 1971."}