{"1": "The authors would like to thank Philippe Rigollet for helpful discussions during the preparation of this paper.  D. Achlioptas, A. Coja-Oghlan, and F. Ricci-Tersenghi. On the solution space geometry of random  formulas. Random Structures and Algorithms, 38:251-268, 2011.  Dimitris Achlioptas and Amin Coja-Oghlan. Algorithmic barriers from phase transitions. In Foun- dations of Computer Science, 2008. FOCS’08. IEEE 49th Annual IEEE Symposium on, pages 793-802. IEEE, 2008.  Emmanuel J Candes and Terence Tao. Decoding by linear programming. IEEE transactions on  information theory, 51(12):4203-4215, 2005.  Scott Shaobing Chen, David L. Donoho, and Michael A. Saunders. Atomic decomposition by ISSN 0036-1445. doi: 10.1137/  basis pursuit. SIAM Rev., 43(1):129-159, January 2001. S003614450037906X. URL http://dx.doi.org/10.1137/S003614450037906X.  5   HIGH-DIMENSIONAL REGRESSION WITH BINARY COEFFICIENTS  Theorem 4 (The Overlap Gap Property) Suppose the assumptions of Theorem 1 hold. Suppose in addition σ2 → +∞. For every sufficiently large constant D0 there exist sequences 0 < ζ1,k,n < ζ2,k,n < 1 satisfying  lim k→∞  k (ζ2,k,n − ζ1,k,n) = +∞,  as k → ∞, and such that if rk = D0 max (Γ(0), Γ(1)) and max{ 1 n ≤ k log p/(3 log D0) then w.h.p. as k increases the following holds  C k log k, (cid:0)e7D2  0 + 1(cid:1) σ2 log p} ≤  (a) For every β ∈ Srk  (b) β∗ ∈ Srk . In particular the set  is non-empty.  (c) The cardinality of the set  (2k)−1 (cid:107)β − β∗(cid:107)0 < ζ1,k,n or (2k)−1 (cid:107)β − β∗(cid:107)0 > ζ2,k,n.  Srk ∩ {β : (2k)−1 (cid:107)β − β∗(cid:107)0 < ζ1,k,n}  |Srk ∩ {β : (cid:107)β − β∗(cid:107)0} = 2k}|,  0 . In particular the set Srk ∩ {β : (cid:107)β − β∗(cid:107)0} = 2k} has exponentially many in  n 3  is at least D n elements.  Acknowledgments  References  The authors would like to thank Philippe Rigollet for helpful discussions during the preparation of this paper.  D. Achlioptas, A. Coja-Oghlan, and F. Ricci-Tersenghi. On the solution space geometry of random  formulas. Random Structures and Algorithms, 38:251-268, 2011.  Dimitris Achlioptas and Amin Coja-Oghlan. Algorithmic barriers from phase transitions. In Foun- dations of Computer Science, 2008. FOCS’08. IEEE 49th Annual IEEE Symposium on, pages 793-802. IEEE, 2008.  Emmanuel J Candes and Terence Tao. Decoding by linear programming. IEEE transactions on  information theory, 51(12):4203-4215, 2005.  Scott Shaobing Chen, David L. Donoho, and Michael A. Saunders. Atomic decomposition by ISSN 0036-1445. doi: 10.1137/  basis pursuit. SIAM Rev., 43(1):129-159, January 2001. S003614450037906X. URL http://dx.doi.org/10.1137/S003614450037906X. GAMARNIK ZADIK  A. Coja-Oghlan and C. Efthymiou. On independent sets in random graphs. In Proceedings of the Twenty-Second Annual ACM-SIAM Symposium on Discrete Algorithms, pages 136-144. SIAM, 2011.  Amin Coja-Oghlan, Amir Haqshenas, and Samuel Hetterich. Walksat stalls well below the satisfia-  bility threshold. arXiv preprint arXiv:1608.00346, 2016.  David L Donoho. Compressed sensing. IEEE Transactions on information theory, 52(4):1289-  1306, 2006.  2013.  Alyson K. Fletcher and Sundeep Rangan. Orthogonal matching pursuit from noisy measurements: A new analysis. In Proceedings of the 22Nd International Conference on Neural Information Processing Systems, NIPS’09, pages 540-548, USA, 2009. Curran Associates Inc. ISBN 978-1- 61567-911-9. URL http://dl.acm.org/citation.cfm?id=2984093.2984154.  Simon Foucart and Holger Rauhut. A mathematical introduction to compressive sensing. Springer,  David Gamarnik and Quan Li. Finding a large submatrix of a gaussian random matrix. arXiv  preprint arXiv:1602.08529, 2016.  of Probability. To appear, a.  David Gamarnik and Madhu Sudan. Limits of local algorithms over sparse random graphs. Annals  David Gamarnik and Madhu Sudan. Performance of sequential local algorithms for the random  nae-k-sat problem. SIAM Journal on Computing. To appear, b.  Nicolai Meinshausen and Peter Bhlmann. High-dimensional graphs and variable selection with the lasso. Ann. Statist., 34(3):1436-1462, 06 2006. doi: 10.1214/009053606000000281. URL http://dx.doi.org/10.1214/009053606000000281.  Andrea Montanari, Ricardo Restrepo, and Prasad Tetali. Reconstruction and clustering in random constraint satisfaction problems. SIAM Journal on Discrete Mathematics, 25(2):771-808, 2011.  Mustazee Rahman and Balint Virag. Local algorithms for independent sets are half-optimal. arXiv  preprint arXiv:1402.0485, 2014.  Martin J Wainwright. Information-theoretic limits on sparsity recovery in the high-dimensional and  noisy setting. Information Theory, IEEE Transactions on, 55(12):5728-5741, 2009a.  Martin J Wainwright. Sharp thresholds for high-dimensional and noisy sparsity recovery using IEEE transactions on information theory, 55(5):  constrained quadratic programming (lasso). 2183-2202, 2009b.  Wei Wang, Martin J Wainwright, and Kannan Ramchandran. Information-theoretic limits on sparse signal recovery: Dense versus sparse measurement matrices. Information Theory, IEEE Trans- actions on, 56(6):2967-2979, 2010.  Peng Zhao and Bin Yu. On model selection consistency of lasso. J. Mach. Learn. Res., 7:2541- 2563, December 2006. ISSN 1532-4435. URL http://dl.acm.org/citation.cfm? id=1248547.1248637."}