{"1": "ABCNews.  Rapper  Pitbull  visits Kodiak http://abcnews.go.com/blogs/  entertainment/2012/08/rapper-pitbull-visits-kodiak-alaska-and-gets-bear-repellent/. 2012.  Nir Ailon, Bernard Chazelle, Seshadhri Comandur, and Ding Liu. Property-preserving data re- ISSN 0178-4617. doi: 10.1007/  construction. Algorithmica, 51(2):160-182, April 2008. s00453-007-9075-9. URL http://dx.doi.org/10.1007/s00453-007-9075-9.  Arnab Bhattacharyya, Elena Grigorescu, Madhav Jha, Kyomin Jung, Sofya Raskhodnikova, and David P. Woodruff. Lower bounds for local monotonicity reconstruction from transitive-closure spanners. doi: 10.1137/ 100808186. URL http://dx.doi.org/10.1137/100808186.  SIAM Journal on Discrete Mathematics, 26(2):618-646, 2012.  M. Blum, M. Luby, and R. Rubinfeld. Self-testing/correcting with applications to numerical prob- In Proceedings of the Twenty-second Annual ACM Symposium on Theory of Comput- ISBN 0-89791-361-2. doi:  lems. ing, STOC ’90, pages 73-83, New York, NY, USA, 1990. ACM. 10.1145/100216.100225. URL http://doi.acm.org/10.1145/100216.100225.  Cl´ement L. Canonne, Dana Ron, and Rocco A. Servedio. Testing equivalence between distributions using conditional samples. In Proceedings of the Twenty-Fifth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2014, pages 1174-1192, 2014.  Clement L. Canonne, Themis Gouleakis, and Ronitt Rubinfeld. Sampling correctors. In Proceed- ings of the 2016 ACM Conference on Innovations in Theoretical Computer Science, ITCS ’16, ISBN 978-1-4503-4057-1. doi: 10.1145/ pages 93-102, New York, NY, USA, 2016. ACM. 2840728.2840729. URL http://doi.acm.org/10.1145/2840728.2840729.  Moses Charikar, Jacob Steinhardt, and Gregory Valiant. Learning from untrusted data. In Proceed- ings of the 49th Annual ACM SIGACT Symposium on Theory of Computing, pages 47-60. ACM, 2017.  Ilias Diakonikolas, Gautam Kamath, Daniel M. Kane, Jerry Li, Ankur Moitra, and Alistair Stewart. In IEEE 57th Robust estimators in high dimensions without the computational intractability. Annual Symposium on Foundations of Computer Science, FOCS 2016, 9-11 October 2016, Hyatt Regency, New Brunswick, New Jersey, USA, pages 655-664, 2016. doi: 10.1109/FOCS.2016.85. URL https://doi.org/10.1109/FOCS.2016.85.  Ilias Diakonikolas, Gautam Kamath, Daniel M Kane, Jerry Li, Ankur Moitra, and Alistair Stewart. Being robust (in high dimensions) can be practical. arXiv preprint arXiv:1703.00893, 2017a.  Ilias Diakonikolas, Daniel M Kane, and Alistair Stewart. Statistical query lower bounds for robust estimation of high-dimensional gaussians and gaussian mixtures. In Foundations of Computer Science (FOCS), 2017 IEEE 58th Annual Symposium on, pages 73-84. IEEE, 2017b.  13   CERTIFIED COMPUTATION FROM UNRELIABLE DATASETS  The authors were supported by NSF CCF-1551875, CCF-1617730, CCF-1733808, and IIS-1741137.  Acknowledgements  References  ABCNews.  Rapper  Pitbull  visits Kodiak http://abcnews.go.com/blogs/  entertainment/2012/08/rapper-pitbull-visits-kodiak-alaska-and-gets-bear-repellent/. 2012.  Nir Ailon, Bernard Chazelle, Seshadhri Comandur, and Ding Liu. Property-preserving data re- ISSN 0178-4617. doi: 10.1007/  construction. Algorithmica, 51(2):160-182, April 2008. s00453-007-9075-9. URL http://dx.doi.org/10.1007/s00453-007-9075-9.  Arnab Bhattacharyya, Elena Grigorescu, Madhav Jha, Kyomin Jung, Sofya Raskhodnikova, and David P. Woodruff. Lower bounds for local monotonicity reconstruction from transitive-closure spanners. doi: 10.1137/ 100808186. URL http://dx.doi.org/10.1137/100808186.  SIAM Journal on Discrete Mathematics, 26(2):618-646, 2012.  M. Blum, M. Luby, and R. Rubinfeld. Self-testing/correcting with applications to numerical prob- In Proceedings of the Twenty-second Annual ACM Symposium on Theory of Comput- ISBN 0-89791-361-2. doi:  lems. ing, STOC ’90, pages 73-83, New York, NY, USA, 1990. ACM. 10.1145/100216.100225. URL http://doi.acm.org/10.1145/100216.100225.  Cl´ement L. Canonne, Dana Ron, and Rocco A. Servedio. Testing equivalence between distributions using conditional samples. In Proceedings of the Twenty-Fifth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2014, pages 1174-1192, 2014.  Clement L. Canonne, Themis Gouleakis, and Ronitt Rubinfeld. Sampling correctors. In Proceed- ings of the 2016 ACM Conference on Innovations in Theoretical Computer Science, ITCS ’16, ISBN 978-1-4503-4057-1. doi: 10.1145/ pages 93-102, New York, NY, USA, 2016. ACM. 2840728.2840729. URL http://doi.acm.org/10.1145/2840728.2840729.  Moses Charikar, Jacob Steinhardt, and Gregory Valiant. Learning from untrusted data. In Proceed- ings of the 49th Annual ACM SIGACT Symposium on Theory of Computing, pages 47-60. ACM, 2017.  Ilias Diakonikolas, Gautam Kamath, Daniel M. Kane, Jerry Li, Ankur Moitra, and Alistair Stewart. In IEEE 57th Robust estimators in high dimensions without the computational intractability. Annual Symposium on Foundations of Computer Science, FOCS 2016, 9-11 October 2016, Hyatt Regency, New Brunswick, New Jersey, USA, pages 655-664, 2016. doi: 10.1109/FOCS.2016.85. URL https://doi.org/10.1109/FOCS.2016.85.  Ilias Diakonikolas, Gautam Kamath, Daniel M Kane, Jerry Li, Ankur Moitra, and Alistair Stewart. Being robust (in high dimensions) can be practical. arXiv preprint arXiv:1703.00893, 2017a.  Ilias Diakonikolas, Daniel M Kane, and Alistair Stewart. Statistical query lower bounds for robust estimation of high-dimensional gaussians and gaussian mixtures. In Foundations of Computer Science (FOCS), 2017 IEEE 58th Annual Symposium on, pages 73-84. IEEE, 2017b. CERTIFIED COMPUTATION FROM UNRELIABLE DATASETS  Ilias Diakonikolas, Gautam Kamath, Daniel M. Kane, Jerry Li, Ankur Moitra, and Alistair Stewart. Robustly learning a gaussian: Getting optimal error, efficiently. In Proceedings of the Twenty- Ninth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2018, New Orleans, LA, USA, January 7-10, 2018, pages 2683-2702, 2018. doi: 10.1137/1.9781611975031.171. URL https://doi.org/10.1137/1.9781611975031.171.  Anhai Doan, Raghu Ramakrishnan, and Alon Y Halevy. Crowdsourcing systems on the world-wide  web. Communications of the ACM, 54(4):86-96, 2011.  Dimitris Fotakis, Christos Tzamos, and Manolis Zampetakis. Mechanism design with selective verification. In Proceedings of the 2016 ACM Conference on Economics and Computation, pages 771-788. ACM, 2016.  Oded Goldreich, Shafi Goldwasser, and Dana Ron. Property testing and its connection to learning and approximation. In 37th Annual Symposium on Foundations of Computer Science, FOCS ’96, Burlington, Vermont, USA, 14-16 October, 1996, pages 339-348, 1996. doi: 10.1109/SFCS. 1996.548493. URL https://doi.org/10.1109/SFCS.1996.548493.  Themistoklis Gouleakis, Christos Tzamos, and Manolis Zampetakis. Faster sublinear algorithms using conditional sampling. In Proceedings of the Twenty-Eighth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 1743-1757. SIAM, 2017.  Frank R Hampel, Peter J Rousseeuw, Elvezio M Ronchetti, and Werner A Stahel. Robust statistics:  the approach based on inﬂuence functions. 1980.  Peter J Huber. Robust statistics. In International Encyclopedia of Statistical Science, pages 1248-  1251. Springer, 2011.  M. Jha and S. Raskhodnikova. Testing and reconstruction of lipschitz functions with applications to data privacy. In 2011 IEEE 52nd Annual Symposium on Foundations of Computer Science, pages 433-442, Oct 2011. doi: 10.1109/FOCS.2011.13.  Gabriella Kazai, Jaap Kamps, Marijn Koolen, and Natasa Milic-Frayling. Crowdsourcing for book search evaluation: impact of hit design on comparative system ranking. In Proceedings of the 34th international ACM SIGIR conference on Research and development in Information Retrieval, pages 205-214. ACM, 2011.  Kevin A Lai, Anup B Rao, and Santosh Vempala. Agnostic estimation of mean and covariance. In Foundations of Computer Science (FOCS), 2016 IEEE 57th Annual Symposium on, pages 665-674. IEEE, 2016.  Roderick J. A. Little and Donald B. Rubin. Statistical Analysis with Missing Data. Wiley Series in Probability and Statistics. John Wiley & Sons, 2002. ISBN 9780471183860. Second edition.  Donald B. Rubin. Multiple imputation for nonresponse in surveys. John Wiley & Sons, 1987.  Michael Saks and C. Seshadhri. Local monotonicity reconstruction. SIAM Journal on Computing, 39(7):2897-2926, 2010. doi: 10.1137/080728561. URL http://dx.doi.org/10.1137/ 080728561. CERTIFIED COMPUTATION FROM UNRELIABLE DATASETS  Joseph L. Schafer. Analysis of incomplete multivariate data. CRC press, 1997.  Jacob Steinhardt, Gregory Valiant,  and Moses Charikar.  Adversarial Information Processing  and delinquents: in Neural ral Spain, 6440-avoiding-imposters-and-delinquents-adversarial-crowdsourcing-and-peer-prediction.  imposters In Advances crowdsourcing and peer prediction. 29: on Neu- 2016, December Barcelona, 5-10, URL http://papers.nips.cc/paper/  Information Processing  Annual Conference  4439-4447,  Avoiding  Systems  Systems  pages  2016.  2016,  Jeroen Vuurens, Arjen P de Vries, and Carsten Eickhoff. How much spam can you take? an analysis of crowdsourcing results to increase accuracy. In Proc. ACM SIGIR Workshop on Crowdsourcing for Information Retrieval (CIR’11), pages 21-26, 2011.  Paul Wais, Shivaram Lingamneni, Duncan Cook, Jason Fennell, Benjamin Goldenberg, Daniel Lubarov, David Marin, and Hari Simons. Towards building a high-quality workforce with me- chanical turk. Proceedings of computational social science and the wisdom of crowds (NIPS), pages 1-5, 2010. CERTIFIED COMPUTATION FROM UNRELIABLE DATASETS"}