{"1": "Sanjeev Arora, L´aszl´o Babai, Jacques Stern, and Z Sweedyk. The hardness of approximate optima in lattices, codes, and systems of linear equations. In Foundations of Computer Science, 1993. Proceedings., 34th Annual Symposium on, pages 724-733. IEEE, 1993.  Pranjal Awasthi, Maria-Florina Balcan, and Phil Long. The power of localization for efficiently  learning linear separators with noise. In STOC, 2014.  P.L. Bartlett, O. Bousquet, and S. Mendelson. Local rademacher complexities. Annals of Statistics,  33(4):1497-1537, 2005.  S. Ben-David, D. Loker, N. Srebro, and K. Sridharan. Minimizing the misclassification error rate  using a surrogate convex loss. In ICML, 2012.  I. Ben-Eliezer, S. Lovett, and A. Yadin. Polynomial threshold functions: Structure, approximation  and pseudorandomness. Unpublished manuscript, 2009.  A. Birnbaum and S. Shalev-Shwartz. Learning halfspaces with the zero-one loss: Time-accuracy  tradeoffs. In NIPS, 2012.  Amit Daniely and Shai Shalev-Shwartz. Complexity theoretic limitations on learning dnf’s.  In  Arxiv preprint arXiv:1404.3378 v1, 2014.  Amit Daniely, Nati Linial, and Shai Shalev-Shwartz. From average case complexity to improper  learning complexity. In STOC, 2014a.  Amit Daniely, Nati Linial, and Shai Shalev-Shwartz. The complexity of learning halfspaces using  generalized linear methods. In COLT, 2014b.  Philip J Davis. Interpolation and approximation. Courier Dover Publications, 1975.  Ilias Diakonikolas, Parikshit Gopalan, Ragesh Jaiswal, Rocco A Servedio, and Emanuele Viola. Bounded independence fools halfspaces. SIAM Journal on Computing, 39(8):3441-3462, 2010a.  Ilias Diakonikolas, Daniel M Kane, and Jelani Nelson. Bounded independence fools degree-2 threshold functions. In Foundations of Computer Science (FOCS), 2010 51st Annual IEEE Sym- posium on, pages 11-20. IEEE, 2010b.  V. Feldman, P. Gopalan, S. Khot, and A.K. Ponnuswami. New results for learning noisy parities and halfspaces. In In Proceedings of the 47th Annual IEEE Symposium on Foundations of Computer Science, 2006.  V. Guruswami and P. Raghavendra. Hardness of learning halfspaces with noise. In Proceedings of  the 47th Foundations of Computer Science (FOCS), 2006.  A. Kalai, A.R. Klivans, Y. Mansour, and R. Servedio. Agnostically learning halfspaces. In Pro-  ceedings of the 46th Foundations of Computer Science (FOCS), 2005.  Michael Kearns and Ming Li. Learning in the presence of malicious errors. pages 267-280, May  1988. SIAM Journal on Computing.  12   DANIELY  References  Sanjeev Arora, L´aszl´o Babai, Jacques Stern, and Z Sweedyk. The hardness of approximate optima in lattices, codes, and systems of linear equations. In Foundations of Computer Science, 1993. Proceedings., 34th Annual Symposium on, pages 724-733. IEEE, 1993.  Pranjal Awasthi, Maria-Florina Balcan, and Phil Long. The power of localization for efficiently  learning linear separators with noise. In STOC, 2014.  P.L. Bartlett, O. Bousquet, and S. Mendelson. Local rademacher complexities. Annals of Statistics,  33(4):1497-1537, 2005.  S. Ben-David, D. Loker, N. Srebro, and K. Sridharan. Minimizing the misclassification error rate  using a surrogate convex loss. In ICML, 2012.  I. Ben-Eliezer, S. Lovett, and A. Yadin. Polynomial threshold functions: Structure, approximation  and pseudorandomness. Unpublished manuscript, 2009.  A. Birnbaum and S. Shalev-Shwartz. Learning halfspaces with the zero-one loss: Time-accuracy  tradeoffs. In NIPS, 2012.  Amit Daniely and Shai Shalev-Shwartz. Complexity theoretic limitations on learning dnf’s.  In  Arxiv preprint arXiv:1404.3378 v1, 2014.  Amit Daniely, Nati Linial, and Shai Shalev-Shwartz. From average case complexity to improper  learning complexity. In STOC, 2014a.  Amit Daniely, Nati Linial, and Shai Shalev-Shwartz. The complexity of learning halfspaces using  generalized linear methods. In COLT, 2014b.  Philip J Davis. Interpolation and approximation. Courier Dover Publications, 1975.  Ilias Diakonikolas, Parikshit Gopalan, Ragesh Jaiswal, Rocco A Servedio, and Emanuele Viola. Bounded independence fools halfspaces. SIAM Journal on Computing, 39(8):3441-3462, 2010a.  Ilias Diakonikolas, Daniel M Kane, and Jelani Nelson. Bounded independence fools degree-2 threshold functions. In Foundations of Computer Science (FOCS), 2010 51st Annual IEEE Sym- posium on, pages 11-20. IEEE, 2010b.  V. Feldman, P. Gopalan, S. Khot, and A.K. Ponnuswami. New results for learning noisy parities and halfspaces. In In Proceedings of the 47th Annual IEEE Symposium on Foundations of Computer Science, 2006.  V. Guruswami and P. Raghavendra. Hardness of learning halfspaces with noise. In Proceedings of  the 47th Foundations of Computer Science (FOCS), 2006.  A. Kalai, A.R. Klivans, Y. Mansour, and R. Servedio. Agnostically learning halfspaces. In Pro-  ceedings of the 46th Foundations of Computer Science (FOCS), 2005.  Michael Kearns and Ming Li. Learning in the presence of malicious errors. pages 267-280, May  1988. SIAM Journal on Computing. A PTAS FOR AGNOSTICALLY LEARNING HALFSPACES  Michael J. Kearns, Robert E. Schapire, and Linda M. Sellie. Toward efficient agnostic learning.  Machine Learning, 17:115-141, 1994.  Adam Klivans and Pravesh Kothari. Embedding hard learning problems into gaussian space. In  RANDOM, 2014.  Adam R Klivans, Ryan O’Donnell, and Rocco Servedio. Learning intersections and thresholds of In Foundations of Computer Science, 2002. Proceedings. The 43rd Annual IEEE  halfspaces. Symposium on, pages 177-186. IEEE, 2002.  A.R. Klivans, P.M. Long, and R.A. Servedio. Learning halfspaces with malicious noise. The Journal  of Machine Learning Research, 10:2715-2740, 2009.  Nathan Linial, Yishay Mansour, and Noam Nisan. Constant depth circuits, Fourier transform, and  learnability. In FOCS, pages 574-579, October 1989.  P.M. Long and R.A. Servedio. Learning large-margin halfspaces with more malicious noise. In  NIPS, 2011.  Burr Settles. Active learning literature survey. University of Wisconsin, Madison, 52:55-66, 2010.  S. Shalev-Shwartz, O. Shamir, and K. Sridharan. Learning kernel-based halfspaces with the 0-1  loss. SIAM Journal on Computing, 40:1623-1646, 2011.  V. N. Vapnik. Statistical Learning Theory. Wiley, 1998. DANIELY"}