{"1": "Alekh Agarwal, Animashree Anandkumar, Prateek Jain, Praneeth Netrapalli, and Rashish Tandon. Learning sparsely used overcomplete dictionaries via alternating minimization. arXiv preprint arXiv:1310.7991, 2013a.  Alekh Agarwal, Animashree Anandkumar, and Praneeth Netrapalli. Exact recovery of sparsely used  overcomplete dictionaries. arXiv preprint arXiv:1309.1952, 2013b.  S. Arora, R. Ge, and A. Moitra. New Algorithms for Learning Incoherent and Overcomplete Dic-  tionaries. ArXiv e-prints, August 2013.  Krishnakumar Balasubramanian, Kai Yu, and Guy Lebanon. Smooth sparse coding via marginal  regression for learning sparse representations. In ICML, 2013.  Yoshua Bengio, Aaron Courville, and Pascal Vincent. Unsupervised feature learning and deep  learning: A review and new perspectives. arXiv preprint arXiv:1206.5538, 2012.  Michael Elad. Sparse and redundant representations: from theory to applications in signal and  image processing. Springer, 2010.  Kjersti Engan, Sven Ole Aase, and J Hakon Husoy. Method of optimal directions for frame de- sign. In Acoustics, Speech, and Signal Processing, 1999. Proceedings., 1999 IEEE International Conference on, volume 5, pages 2443-2446. IEEE, 1999.  Rahul Garg and Rohit Khandekar. Gradient descent with sparsification: an iterative algorithm for  sparse recovery with restricted isometry property. In ICML, 2009.  Quan Geng, Huan Wang, and John Wright.  mization for dictionary learning. URL:http://arxiv.org/abs/1101.5672.  arXiv preprint arXiv:1101:5672, 2011.  On the local correctness of ℓ1 mini- Preprint,  R´emi Gribonval and Karin Schnass. Dictionary Identification - Sparse Matrix-Factorisation via  ℓ 1-Minimisation. IEEE Transactions on Information Theory, 56(7):3523-3539, 2010.  Christopher J Hillar and Friedrich T Sommer. Ramsey theory reveals the conditions when sparse  coding on subsampled data is unique. arXiv preprint arXiv:1106.3616, 2011.  Rodolphe Jenatton, Julien Mairal, Francis R Bach, and Guillaume R Obozinski. Proximal methods for sparse hierarchical dictionary learning. In Proceedings of the 27th International Conference on Machine Learning (ICML-10), pages 487-494, 2010.  Rodolphe Jenatton, R´emi Gribonval, and Francis Bach. sparse dictionary learning in the presence of noise. http://hal.inria.fr/hal-00737152.  Local stability and robustness of URL Technical report, 2012.  Honglak Lee, Alexis Battle, Rajat Raina, and Andrew Ng. Efficient sparse coding algorithms. In  Advances in neural information processing systems, pages 801-808, 2006.  Michael S Lewicki and Terrence J Sejnowski. Learning overcomplete representations. Neural  computation, 12(2):337-365, 2000.  14   AGARWAL ANANDKUMAR JAIN NETRAPALLI TANDON  References  Alekh Agarwal, Animashree Anandkumar, Prateek Jain, Praneeth Netrapalli, and Rashish Tandon. Learning sparsely used overcomplete dictionaries via alternating minimization. arXiv preprint arXiv:1310.7991, 2013a.  Alekh Agarwal, Animashree Anandkumar, and Praneeth Netrapalli. Exact recovery of sparsely used  overcomplete dictionaries. arXiv preprint arXiv:1309.1952, 2013b.  S. Arora, R. Ge, and A. Moitra. New Algorithms for Learning Incoherent and Overcomplete Dic-  tionaries. ArXiv e-prints, August 2013.  Krishnakumar Balasubramanian, Kai Yu, and Guy Lebanon. Smooth sparse coding via marginal  regression for learning sparse representations. In ICML, 2013.  Yoshua Bengio, Aaron Courville, and Pascal Vincent. Unsupervised feature learning and deep  learning: A review and new perspectives. arXiv preprint arXiv:1206.5538, 2012.  Michael Elad. Sparse and redundant representations: from theory to applications in signal and  image processing. Springer, 2010.  Kjersti Engan, Sven Ole Aase, and J Hakon Husoy. Method of optimal directions for frame de- sign. In Acoustics, Speech, and Signal Processing, 1999. Proceedings., 1999 IEEE International Conference on, volume 5, pages 2443-2446. IEEE, 1999.  Rahul Garg and Rohit Khandekar. Gradient descent with sparsification: an iterative algorithm for  sparse recovery with restricted isometry property. In ICML, 2009.  Quan Geng, Huan Wang, and John Wright.  mization for dictionary learning. URL:http://arxiv.org/abs/1101.5672.  arXiv preprint arXiv:1101:5672, 2011.  On the local correctness of ℓ1 mini- Preprint,  R´emi Gribonval and Karin Schnass. Dictionary Identification - Sparse Matrix-Factorisation via  ℓ 1-Minimisation. IEEE Transactions on Information Theory, 56(7):3523-3539, 2010.  Christopher J Hillar and Friedrich T Sommer. Ramsey theory reveals the conditions when sparse  coding on subsampled data is unique. arXiv preprint arXiv:1106.3616, 2011.  Rodolphe Jenatton, Julien Mairal, Francis R Bach, and Guillaume R Obozinski. Proximal methods for sparse hierarchical dictionary learning. In Proceedings of the 27th International Conference on Machine Learning (ICML-10), pages 487-494, 2010.  Rodolphe Jenatton, R´emi Gribonval, and Francis Bach. sparse dictionary learning in the presence of noise. http://hal.inria.fr/hal-00737152.  Local stability and robustness of URL Technical report, 2012.  Honglak Lee, Alexis Battle, Rajat Raina, and Andrew Ng. Efficient sparse coding algorithms. In  Advances in neural information processing systems, pages 801-808, 2006.  Michael S Lewicki and Terrence J Sejnowski. Learning overcomplete representations. Neural  computation, 12(2):337-365, 2000. LEARNING SPARSELY USED OVERCOMPLETE DICTIONARIES  Andreas Maurer, Massimiliano Pontil, and Bernardino Romera-Paredes. Sparse coding for multitask  and transfer learning. arXiv preprint arXiv:1209.0738, 2012.  Andreas Maurer, Massimiliano Pontil, and Bernardino Romera-Paredes. Sparse coding for multitask  and transfer learning. In ICML, 2013.  Nishant Mehta and Alexander G Gray. Sparsity-based generalization bounds for predictive sparse coding. In Proceedings of the 30th International Conference on Machine Learning (ICML-13), pages 36-44, 2013.  Bruno A Olshausen and David J Field. Sparse coding with an overcomplete basis set: A strategy  employed by v1? Vision research, 37(23):3311-3325, 1997.  Holger Rauhut. Compressive sensing, structured random matrices and recovery of functions in high  dimensions. In Oberwolfach Reports, volume 7, pages 1990-1993, 2010.  Daniel A Spielman, Huan Wang, and John Wright. Exact recovery of sparsely-used dictionaries. In  Proc. of Conf. on Learning Theory, 2012.  Jayaraman J. Thiagarajan, Karthikeyan Natesan Ramamurthy, and Andreas Spanias. Learning stable  multilevel dictionaries for sparse representation of images. ArXiv 1303.0448, 2013.  J.A. Tropp and A.C. Gilbert. Signal recovery from random measurements via orthogonal matching  pursuit. Information Theory, IEEE Transactions on, 53(12):4655-4666, 2007.  Daniel Vainsencher, Shie Mannor, and Alfred M Bruckstein. The sample complexity of dictionary  learning. The Journal of Machine Learning Research, 12:3259-3281, 2011.  Roman Vershynin. Introduction to the non-asymptotic analysis of random matrices. arXiv preprint  arXiv:1011.3027, 2010."}