{"1": "Emmanuel Abbe, Afonso S Bandeira, and Georgina Hall. Exact recovery in the stochastic block  model. IEEE Transactions on Information Theory, 2016.  Louigi Addario-Berry, Nicolas Broutin, Luc Devroye, and G´abor Lugosi. On combinatorial testing  problems. The Annals of Statistics, 2010.  Alekh Agarwal, Daniel Hsu, Satyen Kale, John Langford, Lihong Li, and Robert E. Schapire. Tam- ing the monster: A fast and simple algorithm for contextual bandits. In International Conference on Machine Learning, 2014.  Andr´as Antos, Varun Grover, and Csaba Szepesv´ari. Active learning in heteroscedastic noise. The-  oretical Computer Science, 2010.  Ery Arias-Castro and Emmanuel J. Cand`es. Searching for a trail of evidence in a maze. The Annals  of Statistics, 2008.  Jean-Yves Audibert and S´ebastien Bubeck. Best arm identification in multi-armed bandits.  In  Conference on Learning Theory, 2010.  Sivaraman Balakrishnan, Min Xu, Akshay Krishnamurthy, and Aarti Singh. Noise Thresholds for  Spectral Clustering. In Advances in Neural Information Processing Systems, 2011.  S´ebastian Bubeck, Tengyao Wang, and Nitin Viswanathan. Multiple identifications in multi-armed  bandits. In International Conference on Machine Learning, 2013.  Cristina Butucea and Yuri I. Ingster. Detection of a sparse submatrix of a high-dimensional noisy  matrix. Bernoulli, 2013.  Alexandra Carpentier and Andrea Locatelli. Tight (lower) bounds for the fixed budget best arm  identification bandit problem. In Conference on Learning Theory, 2016.  Rui Castro and Ervin T´anczos. Adaptive sensing for estimation of structured sparse signals. IEEE  Transactions on Information Theory, 2015.  Lijie Chen, Anupam Gupta, and Jian Li. Pure exploration of multi-armed bandit under matroid  constraints. In Conference on Learning Theory, 2016.  Lijie Chen, Anupam Gupta, Jian Li, Mingda Qiao, and Ruosong Wang. Nearly optimal sampling  algorithms for combinatorial pure exploration. In Conference on Learning Theory, 2017.  Shouyuan Chen, Tian Lin, Irwin King, Michael R Lyu, and Wei Chen. Combinatorial pure explo- ration of multi-armed bandits. In Advances in Neural Information Processing Systems, 2014.  Yudong Chen and Jiaming Xu. Statistical-computational tradeoffs in planted problems and subma- trix localization with a growing number of clusters and submatrices. Journal of Machine Learning Research, 2016.  David Cohn, Les Atlas, and Richard Ladner. Improving generalization with active learning. Ma-  chine Learning, 1994.  13   DISAGREEMENT-BASED COMBINATORIAL EXPLORATION  References  Emmanuel Abbe, Afonso S Bandeira, and Georgina Hall. Exact recovery in the stochastic block  model. IEEE Transactions on Information Theory, 2016.  Louigi Addario-Berry, Nicolas Broutin, Luc Devroye, and G´abor Lugosi. On combinatorial testing  problems. The Annals of Statistics, 2010.  Alekh Agarwal, Daniel Hsu, Satyen Kale, John Langford, Lihong Li, and Robert E. Schapire. Tam- ing the monster: A fast and simple algorithm for contextual bandits. In International Conference on Machine Learning, 2014.  Andr´as Antos, Varun Grover, and Csaba Szepesv´ari. Active learning in heteroscedastic noise. The-  oretical Computer Science, 2010.  Ery Arias-Castro and Emmanuel J. Cand`es. Searching for a trail of evidence in a maze. The Annals  of Statistics, 2008.  Jean-Yves Audibert and S´ebastien Bubeck. Best arm identification in multi-armed bandits.  In  Conference on Learning Theory, 2010.  Sivaraman Balakrishnan, Min Xu, Akshay Krishnamurthy, and Aarti Singh. Noise Thresholds for  Spectral Clustering. In Advances in Neural Information Processing Systems, 2011.  S´ebastian Bubeck, Tengyao Wang, and Nitin Viswanathan. Multiple identifications in multi-armed  bandits. In International Conference on Machine Learning, 2013.  Cristina Butucea and Yuri I. Ingster. Detection of a sparse submatrix of a high-dimensional noisy  matrix. Bernoulli, 2013.  Alexandra Carpentier and Andrea Locatelli. Tight (lower) bounds for the fixed budget best arm  identification bandit problem. In Conference on Learning Theory, 2016.  Rui Castro and Ervin T´anczos. Adaptive sensing for estimation of structured sparse signals. IEEE  Transactions on Information Theory, 2015.  Lijie Chen, Anupam Gupta, and Jian Li. Pure exploration of multi-armed bandit under matroid  constraints. In Conference on Learning Theory, 2016.  Lijie Chen, Anupam Gupta, Jian Li, Mingda Qiao, and Ruosong Wang. Nearly optimal sampling  algorithms for combinatorial pure exploration. In Conference on Learning Theory, 2017.  Shouyuan Chen, Tian Lin, Irwin King, Michael R Lyu, and Wei Chen. Combinatorial pure explo- ration of multi-armed bandits. In Advances in Neural Information Processing Systems, 2014.  Yudong Chen and Jiaming Xu. Statistical-computational tradeoffs in planted problems and subma- trix localization with a growing number of clusters and submatrices. Journal of Machine Learning Research, 2016.  David Cohn, Les Atlas, and Richard Ladner. Improving generalization with active learning. Ma-  chine Learning, 1994. CAO KRISHNAMURTHY  Sanjoy Dasgupta, Daniel Hsu, and Claire Monteleoni. A general agnostic active learning algorithm.  In Advances in Neural Information Processing Systems, 2007.  Eyal Even-Dar, Shie Mannor, and Yishay Mansour. Action elimination and stopping conditions for the multi-armed bandit and reinforcement learning problems. Journal of Machine Learning Research, 2006.  Victor Gabillon, Alessandro Lazaric, Mohammad Ghavamzadeh, Ronald Ortner, and Peter Bartlett. Improved learning complexity in combinatorial pure exploration bandits. In Artificial Intelligence and Statistics, 2016.  Aur´elien Garivier and Emilie Kaufmann. Optimal best arm identification with fixed confidence. In  Conference on Learning Theory, 2016.  Steve Hanneke. Theory of disagreement-based active learning. Foundations and Trends in Machine  Daniel Hsu. Algorithms for Active Learning. PhD thesis, University of California at San Diego,  Learning, 2014.  2010.  Tzu-Kuo Huang, Alekh Agarwal, Daniel Hsu, John Langford, and Robert E. Schapire. Efficient and parsimonious agnostic active learning. In Advances in Neural Information Processing Systems, 2015.  Adam Kalai and Santosh Vempala. Efficient algorithms for online decision problems. Journal of  Computer and System Sciences, 2005.  Shivaram Kalyanakrishnan, Ambuj Tewari, Peter Auer, and Peter Stone. Pac subset selection in  stochastic multi-armed bandits. In International Conference on Machine Learning, 2012.  Zohar Karnin, Tomer Koren, and Oren Somekh. Almost optimal exploration in multi-armed bandits.  In International Conference on Machine Learning, 2013.  Zohar S Karnin. Verification based solution for structured mab problems. In Advances in Neural  Information Processing Systems, 2016.  Emilie Kaufmann and Shivaram Kalyanakrishnan. Information complexity in bandit subset selec-  tion. In Conference on Learning Theory, 2013.  Emilie Kaufmann, Olivier Capp´e, and Aur´elien Garivier. On the complexity of a/b testing.  In  Conference on Learning Theory, 2014.  Mladen Kolar, Sivaraman Balakrishnan, Alessandro Rinaldo, and Aarti Singh. Minimax localization of structural information in large noisy matrices. Advances in Neural Information Processing Systems, 2011.  Akshay Krishnamurthy. Minimax structured normal means inference. IEEE International Sympo-  sium on Information Theory, 2016.  Shie Mannor and John N Tsitsiklis. The sample complexity of exploration in the multi-armed bandit  problem. Journal of Machine Learning Research, 2004. DISAGREEMENT-BASED COMBINATORIAL EXPLORATION  Elchanan Mossel, Joe Neeman, and Allan Sly. Belief propagation, robust reconstruction and optimal  recovery of block models. In Conference on Learning Theory, 2014.  Serge A. Plotkin, David B. Shmoys, and ´Eva Tardos. Fast approximation algorithms for fractional  packing and covering problems. Mathematics of Operations Research, 1995.  Alexander Rakhlin and Karthik Sridharan. Bistro: An efficient relaxation-based method for contex-  tual bandits. In International Conference on Machine Learning, 2016.  Daniel Russo. Simple bayesian algorithms for best arm identification. In Conference on Learning  Theory, 2016.  Max Simchowitz, Kevin Jamieson, and Benjamin Recht. The simulator: Understanding adaptive  sampling in the moderate-confidence regime. In Conference on Learning Theory, 2017.  Vasilis Syrgkanis, Haipeng Luo, Akshay Krishnamurthy, and Robert E Schapire. Improved regret bounds for oracle-based adversarial contextual bandits. In Advances in Neural Information Pro- cessing Systems, 2016.  Shu Wang, Robin R Gutell, and Daniel P Miranker. Biclustering as a method for rna local multiple  sequence alignment. Bioinformatics, 2007."}