{"1": "151-163, 2007.  D. Angluin. Queries and concept learning. Machine Learning, 2:319-342, 1998.  P. Auer and R. Ortner. A new PAC bound for intersection-closed concept classes. Machine Learning, 66:  M. F. Balcan, A. Beygelzimer, and J. Langford. Agnostic active learning. In ICML, 2006.  M.-F. Balcan, A. Broder, and T. Zhang. Margin based active learning. In COLT, 2007.  M.-F. Balcan, S. Hanneke, and J. Wortman. The true sample complexity of active learning. In COLT, 2008.  J. L. Balc´azar, J. Castro, and D. Guijarro. A general dimension for exact learning. In Proceedings of the 14th  Conference on Learning Theory, 2001.  J. L. Balc´azar, J. Castro, and D. Guijarro. A new abstract combinatorial dimension for exact learning via  queries. Journal of Computer and System Sciences, 64:2-21, 2002.  S. Ben-David, N. Cesa-Bianchi, D. Haussler, and P. M. Long. Characterizations of Learnability for Classes  of {0, ..., n}-Valued Functions. J. Comput. Syst. Sci., 1995.  A. Beygelzimer, S. Dasgupta, and J. Langford. Importance weighted active learning. In Proceedings of the  26th International Conference on Machine Learning (ICML), 2009.  A. Beygelzimer, D. Hsu, J. Langford, and T. Zhang. Agnostic active learning without constraints. In NIPS,  2010.  R. Castro and R. Nowak. Minimax bounds for active learning. In Proceedings of the 20th Annual Conference  on Computational Learning Theory (COLT), 2007.  E. Chang, S. Tong, K. Goh, and C.-W. Chang. Support vector machine concept-dependent active learning for  image retrieval. IEEE Transactions on Multimedia, 2005.  S. Dasgupta. Coarse sample complexity bounds for active learning. In NIPS, volume 18, 2005.  S. Dasgupta, A. Kalai, and C. Monteleoni. Analysis of perceptron-based active learning. In COLT, 2005.  S. Dasgupta, D.J. Hsu, and C. Monteleoni. A general agnostic active learning algorithm. Advances in Neural  Information Processing Systems, 20, 2007.  S. Doyle, J. Monaco, M. Feldman, J. Tomaszewski, and A. Madabhushi. A class balanced active learning scheme that accounts for minority class problems: Applications to histopathology. In MICCAI Workshop on Optical Tissue Image Analysis in Microsopy, Histopathology and Endoscopy, 2009.  Y. Freund, H.S. Seung, E. Shamir, and N. Tishby. Selective sampling using the query by committee algorithm.  Machine Learning, 28(2-3):133-168, 1997.  E. Gine and V. Koltchinskii. Concentration inequalities and asymptotic results for ratio type empirical pro-  cesses. The Annals of Probability, 34(3):1143-1216, 2006.  S. Hanneke. A bound on the label complexity of agnostic active learning. In ICML, 2007a.  S. Hanneke. Teaching dimension and the complexity of active learning. In Proceedings of the 20th Annual  Conference on Computational Learning Theory (COLT), 2007b.  20.13   ROBUST INTERACTIVE LEARNING  References  151-163, 2007.  D. Angluin. Queries and concept learning. Machine Learning, 2:319-342, 1998.  P. Auer and R. Ortner. A new PAC bound for intersection-closed concept classes. Machine Learning, 66:  M. F. Balcan, A. Beygelzimer, and J. Langford. Agnostic active learning. In ICML, 2006.  M.-F. Balcan, A. Broder, and T. Zhang. Margin based active learning. In COLT, 2007.  M.-F. Balcan, S. Hanneke, and J. Wortman. The true sample complexity of active learning. In COLT, 2008.  J. L. Balc´azar, J. Castro, and D. Guijarro. A general dimension for exact learning. In Proceedings of the 14th  Conference on Learning Theory, 2001.  J. L. Balc´azar, J. Castro, and D. Guijarro. A new abstract combinatorial dimension for exact learning via  queries. Journal of Computer and System Sciences, 64:2-21, 2002.  S. Ben-David, N. Cesa-Bianchi, D. Haussler, and P. M. Long. Characterizations of Learnability for Classes  of {0, ..., n}-Valued Functions. J. Comput. Syst. Sci., 1995.  A. Beygelzimer, S. Dasgupta, and J. Langford. Importance weighted active learning. In Proceedings of the  26th International Conference on Machine Learning (ICML), 2009.  A. Beygelzimer, D. Hsu, J. Langford, and T. Zhang. Agnostic active learning without constraints. In NIPS,  2010.  R. Castro and R. Nowak. Minimax bounds for active learning. In Proceedings of the 20th Annual Conference  on Computational Learning Theory (COLT), 2007.  E. Chang, S. Tong, K. Goh, and C.-W. Chang. Support vector machine concept-dependent active learning for  image retrieval. IEEE Transactions on Multimedia, 2005.  S. Dasgupta. Coarse sample complexity bounds for active learning. In NIPS, volume 18, 2005.  S. Dasgupta, A. Kalai, and C. Monteleoni. Analysis of perceptron-based active learning. In COLT, 2005.  S. Dasgupta, D.J. Hsu, and C. Monteleoni. A general agnostic active learning algorithm. Advances in Neural  Information Processing Systems, 20, 2007.  S. Doyle, J. Monaco, M. Feldman, J. Tomaszewski, and A. Madabhushi. A class balanced active learning scheme that accounts for minority class problems: Applications to histopathology. In MICCAI Workshop on Optical Tissue Image Analysis in Microsopy, Histopathology and Endoscopy, 2009.  Y. Freund, H.S. Seung, E. Shamir, and N. Tishby. Selective sampling using the query by committee algorithm.  Machine Learning, 28(2-3):133-168, 1997.  E. Gine and V. Koltchinskii. Concentration inequalities and asymptotic results for ratio type empirical pro-  cesses. The Annals of Probability, 34(3):1143-1216, 2006.  S. Hanneke. A bound on the label complexity of agnostic active learning. In ICML, 2007a.  S. Hanneke. Teaching dimension and the complexity of active learning. In Proceedings of the 20th Annual  Conference on Computational Learning Theory (COLT), 2007b.  20.13   BALCAN HANNEKE  S. Hanneke. Theoretical Foundations of Active Learning. PhD thesis, Machine Learning Department, School  of Computer Science, Carnegie Mellon University, 2009.  S. Hanneke. Rates of convergence in active learning. The Annals of Statistics, 39(1):333-361, 2011.  D. Haussler and P. M. Long. A generalization of sauer’s lemma. Journal of Combinatorial Theory, Series A,  71:219-240, 1995.  T. Heged¨us. Generalized teaching dimension and the query complexity of learning.  In The 8th Annual  Conference on Computational Learning Theory, 1995.  D. Helmbold, R. Sloan, and M. Warmuth. Learning nested differences of intersection-closed concept classes.  Machine Learning, 5:165-196, 1990.  chine Learning, 11:2457-2485, 2010.  chine Learning, 1988.  2006.  V. Koltchinskii. Rademacher complexities and bounding the excess risk in active learning. Journal of Ma-  N. Littlestone. Learning quickly when irrelevant attributes abound: A new linear-threshold algorithm. Ma-  P. Massart and E. Nedelec. Risk bounds for statistical learning. The Annals of Statistics, 34(5):2326-2366,  A. McCallum and K. Nigam. Employing EM in pool-based active learning for text classification. In Pro-  ceedings of the 15th International Conference on Machine Learning (ICML), pages 350-358, 1998.  B. K. Natarajan. On learning sets and functions. Machine Learning, 4:67-97, 1989.  H. Simon. PAC-learning in the presence of one-sided classification noise. In International Symposium on  Artificial Intelligence and Mathematics, 2012.  S. Tong and D. Koller. Support vector machine active learning with applications to text classification. Journal  of Machine Learning Research, 4:45-66, 2001.  A. W. van der Vaart and J. A. Wellner. Weak Convergence and Empirical Processes. Springer, 1996.  V. N. Vapnik. Statistical Learning Theory. John Wiley and Sons, 1998.  L. Wang. Sufficient conditions for agnostic active learnable. In NIPS, 2009."}