{"1": "Alekh Agarwal, Animashree Anandkumar, Prateek Jain, Praneeth Netrapalli, and Rashish Tandon. In Proceedings of The 27th Conference on  Learning sparsely used overcomplete dictionaries. Learning Theory, pages 123-137, 2014.  Animashree Anandkumar, Rong Ge, Daniel Hsu, Sham M Kakade, and Matus Telgarsky. Tensor decompositions for learning latent variable models. Journal of Machine Learning Research, 15 (1):2773-2832, 2014.  Animashree Anandkumar, Rong Ge, and Majid Janzamin. Learning overcomplete latent variable models through tensor methods. In Proceedings of The 28th Conference on Learning Theory, pages 36-112, 2015.  Sanjeev Arora, Rong Ge, and Ankur Moitra. New algorithms for learning incoherent and overcom-  plete dictionaries. In COLT, pages 779-806, 2014.  Quentin Berthet, Philippe Rigollet, et al. Optimal detection of sparse principal components in high  dimension. The Annals of Statistics, 41(4):1780-1815, 2013.  Alex Bloemendal and B´alint Vir´ag. Limits of spiked random matrices i. Probability Theory and  Related Fields, 156(3-4):795-825, 2013.  Anna Choromanska, Mikael Henaff, Michael Mathieu, G´erard Ben Arous, and Yann LeCun. The  loss surfaces of multilayer networks. In AISTATS, 2015.  David L Donoho, Arian Maleki, and Andrea Montanari. Message-passing algorithms for com- pressed sensing. Proceedings of the National Academy of Sciences, 106(45):18914-18919, 2009.  Rong Ge, Furong Huang, Chi Jin, and Yang Yuan. Escaping from saddle points—online stochastic gradient for tensor decomposition. In Proceedings of The 28th Conference on Learning Theory, pages 797-842, 2015.  Rong Ge, Jason D Lee, and Tengyu Ma. Matrix completion has no spurious local minimum. arXiv  preprint arXiv:1605.07272, 2016.  Elad Hazan, Kfir Y Levy, and Shai Shalev-Shwartz. On graduated optimization for stochastic non-  convex problems. In International Conference on Machine Learning (ICML), 2016.  Christopher J Hillar and Lek-Heng Lim. Most tensor problems are np-hard. Journal of the ACM  (JACM), 60(6):45, 2013.  Samuel B Hopkins, Jonathan Shi, and David Steurer. Tensor principal component analysis via sum- of-square proofs. In Proceedings of The 28th Conference on Learning Theory, COLT, pages 3-6, 2015.  Prateek Jain, Praneeth Netrapalli, and Sujay Sanghavi. Low-rank matrix completion using alter- In Proceedings of the forty-fifth annual ACM symposium on Theory of  nating minimization. computing, pages 665-674. ACM, 2013.  14   ANANDKUMAR DENG GE MOBAHI  References  Alekh Agarwal, Animashree Anandkumar, Prateek Jain, Praneeth Netrapalli, and Rashish Tandon. In Proceedings of The 27th Conference on  Learning sparsely used overcomplete dictionaries. Learning Theory, pages 123-137, 2014.  Animashree Anandkumar, Rong Ge, Daniel Hsu, Sham M Kakade, and Matus Telgarsky. Tensor decompositions for learning latent variable models. Journal of Machine Learning Research, 15 (1):2773-2832, 2014.  Animashree Anandkumar, Rong Ge, and Majid Janzamin. Learning overcomplete latent variable models through tensor methods. In Proceedings of The 28th Conference on Learning Theory, pages 36-112, 2015.  Sanjeev Arora, Rong Ge, and Ankur Moitra. New algorithms for learning incoherent and overcom-  plete dictionaries. In COLT, pages 779-806, 2014.  Quentin Berthet, Philippe Rigollet, et al. Optimal detection of sparse principal components in high  dimension. The Annals of Statistics, 41(4):1780-1815, 2013.  Alex Bloemendal and B´alint Vir´ag. Limits of spiked random matrices i. Probability Theory and  Related Fields, 156(3-4):795-825, 2013.  Anna Choromanska, Mikael Henaff, Michael Mathieu, G´erard Ben Arous, and Yann LeCun. The  loss surfaces of multilayer networks. In AISTATS, 2015.  David L Donoho, Arian Maleki, and Andrea Montanari. Message-passing algorithms for com- pressed sensing. Proceedings of the National Academy of Sciences, 106(45):18914-18919, 2009.  Rong Ge, Furong Huang, Chi Jin, and Yang Yuan. Escaping from saddle points—online stochastic gradient for tensor decomposition. In Proceedings of The 28th Conference on Learning Theory, pages 797-842, 2015.  Rong Ge, Jason D Lee, and Tengyu Ma. Matrix completion has no spurious local minimum. arXiv  preprint arXiv:1605.07272, 2016.  Elad Hazan, Kfir Y Levy, and Shai Shalev-Shwartz. On graduated optimization for stochastic non-  convex problems. In International Conference on Machine Learning (ICML), 2016.  Christopher J Hillar and Lek-Heng Lim. Most tensor problems are np-hard. Journal of the ACM  (JACM), 60(6):45, 2013.  Samuel B Hopkins, Jonathan Shi, and David Steurer. Tensor principal component analysis via sum- of-square proofs. In Proceedings of The 28th Conference on Learning Theory, COLT, pages 3-6, 2015.  Prateek Jain, Praneeth Netrapalli, and Sujay Sanghavi. Low-rank matrix completion using alter- In Proceedings of the forty-fifth annual ACM symposium on Theory of  nating minimization. computing, pages 665-674. ACM, 2013. HOMOTOPY ANALYSIS FOR TENSOR PCA  Adel Javanmard and Andrea Montanari. State evolution for general approximate message passing algorithms, with applications to spatial coupling. Information and Inference, page iat004, 2013.  Beatrice Laurent and Pascal Massart. Adaptive estimation of a quadratic functional by model selec-  tion. Annals of Statistics, pages 1302-1338, 2000.  Michel Ledoux. Deviation inequalities on largest eigenvalues. In Geometric aspects of functional  analysis, pages 167-219. Springer, 2007.  Hossein Mobahi. Closed form for some gaussian convolutions. arXiv:1602.05610, 2016.  Hossein Mobahi and John W Fisher III. A theoretical analysis of optimization by gaussian contin-  uation. In AAAI, pages 1205-1211. Citeseer, 2015a.  Hossein Mobahi and John W Fisher III. On the link between gaussian homotopy continuation and In International Workshop on Energy Minimization Methods in Computer  convex envelopes. Vision and Pattern Recognition, pages 43-56. Springer, 2015b.  Praneeth Netrapalli, UN Niranjan, Sujay Sanghavi, Animashree Anandkumar, and Prateek Jain. Non-convex robust pca. In Advances in Neural Information Processing Systems, pages 1107- 1115, 2014.  Amelia Perry, Alexander S Wein, Afonso S Bandeira, and Ankur Moitra. Optimality and arXiv preprint  sub-optimality of pca for spiked random matrices and synchronization. arXiv:1609.05573, 2016.  Emile Richard and Andrea Montanari. A statistical model for tensor pca. In Advances in Neural  Information Processing Systems, pages 2897-2905, 2014.  Ju Sun, Qing Qu, and John Wright. Complete dictionary recovery over the sphere. In Sampling Theory and Applications (SampTA), 2015 International Conference on, pages 407-410. IEEE, 2015.  Ju Sun, Qing Qu, and John Wright. A geometric analysis of phase retrieval. Arxiv, 1602.06664,  Ryota Tomioka and Taiji Suzuki. Spectral norm of random tensors. arXiv preprint arXiv:1407.1870,  2016.  2014.  Xinyang Yi, Constantine Caramanis, and Sujay Sanghavi. Solving a mixture of many random linear equations by tensor decomposition and alternating minimization. Arxiv, abs/1608.05749, 2016. ANANDKUMAR DENG GE MOBAHI"}