{"1": "J. Abernethy, A. Agarwal, P. Bartlett, and A. Rakhlin. A stochastic view of optimal regret In Proceedings of the 22th Annual Conference on Learning  through minimax duality. Theory, 2009.  B. Acciaio, M. Beiglbck, F. Penkner, W. Schachermayer, and J. Temme. A trajectorial interpretation of Doob’s martingale inequalities. Ann. Appl. Probab., 23(4):1494-1505, 08 2013. URL http://dx.doi.org/10.1214/12-AAP878.  M. Beiglb¨ock and M. Nutz. Martingale inequalities and deterministic counterparts. Electron.  M. Beiglb¨ock and P. Siorpaes. Pathwise versions of the burkholder-davis-gundy inequality.  J. Probab, 19(95):1-15, 2014.  Bernoulli, 21(1):360-373, 2015.  2015.  B. Bercu, B. Delyon, and E. Rio. Concentration inequalities for sums and martingales,  J. Borwein, A. Guirao, P. H´ajek, and J. Vanderwerﬀ. Uniformly convex functions on banach  spaces. Proceedings of the American Mathematical Society, 137(3):1081-1091, 2009.  S. Boucheron, G. Lugosi, and P. Massart. Concentration inequalities: A nonasymptotic  theory of independence. Oxford University Press, 2013.  D. Burkholder. The best constant in the davis inequality for the expectation of the martin- gale square function. Transactions of the American Mathematical Society, 354(1):91-105, 2002.  N. Cesa-Bianchi and G. Lugosi. Prediction, Learning, and Games. Cambridge University  Press, 2006.  T. Cover. Behaviour of sequential predictors of binary sequences. In Proc. 4th Prague Conf.  Inform. Theory, Statistical Decision Functions, Random Processes, 1965.  V. H de la Pe˜na, T. L. Lai, and Q.-M. Shao. Self-normalized processes: Limit theory and  Statistical Applications. Springer, 2008.  D. Foster, A. Rakhlin, and K. Sridharan. Adaptive online learning, 2015. In Submission.  D. A Freedman. On tail probabilities for martingales.  the Annals of Probability, pages  E. Gin´e and J. Zinn. Some limit theorems for empirical processes. Annals of Probability,  100-118, 1975.  12(4):929-989, 1984.  14   Rakhlin Sridharan  Research is supported in part by the NSF under grants no. CDS&E-MSS 1521529 and 1521544.  Acknowledgements  References  J. Abernethy, A. Agarwal, P. Bartlett, and A. Rakhlin. A stochastic view of optimal regret In Proceedings of the 22th Annual Conference on Learning  through minimax duality. Theory, 2009.  B. Acciaio, M. Beiglbck, F. Penkner, W. Schachermayer, and J. Temme. A trajectorial interpretation of Doob’s martingale inequalities. Ann. Appl. Probab., 23(4):1494-1505, 08 2013. URL http://dx.doi.org/10.1214/12-AAP878.  M. Beiglb¨ock and M. Nutz. Martingale inequalities and deterministic counterparts. Electron.  M. Beiglb¨ock and P. Siorpaes. Pathwise versions of the burkholder-davis-gundy inequality.  J. Probab, 19(95):1-15, 2014.  Bernoulli, 21(1):360-373, 2015.  2015.  B. Bercu, B. Delyon, and E. Rio. Concentration inequalities for sums and martingales,  J. Borwein, A. Guirao, P. H´ajek, and J. Vanderwerﬀ. Uniformly convex functions on banach  spaces. Proceedings of the American Mathematical Society, 137(3):1081-1091, 2009.  S. Boucheron, G. Lugosi, and P. Massart. Concentration inequalities: A nonasymptotic  theory of independence. Oxford University Press, 2013.  D. Burkholder. The best constant in the davis inequality for the expectation of the martin- gale square function. Transactions of the American Mathematical Society, 354(1):91-105, 2002.  N. Cesa-Bianchi and G. Lugosi. Prediction, Learning, and Games. Cambridge University  Press, 2006.  T. Cover. Behaviour of sequential predictors of binary sequences. In Proc. 4th Prague Conf.  Inform. Theory, Statistical Decision Functions, Random Processes, 1965.  V. H de la Pe˜na, T. L. Lai, and Q.-M. Shao. Self-normalized processes: Limit theory and  Statistical Applications. Springer, 2008.  D. Foster, A. Rakhlin, and K. Sridharan. Adaptive online learning, 2015. In Submission.  D. A Freedman. On tail probabilities for martingales.  the Annals of Probability, pages  E. Gin´e and J. Zinn. Some limit theorems for empirical processes. Annals of Probability,  100-118, 1975.  12(4):929-989, 1984. On Equivalence of Martingale Tail Bounds and Deterministic Regret Inequalities  A. Gushchin. On pathwise counterparts of Doob’s maximal inequalities. Proceedings of the  Steklov Institute of Mathematics, 1(287):118-121, 2014.  D. Panchenko. Symmetrization approach to concentration inequalities for empirical pro-  cesses. Annals of Probability, 31(4):2068-2081, 2003.  I. Pinelis. Optimum bounds for the distributions of martingales in banach spaces. The  Annals of Probability, 22(4):1679-1706, 1994.  A. Rakhlin and K. Sridharan. On equivalence of martingale tail bounds and deterministic  regret inequalities. arXiv preprint arXiv:1510.03925, 2015.  A. Rakhlin and K. Sridharan. A tutorial on online supervised learning with applications to node classification in social networks. CoRR, abs/1608.09014, 2016. URL http: //arxiv.org/abs/1608.09014.  A. Rakhlin, K. Sridharan, and A. Tewari. Online learning: Random averages, combinatorial parameters, and learnability. Advances in Neural Information Processing Systems 23, pages 1984-1992, 2010.  A. Rakhlin, K. Sridharan, and A. Tewari. Online learning via sequential complexities.  Journal of Machine Learning Research, 2014.  N. Srebro, K. Sridharan, and A. Tewari. On the universality of online mirror descent. In  NIPS, pages 2645-2653, 2011.  A. W. Van Der Vaart and J. A. Wellner. Weak Convergence and Empirical Processes: With  Applications to Statistics. Springer Series, March 1996."}