{"1": "A.M. was partially supported by the NSF grant CCF-1319979 and DMS-1613091. S.M. was sup- ported by Office of Technology Licensing Stanford Graduate Fellowship.  Emmanuel Abbe, Afonso S Bandeira, and Georgina Hall. Exact recovery in the stochastic block  model. IEEE Transactions on Information Theory, 62(1):471-487, 2016.  P-A Absil, Christopher G Baker, and Kyle A Gallivan. Trust-region methods on Riemannian mani-  folds. Foundations of Computational Mathematics, 7(3):303-330, 2007.  Greg W Anderson, Alice Guionnet, and Ofer Zeitouni. An introduction to random matrices, volume  118. Cambridge university press, 2010.  Mica Arie-Nachimson, Shahar Z Kovalsky, Ira Kemelmacher-Shlizerman, Amit Singer, and Ronen In 3D Imaging, Modeling, Processing, Basri. Global motion estimation from point matches. Visualization and Transmission (3DIMPVT), 2012 Second International Conference on, pages 81-88. IEEE, 2012.  33   SOLVING SDPS VIA THE GROTHENDIECK INEQUALITY  Case 2. Then, we consider the case where we set µG = F  gradf (σ) (cid:107) of gradient steps. According to Lemma 10, we have  F > µG, and use the eigen-step as (cid:107)  gradf (σ) (cid:107)  (cid:107)  A  (cid:107) ≤  2, and we use the gradient step as (cid:107) µG. First let us bound the number  µ2 G A (cid:107) Hence, we deduce the upper bound TG  40 (cid:107)  TG  g(σ0)  g(σT )  Rg(A).  1 ≤  −  ≤  2 2. Then let us bound the number of eigen-steps. Let us denote  and the subsets of indices corresponding to eigensteps with respectively λH λH < 3  1). According to Lemma 12, we have for all t  1Rg(A)/  A (cid:107)· (cid:107)  ≤  A  I  (cid:107)  (cid:107)  A (cid:107)  2 A 2/(2 (cid:107)  (cid:107)  (cid:107)  1 g(σt+1) −1 A  g(σt) g(σt+1) ≥  g(σt) ≥  864 (cid:107)  1n2 (cid:107)  ∈ J 1 A  864 (cid:107)  1n2 , (cid:107)  whereas for t  ∈ I 1 g(σt+1)2 −2 2n3 (cid:107) (cid:107) Summing the contributions of the above two equations gives the convergence rate  g(σt)2 ≥576  ≥  (cid:19)  (cid:18)  (cid:107)  1 A  g(σt) g(σt+1)  +  g(σt)2 g(σt+1)2  1 A (cid:107)2n3 .  0, 1, . . . , T  J ⊂ { A 3 (cid:107) ≥  2 A 2/(2 (cid:107)  (cid:107)  1 − } 1) and (cid:107)  g(σT )  c  max  ≤  ·  A  1 (cid:107)  (cid:107) (cid:18)  n2 T  ,  A  2n (cid:107)  (cid:107)  (cid:114)  (cid:19)  n T  ≤  This guarantees that g(σT )  nε/2 as soon as T  ≥  for some universal constant ˜c.  for a universal constant c. 2/ε2, 2 1/ε ˜c  n max  A (cid:107)  (cid:107)  ·  A (cid:107)  (cid:107)  (cid:0)  (cid:1)  Acknowledgements  References  A.M. was partially supported by the NSF grant CCF-1319979 and DMS-1613091. S.M. was sup- ported by Office of Technology Licensing Stanford Graduate Fellowship.  Emmanuel Abbe, Afonso S Bandeira, and Georgina Hall. Exact recovery in the stochastic block  model. IEEE Transactions on Information Theory, 62(1):471-487, 2016.  P-A Absil, Christopher G Baker, and Kyle A Gallivan. Trust-region methods on Riemannian mani-  folds. Foundations of Computational Mathematics, 7(3):303-330, 2007.  Greg W Anderson, Alice Guionnet, and Ofer Zeitouni. An introduction to random matrices, volume  118. Cambridge university press, 2010.  Mica Arie-Nachimson, Shahar Z Kovalsky, Ira Kemelmacher-Shlizerman, Amit Singer, and Ronen In 3D Imaging, Modeling, Processing, Basri. Global motion estimation from point matches. Visualization and Transmission (3DIMPVT), 2012 Second International Conference on, pages 81-88. IEEE, 2012. MEI MISIAKIEWICZ MONTANARI OLIVEIRA  Sanjeev Arora and Satyen Kale. A combinatorial, primal-dual approach to semidefinite programs. In Proceedings of the thirty-ninth annual ACM symposium on Theory of computing, pages 227- 236. ACM, 2007.  Sanjeev Arora, Elad Hazan, and Satyen Kale. Fast algorithms for approximate semidefinite pro- gramming using the multiplicative weights update method. In Foundations of Computer Science, 2005. FOCS 2005. 46th Annual IEEE Symposium on, pages 339-348. IEEE, 2005.  Sanjeev Arora, Elad Hazan, and Satyen Kale. The multiplicative weights update method: a meta-  algorithm and applications. Theory of Computing, 8(1):121-164, 2012.  Jinho Baik, G´erard Ben Arous, Sandrine P´ech´e, et al. Phase transition of the largest eigenvalue for nonnull complex sample covariance matrices. The Annals of Probability, 33(5):1643-1697, 2005.  Afonso S Bandeira, Moses Charikar, Amit Singer, and Andy Zhu. Multireference alignment using semidefinite programming. In Proceedings of the 5th conference on Innovations in theoretical computer science, pages 459-470. ACM, 2014.  Afonso S Bandeira, Nicolas Boumal, and Vladislav Voroninski. On the low-rank approach for arXiv preprint  semidefinite programs arising in synchronization and community detection. arXiv:1602.04426, 2016.  Alexander I. Barvinok. Problems of distance geometry and convex properties of quadratic maps.  Discrete & Computational Geometry, 13(2):189-202, 1995.  Nicolas Boumal. A Riemannian low-rank method for optimization over semidefinite matrices with  block-diagonal constraints. arXiv:1506.00575, 2015.  Nicolas Boumal, Vlad Voroninski, and Afonso Bandeira. The non-convex burer-monteiro approach works on smooth semidefinite programs. In Advances in Neural Information Processing Systems, pages 2757-2765, 2016.  Samuel Burer and Renato DC Monteiro. A nonlinear programming algorithm for solving semidefi- nite programs via low-rank factorization. Mathematical Programming, 95(2):329-357, 2003.  Yash Deshpande, Emmanuel Abbe, and Andrea Montanari. Asymptotic mutual information for the  two-groups stochastic block model. arXiv preprint arXiv:1507.08685, 2015.  Joel Friedman. A proof of alon’s second eigenvalue conjecture. In Proceedings of the thirty-fifth  annual ACM symposium on Theory of computing, pages 720-724. ACM, 2003.  Dan Garber and Elad Hazan. Approximating semidefinite programs in sublinear time. In Advances  in Neural Information Processing Systems, pages 1080-1088, 2011.  Michel X Goemans and David P Williamson. Improved approximation algorithms for maximum cut and satisfiability problems using semidefinite programming. Journal of the ACM (JACM), 42 (6):1115-1145, 1995. SOLVING SDPS VIA THE GROTHENDIECK INEQUALITY  Alexander Grothendieck. R´esum´e de la th´eorie m´etrique des produits tensoriels topologiques. Re- senhas do Instituto de Matem´atica e Estat´ıstica da Universidade de S˜ao Paulo, 2(4):401-481, 1996.  Olivier Gu´edon and Roman Vershynin. Community detection in sparse networks via grothendiecks  inequality. Probability Theory and Related Fields, 165(3-4):1025-1049, 2016.  Bruce Hajek, Yihong Wu, and Jiaming Xu. Achieving exact cluster recovery threshold via semidef-  inite programming. IEEE Transactions on Information Theory, 62(5):2788-2797, 2016.  Adel Javanmard, Andrea Montanari, and Federico Ricci-Tersenghi. Phase transitions in semidefinite relaxations. Proceedings of the National Academy of Sciences, 113(16):E2218-E2223, 2016.  Iain M Johnstone. On the distribution of the largest eigenvalue in principal components analysis.  Annals of statistics, pages 295-327, 2001.  Subhash Khot and Assaf Naor. Grothendieck-type inequalities in combinatorial optimization. Com-  munications on Pure and Applied Mathematics, 65(7):992-1035, 2012.  Subhash Khot, Guy Kindler, Elchanan Mossel, and Ryan O’Donnell. Optimal inapproximability results for max-cut and other 2-variable csps? SIAM Journal on Computing, 37(1):319-357, 2007.  Satish Babu Korada and Nicolas Macris. Exact solution of the gauge symmetric p-spin glass model  on a complete graph. Journal of Statistical Physics, 136(2):205-230, 2009.  J Kuczy´nski and H Wo´zniakowski. Estimating the largest eigenvalue by the power and lanczos algorithms with a random start. SIAM journal on matrix analysis and applications, 13(4):1094- 1122, 1992.  Laurent Massouli´e. Community detection thresholds and the weak ramanujan property. In Pro- ceedings of the 46th Annual ACM Symposium on Theory of Computing, pages 694-703. ACM, 2014.  Ankur Moitra, William Perry, and Alexander S Wein. How robust are reconstruction thresholds for community detection? In Proceedings of the 48th Annual ACM SIGACT Symposium on Theory of Computing, pages 828-841. ACM, 2016.  Andrea Montanari. A Grothendieck-type inequality for local maxima. arXiv:1603.04064, 2016.  Andrea Montanari and Subhabrata Sen. Semidefinite programs on sparse random graphs and their application to community detection. In Proceedings of the 48th Annual ACM SIGACT Symposium on Theory of Computing, pages 814-827. ACM, 2016.  Elchanan Mossel, Joe Neeman, and Allan Sly. A proof of the block model threshold conjecture.  arXiv:1311.4115, 2013.  Elchanan Mossel, Joe Neeman, and Allan Sly. Reconstruction and estimation in the planted partition  model. Probability Theory and Related Fields, 162(3-4):431-461, 2015. MEI MISIAKIEWICZ MONTANARI OLIVEIRA  Yurii Nesterov. Introductory lectures on convex optimization: A basic course, volume 87. Springer  Science &amp; Business Media, 2013.  G´abor Pataki. On the rank of extreme matrices in semidefinite programs and the multiplicity of  optimal eigenvalues. Mathematics of operations research, 23(2):339-358, 1998.  Amit Singer. Angular synchronization by eigenvectors and semidefinite programming. Applied and  computational harmonic analysis, 30(1):20-36, 2011.  Amit Singer and Yoel Shkolnisky. Three-dimensional structure determination from common lines in cryo-em by eigenvectors and semidefinite programming. SIAM journal on imaging sciences, 4 (2):543-572, 2011.  David Steurer. Fast sdp algorithms for constraint satisfaction problems.  In Proceedings of the twenty-first annual ACM-SIAM symposium on Discrete Algorithms, pages 684-697. SIAM, 2010."}