{"1": "Miklos Ajtai, J´anos Komlos, William L Steiger, and Endre Szemer´edi. Deterministic selection in  o(log log n) parallel time. In STOC, 1986.  Noga Alon and Yossi Azar. Sorting, approximate sorting, and searching in rounds. SIAM J. Discrete  Math., 1(3):269-280, 1988.  streams. In SODA, 2017.  COLT, 2010.  Sepehr Assadi, Sanjeev Khanna, and Yang Li. On estimating maximum matching size in graph  Jean-Yves Audibert and S´ebastien Bubeck. Best Arm Identification in Multi-Armed Bandits. In  B´ela Bollob´as and Graham Brightwell. Parallel selection with high probability. SIAM Journal on  Discrete Mathematics, 3(1):21-31, 1990.  B´ela Bollob´as and Andrew Thomason. Parallel sorting. Discrete Applied Mathematics, 6(1):1-11,  1983.  Mark Braverman, Jieming Mao, and S. Matthew Weinberg. Parallel Algorithms for Select and  Partition with Noisy Comparisons. In STOC, 2016.  S´ebastien Bubeck, Tengyao Wang, and Nitin Viswanathan. Multiple identifications in multi-armed  bandits. In ICML, 2013.  R´obert Busa-Fekete, B. Szorenyi, Weiwei Cheng, Paul Weng, and E. Hullermeier. Top-k selection  based on adaptive sampling of noisy preferences. In ICML, 2013.  Karthekeyan Chandrasekaran and Richard Karp. Finding a most biased coin with fewest ﬂips. In  Journal of Machine Learning Research, volume 35, pages 394-407, 2014.  Lijie Chen and Jian Li. On the Optimal Sample Complexity for Best Arm Identification. arXiv  preprint arXiv:1511.03774, 2015. URL http://arxiv.org/abs/1511.03774.  Lijie Chen, Jian Li, and Mingda Qiao. Nearly Instance Optimal Sample Complexity Bounds for Top-k Arm Selection. arXiv preprint arXiv:1702.03605, 2017. URL https://arxiv.org/ abs/1702.03605.  Yuxin Chen and Changho Suh. Spectral MLE: Top-k rank aggregation from pairwise comparisons.  In ICML, 2015.  Herman Chernoff. Sequential analysis and optimal design. SIAM, 1972.  Richard Cole. Parallel merge sort. SIAM J. Comput., 17(4):770-785, 1988.  Thomas M. Cover and Joy A. Thomas. Elements of information theory (2. ed.). Wiley, 2006. ISBN  978-0-471-24195-9.  Susan Davidson, Sanjeev Khanna, Tova Milo, and Sudeepa Roy. Top-k and clustering with noisy  comparisons. ACM Transactions on Database Systems (TODS), 39(4):35, 2014.  15   LEARNING WITH LIMITED ROUNDS OF ADAPTIVITY  References  Miklos Ajtai, J´anos Komlos, William L Steiger, and Endre Szemer´edi. Deterministic selection in  o(log log n) parallel time. In STOC, 1986.  Noga Alon and Yossi Azar. Sorting, approximate sorting, and searching in rounds. SIAM J. Discrete  Math., 1(3):269-280, 1988.  streams. In SODA, 2017.  COLT, 2010.  Sepehr Assadi, Sanjeev Khanna, and Yang Li. On estimating maximum matching size in graph  Jean-Yves Audibert and S´ebastien Bubeck. Best Arm Identification in Multi-Armed Bandits. In  B´ela Bollob´as and Graham Brightwell. Parallel selection with high probability. SIAM Journal on  Discrete Mathematics, 3(1):21-31, 1990.  B´ela Bollob´as and Andrew Thomason. Parallel sorting. Discrete Applied Mathematics, 6(1):1-11,  1983.  Mark Braverman, Jieming Mao, and S. Matthew Weinberg. Parallel Algorithms for Select and  Partition with Noisy Comparisons. In STOC, 2016.  S´ebastien Bubeck, Tengyao Wang, and Nitin Viswanathan. Multiple identifications in multi-armed  bandits. In ICML, 2013.  R´obert Busa-Fekete, B. Szorenyi, Weiwei Cheng, Paul Weng, and E. Hullermeier. Top-k selection  based on adaptive sampling of noisy preferences. In ICML, 2013.  Karthekeyan Chandrasekaran and Richard Karp. Finding a most biased coin with fewest ﬂips. In  Journal of Machine Learning Research, volume 35, pages 394-407, 2014.  Lijie Chen and Jian Li. On the Optimal Sample Complexity for Best Arm Identification. arXiv  preprint arXiv:1511.03774, 2015. URL http://arxiv.org/abs/1511.03774.  Lijie Chen, Jian Li, and Mingda Qiao. Nearly Instance Optimal Sample Complexity Bounds for Top-k Arm Selection. arXiv preprint arXiv:1702.03605, 2017. URL https://arxiv.org/ abs/1702.03605.  Yuxin Chen and Changho Suh. Spectral MLE: Top-k rank aggregation from pairwise comparisons.  In ICML, 2015.  Herman Chernoff. Sequential analysis and optimal design. SIAM, 1972.  Richard Cole. Parallel merge sort. SIAM J. Comput., 17(4):770-785, 1988.  Thomas M. Cover and Joy A. Thomas. Elements of information theory (2. ed.). Wiley, 2006. ISBN  978-0-471-24195-9.  Susan Davidson, Sanjeev Khanna, Tova Milo, and Sudeepa Roy. Top-k and clustering with noisy  comparisons. ACM Transactions on Database Systems (TODS), 39(4):35, 2014. AGARWAL AGARWAL ASSADI KHANNA  Eyal Even-Dar, Shie Mannor, and Yishay Mansour. PAC Bounds for Multi-Armed Bandit and  Markov Decision Processes. In COLT, 2002.  Eyal Even-Dar, Shie Mannor, and Yishay Mansour. Action elimination and stopping conditions for the multi-armed bandit and reinforcement learning problems. Journal of Machine Learning Research, 7:1079-1105, 2006.  Uriel Feige, Prabhakar Raghavan, David Peleg, and Eli Upfal. Computing with Noisy Information.  SIAM Journal on Computing, 23(5):1001-1018, 1994. doi: 10.1137/S0097539791195877.  Victor Gabillon, Mohammad Ghavamzadeh, and Alessandro Lazaric. Best arm identification: A  unified approach to fixed budget and fixed confidence. In NIPS, 2012.  Alison L Gibbs and Francis Edward Su. On choosing and bounding probability metrics. Interna-  tional statistical review, 70(3):419-435, 2002.  David F Gleich and Lek-heng Lim. Rank aggregation via nuclear norm minimization. In KDD,  pages 60-68, 2011.  Reinhard Heckel, Nihar B. Shah, Kannan Ramchandran, and Martin J Wainwright. Active Rank- ing from Pairwise Comparisons and when Parametric Assumptions Dont Help. arXiv preprint arXiv:1606.08842, 2016. URL http://arxiv.org/abs/1606.08842.  Eshcar Hillel, Zohar Shay Karnin, Tomer Koren, Ronny Lempel, and Oren Somekh. Distributed  exploration in multi-armed bandits. In NIPS, 2013.  Kevin Jamieson, Matthew Malloy, Robert Nowak, and Sebastien Bubeck. On Finding the Largest Mean Among Many. arXiv preprint arXiv:1306.3917v1, 2013. URL http://arxiv.org/ abs/1306.3917.  Kevin Jamieson, Daniel Haas, and Ben Recht. The Power of Adaptivity in Identifying Statistical  Alternatives. In NIPS, 2016.  2011.  Kevin G Jamieson and Robert D. Nowak. Active Ranking using Pairwise Comparisons. In NIPS,  Minje Jang, Sunghyun Kim, Changho Suh, and Sewoong Oh. Top-k Ranking from Pairwise Com- parisons: When Spectral Ranking is Optimal. arXiv preprint arXiv:1603.04153, 2016. URL http://arxiv.org/abs/1603.04153.  Kwang-Sung Jun, Kevin Jamieson, Robert Nowak, and Xiaojin Zhu. Top Arm Identification in  Multi-Armed Bandits with Batch Arm Pulls. In AISTATS, 2016.  Shivaram Kalyanakrishnan and Peter Stone. Efficient Selection of Multiple Bandit Arms: Theory  and Practice. In ICML, 2010.  Shivaram Kalyanakrishnan, Ambuj Tewari, Peter Auer, and Peter Stone. PAC Subset Selection in  Stochastic Multi-armed Bandits. In ICML, 2012.  Zohar Karnin, Tomer Koren, and Oren Somekh. Almost Optimal Exploration in Multi-Armed  Bandits. In ICML, 2013. LEARNING WITH LIMITED ROUNDS OF ADAPTIVITY  Richard M. Karp and Robert Kleinberg. Noisy binary search and its applications. In SODA, 2007.  Emilie Kaufmann, Olivier Capp´e, and Aurlien Garivier. On the Complexity of Best-Arm Identifi- cation in Multi-Armed Bandit Models. Journal of Machine Learning Research, 17:1-42, 2016.  Matthew L Malloy, Gongguo Tang, and Robert D. Nowak. Quickest search for a rare distribution.  In Information Sciences and Systems (CISS). IEEE, 2012.  Shie Mannor and John N Tsitsiklis. The Sample Complexity of Exploration in the Multi-Armed  Bandit Problem. Journal of Machine Learning Research, 5:623-648, 2004.  Sahand Negahban, Sewoong Oh, and Devavrat Shah. Iterative ranking from pair-wise comparisons.  In NIPS, 2012.  lems. In COLT, 2015.  Vianney Perchet, Philippe Rigollet, Sylvain Chassang, and Erik Snowberg. Batched bandit prob-  Nicholas Pippenger. Sorting and selecting in rounds. SIAM J. Comput., 16(6):1032-1038, 1987.  Arun Rajkumar and Shivani Agarwal. A statistical convergence perspective of algorithms for rank  aggregation from pairwise data. In ICML, 2014.  Nihar B. Shah and Martin J. Wainwright. Simple, Robust and Optimal Ranking from Pairwise Comparisons. arXiv preprint arXiv:1512.08949, 2015. URL http://arxiv.org/abs/ 1512.08949.  Leslie G. Valiant. Parallelism in comparison problems. SIAM Journal on Computing, 4(3):348-355,  1975. AGARWAL AGARWAL ASSADI KHANNA"}