{"1": "Rakesh Agrawal and Ramakrishnan Srikant. Fast algorithms for mining association rules. In Proc. 20th Int’l Conf. Very Large Data Bases, (VLDB), pages 487-499. Morgan Kauf- mann, 1994.  Rakesh Agrawal, Tomasz Imielinski, and Arun Swami. Mining association rules between sets of items in large databases. In Proc. ACM SIGMOD Int’l Conf. on Management of Data, pages 207-216, 1993.  Olivier Bousquet and Andr´e Elisseeﬀ. Stability and generalization. Journal of Machine  Learning Research, 2:499-526, 2002.  John S. Breese, David Heckerman, and Carl Myers Kadie. Empirical analysis of predictive algorithms for collaborative filtering. In Proc. Uncertainty in Artificial Intelligence (UAI), pages 43-52, 1998.  Edith Cohen, Mayur Datar, Shinji Fujiwara, Aristides Gionis, Piotr Indyk, Rajeev Motwani, Jeﬀrey D. Ullman, and Cheng Yang. Finding interesting associations without support pruning. IEEE Trans. Knowl. Data Eng., 13(1):64-78, 2001.  Michelle Keim Condliﬀ, David D. Lewis, David Madigan, and Christian Posse. Bayesian mixed-eﬀects models for recommender systems. In ACM SIGIR Workshop on Recom- mender Systems: Algorithms and Evaluation, 1999.  Luc Devroye and T. J. Wagner. Distribution-free performance bounds for potential function  rules. IEEE Transactions on Information Theory, 25(5):601-604, 1979.  632   Rudin Letham Salleb-Aouissi Kogan Madigan  where we allow the predictions to alter the sequence in which items are placed into the basket (Letham et al., 2011).  6. Conclusion  This work synthesizes tools from several fields to analyze association rules in a supervised learning framework. This analysis is necessarily diﬀerent from that of classical supervised learning analysis; association rules provide two mechanisms for generalization: a large sam- ple, and a minimum support of rules. We considered two simple algorithms, both that create a bound on the support, regulating a tradeoﬀ between accuracy on the training set and generalization ability. We have also demonstrated that the adjusted confidence intro- duced here has several advantages over the minimum support threshold that is commonly considered in association rule mining.  Acknowledgments  C. Rudin is also at the Center for Computational Learning Systems, Columbia University. This work was performed partly while E. Kogan was at Fresh Direct. We would like to acknowledge support for this project from the National Science Foundation under grant IIS-1053407.  References  Rakesh Agrawal and Ramakrishnan Srikant. Fast algorithms for mining association rules. In Proc. 20th Int’l Conf. Very Large Data Bases, (VLDB), pages 487-499. Morgan Kauf- mann, 1994.  Rakesh Agrawal, Tomasz Imielinski, and Arun Swami. Mining association rules between sets of items in large databases. In Proc. ACM SIGMOD Int’l Conf. on Management of Data, pages 207-216, 1993.  Olivier Bousquet and Andr´e Elisseeﬀ. Stability and generalization. Journal of Machine  Learning Research, 2:499-526, 2002.  John S. Breese, David Heckerman, and Carl Myers Kadie. Empirical analysis of predictive algorithms for collaborative filtering. In Proc. Uncertainty in Artificial Intelligence (UAI), pages 43-52, 1998.  Edith Cohen, Mayur Datar, Shinji Fujiwara, Aristides Gionis, Piotr Indyk, Rajeev Motwani, Jeﬀrey D. Ullman, and Cheng Yang. Finding interesting associations without support pruning. IEEE Trans. Knowl. Data Eng., 13(1):64-78, 2001.  Michelle Keim Condliﬀ, David D. Lewis, David Madigan, and Christian Posse. Bayesian mixed-eﬀects models for recommender systems. In ACM SIGIR Workshop on Recom- mender Systems: Algorithms and Evaluation, 1999.  Luc Devroye and T. J. Wagner. Distribution-free performance bounds for potential function  rules. IEEE Transactions on Information Theory, 25(5):601-604, 1979. Sequential Event Prediction with Association Rules  William DuMouchel and Daryl Pregibon. Empirical bayes screening for multi-item associa- tions. In Proc. ACM SIGKDD Int’l Conf. on Knowl. Discovery and Data Mining, pages 67-76, 2001.  A. Frank and A. Asuncion. UCI machine learning repository, 2010. URL http://archive.  ics.uci.edu/ml.  Xiangji Huang, Aijun An, Nick Cercone, and Gary Promhouse. Discovery of interesting association rules from Livelink web log data. In Proc. IEEE Int’l Conf. on Data Mining (ICDM), 2002.  Xiang-Rong Jiang and Le Gruenwald. Microarray gene expression data association rules  mining based on BSC-tree and FIS-tree. Data & Knowl. Eng., 53(1):3-29, 2005.  Yun Sing Koh. Mining non-coincidental rules without a user defined support threshold. In Advances in Knowl. Discovery and Data Mining, 12th Pacific-Asia Conf., (PAKDD), pages 910-915, 2008.  Ron Kohavi, Llew Mason, Rajesh Parekh, and Zijian Zheng. Lessons and challenges from  mining retail e-commerce data. Machine Learning, 57(1-2):83-113, 2004.  R.D. Lawrence, G.S. Almasi, V. Kotlyar, M.S. Viveros, and S.S. Duri. Personalization of supermarket product recommendations. Data Mining and Knowledge Discovery, 5(1-2): 11-32, 2001.  Ben Letham, Cynthia Rudin, and David Madigan. A supervised ranking approach to  sequential event prediction. In Preparation, 2011.  Jinyan Li, Xiuzhen Zhang, Guozhu Dong, Kotagiri Ramamohanarao, and Qun Sun. Eﬃcient mining of high confidence association rules without support thresholds. In Proc. Principles of Data Mining and Knowledge Discovery (PKDD), pages 406-411, 1999.  Weiyang Lin, Sergio A. Alvarez, and Carolina Ruiz. Eﬃcient adaptive-support association rule mining for recommender systems. Data Mining and Knowledge Discovery, 6(1): 83-105, 2002.  Bing Liu, Wynne Hsu, and Yiming Ma.  Integrating classification and association rule mining. In Proceedings of the 4th International Conference on Knowledge Discovery and Data Mining (KDD), 1998.  Tyler McCormick, Cynthia Rudin, and David Madigan. A hierarchical model for association rule mining of sequential events: An approach to automated medical symptom prediction. SSRN eLibrary, 2011. URL http://ssrn.com/paper=1736062.  W. H. Rogers and T. J. Wagner. A finite sample distribution-free performance bound for  local discrimination rules. Annals of Statistics, 6(3):506-514, 1978.  Cynthia Rudin, Benjamin Letham, Eugene Kogan, and David Madigan. A learning theory  framework for association rules and sequential events. In Preparation, 2011. Rudin Letham Salleb-Aouissi Kogan Madigan  Adriano Veloso, Humberto Mossri de Almeida, Marcos Andr´e Gon¸calves, and Wagner Meira Jr. Learning to rank at query-time using association rules. In Proc. Int’l ACM SIGIR Conf. on Research and Development in Information Retrieval, pages 267-274, 2008.  Ke Wang, Yu He, David W. Cheung, and Francis Y. L. Chin. Mining confident rules without support requirement. In Proc. Conf. on Information and Knowledge Management (CIKM), pages 89-96, 2001."}