{"1": "E. Abbe, A. S. Bandeira, A. Bracher, and A. Singer. Linear inverse problems on Erd˝os-R´enyi graphs: Information-theoretic limits and efficient recovery. IEEE International Symposium on Information Theory (ISIT2014), to appear, 2014.  D. Amelunxen and P. B¨urgisser. Intrinsic volumes of symmetric cones and applications in convex  programming. Mathematical Programming, pages 1-26, 2014.  A. S. Bandeira, C. Kennedy, and A. Singer. Approximating the little grothendieck problem over the  orthogonal and unitary groups. Available online at arXiv:1308.5207 [cs.DS], 2013.  A. S. Bandeira, M. Charikar, A. Singer, and A. Zhu. Multireference alignment using semidefinite  programming. 5th Innovations in Theoretical Computer Science (ITCS 2014), 2014.  E. J. Candes and T. Tao. The power of convex relaxation: Near-optimal matrix completion. Infor-  mation Theory, IEEE Transactions on, 56(5):2053-2080, May 2010.  K. N. Chaudhury, Y. Khoo, and A. Singer. Global registration of multiple point clouds using  semidefinite programming. arXiv:1306.5226 [cs.CV], 2013.  A. Nemirovski. Sums of random symmetric matrices and quadratic optimization under orthogonal-  ity constraints. Math. Program., 109(2-3):283-317, 2007.  O. Ozyesil, A. Singer, and R. Basri. Camera motion estimation by convex programming. Available  online at http://arxiv.org/abs/1312.5047 [cs.CV], 2013.  3  00.250.50.75100.20.40.60.81σp00.250.50.75100.20.40.60.81σp OPEN PROBLEM: TIGHTNESS OF MAXIMUM LIKELIHOOD SEMIDEFINITE RELAXATIONS  Figure 1: Fraction of trials (among 100) on which rank recovery was observed, for various values of noise σ. The left plot corresponds to the Procrustes problem (setting of Conjecture 1) when d = 3, n = 20, m = 30 and the right plot corresponds to the multi reference alignment problem treated in Bandeira et al. (2014). Both plots suggest that rank recovery happens with high probability, below certain noise levels.  The multireference alignment consists in estimating a d-dimensional signal by observing n shifted noisy copies of it. For the sake of brevity, we will not describe the problem or the SDP based relaxation here (and refer the reader to Bandeira et al. (2014)) but take the opportunity to con- jecture that a similar phenomenon happens: Below a certain noise level the solution to SDP-based relaxation in Bandeira et al. (2014) has rank d, thus matching the quasi-MLE. Although not going into details, we note that the SDP for this problem is considerably different than (3), in particular, it has Ω (cid:0)n2d2(cid:1) positivity constraints. Also, this problem is discrete and so exact recovery is possible. However, exact recovery can be shown to be only possible for asymptotically vanishing levels of noise and here we conjecture rank recovery happens for a constant level of noise.  References  E. Abbe, A. S. Bandeira, A. Bracher, and A. Singer. Linear inverse problems on Erd˝os-R´enyi graphs: Information-theoretic limits and efficient recovery. IEEE International Symposium on Information Theory (ISIT2014), to appear, 2014.  D. Amelunxen and P. B¨urgisser. Intrinsic volumes of symmetric cones and applications in convex  programming. Mathematical Programming, pages 1-26, 2014.  A. S. Bandeira, C. Kennedy, and A. Singer. Approximating the little grothendieck problem over the  orthogonal and unitary groups. Available online at arXiv:1308.5207 [cs.DS], 2013.  A. S. Bandeira, M. Charikar, A. Singer, and A. Zhu. Multireference alignment using semidefinite  programming. 5th Innovations in Theoretical Computer Science (ITCS 2014), 2014.  E. J. Candes and T. Tao. The power of convex relaxation: Near-optimal matrix completion. Infor-  mation Theory, IEEE Transactions on, 56(5):2053-2080, May 2010.  K. N. Chaudhury, Y. Khoo, and A. Singer. Global registration of multiple point clouds using  semidefinite programming. arXiv:1306.5226 [cs.CV], 2013.  A. Nemirovski. Sums of random symmetric matrices and quadratic optimization under orthogonal-  ity constraints. Math. Program., 109(2-3):283-317, 2007.  O. Ozyesil, A. Singer, and R. Basri. Camera motion estimation by convex programming. Available  online at http://arxiv.org/abs/1312.5047 [cs.CV], 2013.00.250.50.75100.20.40.60.81σp00.250.50.75100.20.40.60.81σp"}