{"1": "N. Alon, M. Krivelevich, and V. H. Vu. On the concentration of eigenvalues of random symmetric  matrices. Israel Journal of Mathematics, 131:259-267, 2002.  E. Arias-Castro and N. Verzelen. Community detection in dense random networks. Annals of  Statistics, 42(3):940-969, 2014.  J. Banks, C. Moore, N. Verzelen, R. Vershynin, and J. Xu.  Information-theoretic bounds and phase transitions in clustering, sparse PCA, and submatrix localization. ArXiv preprint, arXiv:1607.05222v2:1-36, 2016.  Y. Baraud. Non-asymptotic minimax rates of testing in signal detection. Bernoulli, 8(5):577-606,  2002.  B. Bollobas, S. Janson, and O. Riordan. The phase transition in inhomogeneous random graphs.  Random Structures and Algorithms, 31(3):122, 2007.  G. Bounova and O. de Weck. Overview of metrics and their correlation patterns for multiple-metric topology analysis on heterogeneous graph ensembles. Physical Review E, 85:016117, 2012.  S. Bubeck, J. Ding, R. Eldan, and M. Z. R´acz. Testing for high-dimensional geometry in random  graphs. Random Structures & Algorithms, 49(3):503-532, 2016.  23   TWO-SAMPLE TESTS FOR RANDOM GRAPHS  concentrate for generic model classes. For instance, concentration of functions like clustering coefficient and modularity in combination with our results will help to theoretically validate various claims about properties of brain networks.  • Bootstrapped variant of proposed two-sample test  The proposed test primarily relies on concentration of the test statistic (5) under the null and alternative hypotheses. It is often observed that the practical performance of concentration based tests can be improved by using bootstrapped variants (Gretton et al., 2012; Tang et al., 2017). In the present context, we feel that bootstrapping can help to achieve low error rate even for smaller and sparser graphs.  However, bootstrapping is a challenging problem in the present setting. Gretton et al. (2012) consider a large population problem, where random mixing of the two population helps to estimate the null distribution for the test statistic. Tang et al. (2017) deal with the two graph setting, but the assumption that the graphs are generated from RDPG model allows parameter estimation, which in turn, aids in generating bootstrapped samples from the estimated models. It would be interesting to come up with bootstrapping procedures without such assumptions.  The work of D. Ghoshdastidar and U. von Luxburg is supported by the German Research Foundation (Research Unit 1735) and the Institutional Strategy of the University of T¨ubingen (DFG, ZUK 63). The work of M. Gutzeit and A. Carpentier is supported by the Deutsche Forschungsgemeinschaft (DFG) Emmy Noether grant MuSyAD (CA 1488/1-1).  Acknowledgments  References  N. Alon, M. Krivelevich, and V. H. Vu. On the concentration of eigenvalues of random symmetric  matrices. Israel Journal of Mathematics, 131:259-267, 2002.  E. Arias-Castro and N. Verzelen. Community detection in dense random networks. Annals of  Statistics, 42(3):940-969, 2014.  J. Banks, C. Moore, N. Verzelen, R. Vershynin, and J. Xu.  Information-theoretic bounds and phase transitions in clustering, sparse PCA, and submatrix localization. ArXiv preprint, arXiv:1607.05222v2:1-36, 2016.  Y. Baraud. Non-asymptotic minimax rates of testing in signal detection. Bernoulli, 8(5):577-606,  2002.  B. Bollobas, S. Janson, and O. Riordan. The phase transition in inhomogeneous random graphs.  Random Structures and Algorithms, 31(3):122, 2007.  G. Bounova and O. de Weck. Overview of metrics and their correlation patterns for multiple-metric topology analysis on heterogeneous graph ensembles. Physical Review E, 85:016117, 2012.  S. Bubeck, J. Ding, R. Eldan, and M. Z. R´acz. Testing for high-dimensional geometry in random  graphs. Random Structures & Algorithms, 49(3):503-532, 2016. GHOSHDASTIDAR GUTZEIT CARPENTIER LUXBURG  A. Carpentier and R. Nickl. On signal detection and confidence sets for low rank inference problems.  Electronic Journal of Statistics, 9(2):2675-2688, 2015.  S. Chatterjee. Matrix estiamtion via universal singular value thresholding. Annals of Statistics, 43  (1):177-214, 2012.  Y. Chen and J. Xu. Statistical-computational tradeoffs in planted problems and submatrix localiza- tion with a growing number of clusters and submatrices. Journal of Machine Learning Research, 17(27):1-57, 2016.  F. R. K. Chung. Spectral graph theory, volume 92. American Mathematical Society, 1997.  O. Collier. Minimax hypothesis testing for curve registration. In AISTATS, 2012.  A. Gretton, K. M. Borgwardt, M. J. Rasch, B. Sch¨olkopf, and A. Smola. A kernel two-sample test.  Journal of Machine Learning Research, 13:723-733, 2012.  Y. I. Ingster and I. A. Suslina. Minimax nonparametric hypothesis testing for ellipsoids and Besov  bodies. ESAIM: Probability and Statistics, 4:53-135, 2000.  F. Klimm, D. S. Bassett, J. M. Carlson, and P. J. Mucha. Resolving structural variability in network  models and the brain. PloS Computational Biology, 10(3):e1003491, 2014.  R. Kondor and H. Pan. The multiscale Laplacian graph kernel. In NIPS, 2016.  M. Krivelevich and B. Sudakov. The largest eigenvalue of sparse random graphs. Combinatorics,  Probability and Computing, 12(1):61-72, 2003.  J. Lei. A goodness-of-fit test for stochastic block models. Annals of Statistics, 44(1):401-424, 2016.  J. Lei and A. Rinaldo. Consistency of spectral clustering in stochastic block models. Annals of  Statistics, 43(1):215-237, 2015.  natorics, 20(4):P27, 2013.  L. Lu and X. Peng. Spectra of edge-independent random graphs. The Electronic Journal of Combi-  E. Mossel, J. Neeman, and A. Sly. Reconstruction and estimation in the planted partition model.  Probability Theory and Related Fields, 162(3-4):431-461, 2015.  R. Mukherjee, N. S. Pillai, and X. Lin. Hypothesis testing for high-dimensional sparse binary  regression. Annals of Statistics, 43(1):352-381, 2015.  M. Penrose. Random geometric graphs, volume 5. Oxford University Press, 2003.  M. Rubinov and O. Sporns. Complex network measures of brain connectivity: Uses and interpreta-  tions. Neuroimage, 52:1059-1069, 2010.  C. J. Stam, B. F. Jones, G. Nolte, M. Breakspear, and P. Scheltens. Small-world networks and  functional connectivity in Alzheimer’s disease. Cerebral Cortex, 17(1):92-99, 2007.  M. Tang, A. Athreya, D. L. Sussman, V. Lyzinski, and C. E. Priebe. A semiparametric two-sample hypothesis testing problem for random graphs. Journal of Computational and Graphical Statis- tics, 26:344-354, 2017."}