{"1": "A. Agarwal, P. L. Bartlett, P. Ravikumar, and M. J. Wainwright. Information-theoretic lower bounds on the oracle complexity of stochastic convex optimization. IEEE Trans. on Information Theory, 58(5):3235, 2012.  A. Chernov and V. Vovk. Prediction with advice of unknown number of experts. In Proc. of the  Conference on Uncertainty in Artificial Intelligence (UAI), pages 117-125, 2010.  A. Cutkosky and K. Boahen. Online learning without prior information. In Proc. of the Conference  On Learning Theory (COLT), pages 643-677, 2017.  A. Cutkosky and F. Orabona. Black-box reductions for parameter-free online learning in Banach  spaces. In Proc. of the Conference On Learning Theory (COLT), pages 1493-1529, 2018.  J. C. Duchi, M. I. Jordan, and M. J. Wainwright. Privacy aware learning. Journal of the ACM, 61(6):  38, 2014.  R. Durrett. Probability: theory and examples. Cambridge University Press, 2010.  C. Dwork, F. McSherry, K. Nissim, and A. Smith. Calibrating noise to sensitivity in private data  analysis. In Theory of cryptography conference, pages 265-284. Springer, 2006.  D. J. Foster, A. Rakhlin, and K. Sridharan. Adaptive online learning. Information Processing Systems (NeurIPS), pages 3375-3383, 2015.  In Advances in Neural  D. J. Foster, S. Kale, M. Mohri, and K. Sridharan. Parameter-free online learning via model selection.  In Advances in Neural Information Processing Systems (NeurIPS), pages 6020-6030, 2017.  D. J. Foster, A. Rakhlin, and K. Sridharan. Online learning: Sufficient statistics and the Burkholder  method. In Proc. of the Conference On Learning Theory (COLT), pages 3028-3064, 2018.  Daniel Hsu, Sham Kakade, Tong Zhang, et al. A tail inequality for quadratic forms of subgaussian  random vectors. Electronic Communications in Probability, 17, 2012.  S. P. Kasiviswanathan, H. K. Lee, K. Nissim, S. Raskhodnikova, and A. Smith. What can we learn  privately? SIAM Journal on Computing, 40(3):793-826, 2011.  W. M. Koolen and T. van Erven. Second-order quantile methods for experts and combinatorial games.  In Proc. of the Conference On Learning Theory (COLT), pages 1155-1175, 2015.  Wouter M. Koolen. Implementing squint, 2015. URL http://blog.wouterkoolen.info/  Squint_implementation/post.html.  W. Kotłowski. Scale-invariant unconstrained online learning. In Proc. of the International Conference  on Algorithmic Learning Theory (ALT), 2017.  N. Littlestone. From on-line to batch learning. In Proc. of the Conference On Learning Theory  (COLT), pages 269-284, 1989.  5(1):41-65, 1972.  Y. L. Luke. Inequalities for generalized hypergeometric functions. Journal of Approximation Theory,  13   PARAMETER-FREE ONLINE CONVEX OPTIMIZATION WITH SUB-EXPONENTIAL NOISE  References  A. Agarwal, P. L. Bartlett, P. Ravikumar, and M. J. Wainwright. Information-theoretic lower bounds on the oracle complexity of stochastic convex optimization. IEEE Trans. on Information Theory, 58(5):3235, 2012.  A. Chernov and V. Vovk. Prediction with advice of unknown number of experts. In Proc. of the  Conference on Uncertainty in Artificial Intelligence (UAI), pages 117-125, 2010.  A. Cutkosky and K. Boahen. Online learning without prior information. In Proc. of the Conference  On Learning Theory (COLT), pages 643-677, 2017.  A. Cutkosky and F. Orabona. Black-box reductions for parameter-free online learning in Banach  spaces. In Proc. of the Conference On Learning Theory (COLT), pages 1493-1529, 2018.  J. C. Duchi, M. I. Jordan, and M. J. Wainwright. Privacy aware learning. Journal of the ACM, 61(6):  38, 2014.  R. Durrett. Probability: theory and examples. Cambridge University Press, 2010.  C. Dwork, F. McSherry, K. Nissim, and A. Smith. Calibrating noise to sensitivity in private data  analysis. In Theory of cryptography conference, pages 265-284. Springer, 2006.  D. J. Foster, A. Rakhlin, and K. Sridharan. Adaptive online learning. Information Processing Systems (NeurIPS), pages 3375-3383, 2015.  In Advances in Neural  D. J. Foster, S. Kale, M. Mohri, and K. Sridharan. Parameter-free online learning via model selection.  In Advances in Neural Information Processing Systems (NeurIPS), pages 6020-6030, 2017.  D. J. Foster, A. Rakhlin, and K. Sridharan. Online learning: Sufficient statistics and the Burkholder  method. In Proc. of the Conference On Learning Theory (COLT), pages 3028-3064, 2018.  Daniel Hsu, Sham Kakade, Tong Zhang, et al. A tail inequality for quadratic forms of subgaussian  random vectors. Electronic Communications in Probability, 17, 2012.  S. P. Kasiviswanathan, H. K. Lee, K. Nissim, S. Raskhodnikova, and A. Smith. What can we learn  privately? SIAM Journal on Computing, 40(3):793-826, 2011.  W. M. Koolen and T. van Erven. Second-order quantile methods for experts and combinatorial games.  In Proc. of the Conference On Learning Theory (COLT), pages 1155-1175, 2015.  Wouter M. Koolen. Implementing squint, 2015. URL http://blog.wouterkoolen.info/  Squint_implementation/post.html.  W. Kotłowski. Scale-invariant unconstrained online learning. In Proc. of the International Conference  on Algorithmic Learning Theory (ALT), 2017.  N. Littlestone. From on-line to batch learning. In Proc. of the Conference On Learning Theory  (COLT), pages 269-284, 1989.  5(1):41-65, 1972.  Y. L. Luke. Inequalities for generalized hypergeometric functions. Journal of Approximation Theory, PARAMETER-FREE ONLINE CONVEX OPTIMIZATION WITH SUB-EXPONENTIAL NOISE  J. Matoušek. Lectures on discrete geometry, volume 212. Springer New York, 2002.  H. B. McMahan and J. Abernethy. Minimax optimal algorithms for unconstrained linear optimization.  In Advances in Neural Information Processing Systems (NeurIPS), pages 2724-2732, 2013.  H. B. McMahan and F. Orabona. Unconstrained online linear learning in Hilbert spaces: Minimax algorithms and normal approximations. In Proc. of the Conference On Learning Theory (COLT), pages 1020-1039, 2014.  F. Orabona. Dimension-free exponentiated gradient. In Advances in Neural Information Processing  Systems (NeurIPS), pages 1806-1814, 2013.  F. Orabona and D. Pál. Coin betting and parameter-free online learning. In Advances in Neural  Information Processing Systems (NeurIPS), pages 577-585. 2016.  F. Orabona and T. Tommasi. Training deep networks without learning rates through coin betting. In  Advances in Neural Information Processing Systems (NeurIPS), pages 2160-2170, 2017.  I. Pinelis. Rosenthal-type inequalities for martingales in 2-smooth Banach spaces. Theory of  Probability & Its Applications, 59(4):699-706, 2015.  A. Rakhlin and K. Sridharan. On equivalence of martingale tail bounds and deterministic regret inequalities. In Proc. of the Conference On Learning Theory (COLT), pages 1704-1722, 2017.  S. Song, K. Chaudhuri, and A. Sarwate. Learning from data with heterogeneous noise using SGD. In Proc. of International Conference on Artificial Intelligence and Statistics (AISTATS), pages 894-902, 2015.  N. Srebro, K. Sridharan, and A. Tewari. On the universality of online mirror descent. In Advances in  Neural Information Processing Systems (NeurIPS), pages 2645-2653, 2011.  L. Wasserman and S. Zhou. A statistical framework for differential privacy. Journal of the American  Statistical Association, 105(489):375-389, 2010.  X. Wu, F. Li, A. Kumar, K. Chaudhuri, S. Jha, and J. Naughton. Bolt-on differential privacy for scalable stochastic gradient descent-based analytics. In Proc. of the 2017 ACM International Conference on Management of Data, pages 1307-1322. ACM, 2017. PARAMETER-FREE ONLINE CONVEX OPTIMIZATION WITH SUB-EXPONENTIAL NOISE"}