{"1": "Shiri Artstein-Avidan, Apostolos Giannopoulos, and Vitali D Milman. Asymptotic geometric anal-  ysis, Part I, volume 202. American Mathematical Soc., 2015.  Maria-Florina Balcan, Yi Li, David P. Woodruff, and Hongyang Zhang. Testing matrix rank, op- timally. In Proceedings of the Thirtieth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2019., pages 727-746, 2019. doi: 10.1137/1.9781611975482.46.  Paul Beame, Shayan Oveis Gharan, and Xin Yang. Time-space tradeoffs for learning from small test spaces: Learning low degree polynomial functions. arXiv preprint arXiv:1708.02640, 2017.  Paul Beame, Shayan Oveis Gharan, and Xin Yang. Time-space tradeoffs for learning finite functions from random evaluations, with applications to polynomials. In Conference On Learning Theory, COLT 2018, Stockholm, Sweden, 6-9 July 2018., pages 843-856, 2018.  Avrim Blum. Random projection, margins, kernels, and feature-selection.  In Subspace, Latent  Structure and Feature Selection, pages 52-68. Springer, 2006.  11   SPACE LOWER BOUNDS FOR LINEAR PREDICTION IN THE STREAMING MODEL  Reducing Thm. 7 from Lemma 5 We consider a variant of Lemma 5 where the vector w∗ or- thogonal to U and V satisfies e(cid:62) 1 w∗ ≥ cf (Lemma 31). We show that if A is a protocol for finding a linear separator, there exists a protocol A(cid:48) for finding an approximate null vector with the same amount of communication.  Here is how A(cid:48) is created, based on A. The first party, given V ∈ Gr(d/2, d), creates an auxiliary distribution DV over pairs (x, y), with the following property: Any hyperplane w ∈ Sd−1 with low classification error on DV , satisfies (cid:107)ProjV (w)(cid:107)2 ≈ 0. Similarly, the second party will create an auxiliary distribution DU , such that any approximate separator w satisfies (cid:107)ProjU (w)(cid:107)2 ≈ 0. In particular, any hyperplane with low error on the uniform mixture of DV and DU satisfies: (cid:107)ProjV (w)(cid:107)2 + (cid:107)ProjU (w)(cid:107)2 ≈ 0.  Each party draws m = Ω(d) samples from their corresponding distribution (DV or DU ). Then, they simulate A to find a hyperplane ˆw with low classification error on the mixed sample. Since the class of linear separators over Rd is of VC dimension d, ˆw has low classification error on the mixture of DV and DU , hence it satisfies (cid:107)ProjV (w)(cid:107)2 + (cid:107)ProjU (w)(cid:107)2 ≈ 0, as required. Lemma 5 states that the communication of A(cid:48) is Ω(d2), hence the communication of A is Ω(d2) as well.  Here is how a random pair (x, y) is drawn from DV (DU is analogously defined): First a random point x(cid:48) is drawn uniformly from V ∩ Sd−1. Then, set (x, y) = (x+, 1) with probability 1/2 and (x, y) = (x−, −1) with probability 1/2, where x+ = x(cid:48) + Θ(e1/ d). For any fixed w ∈ Sd−1, if x is drawn uniformly from V ∩ Sd−1 then w(cid:62)x ∼ N (0, (cid:107)ProjV (w)(cid:107)2) (approximately, see Lemma 24). From the definition of DV , any hyperplane w with low clas- sification error on DV satisfies w(cid:62)x ≈ 0 for most x ∈ V ∩ Sd−1, hence any such w satisfies (cid:107)ProjV (w)(cid:107)2 ≈ 0, as required.  d) and x− = x(cid:48) − Θ(e1/  √  √  This research is supported in part by European Research Council (ERC) grant 754705.  Acknowledgments  References  Shiri Artstein-Avidan, Apostolos Giannopoulos, and Vitali D Milman. Asymptotic geometric anal-  ysis, Part I, volume 202. American Mathematical Soc., 2015.  Maria-Florina Balcan, Yi Li, David P. Woodruff, and Hongyang Zhang. Testing matrix rank, op- timally. In Proceedings of the Thirtieth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA 2019., pages 727-746, 2019. doi: 10.1137/1.9781611975482.46.  Paul Beame, Shayan Oveis Gharan, and Xin Yang. Time-space tradeoffs for learning from small test spaces: Learning low degree polynomial functions. arXiv preprint arXiv:1708.02640, 2017.  Paul Beame, Shayan Oveis Gharan, and Xin Yang. Time-space tradeoffs for learning finite functions from random evaluations, with applications to polynomials. In Conference On Learning Theory, COLT 2018, Stockholm, Sweden, 6-9 July 2018., pages 843-856, 2018.  Avrim Blum. Random projection, margins, kernels, and feature-selection.  In Subspace, Latent  Structure and Feature Selection, pages 52-68. Springer, 2006. SPACE LOWER BOUNDS FOR LINEAR PREDICTION IN THE STREAMING MODEL  Mark Braverman, Ankit Garg, Tengyu Ma, Huy L. Nguyen, and David P. Woodruff. Commu- nication lower bounds for statistical estimation problems via a distributed data processing in- In Proceedings of the 48th Annual ACM SIGACT Symposium on Theory of Com- equality. puting, STOC 2016, Cambridge, MA, USA, June 18-21, 2016, pages 1011-1020, 2016. doi: 10.1145/2897518.2897582.  Vladimir Braverman, Stephen R. Chestnut, Robert Krauthgamer, Yi Li, David P. Woodruff, and Lin F. Yang. Matrix norms in data streams: Faster, multi-pass and row-order. In Proceedings of the 35th International Conference on Machine Learning, ICML 2018, Stockholmsm¨assan, Stock- holm, Sweden, July 10-15, 2018, pages 648-657, 2018.  Jeff I Chu and Georg Schnitger. The communication complexity of several problems in matrix  computation. Journal of Complexity, 7(4):395-407, 1991.  Jeff I Chu and Georg Schnitger. Communication complexity of matrix computation over finite  fields. Mathematical systems theory, 28(3):215-228, 1995.  Kenneth L Clarkson and David P Woodruff. Numerical linear algebra in the streaming model. In Proceedings of the forty-first annual ACM symposium on Theory of computing, pages 205-214. ACM, 2009.  Michael B. Cohen, Jelani Nelson, and David P. Woodruff. Optimal approximate matrix prod- In 43rd International Colloquium on Automata, Languages, and uct in terms of stable rank. Programming, ICALP 2016, July 11-15, 2016, Rome, Italy, pages 11:1-11:14, 2016. doi: 10.4230/LIPIcs.ICALP.2016.11.  Yuval Dagan and Ohad Shamir. Detecting correlations with little memory and communication. In Conference On Learning Theory, COLT 2018, Stockholm, Sweden, 6-9 July 2018., pages 1145- 1198, 2018.  Wei Dai, Brian C Rider, and Youjian Liu. Volume growth and general rate quantization on grass- In Global Telecommunications Conference, 2007. GLOBECOM’07. IEEE,  mann manifolds. pages 1441-1445. IEEE, 2007.  Amit Daniely and Vitaly Feldman. Learning without interaction requires separation. CoRR,  abs/1809.09165, 2018.  Sumegha Garg, Ran Raz, and Avishay Tal. Extractor-based time-space lower bounds for learning.  arXiv preprint arXiv:1708.02639, 2017.  Sudipto Guha and Andrew McGregor. Tight lower bounds for multi-pass stream computation via In International Colloquium on Automata, Languages, and Programming,  pass elimination. pages 760-772. Springer, 2008.  Daniel M Kane, Roi Livni, Shay Moran, and Amir Yehudayoff. On communication complexity of  classification problems. arXiv preprint arXiv:1711.05893, 2017.  Gillat Kol, Ran Raz, and Avishay Tal. Time-space hardness of learning sparse parities. In Proceed- ings of the 49th Annual ACM SIGACT Symposium on Theory of Computing, pages 1067-1080. ACM, 2017. SPACE LOWER BOUNDS FOR LINEAR PREDICTION IN THE STREAMING MODEL  Roie Levin, Anish Prasad Sevekari, and David P. Woodruff. Robust subspace approximation in a stream. In Advances in Neural Information Processing Systems 31: Annual Conference on Neural Information Processing Systems 2018, NeurIPS 2018, 3-8 December 2018, Montr´eal, Canada., pages 10706-10716, 2018.  Yi Li, Xiaoming Sun, Chengu Wang, and David P Woodruff. On the communication complex- ity of linear algebraic problems in the message passing model. In International Symposium on Distributed Computing, pages 499-513. Springer, 2014.  Dana Moshkovitz and Michal Moshkovitz. Mixing implies lower bounds for space bounded learn-  ing. In Conference on Learning Theory, pages 1516-1566, 2017.  Dana Moshkovitz and Michal Moshkovitz. Entropy samplers and strong generic lower bounds for space bounded learning. In 9th Innovations in Theoretical Computer Science Conference, ITCS 2018, January 11-14, 2018, Cambridge, MA, USA, pages 28:1-28:20, 2018. doi: 10.4230/LIPIcs. ITCS.2018.28.  Ran Raz. Fast learning requires good memory: A time-space lower bound for parity learning. In 2016 IEEE 57th Annual Symposium on Foundations of Computer Science (FOCS), pages 266- 275. IEEE, 2016.  Ran Raz. A time-space lower bound for a large class of learning problems.  In Foundations of Computer Science (FOCS), 2017 IEEE 58th Annual Symposium on, pages 732-742. IEEE, 2017.  Shai Shalev-Shwartz and Shai Ben-David. Understanding machine learning: From theory to algo-  rithms. Cambridge university press, 2014.  Vatsal Sharan, Aaron Sidford, and Gregory Valiant. Memory-sample tradeoffs for linear regression  with small error. arXiv preprint arXiv:1904.08544, 2019.  Jacob Steinhardt and John Duchi. Minimax rates for memory-bounded sparse linear regression. In  Conference on Learning Theory, pages 1564-1587, 2015.  Xiaoming Sun and Chengu Wang. Randomized communication complexity for linear algebra prob- lems over finite fields. In STACS’12 (29th Symposium on Theoretical Aspects of Computer Sci- ence), volume 14, pages 477-488. LIPIcs, 2012.  Stanislaw J Szarek. Spaces with large distance to (cid:96)n  ∞ and random matrices. American Journal of  Mathematics, 112(6):899-942, 1990.  Roman Vershynin. Introduction to the non-asymptotic analysis of random matrices. arXiv preprint  arXiv:1011.3027, 2010.  Feng Wei. Upper bound for intermediate singular values of random matrices. Journal of Mathe-  matical Analysis and Applications, 445(2):1530-1547, 2017.  Ke Ye and Lek-Heng Lim. Schubert varieties and distances between subspaces of different dimen-  sions. SIAM Journal on Matrix Analysis and Applications, 37(3):1176-1197, 2016. SPACE LOWER BOUNDS FOR LINEAR PREDICTION IN THE STREAMING MODEL  Yuchen Zhang, Martin Wainwright, and Michael Jordan. Distributed estimation of generalized matrix rank: Efficient algorithms and lower bounds. In International Conference on Machine Learning, pages 457-465, 2015."}