{"1": "Charu C. Aggarwal, Jiawei Han, Jianyong Wang, and Philip S. Yu. On demand classification  of data streams. In KDD, pages 503-508, Seattle, WA, 2004.  Noga Alon, Yossi Matias, and Mario Szegedy. The space complexity of approximating the  frequency moments. In STOC, pages 20-29, Philadelphia, PA, 1996.  Lakshminath Bhuvanagiri and Sumit Ganguly. Estimating entropy over data streams. In  ESA, pages 148-159, Zurich, Switzerland, 2006.  Daniela Brauckhoﬀ, Bernhard Tellenbach, Arno Wagner, Martin May, and Anukool Lakhina. Impact of packet sampling on anomaly detection metrics. In IMC, pages 159- 164, Rio de Janeriro, Brazil, 2006.  Amit Chakrabarti, Khanh Do Ba, and S. Muthukrishnan. Estimating entropy and entropy  norm on data streams. Internet Mathematics, 3(1):63-78, 2006.  494   Li Zhang  7. Conclusion  Many machine learning (e.g., neural computation, graph estimation) and data mining (e.g., anomaly detection) problems require estimating the Shannon entropy. When the data are dynamic (e.g., data streams), eﬃcient estimation of the Shannon entropy using small space has been a challenging problem. It is known that we can approximate the Shannon entropy using the α-th frequency moment of the stream with α very close to 1, if the estimator of the moment is accurate enough with variance proportional to O(∆2), where ∆ = |1 − α|. Our paper provides such a practical estimator. Our method is an ideal solution to the problem of entropy estimation when the data streams follow the strict-Turnstile model.  For ν-additive Shannon entropy estimation, the sample complexity of the algorithm is only O (cid:0) 1 (cid:1). The constant factor for this bound is merely about 6. In addition, we prove ν2 that our algorithm achieves an upper bound of the Fisher information and in fact it is close to 100% statistically optimal. An empirical study is also conducted to verify the accuracy of our algorithm.  Further research: To further reduce the processing cost in order to better accommodate high-rate data streams, it is desirable to replace the dense matrix of skewed stable variables by a sparse matrix of Pareto-type variables. This is closely related to the prior study of very sparse symmetric stable random projections (Li, 2007). However, the extension to CC requires further work.  Acknowledgments  The authors thank the anonymous reviewers for their constructive comments. Ping Li’s research is partially supported by the National Science Foundation (DMS-0808864), the Oﬃce of Naval Research (YIP-N000140910911), and a gift from Google. Cun-Hui Zhang’s research is partially supported by the National Science Foundation (DMS-0804626, DMS- 0906420) and the National Security Agency (H98230-09-1-0006, H98230-11-1-0205).  References  Charu C. Aggarwal, Jiawei Han, Jianyong Wang, and Philip S. Yu. On demand classification  of data streams. In KDD, pages 503-508, Seattle, WA, 2004.  Noga Alon, Yossi Matias, and Mario Szegedy. The space complexity of approximating the  frequency moments. In STOC, pages 20-29, Philadelphia, PA, 1996.  Lakshminath Bhuvanagiri and Sumit Ganguly. Estimating entropy over data streams. In  ESA, pages 148-159, Zurich, Switzerland, 2006.  Daniela Brauckhoﬀ, Bernhard Tellenbach, Arno Wagner, Martin May, and Anukool Lakhina. Impact of packet sampling on anomaly detection metrics. In IMC, pages 159- 164, Rio de Janeriro, Brazil, 2006.  Amit Chakrabarti, Khanh Do Ba, and S. Muthukrishnan. Estimating entropy and entropy  norm on data streams. Internet Mathematics, 3(1):63-78, 2006. Compressed Counting for Entropy Estimation  Amit Chakrabarti, Graham Cormode, and Andrew McGregor. A near-optimal algorithm for computing the entropy of a stream. In SODA, pages 328-335, New Orleans, Louisiana, 2007.  John M. Chambers, C. L. Mallows, and B. W. Stuck. A method for simulating stable random  variables. Journal of the American Statistical Association, 71(354):340-344, 1976.  Carlotta Domeniconi and Dimitrios Gunopulos. Incremental support vector machine con-  struction. In ICDM, pages 589-592, San Jose, CA, 2001.  Laura Feinstein, Dan Schnackenberg, Ravindra Balupari, and Darrell Kindred. Statistical approaches to DDoS attack detection and response. In DARPA Information Survivability Conference and Exposition, pages 303-314, 2003.  Izrail S. Gradshteyn and Iosif M. Ryzhik. Table of Integrals, Series, and Products. Academic  Press, New York, fifth edition, 1994.  Sudipto Guha, Andrew McGregor, and Suresh Venkatasubramanian. Streaming and sub- linear approximation of entropy and information distances. In SODA, pages 733 - 742, Miami, FL, 2006.  Anupam Gupta, John D. Laﬀerty, Han Liu, Larry A. Wasserman, and Min Xu. Forest  density estimation. In COLT, pages 394-406, Haifa, Israel, 2010.  Nicholas J. A. Harvey, Jelani Nelson, and Krzysztof Onak. Sketching and streaming entropy  via approximation theory. In FOCS, 2008a.  Nicholas J. A. Harvey, Jelani Nelson, and Krzysztof Onak. Streaming algorithms for esti-  mating entropy. In ITW, 2008b.  M E. Havrda and F. Charv´at. Quantification methods of classification processes: Concept  of structural α-entropy. Kybernetika, 3:30-35, 1967.  Monika R. Henzinger, Prabhakar Raghavan, and Sridhar Rajagopalan. Computing on Data  Streams. American Mathematical Society, Boston, MA, USA, 1999.  Piotr Indyk. Stable distributions, pseudorandom generators, embeddings, and data stream  computation. Journal of ACM, 53(3):307-323, 2006.  Anukool Lakhina, Mark Crovella, and Christophe Diot. Mining anomalies using traﬃc  feature distributions. In SIGCOMM, pages 217-228, Philadelphia, PA, 2005.  Ashwin Lall, Vyas Sekar, Mitsunori Ogihara, Jun Xu, and Hui Zhang. Data streaming algorithms for estimating entropy of network traﬃc. In SIGMETRICS, pages 145-156, Saint Malo, France, 2006.  Ping Li. Very sparse stable random projections for dimension reduction in lα (0 < α ≤ 2)  norm. In KDD, San Jose, CA, 2007.  Ping Li. Estimators and tail bounds for dimension reduction in lα (0 < α ≤ 2) using stable  random projections. In SODA, pages 10 - 19, San Francisco, CA, 2008. Li Zhang  Ping Li. Compressed counting. In SODA, New York, NY, 2009a.  Ping Li. Improving compressed counting. In UAI, Montreal, CA, 2009b.  Ping Li and Kenneth W. Church. A sketch algorithm for estimating two-way and multi-way associations. Computational Linguistics (Preliminary results appeared in HLT/EMNLP 2005), 33(3):305-354, 2007.  Ping Li and Trevor J. Hastie. A unified near-optimal estimator for dimension reduction in lα (0 < α ≤ 2) using stable random projections. In NIPS, Vancouver, BC, Canada, 2007.  Ping Li, Kenneth W. Church, and Trevor J. Hastie. One sketch for all: Theory and appli- cations of conditional random sampling. In NIPS (Preliminary results appeared in NIPS 2006), Vancouver, BC, Canada, 2008.  Ping Li, Michael Mahoney, and Yiyuan She. Approximating higher-order distances using  random projections. In UAI, 2010.  Qiaozhu Mei and Kenneth Church. Entropy of search logs: How hard is search? with  personalization? with backoﬀ? In WSDM, pages 45 - 54, Palo Alto, CA, 2008.  S. Muthukrishnan. Data streams: Algorithms and applications. Foundations and Trends  in Theoretical Computer Science, 1:117-236, 2 2005.  Liam Paninski. Estimation of entropy and mutual information. Neural Comput., 15(6):  1191-1253, 2003.  Alfred R´enyi. On measures of information and entropy. In The 4th Berkeley Symposium on  Mathematics, Statistics and Probability 1960, pages 547-561, 1961.  Constantino Tsallis. Possible generalization of boltzmann-gibbs statistics. Journal of Sta-  tistical Physics, 52:479-487, 1988.  Kuai Xu, Zhi-Li Zhang, and Supratik Bhattacharyya. Profiling internet backbone traﬃc: behavior models and applications. In SIGCOMM ’05: Proceedings of the 2005 conference on Applications, technologies, architectures, and protocols for computer communications, pages 169-180, Philadelphia, Pennsylvania, USA, 2005.  Qiang Yang and Xindong Wu. 10 challeng problems in data mining research. International  Journal of Information Technology and Decision Making, 5(4):597-604, 2006.  Haiquan Zhao, Ashwin Lall, Mitsunori Ogihara, Oliver Spatscheck, Jia Wang, and Jun Xu. A data streaming algorithm for estimating entropies of od ﬂows. In IMC, San Diego, CA, 2007.  Haiquan Zhao, Nan Hua, Ashwin Lall, Ping Li, Jia Wang, and Jun Xu. Towards a universal  sketch for origin-destination network measurements. Technical report, 2010."}