{"1": "Alekh Agarwal, Ofer Dekel, and Lin Xiao. Optimal algorithms for online convex optimization with  multi-point bandit feedback. In COLT, pages 28-40. Citeseer, 2010.  Maria-Florina Balcan and Nicholas JA Harvey. Learning submodular functions. In Proceedings of the forty-third annual ACM symposium on Theory of computing, pages 793-802. ACM, 2011.  Eric Balkanski, Aviad Rubinstein, and Yaron Singer. The power of optimization from samples. In  Advances in Neural Information Processing Systems, pages 4017-4025, 2016.  Eric Balkanski, Aviad Rubinstein, and Yaron Singer. The limitations of optimization from samples. Proceedings of the Forty-Ninth Annual ACM on Symposium on Theory of Computing, 2017.  Alexandre Belloni, Tengyuan Liang, Hariharan Narayanan, and Alexander Rakhlin. Escaping the In local minima via simulated annealing: Optimization of approximately convex functions. COLT, pages 240-265, 2015.  Michael Ben-Or and Prasoon Tiwari. A deterministic algorithm for sparse multivariate polynomial interpolation. In Proceedings of the twentieth annual ACM symposium on Theory of computing, pages 301-309. ACM, 1988.  S´ebastien Bubeck and Ronen Eldan. Multi-scale exploration of convex functions and bandit convex  optimization. CoRR, abs/1507.06580, 2015.  Carl De Boor and Amos Ron. On multivariate polynomial interpolation. Constructive Approxima-  tion, 6(3):287-302, 1990.  Alina Ene, Jan Vondr´ak, and Yi Wu. Local distribution and the symmetry gap: Approximability In Proceedings of the Twenty-Fourth Annual ACM-SIAM  of multiway partitioning problems. Symposium on Discrete Algorithms, pages 306-325. SIAM, 2013.  Vitaly Feldman. Generalization of erm in stochastic convex optimization: The dimension strikes  back. In Advances in Neural Information Processing Systems, pages 3576-3584, 2016.  Vitaly Feldman and Pravesh Kothari. Learning coverage functions and private release of marginals.  In COLT, pages 679-702, 2014.  Vitaly Feldman, Pravesh Kothari, and Jan Vondr´ak. Representation, approximation and learning of  submodular functions using low-rank decision trees. In COLT, pages 711-740, 2013.  Abraham D Flaxman, Adam Tauman Kalai, and H Brendan McMahan. Online convex optimization in the bandit setting: gradient descent without a gradient. In Proceedings of the sixteenth an- nual ACM-SIAM symposium on Discrete algorithms, pages 385-394. Society for Industrial and Applied Mathematics, 2005.  Mariano Gasca. Multivariate polynomial interpolation.  In Computation of curves and surfaces,  pages 215-236. Springer, 1990.  arXiv:1601.03095, 2016.  Avinatan Hassidim and Yaron Singer. Submodular optimization under noise. arXiv preprint  13   THE SAMPLE COMPLEXITY OF OPTIMIZING A CONVEX FUNCTION  References  Alekh Agarwal, Ofer Dekel, and Lin Xiao. Optimal algorithms for online convex optimization with  multi-point bandit feedback. In COLT, pages 28-40. Citeseer, 2010.  Maria-Florina Balcan and Nicholas JA Harvey. Learning submodular functions. In Proceedings of the forty-third annual ACM symposium on Theory of computing, pages 793-802. ACM, 2011.  Eric Balkanski, Aviad Rubinstein, and Yaron Singer. The power of optimization from samples. In  Advances in Neural Information Processing Systems, pages 4017-4025, 2016.  Eric Balkanski, Aviad Rubinstein, and Yaron Singer. The limitations of optimization from samples. Proceedings of the Forty-Ninth Annual ACM on Symposium on Theory of Computing, 2017.  Alexandre Belloni, Tengyuan Liang, Hariharan Narayanan, and Alexander Rakhlin. Escaping the In local minima via simulated annealing: Optimization of approximately convex functions. COLT, pages 240-265, 2015.  Michael Ben-Or and Prasoon Tiwari. A deterministic algorithm for sparse multivariate polynomial interpolation. In Proceedings of the twentieth annual ACM symposium on Theory of computing, pages 301-309. ACM, 1988.  S´ebastien Bubeck and Ronen Eldan. Multi-scale exploration of convex functions and bandit convex  optimization. CoRR, abs/1507.06580, 2015.  Carl De Boor and Amos Ron. On multivariate polynomial interpolation. Constructive Approxima-  tion, 6(3):287-302, 1990.  Alina Ene, Jan Vondr´ak, and Yi Wu. Local distribution and the symmetry gap: Approximability In Proceedings of the Twenty-Fourth Annual ACM-SIAM  of multiway partitioning problems. Symposium on Discrete Algorithms, pages 306-325. SIAM, 2013.  Vitaly Feldman. Generalization of erm in stochastic convex optimization: The dimension strikes  back. In Advances in Neural Information Processing Systems, pages 3576-3584, 2016.  Vitaly Feldman and Pravesh Kothari. Learning coverage functions and private release of marginals.  In COLT, pages 679-702, 2014.  Vitaly Feldman, Pravesh Kothari, and Jan Vondr´ak. Representation, approximation and learning of  submodular functions using low-rank decision trees. In COLT, pages 711-740, 2013.  Abraham D Flaxman, Adam Tauman Kalai, and H Brendan McMahan. Online convex optimization in the bandit setting: gradient descent without a gradient. In Proceedings of the sixteenth an- nual ACM-SIAM symposium on Discrete algorithms, pages 385-394. Society for Industrial and Applied Mathematics, 2005.  Mariano Gasca. Multivariate polynomial interpolation.  In Computation of curves and surfaces,  pages 215-236. Springer, 1990.  arXiv:1601.03095, 2016.  Avinatan Hassidim and Yaron Singer. Submodular optimization under noise. arXiv preprint BALKANSKI SINGER  Elad Hazan. Introduction to online convex optimization. Foundations and Trends in Optimization,  2(3-4):157-325, 2015.  Elad Hazan, Amit Agarwal, and Satyen Kale. Logarithmic regret algorithms for online convex  optimization. Machine Learning, 69(2-3):169-192, 2007.  Vahab Mirrokni, Michael Schapira, and Jan Vondr´ak. Tight information-theoretic lower bounds for welfare maximization in combinatorial auctions. In Proceedings of the 9th ACM conference on Electronic commerce, pages 70-77. ACM, 2008.  Shai Shalev-Shwartz and Shai Ben-David. Understanding machine learning: From theory to algo-  rithms. Cambridge university press, 2014.  Shai Shalev-Shwartz, Ohad Shamir, Nathan Srebro, and Karthik Sridharan. Stochastic convex opti-  mization. In COLT, 2009.  Shai Shalev-Shwartz et al. Online learning and online convex optimization. Foundations and  Trends R(cid:13) in Machine Learning, 4(2):107-194, 2012.  Yaron Singer and Jan Vondr´ak. Information-theoretic lower bounds for convex optimization with erroneous oracles. In Advances in Neural Information Processing Systems, pages 3204-3212, 2015.  Leslie G Valiant. A theory of the learnable. Communications of the ACM, 27(11):1134-1142, 1984.  Jan Vondr´ak. Symmetry and approximability of submodular maximization problems. SIAM Journal  on Computing, 42(1):265-304, 2013. THE SAMPLE COMPLEXITY OF OPTIMIZING A CONVEX FUNCTION"}