{"1": "Sanjeev Arora and Rong Ge. New tools for graph coloring. In Approximation, Randomization, and  Combinatorial Optimization. Algorithms and Techniques, pages 1-12. Springer, 2011.  Sanjeev Arora, David Karger, and Marek Karpinski. Polynomial time approximation schemes for dense instances of np-hard problems. In Proceedings of the twenty-seventh annual ACM sympo- sium on Theory of computing, pages 284-293. ACM, 1995.  Sanjeev Arora, Boaz Barak, and David Steurer. Subexponential algorithms for unique games and related problems. In Foundations of Computer Science (FOCS), 2010 51st Annual IEEE Sympo- sium on, pages 563-572. IEEE, 2010.  12   RISTESKI  (cid:15) “Around the transition threshold”, i.e. when jJj = (cid:2)( 1  d ) for a sufficiently large constant in the (cid:2) notation, such that there is no correlation decay. Generally, unless there is some special structure, Markov Chain methods will provide no non-trivial guarantee in this regime - however, we get an order ϵn additive factor approximation to log Z, which translates to a (1 + ϵ)n factor approximation of Z. We do not, to the best of our knowledge, know how to get such results using any other methods.  (cid:15) “Low temperature regime”, i.e. when jJj = !(1=d). In this case, in light of the variational characterization of log Z and the fact that the entropy is upper bounded by n, the dominating (i;j)2E(G) Ji;jE(cid:22)[xixj], so essentially the quality of term will typically be the energy term approximation will be dictated by the hardness of the optimization problem corresponding to the energy term. (e.g., for the anti-ferromagnetic case, where all the potentials Ji;j are negative, the optimization problem corresponding to the energy term is just max-cut, and we cannot hope for more than a constant factor approximation to log Z for general (negative) potentials.)  ∑  6. Conclusion  We presented simple new algorithms for calculating partition functions in Ising models based on variational methods and convex programming hierarchies. To the best of our knowledge, these techniques give new, non-trivial approximation guarantees for the partition function when correla- tion decay does not hold, and are the first provable, convex variational methods. Our guarantees are for dense or low threshold rank graphs, and in the process we design novel entropy approximations based on the low-order moments of a distribution.  We barely scratched the surface, and we leave many interesting directions open. Our methods are very generic, and are probably applicable to many other classes of partition functions apart from Ising models. One natural candidate is weighted matchings due to the connections to calculating non-negative permanents.  Another intriguing question is to determine if there is a similar approach that can subsume prior results on partition function calculation in the regime of correlation decay, as our guarantees are much weaker there. This would give a convex relaxation interpretation of these types of results.  References  Sanjeev Arora and Rong Ge. New tools for graph coloring. In Approximation, Randomization, and  Combinatorial Optimization. Algorithms and Techniques, pages 1-12. Springer, 2011.  Sanjeev Arora, David Karger, and Marek Karpinski. Polynomial time approximation schemes for dense instances of np-hard problems. In Proceedings of the twenty-seventh annual ACM sympo- sium on Theory of computing, pages 284-293. ACM, 1995.  Sanjeev Arora, Boaz Barak, and David Steurer. Subexponential algorithms for unique games and related problems. In Foundations of Computer Science (FOCS), 2010 51st Annual IEEE Sympo- sium on, pages 563-572. IEEE, 2010. HOW TO CALCULATE PARTITION FUNCTIONS USING CONVEX PROGRAMMING HIERARCHIES  Boaz Barak, Prasad Raghavendra, and David Steurer. Rounding semidefinite programming hier- archies via global correlation. In Foundations of Computer Science (FOCS), 2011 IEEE 52nd Annual Symposium on, pages 472-481. IEEE, 2011.  Boaz Barak, Jonathan A Kelner, and David Steurer. Rounding sum-of-squares relaxations.  In Proceedings of the 46th Annual ACM Symposium on Theory of Computing, pages 31-40. ACM, 2014.  Alexander Barvinok. Polynomial time algorithms to approximate permanents and mixed discrimi-  nants within a simply exponential factor. Ann Arbor, 1001(48109):1109.  Mohsen Bayati, David Gamarnik, Dimitriy Katz, Chandra Nair, and Prasad Tetali. Simple deter- In Proceedings of the thirty-ninth  ministic approximation algorithms for counting matchings. annual ACM symposium on Theory of computing, pages 122-127. ACM, 2007.  David M Blei, Andrew Y Ng, and Michael I Jordan. Latent dirichlet allocation.  the Journal of  machine Learning research, 3:993-1022, 2003.  David M Blei, Alp Kucukelbir, and Jon D McAuliffe. Variational inference: A review for statisti-  cians. arXiv preprint arXiv:1601.00670, 2016.  Yiling Chen, Lance Fortnow, Nicolas Lambert, David M Pennock, and Jennifer Wortman. Com- plexity of combinatorial market makers. In Proceedings of the 9th ACM conference on Electronic commerce, pages 190-199. ACM, 2008.  Richard S Ellis. Entropy, large deviations, and statistical mechanics, volume 271. Springer Science  & Business Media, 2012.  Physics, 19(2):149-161, 1978.  Richard S Ellis and Charles M Newman. The statistics of curie-weiss models. Journal of Statistical  David Gamarnik and Dmitriy Katz. A deterministic approximation algorithm for computing the permanent of a 0, 1 matrix. Journal of Computer and System Sciences, 76(8):879-883, 2010.  Leonid Gurvits and Alex Samorodnitsky. Bounds on the permanent and some applications.  In 55th IEEE Annual Symposium on Foundations of Computer Science, FOCS 2014, Philadelphia, PA, USA, October 18-21, 2014, pages 90-99, 2014. doi: 10.1109/FOCS.2014.18. URL http: //dx.doi.org/10.1109/FOCS.2014.18.  David P Helmbold and Manfred K Warmuth. Learning permutations with exponential weights. The  Journal of Machine Learning Research, 10:1705-1736, 2009.  Tom Heskes. Convexity arguments for efficient minimization of the bethe and kikuchi free energies.  2006.  Mark Jerrum and Alistair Sinclair. Polynomial-time approximation algorithms for the ising model.  SIAM Journal on computing, 22(5):1087-1116, 1993.  Mark Jerrum and Umesh Vazirani. A mildly exponential approximation algorithm for the perma-  nent. Algorithmica, 16(4):392-401, 1996. RISTESKI  Mark Jerrum, Alistair Sinclair, and Eric Vigoda. A polynomial-time approximation algorithm for the permanent of a matrix with nonnegative entries. Journal of the ACM (JACM), 51(4):671-697, 2004.  Monique Laurent. Sums of squares, moment matrices and optimization over polynomials. In Emerg-  ing applications of algebraic geometry, pages 157-270. Springer, 2009.  Liang Li, Pinyan Lu, and Yitong Yin. Approximate counting via correlation decay in spin systems. In Proceedings of the twenty-third annual ACM-SIAM symposium on Discrete Algorithms, pages 922-940. SIAM, 2012.  Liang Li, Pinyan Lu, and Yitong Yin. Correlation decay up to uniqueness in spin systems.  In Proceedings of the Twenty-Fourth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 67-84. SIAM, 2013.  Ofer Meshi, Ariel Jaimovich, Amir Globerson, and Nir Friedman. Convexifying the bethe free energy. In Proceedings of the Twenty-Fifth Conference on Uncertainty in Artificial Intelligence, pages 402-410. AUAI Press, 2009.  Alistair Sinclair, Piyush Srivastava, and Marc Thurley. Approximation algorithms for two-state anti-ferromagnetic spin systems on bounded degree graphs. Journal of Statistical Physics, 155 (4):666-686, 2014.  Allan Sly. Computational transition at the uniqueness threshold.  In Foundations of Computer  Science (FOCS), 2010 51st Annual IEEE Symposium on, pages 287-296. IEEE, 2010.  David Steurer. On the complexity of unique games and graph expansion. PhD thesis, Princeton  University, 2010.  Martin J Wainwright and Michael I Jordan. Graphical models, exponential families, and variational  inference. Foundations and Trends R⃝ in Machine Learning, 1(1-2):1-305, 2008.  Martin J Wainwright, Tommi S Jaakkola, and Alan S Willsky. Tree-reweighted belief propagation  algorithms and approximate ml estimation by pseudo-moment matching.  Martin J Wainwright, Tommi S Jaakkola, and Alan S Willsky. A new class of upper bounds on the  log partition function. Information Theory, IEEE Transactions on, 51(7):2313-2335, 2005.  Martin J Wainwright, Michael Jordan, et al. Log-determinant relaxation for approximate inference in discrete markov random fields. Signal Processing, IEEE Transactions on, 54(6):2099-2109, 2006.  Yair Weiss. Correctness of local probability propagation in graphical models with loops. Neural  computation, 12(1):1-41, 2000.  Dror Weitz. Counting independent sets up to the tree threshold. In Proceedings of the thirty-eighth  annual ACM Symposium on Theory of Computing, pages 140-149. ACM, 2006.  Avi Wigderson. personal communication. HOW TO CALCULATE PARTITION FUNCTIONS USING CONVEX PROGRAMMING HIERARCHIES  Jonathan S Yedidia, William T Freeman, and Yair Weiss. Understanding belief propagation and its  generalizations. 2003.  Yuichi Yoshida and Yuan Zhou. Approximation schemes via sherali-adams hierarchy for dense constraint satisfaction problems and assignment problems. In Proceedings of the 5th conference on Innovations in theoretical computer science, pages 423-438. ACM, 2014."}