{"1": "Kareem Amin, Michael Kearns, Peter Key, and Anton Schwaighofer. Budget optimization for sponsored search: Censored learning in MDPs. In Proceedings of the Twenty-Eighth Conference on Uncertainty in Artificial Intelligence, Catalina Island, CA, USA, August 14-18, 2012, pages 54-63, 2012.  Kareem Amin, Afshin Rostamizadeh, and Umar Syed. Repeated contextual auctions with strategic buyers. In Z. Ghahramani, M. Welling, C. Cortes, N.D. Lawrence, and K.Q. Weinberger, editors, Advances in Neural Information Processing Systems 27, pages URL http://papers.nips.cc/paper/ 622-630. Curran Associates, 5589-repeated-contextual-auctions-with-strategic-buyers.pdf.  Inc., 2014.  Kareem Amin, Rachel Cummings, Lili Dworkin, Michael Kearns, and Aaron Roth. Online learning and profit maximization from revealed preferences. In Proceedings of the Twenty-Ninth AAAI Conference on Artificial Intelligence, January 25-30, 2015, Austin, Texas, USA., pages 770-776, 2015.  Peter Auer, Nicol`o Cesa-Bianchi, and Paul Fischer. Finite-time analysis of the multiarmed bandit  problem. Mach. Learn., 47(2-3):235-256, 2002.  Peter Auer, Nicol`o Cesa-Bianchi, Yoav Freund, and Robert E. Schapire. The nonstochastic multiarmed bandit problem. ISSN 0097-5397. doi: 10.1137/S0097539701398375. URL http://dx.doi.org/10.1137/ S0097539701398375.  SIAM J. Comput., 32(1):48-77 (electronic), 2002/03.  Moshe Babaioff, Yogeshwer Sharma, and Aleksandrs Slivkins. Characterizing truthful multi-armed bandit mechanisms: Extended abstract. In Proceedings of the 10th ACM Conference on Elec- tronic Commerce, EC ’09, pages 79-88, New York, NY, USA, 2009. ACM. ISBN 978-1- 60558-458-4. doi: 10.1145/1566374.1566386. URL http://doi.acm.org/10.1145/ 1566374.1566386.  Moshe Babaioff, Robert D. Kleinberg, and Aleksandrs Slivkins. Truthful mechanisms with implicit payment computation. In Proceedings of the 11th ACM Conference on Electronic Commerce, EC ’10, pages 43-52, New York, NY, USA, 2010. ACM. ISBN 978-1-60558-822-3. doi: 10.1145/ 1807342.1807349. URL http://doi.acm.org/10.1145/1807342.1807349.  Ashwinkumar Badanidiyuru, Robert Kleinberg, and Aleksandrs Slivkins. Bandits with knapsacks. In Proceedings of the 2013 IEEE 54th Annual Symposium on Foundations of Computer Science, FOCS ’13, pages 207-216, Washington, DC, USA, 2013. IEEE Computer Society. ISBN 978-0- 7695-5135-7. doi: 10.1109/FOCS.2013.30. URL http://dx.doi.org/10.1109/FOCS. 2013.30.  Santiago R. Balseiro, Omar Besbes, and Gabriel Y. Weintraub. Repeated auctions with budgets in ad exchanges: Approximations and design. Manage. Sci., 61(4):864-884, April 2015. ISSN 0025-1909. doi: 10.1287/mnsc.2014.2022. URL http://dx.doi.org/10.1287/mnsc. 2014.2022.  14   WEED PERCHET RIGOLLET  References  Kareem Amin, Michael Kearns, Peter Key, and Anton Schwaighofer. Budget optimization for sponsored search: Censored learning in MDPs. In Proceedings of the Twenty-Eighth Conference on Uncertainty in Artificial Intelligence, Catalina Island, CA, USA, August 14-18, 2012, pages 54-63, 2012.  Kareem Amin, Afshin Rostamizadeh, and Umar Syed. Repeated contextual auctions with strategic buyers. In Z. Ghahramani, M. Welling, C. Cortes, N.D. Lawrence, and K.Q. Weinberger, editors, Advances in Neural Information Processing Systems 27, pages URL http://papers.nips.cc/paper/ 622-630. Curran Associates, 5589-repeated-contextual-auctions-with-strategic-buyers.pdf.  Inc., 2014.  Kareem Amin, Rachel Cummings, Lili Dworkin, Michael Kearns, and Aaron Roth. Online learning and profit maximization from revealed preferences. In Proceedings of the Twenty-Ninth AAAI Conference on Artificial Intelligence, January 25-30, 2015, Austin, Texas, USA., pages 770-776, 2015.  Peter Auer, Nicol`o Cesa-Bianchi, and Paul Fischer. Finite-time analysis of the multiarmed bandit  problem. Mach. Learn., 47(2-3):235-256, 2002.  Peter Auer, Nicol`o Cesa-Bianchi, Yoav Freund, and Robert E. Schapire. The nonstochastic multiarmed bandit problem. ISSN 0097-5397. doi: 10.1137/S0097539701398375. URL http://dx.doi.org/10.1137/ S0097539701398375.  SIAM J. Comput., 32(1):48-77 (electronic), 2002/03.  Moshe Babaioff, Yogeshwer Sharma, and Aleksandrs Slivkins. Characterizing truthful multi-armed bandit mechanisms: Extended abstract. In Proceedings of the 10th ACM Conference on Elec- tronic Commerce, EC ’09, pages 79-88, New York, NY, USA, 2009. ACM. ISBN 978-1- 60558-458-4. doi: 10.1145/1566374.1566386. URL http://doi.acm.org/10.1145/ 1566374.1566386.  Moshe Babaioff, Robert D. Kleinberg, and Aleksandrs Slivkins. Truthful mechanisms with implicit payment computation. In Proceedings of the 11th ACM Conference on Electronic Commerce, EC ’10, pages 43-52, New York, NY, USA, 2010. ACM. ISBN 978-1-60558-822-3. doi: 10.1145/ 1807342.1807349. URL http://doi.acm.org/10.1145/1807342.1807349.  Ashwinkumar Badanidiyuru, Robert Kleinberg, and Aleksandrs Slivkins. Bandits with knapsacks. In Proceedings of the 2013 IEEE 54th Annual Symposium on Foundations of Computer Science, FOCS ’13, pages 207-216, Washington, DC, USA, 2013. IEEE Computer Society. ISBN 978-0- 7695-5135-7. doi: 10.1109/FOCS.2013.30. URL http://dx.doi.org/10.1109/FOCS. 2013.30.  Santiago R. Balseiro, Omar Besbes, and Gabriel Y. Weintraub. Repeated auctions with budgets in ad exchanges: Approximations and design. Manage. Sci., 61(4):864-884, April 2015. ISSN 0025-1909. doi: 10.1287/mnsc.2014.2022. URL http://dx.doi.org/10.1287/mnsc. 2014.2022. LEARNING IN AUCTIONS  G´abor Bart´ok, Dean P. Foster, D´avid P´al, Alexander Rakhlin, and Csaba Szepesv´ari. Partial monitoring—classification, regret bounds, and algorithms. Math. Oper. Res., 39(4):967-997, 2014. ISSN 0364-765X. doi: 10.1287/moor.2014.0663. URL http://dx.doi.org/10. 1287/moor.2014.0663.  Avrim Blum, Vijay Kumar, Atri Rudra, and Felix Wu. Online learning in online auctions. In Pro- ceedings of the Fourteenth Annual ACM-SIAM Symposium on Discrete Algorithms (Baltimore, MD, 2003), pages 202-204, 2003.  Avrim Blum, Yishay Mansour, and Jamie Morgenstern. Learning valuation distributions from par- tial observation. In Proceedings of the Twenty-Ninth AAAI Conference on Artificial Intelligence, January 25-30, 2015, Austin, Texas, USA., pages 798-804, 2015.  S´ebastien Bubeck and Nicol`o Cesa-Bianchi. Regret analysis of stochastic and nonstochastic multi-  armed bandit problems. Foundations and Trends in Machine Learning, 5(1):1-122, 2012.  S´ebastien Bubeck, Vianney Perchet, and Philippe Rigollet. Bounded regret in stochastic multi- In Shai Shalev-Shwartz and Ingo Steinwart, editors, COLT 2013 - The 26th armed bandits. Conference on Learning Theory, Princeton, NJ, June 12-14, 2013, volume 30 of JMLR W&CP, pages 122-134, 2013.  Nicol`o Cesa-Bianchi and G´abor Lugosi. Prediction, learning, and games. Cambridge Uni- ISBN 978-0-521-84108-5; 0-521-84108-9. doi: 10.1017/  versity Press, Cambridge, 2006. CBO9780511546921. URL http://dx.doi.org/10.1017/CBO9780511546921.  Nicol`o Cesa-Bianchi, Claudio Gentile, and Yishay Mansour. Regret minimization for reserve prices in second-price auctions. In Proceedings of the Twenty-Fourth Annual ACM-SIAM Symposium on Discrete Algorithms, SODA ’13, pages 1190-1204. SIAM, 2013.  Shuchi Chawla, Jason Hartline, and Denis Nekipelov. Mechanism design for data science.  In Proceedings of the Fifteenth ACM Conference on Economics and Computation, EC ’14, pages 711-712, New York, NY, USA, 2014. ACM. ISBN 978-1-4503-2565-3. doi: 10.1145/2600057. 2602881. URL http://doi.acm.org/10.1145/2600057.2602881.  Richard Cole and Tim Roughgarden. The sample complexity of revenue maximization. In Proceed- ings of the 46th Annual ACM Symposium on Theory of Computing, STOC ’14, pages 243-252, New York, NY, USA, 2014. ACM. ISBN 978-1-4503-2710-7. doi: 10.1145/2591796.2591867. URL http://doi.acm.org/10.1145/2591796.2591867.  Jacques Cr´emer and Richard P. McLean. Full extraction of the surplus in Bayesian and dominant strategy auctions. Econometrica, 56(6):pp. 1247-1257, 1988. ISSN 00129682. URL http: //www.jstor.org/stable/1913096.  Nikhil R. Devanur and Sham M. Kakade. The price of truthfulness for pay-per-click auctions. In Proceedings of the 10th ACM Conference on Electronic Commerce, EC ’09, pages 99-106, New York, NY, USA, 2009. ACM. ISBN 978-1-60558-458-4. doi: 10.1145/1566374.1566388. URL http://doi.acm.org/10.1145/1566374.1566388. WEED PERCHET RIGOLLET  Peerapong Dhangwatnotai, Tim Roughgarden, and Qiqi Yan. Revenue maximization with a single sample. Games Econom. Behav., 91:318-333, 2015. ISSN 0899-8256. doi: 10.1016/j.geb.2014. 03.011. URL http://dx.doi.org/10.1016/j.geb.2014.03.011.  Dylan Foster, Alexander Rakhlin, and Karthik Sridharan. Adaptive online learning. In NIPS, 2015.  Hu Fu, Jason Hartline, and Darrell Hoy. Prior-independent auctions for risk-averse agents.  In Proceedings of the Fourteenth ACM Conference on Electronic Commerce, EC ’13, pages 471- 488, New York, NY, USA, 2013. ACM. ISBN 978-1-4503-1962-1. doi: 10.1145/2482540. 2482551. URL http://doi.acm.org/10.1145/2482540.2482551.  Hu Fu, Nima Haghpanah, Jason Hartline, and Robert Kleinberg. Optimal auctions for correlated buyers with sampling. In Proceedings of the Fifteenth ACM Conference on Economics and Com- putation, EC ’14, pages 23-36, New York, NY, USA, 2014. ACM. ISBN 978-1-4503-2565- 3. doi: 10.1145/2600057.2602895. URL http://doi.acm.org/10.1145/2600057. 2602895.  Ramki Gummadi, Peter Key, and Alexandre Proutiere. Repeated auctions with budget constraints: optimal bidding strategies and equilibria. In Proc. of Informs Applied Probability conf., 2011.  Wei Han, Alexander Rakhlin, and Karthik Sridharan. Competing with strategies. In Shai Shalev- Shwartz and Ingo Steinwart, editors, COLT 2013 - The 26th Conference on Learning Theory, Princeton, NJ, June 12-14, 2013, volume 30 of JMLR W&CP, pages 966-992, 2013.  Jason D. Hartline and Tim Roughgarden. Simple versus optimal mechanisms. SIGecom Exch., 8 (1):5:1-5:3, July 2009. ISSN 1551-9031. doi: 10.1145/1598780.1598785. URL http://doi. acm.org/10.1145/1598780.1598785.  Elad Hazan and Satyen Kale. Extracting certainty from uncertainty:  ation in costs. Mach. Learn., 80(2-3):165-188, 2010. s10994-010-5175-x. URL http://dx.doi.org/10.1007/s10994-010-5175-x.  ISSN 0885-6125.  regret bounded by vari- doi: 10.1007/  Sham M. Kakade, Shai Shalev-Shwartz, and Ambuj Tewari. Efficient bandit algorithms for online multiclass prediction. In William W. Cohen, Andrew McCallum, and Sam T. Roweis, editors, ICML, volume 307 of ACM International Conference Proceeding Series, pages 440-447. ACM, 2008. ISBN 978-1-60558-205-4.  Yash Kanoria and Hamid Nazerzadeh. Dynamic reserve prices for repeated auctions: Learning from bids. In Tie-Yan Liu, Qi Qi, and Yinyu Ye, editors, Web and Internet Economics, volume 8877 of Lecture Notes in Computer Science, pages 232-232. Springer International Publishing, ISBN 978-3-319-13128-3. doi: 10.1007/978-3-319-13129-0 17. URL http://dx. 2014. doi.org/10.1007/978-3-319-13129-0_17.  Brendan Kitts and Benjamin Leblanc. Optimal bidding on keyword auctions. Electronic Mar- doi: 10.1080/1019678042000245119. URL http://www.  kets, 14(3):186-201, 2004. tandfonline.com/doi/abs/10.1080/1019678042000245119.  Robert Kleinberg and Tom Leighton. The value of knowing a demand curve: Bounds on regret for online posted-price auctions. In Proceedings of the 44th Annual IEEE Symposium on Foundations LEARNING IN AUCTIONS  of Computer Science, FOCS ’03, pages 594-, Washington, DC, USA, 2003. IEEE Computer So- ciety. ISBN 0-7695-2040-5. URL http://dl.acm.org/citation.cfm?id=946243. 946352.  T. L. Lai and H. Robbins. Asymptotically efficient adaptive allocation rules. Advances in Applied  Mathematics, 6:4-22, 1985.  1999. ISSN 0090-5364.  E. Mammen and A. B. Tsybakov. Smooth discrimination analysis. Ann. Statist., 27(6):1808-1829,  R.Preston McAfee. The design of advertising exchanges. Review of Industrial Organization, 39(3): 169-185, 2011. ISSN 0889-938X. doi: 10.1007/s11151-011-9300-1. URL http://dx.doi. org/10.1007/s11151-011-9300-1.  Mehryar Mohri and Andres Mu˜noz Medina. Learning theory and algorithms for revenue optimiza- tion in second price auctions with reserve. In Proceedings of the 31th International Conference on Machine Learning, ICML 2014, Beijing, China, 21-26 June 2014, pages 262-270, 2014.  S. Muthukrishnan. Ad exchanges: Research issues.  In Stefano Leonardi, editor, Internet and Network Economics, volume 5929 of Lecture Notes in Computer Science, pages 1-12. Springer Berlin Heidelberg, 2009. ISBN 978-3-642-10840-2. doi: 10.1007/978-3-642-10841-9 1. URL http://dx.doi.org/10.1007/978-3-642-10841-9_1.  Roger B. Myerson. Optimal auction design. Math. Oper. Res., 6(1):58-73, 1981. ISSN 0364-765X.  doi: 10.1287/moor.6.1.58. URL http://dx.doi.org/10.1287/moor.6.1.58.  Michael Ostrovsky and Michael Schwarz. Reserve prices in internet advertising auctions: A field experiment. In Proceedings of the 12th ACM Conference on Electronic Commerce, EC ’11, pages 59-60, New York, NY, USA, 2011. ACM. ISBN 978-1-4503-0261-6. doi: 10.1145/1993574. 1993585. URL http://doi.acm.org/10.1145/1993574.1993585.  Vianney Perchet and Philippe Rigollet. The multi-armed bandit problem with covariates. Ann.  Statist., 41(2):693-721, 2013.  Alexander Rakhlin and Karthik Sridharan. Online learning with predictable sequences.  In Shai Shalev-Shwartz and Ingo Steinwart, editors, COLT 2013 - The 26th Conference on Learning Theory, Princeton, NJ, June 12-14, 2013, volume 30 of JMLR W&CP, pages 993-1019, 2013.  John Riley and William F Samuelson. Optimal auctions. American Economic Review, 71(3): 381-92, 1981. URL http://EconPapers.repec.org/RePEc:aea:aecrev:v:71: y:1981:i:3:p:381-92.  Tim Roughgarden, Inbal Talgam-Cohen, and Qiqi Yan. Supply-limiting mechanisms.  In Pro- ceedings of the 13th ACM Conference on Electronic Commerce, EC ’12, pages 844-861, New York, NY, USA, 2012. ACM. ISBN 978-1-4503-1415-2. doi: 10.1145/2229012.2229077. URL http://doi.acm.org/10.1145/2229012.2229077.  Aleksandrs Slivkins. Contextual bandits with similarity information. J. Mach. Learn. Res., 15 (1):2533-2568, January 2014. ISSN 1532-4435. URL http://dl.acm.org/citation. cfm?id=2627435.2670330. WEED PERCHET RIGOLLET  Long Tran-Thanh, Lampros C. Stavrogiannis, Victor Naroditskiy, Valentin Robu, Nicholas R. Jen- nings, and Peter Key. Efficient regret bounds for online bid optimisation in budget-limited spon- sored search auctions. In Proceedings of the Thirtieth Conference on Uncertainty in Artificial Intelligence, UAI 2014, Quebec City, Quebec, Canada, July 23-27, 2014, pages 809-818, 2014.  Alexandre Tsybakov. Statistique appliqu´ee. Lecture Notes, 2006.  Alexandre B. Tsybakov. Introduction to nonparametric estimation. Springer Series in Statistics. ISBN 978-0-387-79051-0. Revised and extended from the 2004  Springer, New York, 2009. French original, Translated by Vladimir Zaiats.  Chih-Chun Wang, S.R. Kulkarni, and H.V. Poor. Bandit problems with arbitrary side observations. In Decision and Control, 2003. Proceedings. 42nd IEEE Conference on, volume 3, pages 2948- 2953 Vol.3, Dec 2003. doi: 10.1109/CDC.2003.1273074.  Robert Wilson. Game-theoretic analyses of trading processes.  In Truman Fassett Bewley, ed- itor, Advances in Economic Theory, pages 33-70. Cambridge University Press, 1987. ISBN 9781139052054. URL http://dx.doi.org/10.1017/CCOL0521340446.002. Cam- bridge Books Online.  Robert B. Wilson. Competitive bidding with disparate information. Management Science, 15(7): ISSN 00251909, 15265501. URL http://www.jstor.org/stable/  446-448, 1969. 2628640. LEARNING IN AUCTIONS"}