{"1": "Benny Chor, Eyal Kushilevitz, Oded Goldreich, and Madhu Sudan. Private information retrieval.  Journal of the ACM, 45(6):965-981, 1998.  Cynthia Dwork. Differential privacy: A survey of results. In International Conference on Theory  and Applications of Models of Computation, pages 1-19. Springer, 2008.  Cynthia Dwork and Aaron Roth. The algorithmic foundations of differential privacy. Foundations  and Trends in Theoretical Computer Science, 9(3-4):211-407, 2014.  William Gasarch. A survey on private information retrieval. In Bulletin of the EATCS. Citeseer,  2004.  Eyal Kushilevitz and Rafail Ostrovsky. Replication is not needed: Single database, computationally- private information retrieval. In Foundations of Computer Science (FOCS), volume 97, pages 364-373, 1997.  John Tsitsiklis and Kuang Xu. Delay-predictability tradeoffs in reaching a secret goal. Operations  Research, 66(2):587-596, 2018.  John N Tsitsiklis, Kuang Xu, and Zhi Xu.  Private sequential  learning.  arXiv preprint  arXiv:1805.02136, 2018. URL https://arxiv.org/abs/1805.02136.  Zhi Xu. Private sequential search and optimization. Master’s thesis, Massachusetts Institute of  Technology, 2017. URL http://hdl.handle.net/1721.1/112054.  7   PRIVATE SEQUENTIAL LEARNING  A main take-away from the above results is about the price of privacy: it is not difficult to see that in the absence of a privacy constraint, the most efficient strategy, using a bisection search, can locate the true value with log(1/(cid:15)) queries. Our results thus demonstrate that the price of privacy is at most an additive factor of 2L.  The proof of Theorem 4 is given in Tsitsiklis et al. (2018). For the upper bound, we con- struct a certain Opportunistic Bisection (OB) query strategy, where the learner augments a bisection search with 2L additional “opportunistic” queries in a randomized and symmetric manner, such the adversary cannot be certain whether the true value is discovered by the bisection search, or the opportunistic queries. For the lower bound, one may ask whether the additional 2L queries need to be distinct from the log(1/(cid:15)) queries used by the bisection search, or essentially, whether the query complexity could be further reduced by “blending” the queries for obfuscation with those for identifying the true value in a more effective manner. However, we show that such “blending” is not possible.  References  Benny Chor, Eyal Kushilevitz, Oded Goldreich, and Madhu Sudan. Private information retrieval.  Journal of the ACM, 45(6):965-981, 1998.  Cynthia Dwork. Differential privacy: A survey of results. In International Conference on Theory  and Applications of Models of Computation, pages 1-19. Springer, 2008.  Cynthia Dwork and Aaron Roth. The algorithmic foundations of differential privacy. Foundations  and Trends in Theoretical Computer Science, 9(3-4):211-407, 2014.  William Gasarch. A survey on private information retrieval. In Bulletin of the EATCS. Citeseer,  2004.  Eyal Kushilevitz and Rafail Ostrovsky. Replication is not needed: Single database, computationally- private information retrieval. In Foundations of Computer Science (FOCS), volume 97, pages 364-373, 1997.  John Tsitsiklis and Kuang Xu. Delay-predictability tradeoffs in reaching a secret goal. Operations  Research, 66(2):587-596, 2018.  John N Tsitsiklis, Kuang Xu, and Zhi Xu.  Private sequential  learning.  arXiv preprint  arXiv:1805.02136, 2018. URL https://arxiv.org/abs/1805.02136.  Zhi Xu. Private sequential search and optimization. Master’s thesis, Massachusetts Institute of  Technology, 2017. URL http://hdl.handle.net/1721.1/112054."}