{"1": "Nir Ailon, Zohar Karnin, and Thorsten Joachims. Reducing dueling bandits to cardinal bandits. In  Proceedings of the International Conference on Machine Learning (ICML), 2014.  R. Busa-Fekete, B. Sz¨or´enyi, P. Weng, W. Cheng, and E. H¨ullermeier. Top-k selection based on adaptive sampling of noisy preferences. In Proceedings of the International Conference on Ma- chine Learning (ICML), 2013.  R. Busa-Fekete, B. Sz¨or´enyi, and E. H¨ullermeier. PAC rank elicitation through adaptive sampling of stochastic pairwise preferences. In National Conference on Artificial Intelligence (AAAI), 2014.  Yuxin Chen and Changho Suh. Spectral mle: Top-k rank aggregation from pairwise comparisons. In Proceedings of the International Conference on Machine Learning (ICML), pages 371-380, 2015.  Massimiliano Ciaramita, Vanessa Murdock, and Vassilis Plachouras. Online learning from click  data for sponsored search. In World Wide Web. ACM, 2008.  Miroslav Dud´ık, Katja Hofmann, Robert E. Schapire, Aleksandrs Slivkins, and Masrour Zoghi.  Contextual dueling bandits. In Conference on Learning Theory (COLT), 2015.  Eyal Even-Dar, Shie Mannor, and Yishay Mansour. PAC bounds for multi-armed bandit and Markov  decision processes. In Conference on Learning Theory (COLT). Springer, 2002.  Katja Hofmann, Shimon Whiteson, and Maarten de Rijke. Balancing exploration and exploitation in listwise and pairwise online learning to rank for information retrieval. Information Retrieval, 16(1):63-90, 2013.  Kevin Jamieson, Sumeet Katariya, Atul Deshpande, and Robert Nowak. Sparse dueling bandits. In  Artificial Intelligence and Statistics, pages 416-424, 2015.  Thorsten Joachims. Optimizing search engines using clickthrough data. In KDD, 2002.  Junpei Komiyama, Junya Honda, Hisashi Kashima, and Hiroshi Nakagawa. Regret lower bound and optimal algorithm in dueling bandit problem. In Conference on Learning Theory (COLT), 2015.  Junpei Komiyama, Junya Honda, and Hiroshi Nakagawa. Copeland dueling bandit problem: Regret lower bound, optimal algorithm, and computationally efficient algorithm. In Proceedings of the International Conference on Machine Learning (ICML), 2016.  Sahand Negahban, Sewoong Oh, and Devavrat Shah. Iterative ranking from pair-wise comparisons.  In NIPS, 2012.  24   BALSUBRAMANI KARNIN SCHAPIRE ZOGHI  We would like to thank Alekh Agarwal, Miroslav Dud´ık, and Akshay Krishnamurthy for many formative discussions on the problem.  Acknowledgments  References  Nir Ailon, Zohar Karnin, and Thorsten Joachims. Reducing dueling bandits to cardinal bandits. In  Proceedings of the International Conference on Machine Learning (ICML), 2014.  R. Busa-Fekete, B. Sz¨or´enyi, P. Weng, W. Cheng, and E. H¨ullermeier. Top-k selection based on adaptive sampling of noisy preferences. In Proceedings of the International Conference on Ma- chine Learning (ICML), 2013.  R. Busa-Fekete, B. Sz¨or´enyi, and E. H¨ullermeier. PAC rank elicitation through adaptive sampling of stochastic pairwise preferences. In National Conference on Artificial Intelligence (AAAI), 2014.  Yuxin Chen and Changho Suh. Spectral mle: Top-k rank aggregation from pairwise comparisons. In Proceedings of the International Conference on Machine Learning (ICML), pages 371-380, 2015.  Massimiliano Ciaramita, Vanessa Murdock, and Vassilis Plachouras. Online learning from click  data for sponsored search. In World Wide Web. ACM, 2008.  Miroslav Dud´ık, Katja Hofmann, Robert E. Schapire, Aleksandrs Slivkins, and Masrour Zoghi.  Contextual dueling bandits. In Conference on Learning Theory (COLT), 2015.  Eyal Even-Dar, Shie Mannor, and Yishay Mansour. PAC bounds for multi-armed bandit and Markov  decision processes. In Conference on Learning Theory (COLT). Springer, 2002.  Katja Hofmann, Shimon Whiteson, and Maarten de Rijke. Balancing exploration and exploitation in listwise and pairwise online learning to rank for information retrieval. Information Retrieval, 16(1):63-90, 2013.  Kevin Jamieson, Sumeet Katariya, Atul Deshpande, and Robert Nowak. Sparse dueling bandits. In  Artificial Intelligence and Statistics, pages 416-424, 2015.  Thorsten Joachims. Optimizing search engines using clickthrough data. In KDD, 2002.  Junpei Komiyama, Junya Honda, Hisashi Kashima, and Hiroshi Nakagawa. Regret lower bound and optimal algorithm in dueling bandit problem. In Conference on Learning Theory (COLT), 2015.  Junpei Komiyama, Junya Honda, and Hiroshi Nakagawa. Copeland dueling bandit problem: Regret lower bound, optimal algorithm, and computationally efficient algorithm. In Proceedings of the International Conference on Machine Learning (ICML), 2016.  Sahand Negahban, Sewoong Oh, and Devavrat Shah. Iterative ranking from pair-wise comparisons.  In NIPS, 2012. REGRET BOUNDS FOR DUELING BANDITS  Guillermo Owen. Game Theory. Emerald Group Publishing Limited, 3rd edition, 1995.  Sandeep Pandey, Deepak Agarwal, Deepayan Chakrabarti, and Vanja Josifovski. Bandits for tax- onomies: A model-based approach. In SIAM Conference on Data Mining (SDM). SIAM, 2007.  Seung-Taek Park and Wei Chu. Pairwise preference regression for cold-start recommendation. In  Proceedings of the Third ACM Conference on Recommender Systems. ACM, 2009.  Ronald L. Rivest and Emily Shen. An optimal single-winner preferential voting system based on In Proceedings Third International Workshop on Computational Social Choice,  game theory. 2010.  Tanguy Urvoy, Fabrice Clerot, Raphael F´eraud, and Sami Naamane. Generic exploration and k- In Proceedings of the International Conference on Machine Learning  armed voting bandits. (ICML), pages 91-99, 2013.  Yisong Yue and Thorsten Joachims. Beat the mean bandit.  In Proceedings of the International  Conference on Machine Learning (ICML), 2011.  Yisong Yue, Josef Broder, Robert Kleinberg, and Thorsten Joachims. The K-armed dueling bandits  problem. Journal of Computer and System Sciences, 78(5):1538-1556, September 2012.  Masrour Zoghi, Shimon Whiteson, Maarten de Rijke, and R´emi Munos. Relative confidence sam- pling for efficient on-line ranker evaluation. In Proceedings of the International Conference on Web Search and Data Mining (WSDM), 2014a.  Masrour Zoghi, Shimon Whiteson, R´emi Munos, and Maarten de Rijke. Relative upper confidence bound for the k-armed dueling bandits problem. In Proceedings of the International Conference on Machine Learning (ICML), 2014b.  Masrour Zoghi, Zohar Karnin, Shimon Whiteson, and Maarten de Rijke. Copeland dueling bandits.  In Proceedings of the International Conference on Machine Learning (ICML), 2015a.  Masrour Zoghi, Shimon Whiteson, and Maarten de Rijke. MergeRUCB: A method for large-scale In Proceedings of the International Conference on Web Search and  online ranker evaluation. Data Mining (WSDM), 2015b."}