{"1": "tation, 75(2):87-106, 1987.  D. Angluin. Learning Regular Sets from Queries and Counterexamples. Information and Compu-  D. Barrington. Bounded-width polynomial-size branching programs recognize exactly those lan-  guages in nc1. Journal of Computer and System Sciences, 38(1):150-164, 1989.  E. Baum. On learning a union of halfspaces. Journal of Complexity, 6(1):67-101, 1990.  Amos Beimel, Francesco Bergadano, Nader H. Bshouty, Eyal Kushilevitz, and Stefano Varricchio.  Learning functions represented as multiplicity automata. J. ACM, 47(3):506-530, 2000.  A. Blum and R. Kannan. Learning an intersection of a constant number of halfspaces over a uniform  distribution. J. Comput. Syst. Sci. (JCSS), 54(2):371-380, 1997.  N. Bshouty, C. Tamon, and D. Wilson. On learning width two branching programs. Information  Processing Letters, 65:217-222, 1998.  F. Erg¨un, R. Kumar, and R. Rubinfeld. On learning bounded-width branching programs. In COLT,  pages 361-368, 1995.  P. Gopalan, A. Klivans, and R. Meka. Polynomial-time approximation schemes for knapsack and re- lated counting problems using branching programs. In Electronic Colloquium on Computational Complexity (ECCC), 2011a.  P. Gopalan, A. Klivans, R. Meka, D. Stefankovic, S. Vempala, and E. Vigoda. An FPTAS for  knapsack and related counting problems. In FOCS, pages 817-826, 2011b.  15.9   LEARNING USING PREFIX COVERS  4. Conclusions  Our algorithm for learning functions of halfspaces exploits the connection between halfspaces and ROBPs. It would be interesting if this connection could lead to improved algorithms for agnosti- cally learning halfspaces. In particular, the problem of agnostically learning poly(n)-ROBPs with membership queries is open. A (query) algorithm for this problem will give a (query) algorithm for agnostically learning halfspaces.  The best known algorithm for agnostically learning a halfspace under the uniform distribution on {0, 1}n due to Kalai et al. (2008) runs in time O(n1/ε2). Their paper also shows that a poly(n, 1/ε) algorithm for agnostically learning halfspaces from random examples alone will result in a poly(n) time algorithm for the notorious noisy parity problem. This seems to suggest that such an algo- rithm is perhaps unlikely, but it leaves open the possibility of a poly(n, 1/ε) algorithm that uses membership queries. ROBP-based algorithms seem to be the only tool we currently have to exploit membership queries in the context of halfspace learning.  Adam Klivans is supported by an NSF CAREER Award and NSF CCF 0728536.  5. Acknowledgments  References  tation, 75(2):87-106, 1987.  D. Angluin. Learning Regular Sets from Queries and Counterexamples. Information and Compu-  D. Barrington. Bounded-width polynomial-size branching programs recognize exactly those lan-  guages in nc1. Journal of Computer and System Sciences, 38(1):150-164, 1989.  E. Baum. On learning a union of halfspaces. Journal of Complexity, 6(1):67-101, 1990.  Amos Beimel, Francesco Bergadano, Nader H. Bshouty, Eyal Kushilevitz, and Stefano Varricchio.  Learning functions represented as multiplicity automata. J. ACM, 47(3):506-530, 2000.  A. Blum and R. Kannan. Learning an intersection of a constant number of halfspaces over a uniform  distribution. J. Comput. Syst. Sci. (JCSS), 54(2):371-380, 1997.  N. Bshouty, C. Tamon, and D. Wilson. On learning width two branching programs. Information  Processing Letters, 65:217-222, 1998.  F. Erg¨un, R. Kumar, and R. Rubinfeld. On learning bounded-width branching programs. In COLT,  pages 361-368, 1995.  P. Gopalan, A. Klivans, and R. Meka. Polynomial-time approximation schemes for knapsack and re- lated counting problems using branching programs. In Electronic Colloquium on Computational Complexity (ECCC), 2011a.  P. Gopalan, A. Klivans, R. Meka, D. Stefankovic, S. Vempala, and E. Vigoda. An FPTAS for  knapsack and related counting problems. In FOCS, pages 817-826, 2011b.  15.9   GOPALAN KLIVANS MEKA  P. Harsha, A. Klivans, and R. Meka. An invariance principle for polytopes. In STOC, pages 543-  552, 2010.  A. Kalai, A. Klivans, Y. Mansour, and R. Servedio. Agnostically learning halfspaces. SIAM Journal  on Computing, 37(6):1777-1805, 2008.  J. Kamp, A. Rao, S. P. Vadhan, and D. Zuckerman. Deterministic extractors for small-space sources.  In STOC, pages 691-700, 2006.  M. Kearns and L. Valiant. Cryptographic limitations on learning Boolean formulae and finite au-  tomata. Journal of the ACM, 41(1):67-95, 1994.  A. Klivans, R. O’Donnell, and R. Servedio. Learning intersections and thresholds of halfspaces.  Journal of Computer & System Sciences, 68(4):808-840, 2004.  A. Klivans, P. M. Long, and A. Tang. Baum’s algorithm learns intersections of halfspaces with  respect to log-concave distributions. In APPROX-RANDOM, pages 588-600, 2009.  A. R. Klivans, R. O’Donnell, and R. Servedio. Learning geometric concepts via Gaussian surface  area. In FOCS, pages 541-550, 2008.  N. Linial, Y. Mansour, and N. Nisan. Constant depth circuits, Fourier transform and learnability.  Journal of the ACM, 40(3):607-620, 1993.  R. Meka and D. Zuckerman. Pseudorandom generators for polynomial threshold functions.  In  STOC, pages 427-436, 2010.  R. O’Donnell. Noise sensitivity of intersections of halfspaces, Open problem collection (Simons  Symposium). http://analysisofbooelanfunctions.org, 2012.  S. Vempala. A random sampling based algorithm for learning the intersection of halfspaces. In  FOCS, pages 508-513, 1997.  S. Vempala. Learning convex concepts from gaussian distributions with PCA.  In FOCS, pages  S. Vempala. A random-sampling-based algorithm for learning intersections of halfspaces. J. ACM,  124-130, 2010a.  57(6):32, 2010b.  15.10"}