{"1": "Soren Asmussen and Peter W. Glynn. Stochastic Simulation: Algorithms and Analysis: Algorithms  and Analysis. Stochastic Modelling and Applied Probability. Springer, 2007.  Daryl J Daley and David Vere-Jones. An introduction to the theory of point processes. 2007.  Amit Deshpande and Luis Rademacher. Efficient volume sampling for row/column subset selection. In Proceedings of the 2010 IEEE 51st Annual Symposium on Foundations of Computer Science, FOCS ’10, pages 329-338. IEEE Computer Society, 2010.  Josip Djolonga and Andreas Krause. From MAP to marginals: Variational inference in bayesian submodular models. In Advances in Neural Information Processing Systems 27, pages 244-252. Curran Associates, Inc., 2014.  R. L. Dobrushin and S. B. Shlosman. Constructive criterion for the uniqueness of Gibbs field. In Statistical physics and dynamical systems (K¨oszeg, 1984), volume 10 of Progr. Phys., pages 347-370. Birkh¨auser Boston, Boston, MA, 1985.  R. L. Dobruˇsin. Definition of a system of random variables by means of conditional distributions.  Teor. Verojatnost. i Primenen., 15:469-497, 1970.  Martin Dyer, Leslie Ann Goldberg, and Mark Jerrum. Matrix norms and rapid mixing for spin  systems. Ann. Appl. Probab., 19(1):71-107, 02 2009.  Khalid El-Arini, Gaurav Veda, Dafna Shahaf, and Carlos Guestrin. Turning down the noise in the  blogosphere. In KDD, 2009.  50(3):273-285, 1979.  H. F¨ollmer. Tail structure of Markov chains on infinite product spaces. Z. Wahrsch. Verw. Gebiete,  Hans-Otto Georgii. Gibbs measures and phase transitions, volume 9 of de Gruyter Studies in  Mathematics. Walter de Gruyter & Co., Berlin, second edition, 2011.  Leslie Ann Goldberg and Mark Jerrum. The complexity of ferromagnetic ising with local fields.  Combinatorics, Probability and Computing, 2007.  J Ben Hough, Manjunath Krishnapur, Yuval Peres, B´alint Vir´ag, et al. Determinantal processes and  independence. 2006.  Rishabh Iyer and Jeff Bilmes. Submodular point processes. In 18th International Conference on  Artificial Intelligence and Statistics (AISTATS-2015), May 2015.  Rishabh Iyer, Stefanie Jegelka, and Jeff Bilmes. Fast semidifferential-based submodular function  optimization. NIPS, 2013.  NIPS, 2011.  Stefanie Jegelka, Hui Lin, and Jeff A Bilmes. On fast approximate submodular minimization. In  Mark Jerrum and Alistair Sinclair. Polynomial-time approximation algorithms for the ising model.  SIAM Journal on Computing, 22(5):1087-1116, 1993.  13   FAST MIXING FOR DISCRETE POINT PROCESSES  References  Soren Asmussen and Peter W. Glynn. Stochastic Simulation: Algorithms and Analysis: Algorithms  and Analysis. Stochastic Modelling and Applied Probability. Springer, 2007.  Daryl J Daley and David Vere-Jones. An introduction to the theory of point processes. 2007.  Amit Deshpande and Luis Rademacher. Efficient volume sampling for row/column subset selection. In Proceedings of the 2010 IEEE 51st Annual Symposium on Foundations of Computer Science, FOCS ’10, pages 329-338. IEEE Computer Society, 2010.  Josip Djolonga and Andreas Krause. From MAP to marginals: Variational inference in bayesian submodular models. In Advances in Neural Information Processing Systems 27, pages 244-252. Curran Associates, Inc., 2014.  R. L. Dobrushin and S. B. Shlosman. Constructive criterion for the uniqueness of Gibbs field. In Statistical physics and dynamical systems (K¨oszeg, 1984), volume 10 of Progr. Phys., pages 347-370. Birkh¨auser Boston, Boston, MA, 1985.  R. L. Dobruˇsin. Definition of a system of random variables by means of conditional distributions.  Teor. Verojatnost. i Primenen., 15:469-497, 1970.  Martin Dyer, Leslie Ann Goldberg, and Mark Jerrum. Matrix norms and rapid mixing for spin  systems. Ann. Appl. Probab., 19(1):71-107, 02 2009.  Khalid El-Arini, Gaurav Veda, Dafna Shahaf, and Carlos Guestrin. Turning down the noise in the  blogosphere. In KDD, 2009.  50(3):273-285, 1979.  H. F¨ollmer. Tail structure of Markov chains on infinite product spaces. Z. Wahrsch. Verw. Gebiete,  Hans-Otto Georgii. Gibbs measures and phase transitions, volume 9 of de Gruyter Studies in  Mathematics. Walter de Gruyter & Co., Berlin, second edition, 2011.  Leslie Ann Goldberg and Mark Jerrum. The complexity of ferromagnetic ising with local fields.  Combinatorics, Probability and Computing, 2007.  J Ben Hough, Manjunath Krishnapur, Yuval Peres, B´alint Vir´ag, et al. Determinantal processes and  independence. 2006.  Rishabh Iyer and Jeff Bilmes. Submodular point processes. In 18th International Conference on  Artificial Intelligence and Statistics (AISTATS-2015), May 2015.  Rishabh Iyer, Stefanie Jegelka, and Jeff Bilmes. Fast semidifferential-based submodular function  optimization. NIPS, 2013.  NIPS, 2011.  Stefanie Jegelka, Hui Lin, and Jeff A Bilmes. On fast approximate submodular minimization. In  Mark Jerrum and Alistair Sinclair. Polynomial-time approximation algorithms for the ising model.  SIAM Journal on Computing, 22(5):1087-1116, 1993. REBESCHINI KARBASI  Byungkon Kang. Fast determinantal point process sampling with application to clustering.  In Advances in Neural Information Processing Systems 26, pages 2319-2327. Curran Associates, Inc., 2013.  Andreas Krause and Daniel Golovin. Submodular function maximization. In Tractability: Practical  Approaches to Hard Problems (to appear). Cambridge University Press, February 2014.  Alex Kulesza and Ben Taskar. Determinantal point processes for machine learning. 2012.  D.A. Levin, Y. Peres, and E.L. Wilmer. Markov Chains and Mixing Times. American Mathematical  Soc., 2008.  Baharan Mirzasoleiman, Amin Karbasi, Rik Sarkar, and Andreas Krause. Distributed submodular  maximization: Identifying representative elements in massive data. In NIPS, 2013.  Elchanan Mossel and Allan Sly. Exact thresholds for Ising-Gibbs samplers on general graphs. Ann.  Probab., 41(1):294-328, 01 2013.  Patrick Rebeschini and Ramon van Handel. Comparison theorems for Gibbs measures. Journal of  Statistical Physics, 157(2):234-281, 2014.  Amar Shah and Zoubin Ghahramani. Determinantal clustering processes - A nonparametric In Proceedings of the Twenty-  bayesian approach to kernel based semi-supervised clustering. Ninth Conference on Uncertainty in Artificial Intelligence, 2013.  Peter Stobbe and Andreas Krause. Efficient minimization of decomposable submodular functions. In Advances in Neural Information Processing Systems 23, pages 2208-2216. Curran Associates, Inc., 2010.  Martin J Wainwright and Michael I Jordan. Graphical models, exponential families, and variational  inference. Foundations and Trends R(cid:13) in Machine Learning, 2008.  Dror Weitz. Combinatorial criteria for uniqueness of Gibbs measures. Random Structures Algo-  rithms, 27(4):445-475, 2005."}