{"1": "S. Agarwal, T. Graepel, R. Herbrich, S. Har-Peled, and D. Roth. Generalization bounds  for the area under an ROC curve. 2004.  A. Al-Maskari, M. Sanderson, and P. Clough. The relationship between IR eﬀectiveness  measures and user satisfaction. In SIGIR, pages 773-774, 2007.  J.A. Aslam, E. Yilmaz, and V. Pavlu. The maximum entropy method for analyzing retrieval In Proceedings of the 28th annual international ACM SIGIR conference on  measures. Research and development in information retrieval, pages 27-34. ACM, 2005.  R. Baeza-Yates and B. Ribeiro-Neto. Modern Information Retrieval, volume 82. Addison-  Wesley New York, 1999.  M.F. Balcan, N. Bansal, A. Beygelzimer, D. Coppersmith, J. Langford, and G.B. Sorkin. Robust reductions from ranking to classification. Machine learning, 72(1):139-153, 2008.  P.L. Bartlett, M.I. Jordan, and J.D. McAuliﬀe. Convexity, classification, and risk bounds.  Journal of the American Statistical Association, 101(473):138-156, 2006.  D. Buﬀoni, C. Calauzenes, P. Gallinari, and N. Usunier. Learning scoring functions with order-preserving losses and standardized supervision. In Proceedings of the 28th Interna- tional Conference on Machine Learning, 2011.  C.J.C. Burges, R. Ragno, and Q. V. Le. Learning to rank with nonsmooth cost function- s. In Advances in Neural Information Processing Systems 19: Proceedings of the 2006 Conference, volume 19, page 193. The MIT Press, 2007.  Cl´ement Calauz`enes, Nicolas Usunier, and Patrick Gallinari. On the (non-)existence of convex, calibrated surrogate losses for ranking. In P. Bartlett, F.C.N. Pereira, C.J.C. Burges, L. Bottou, and K.Q. Weinberger, editors, Advances in Neural Information Pro- cessing Systems 25, pages 197-205. 2012.  Z. Cao, T. Qin, T.Y. Liu, M.F. Tsai, and H. Li. Learning to rank: from pairwise approach  to listwise approach. In ICML, pages 129-136, 2007.  O. Chapelle, D. Metlzer, Y. Zhang, and P. Grinspan. Expected reciprocal rank for graded In Proceedings of the 18th ACM conference on Information and knowledge  relevance. management, pages 621-630. ACM, 2009.  St´ephan J.M. Cl´emen¸con and Nicolas Vayatis. Empirical performance maximization for linear rank statistics. In D. Koller, D. Schuurmans, Y. Bengio, and L. Bottou, editors, Advances in Neural Information Processing Systems 21, pages 305-312. 2009.  28   Wang Wang Li He Chen Liu  Proof The proof is almost the same as the proof of Lemma 23  The theorem follows immediately from Lemma 33 and Lemma 34.  References  S. Agarwal, T. Graepel, R. Herbrich, S. Har-Peled, and D. Roth. Generalization bounds  for the area under an ROC curve. 2004.  A. Al-Maskari, M. Sanderson, and P. Clough. The relationship between IR eﬀectiveness  measures and user satisfaction. In SIGIR, pages 773-774, 2007.  J.A. Aslam, E. Yilmaz, and V. Pavlu. The maximum entropy method for analyzing retrieval In Proceedings of the 28th annual international ACM SIGIR conference on  measures. Research and development in information retrieval, pages 27-34. ACM, 2005.  R. Baeza-Yates and B. Ribeiro-Neto. Modern Information Retrieval, volume 82. Addison-  Wesley New York, 1999.  M.F. Balcan, N. Bansal, A. Beygelzimer, D. Coppersmith, J. Langford, and G.B. Sorkin. Robust reductions from ranking to classification. Machine learning, 72(1):139-153, 2008.  P.L. Bartlett, M.I. Jordan, and J.D. McAuliﬀe. Convexity, classification, and risk bounds.  Journal of the American Statistical Association, 101(473):138-156, 2006.  D. Buﬀoni, C. Calauzenes, P. Gallinari, and N. Usunier. Learning scoring functions with order-preserving losses and standardized supervision. In Proceedings of the 28th Interna- tional Conference on Machine Learning, 2011.  C.J.C. Burges, R. Ragno, and Q. V. Le. Learning to rank with nonsmooth cost function- s. In Advances in Neural Information Processing Systems 19: Proceedings of the 2006 Conference, volume 19, page 193. The MIT Press, 2007.  Cl´ement Calauz`enes, Nicolas Usunier, and Patrick Gallinari. On the (non-)existence of convex, calibrated surrogate losses for ranking. In P. Bartlett, F.C.N. Pereira, C.J.C. Burges, L. Bottou, and K.Q. Weinberger, editors, Advances in Neural Information Pro- cessing Systems 25, pages 197-205. 2012.  Z. Cao, T. Qin, T.Y. Liu, M.F. Tsai, and H. Li. Learning to rank: from pairwise approach  to listwise approach. In ICML, pages 129-136, 2007.  O. Chapelle, D. Metlzer, Y. Zhang, and P. Grinspan. Expected reciprocal rank for graded In Proceedings of the 18th ACM conference on Information and knowledge  relevance. management, pages 621-630. ACM, 2009.  St´ephan J.M. Cl´emen¸con and Nicolas Vayatis. Empirical performance maximization for linear rank statistics. In D. Koller, D. Schuurmans, Y. Bengio, and L. Bottou, editors, Advances in Neural Information Processing Systems 21, pages 305-312. 2009. Short Title  S. Clemen¸con, G. Lugosi, and N. Vayatis. Ranking and empirical minimization of U-  statistics. The Annals of Statistics, 36(2):844-874, 2008.  D. Cossock and T. Zhang. Statistical analysis of bayes optimal subset ranking. Information  Theory, IEEE Transactions on, 54(11):5140-5154, 2008.  K. Crammer and Y. Singer. Pranking with ranking. In Advances in Neural Information  Processing Systems, 2002.  Addison-Wesley, 2010.  W.B. Croft, D. Metzler, and T. Strohman. Search engines: Information retrieval in practice.  J. Duchi, L. Mackey, and M.I. Jordan. On the consistency of ranking algorithms.  In Proceedings of the 27th International Conference on Machine Learning, pages 327-334, 2010.  Y. Freund, R. Iyer, R.E. Schapire, and Y. Singer. An eﬃcient boosting algorithm for combining preferences. The Journal of Machine Learning Research, 4:933-969, 2003. ISSN 1532-4435.  J. H´ajek, Z. ˇSid´ak, and P.K. Sen. Theory of rank tests. Academic press New York, 1967.  R. Herbrich, T. Graepel, and K. Obermayer. Large margin rank boundaries for ordinal regression. Advances in Neural Information Processing Systems, pages 115-132, 1999.  K. J¨arvelin and J. Kek¨al¨ainen. IR evaluation methods for retrieving highly relevant doc- In Proceedings of the 23rd annual international ACM SIGIR conference on  uments. Research and development in information retrieval, pages 41-48. ACM, 2000.  K. J¨arvelin and J. Kek¨al¨ainen. Cumulated gain-based evaluation of IR techniques. ACM  Transactions on Information Systems (TOIS), 20(4):422-446, 2002.  T. Joachims. Optimizing search engines using clickthrough data.  In Proceedings of the eighth ACM SIGKDD international conference on Knowledge discovery and data mining, pages 133-142. ACM, 2002.  Evangelos Kanoulas and Javed A. Aslam. Empirical justification of the gain and discount In Proceedings of the 18th ACM conference on Information and  function for NDCG. knowledge management, pages 611-620. ACM, 2009.  M.G. Kendall. A new measure of rank correlation. Biometrika, 30(1/2):81-93, 1938.  R. Nallapati. Discriminative models for information retrieval. In Proceedings of the 27th an- nual international ACM SIGIR conference on Research and development in information retrieval, pages 64-71. ACM, 2004.  P. Ravikumar, A. Tewari, and E. Yang. On NDCG consistency of listwise ranking methods. In Proceedings of 14th International Conference on Artificial Intelligence and Statistics, AISTATS, 2011. Wang Wang Li He Chen Liu  C. Rudin. The p-norm push: A simple convex ranking algorithm that concentrates at the  top of the list. The Journal of Machine Learning Research, 10:2233-2271, 2009.  T. Sakai. Evaluating evaluation metrics based on the bootstrap. In Proceedings of the 29th annual international ACM SIGIR conference on Research and development in informa- tion retrieval, pages 525-532. ACM, 2006.  G. Sansone. Orthogonal Functions. Interscience Publishers Inc., New York, 1959.  A. Tewari and P.L. Bartlett. On the consistency of multiclass classification methods. Journal  of Machine Learning Research, 8:1007-1025, 2007.  A. Turpin and F. Scholer. User performance versus precision measures for simple search tasks. In Proceedings of the 29th annual international ACM SIGIR conference on Research and development in information retrieval, pages 11-18. ACM, 2006.  H. Valizadegan, R. Jin, R. Zhang, and J. Mao. Learning to rank by optimizing NDCG  measure. Advances in Neural Information Processing Systems, 22:1883-1891, 2009.  E.M. Voorhees. Evaluation by highly relevant documents. In Proceedings of the 24th an- nual international ACM SIGIR conference on Research and development in information retrieval, pages 74-82. ACM, 2001.  F. Xia, T.Y. Liu, J. Wang, W. Zhang, and H. Li. Listwise approach to learning to rank: theory and algorithm. In Proceedings of the 25th international conference on Machine learning, pages 1192-1199. ACM, 2008.  Y. Yue, T. Finley, F. Radlinski, and T. Joachims. A support vector method for optimizing average precision. In Proceedings of the 30th annual international ACM SIGIR conference on Research and development in information retrieval, pages 271-278. ACM, 2007.  T. Zhang. Statistical behavior and consistency of classification methods based on convex  risk minimization. Annals of Statistics, pages 56-85, 2004a.  T. Zhang. Statistical analysis of some multi-category large margin classification methods.  The Journal of Machine Learning Research, 5:1225-1251, 2004b.  K. Zhou, H. Zha, Y. Chang, and G.R. Xue. Learning the gain values and discount factors of discounted cumulative gains. IEEE Transactions on Knowledge and Data Engineering, to appear."}