{"1": "Shivani Agarwal. The infinite push: A new support vector ranking algorithm that directly optimizes accuracy at the absolute top of the list. In SIAM International Conference on Data Mining (SDM), pages 839-850, 2011.  Shivani Agarwal. Surrogate regret bounds for the area under the ROC curve via strongly proper  losses. In Conference on Learning Theory (COLT), pages 338-353, 2013.  Shivani Agarwal, Thore Graepel, Ralf Herbrich, Sariel Har-Peled, and Dan Roth. Generalization bounds for the area under the ROC curve. Journal of Machine Learning Research, 6:393-425, December 2005.  Maria-Florina Balcan, Nikhil Bansal, Alina Beygelzimer, Don Coppersmith, John Langford, and Gregory B . Sorkin. Robust reductions from ranking to classification. Machine Learning, 72 (1-2):139-153, 2008. doi: 10.1007/s10994-008-5058-6.  Peter L. Bartlett, Michael I. Jordan, and Jon D. McAuliffe. Convexity, classification, and risk  bounds. Journal of the American Statistical Association, 101(473):138-156, 2006.  Stephen P. Boyd, Corinna Cortes, Mehryar Mohri, and Ana Radovanovic. Accuracy at the top. In  Advances In Neural Information Processing Systems (NIPS), pages 962-970, 2012.  Andreas Buja, Werner Stuetzle, and Yi Shen. Loss functions for binary class probability estimation and classification: Structure and applications. www-stat.wharton.upenn.edu/˜buja, 2005. Unpublished manuscript.  Chris Burges, Tal Shaked, Erin Renshaw, Ari Lazier, Matt Deeds, Nicole Hamilton, and Greg Hul- lender. Learning to rank using gradient descent. In Proceedings of the 22nd International Con- ference on Machine learning (ICML), pages 89-96, New York, NY, USA, 2005. ACM. doi: 10.1145/1102351.1102363.  St´ephan Cl´emenc¸on and Nicolas Vayatis. Ranking the best instances. Journal of Machine Learning  Research, 8:2671-2699, December 2007.  St´ephan Cl´emenc¸on, G´abor Lugosi, and Nicolas Vayatis. Ranking and Empirical Minimization of  U-statistics. The Annals of Statistics, 36(2):844-874, April 2008.  William W. Cohen, Robert E. Schapire, and Yoram Singer. Learning to order things. Journal of  Artificial Intelligence Research, 10(1):243-270, May 1999.  Luc Devroye, L´aszl´o Gy¨orfi, and G´abor Lugosi. A Probabilistic Theory of Pattern Recognition.  Springer, 1996.  New York, 1999.  S¸ eyda Ertekin and Cynthia Rudin. On equivalence relationships between classification and ranking  algorithms. Journal of Machine Learning Research, 12:2905-2929, Oct 2011.  Gerald B. Folland. Real Analysis: Modern Techniques and Their Applications. Wiley Interscience,  14   MENON WILLIAMSON  References  Shivani Agarwal. The infinite push: A new support vector ranking algorithm that directly optimizes accuracy at the absolute top of the list. In SIAM International Conference on Data Mining (SDM), pages 839-850, 2011.  Shivani Agarwal. Surrogate regret bounds for the area under the ROC curve via strongly proper  losses. In Conference on Learning Theory (COLT), pages 338-353, 2013.  Shivani Agarwal, Thore Graepel, Ralf Herbrich, Sariel Har-Peled, and Dan Roth. Generalization bounds for the area under the ROC curve. Journal of Machine Learning Research, 6:393-425, December 2005.  Maria-Florina Balcan, Nikhil Bansal, Alina Beygelzimer, Don Coppersmith, John Langford, and Gregory B . Sorkin. Robust reductions from ranking to classification. Machine Learning, 72 (1-2):139-153, 2008. doi: 10.1007/s10994-008-5058-6.  Peter L. Bartlett, Michael I. Jordan, and Jon D. McAuliffe. Convexity, classification, and risk  bounds. Journal of the American Statistical Association, 101(473):138-156, 2006.  Stephen P. Boyd, Corinna Cortes, Mehryar Mohri, and Ana Radovanovic. Accuracy at the top. In  Advances In Neural Information Processing Systems (NIPS), pages 962-970, 2012.  Andreas Buja, Werner Stuetzle, and Yi Shen. Loss functions for binary class probability estimation and classification: Structure and applications. www-stat.wharton.upenn.edu/˜buja, 2005. Unpublished manuscript.  Chris Burges, Tal Shaked, Erin Renshaw, Ari Lazier, Matt Deeds, Nicole Hamilton, and Greg Hul- lender. Learning to rank using gradient descent. In Proceedings of the 22nd International Con- ference on Machine learning (ICML), pages 89-96, New York, NY, USA, 2005. ACM. doi: 10.1145/1102351.1102363.  St´ephan Cl´emenc¸on and Nicolas Vayatis. Ranking the best instances. Journal of Machine Learning  Research, 8:2671-2699, December 2007.  St´ephan Cl´emenc¸on, G´abor Lugosi, and Nicolas Vayatis. Ranking and Empirical Minimization of  U-statistics. The Annals of Statistics, 36(2):844-874, April 2008.  William W. Cohen, Robert E. Schapire, and Yoram Singer. Learning to order things. Journal of  Artificial Intelligence Research, 10(1):243-270, May 1999.  Luc Devroye, L´aszl´o Gy¨orfi, and G´abor Lugosi. A Probabilistic Theory of Pattern Recognition.  Springer, 1996.  New York, 1999.  S¸ eyda Ertekin and Cynthia Rudin. On equivalence relationships between classification and ranking  algorithms. Journal of Machine Learning Research, 12:2905-2929, Oct 2011.  Gerald B. Folland. Real Analysis: Modern Techniques and Their Applications. Wiley Interscience, BAYES-OPTIMAL SCORERS FOR BIPARTITE RANKING  Yoav Freund, Raj Iyer, Robert E. Schapire, and Yoram Singer. An efficient boosting algorithm for combining preferences. Journal of Machine Learning Research, 4:933-969, December 2003.  Wei Gao and Zhi-Hua Zhou. On the consistency of AUC optimization. CoRR, abs/1208.0645, 2012.  Izrail M. Gelfand and Sergei V. Fomin. Calculus of Variations. Dover, 2000.  Mariano Giaquinta and Stefan Hildebrandt. Calculus of Variations I: The Lagrangian formalism.  Springer-Verlag, Berlin, 2nd edition, 2004.  Ralf Herbrich, Thore Graepel, and Klaus Obermayer. Large margin rank boundaries for ordinal regression. In A.J. Smola, P.L. Bartlett, B. Sch¨olkopf, and D. Schuurmans, editors, Advances in Large Margin Classifiers, pages 115-132, Cambridge, MA, 2000. MIT Press.  Palaniappan Kannappan. Functional equations and inequalities with applications. New York, NY:  Springer, 2009. doi: 10.1007/978-0-387-89492-8.  Donald E. Knuth. Two notes on notation. American Mathematical Monthly, 99(5):403-422, May  1992. doi: 10.2307/2325085.  Wojciech Kotlowski, Krzysztof Dembczynski, and Eyke H¨ullermeier. Bipartite ranking through minimization of univariate loss. In International Conference on Machine Learning (ICML), pages 1113-1120, 2011.  Aditya Krishna Menon and Robert C. Williamson. Bipartite ranking: risk, optimality, and equiva-  lences. Submitted to JMLR, 2014.  Harikrishna Narasimhan and Shivani Agarwal. On the relationship between binary classification, In Advances In Neural Information  bipartite ranking, and binary class probability estimation. Processing Systems (NIPS), pages 2913-2921, 2013.  Jorge Nocedal and Stephen J. Wright. Numerical Optimization. Springer, New York, 2nd edition,  2006.  Mark D. Reid and Robert C. Williamson. Surrogate regret bounds for proper losses. In International Conference on Machine Learning (ICML), pages 897-904, New York, NY, USA, 2009. ACM. doi: 10.1145/1553374.1553489.  Mark D. Reid and Robert C. Williamson. Composite binary losses. Journal of Machine Learning  Research, 11:2387-2422, December 2010.  Mark D. Reid and Robert C. Williamson. Information, divergence and risk for binary experiments.  Journal of Machine Learning Research, 12:731-817, Mar 2011.  Fred S. Roberts. Measurement theory with Applications to Decision Making, Utility, and the So- cial Sciences, volume 7 of Encyclopedia of Mathematics and Its Applications. Addison-Wesley, Reading, MA, 1984.  Cynthia Rudin. The p-norm push: A simple convex ranking algorithm that concentrates at the top  of the list. Journal of Machine Learning Research, 10:2233-2271, December 2009. MENON WILLIAMSON  Cynthia Rudin and Robert E. Schapire. Margin-based ranking and an equivalence between Ad-  aBoost and RankBoost. Journal of Machine Learning Research, 10:2193-2232, 2009.  Emir H. Shuford Jr., Arthur Albert, and H. Edward Massengill. Admissible probability measure-  ment procedures. Psychometrika, 31(2):125-145, 1966. doi: 10.1007/BF02289503.  Ingo Steinwart. How to compare different loss functions and their risks. Constructive Approxima-  tion, 26(2):225-287, 2007. doi: 10.1007/s00365-006-0662-3.  S. Joshua Swamidass, Chlo´e-Agathe Azencott, Kenny Daily, and Pierre Baldi. A CROC stronger than ROC. Bioinformatics, 26(10):1348-1356, May 2010. doi: 10.1093/bioinformatics/btq140.  Erik N. Torgersen. Comparison of Statistical Experiments. Cambridge University Press, 1991.  John L. Troutman. Variational Calculus and Optimal Control: Optimization with Elementary Con-  vexity. Undergraduate Texts in Mathematics. Springer, 1996.  Kazuki Uematsu and Yoonkyung Lee. On theoretically optimal ranking functions in bipartite rank- ing. http://www.stat.osu.edu/˜yklee/mss/bipartrank.rev.pdf, 2012. Un- published manuscript.  Elodie Vernet, Mark D. Reid, and Robert C. Williamson. Composite multiclass losses. In J. Shawe- Taylor, R.S. Zemel, P. Bartlett, F.C.N. Pereira, and K.Q. Weinberger, editors, Advances in Neural Information Processing Systems (NIPS) 24, pages 1224-1232, 2011.  Tong Zhang. Statistical behavior and consistency of classification methods based on convex risk  minimization. The Annals of Statistics, 32:56-134, March 2004. BAYES-OPTIMAL SCORERS FOR BIPARTITE RANKING"}