{"1": "D. J. Lehmann B. Lehmann and N. Nisan. Combinatorial auctions with decreasing marginal utilities.  Games and Economic Behavior, 55:1884-1899, 2006.  Ashwinkumar Badanidiyuru, Shahar Dobzinski, Hu Fu, Robert Kleinberg, Noam Nisan, and Tim  Roughgarden. Sketching valuation functions. In SODA, pages 1025-1035, 2012.  M.F. Balcan and N. Harvey. Submodular functions: Learnability, structure, and optimization. CoRR,  abs/1008.2159, 2012. Earlier version in proceedings of STOC 2011.  M.F. Balcan, Florin Constantin, Satoru Iwata, and Lei Wang. Learning valuation functions. Journal  of Machine Learning Research - COLT Proceedings, 23:4.1-4.24, 2012.  Eric Blais, Krzysztof Onak, Rocco Servedio, and Grigory Yaroslavtsev. Concise representations of  discrete submodular functions, 2013. Personal communication.  A. Blum, A. Kalai, and H. Wasserman. Noise-tolerant learning, the parity problem, and the statisti-  cal query model. Journal of the ACM, 50(4):506-519, 2003.  St´ephane Boucheron, G´abor Lugosi, and Pascal Massart. A sharp concentration inequality with  applications. Random Struct. Algorithms, 16(3):277-292, 2000.  M. Cheraghchi, A. Klivans, P. Kothari, and H. Lee. Submodular functions are noise stable.  In  SODA, pages 1586-1592, 2012.  G. Cornuejols, M. Fisher, and G. Nemhauser. Location of bank accounts to optimize ﬂoat: an analytic studyof exact and approximate algorithms. Management Science, 23:789-810, 1977.  Shahar Dobzinski, Noam Nisan, and Michael Schapira. Approximation algorithms for combinato-  rial auctions with complement-free bidders. In STOC, pages 610-618, 2005.  Shaddin Dughmi, Tim Roughgarden, and Qiqi Yan. From convex optimization to randomized mech-  anisms: toward optimal combinatorial auctions. In STOC, pages 149-158, 2011.  Jack Edmonds. Matroids, submodular functions and certain polyhedra. Combinatorial Structures  and Their Applications, pages 69-87, 1970.  13   LEARNING SUBMODULAR FUNCTIONS USING LOW-RANK DTS  {0, 1}, with probability at least 2/3, outputs a function h : {0, 1}n → [0, 1], such that (cid:107)f − h(cid:107)1 ≤ ∆ + (cid:15), where ∆ = ming∈DT[0,1](r){(cid:107)f − g(cid:107)1}. Further, A runs in time poly(n, 2r, 1/(cid:15)) and uses poly(log n, 2r, 1/(cid:15)) value queries.  Combining Theorems 20 and 1 gives the following agnostic learning algorithm for submodular  functions (the proof is in App. A.4).  Theorem 21 Let Cs denote the class of all submodular functions from {0, 1}n to [0, 1]. There exists an algorithm A that given (cid:15) > 0 and access to value queries of any real-valued f , with probability at least 2/3, outputs a function h, such that (cid:107)f − h(cid:107)1 ≤ ∆ + (cid:15), where ∆ = ming∈Cs{(cid:107)f − g(cid:107)1}. Further, A runs in time poly(n, 21/(cid:15)2) and using poly(log n, 21/(cid:15)2) value queries.  References  D. J. Lehmann B. Lehmann and N. Nisan. Combinatorial auctions with decreasing marginal utilities.  Games and Economic Behavior, 55:1884-1899, 2006.  Ashwinkumar Badanidiyuru, Shahar Dobzinski, Hu Fu, Robert Kleinberg, Noam Nisan, and Tim  Roughgarden. Sketching valuation functions. In SODA, pages 1025-1035, 2012.  M.F. Balcan and N. Harvey. Submodular functions: Learnability, structure, and optimization. CoRR,  abs/1008.2159, 2012. Earlier version in proceedings of STOC 2011.  M.F. Balcan, Florin Constantin, Satoru Iwata, and Lei Wang. Learning valuation functions. Journal  of Machine Learning Research - COLT Proceedings, 23:4.1-4.24, 2012.  Eric Blais, Krzysztof Onak, Rocco Servedio, and Grigory Yaroslavtsev. Concise representations of  discrete submodular functions, 2013. Personal communication.  A. Blum, A. Kalai, and H. Wasserman. Noise-tolerant learning, the parity problem, and the statisti-  cal query model. Journal of the ACM, 50(4):506-519, 2003.  St´ephane Boucheron, G´abor Lugosi, and Pascal Massart. A sharp concentration inequality with  applications. Random Struct. Algorithms, 16(3):277-292, 2000.  M. Cheraghchi, A. Klivans, P. Kothari, and H. Lee. Submodular functions are noise stable.  In  SODA, pages 1586-1592, 2012.  G. Cornuejols, M. Fisher, and G. Nemhauser. Location of bank accounts to optimize ﬂoat: an analytic studyof exact and approximate algorithms. Management Science, 23:789-810, 1977.  Shahar Dobzinski, Noam Nisan, and Michael Schapira. Approximation algorithms for combinato-  rial auctions with complement-free bidders. In STOC, pages 610-618, 2005.  Shaddin Dughmi, Tim Roughgarden, and Qiqi Yan. From convex optimization to randomized mech-  anisms: toward optimal combinatorial auctions. In STOC, pages 149-158, 2011.  Jack Edmonds. Matroids, submodular functions and certain polyhedra. Combinatorial Structures  and Their Applications, pages 69-87, 1970. FELDMAN KOTHARI VONDR ´AK  A. Ehrenfeucht and D. Haussler. Learning decision trees from random examples. Information and  Computation, 82(3):231-246, 1989.  Uriel Feige. A threshold of ln n for approximating set cover. Journal of the ACM, 45(4):634-652,  1998.  V. Feldman. Attribute efficient and non-adaptive learning of parities and DNF expressions. Journal  of Machine Learning Research, (8):1431-1460, 2007.  V. Feldman. Distribution-specific agnostic boosting. In Proceedings of Innovations in Computer  Science, pages 241-250, 2010.  V. Feldman. A complete characterization of statistical query learning with applications to evolv-  ability. Journal of Computer System Sciences, 78(5):1444-1459, 2012.  V. Feldman and P. Kothari. Learning coverage functions. CoRR, abs/1304.2079, 2013.  V. Feldman, P. Gopalan, S. Khot, and A. Ponuswami. On agnostic learning of parities, monomials  and halfspaces. SIAM Journal on Computing, 39(2):606-645, 2009.  L. Fleischer, S. Fujishige, and S. Iwata. A combinatorial, strongly polynomial-time algorithm for  minimizing submodular functions. Journal of the ACM, 48(4):761-777, 2001.  Andr´as Frank. Matroids and submodular functions. Annotated Biblographies in Combinatorial  Optimization, pages 65-80, 1997.  M. X. Goemans and D. P. Williamson.  Improved approximation algorithms for maximum cut and satisfiability problemsusing semidefinite programming. Journal of the ACM, 42:1115-1145, 1995.  Michel X. Goemans, Nicholas J. A. Harvey, Satoru Iwata, and Vahab S. Mirrokni. Approximating  submodular functions everywhere. In SODA, pages 535-544, 2009.  O. Goldreich and L. Levin. A hard-core predicate for all one-way functions. In Proceedings of  STOC, pages 25-32, 1989.  pages 527-536, 2008.  P. Gopalan, A. Kalai, and A. Klivans. Agnostically learning decision trees. In Proceedings of STOC,  Carlos Guestrin, Andreas Krause, and Ajit Paul Singh. Near-optimal sensor placements in gaussian  processes. In ICML, pages 265-272, 2005.  A. Gupta, M. Hardt, A. Roth, and J. Ullman. Privately releasing conjunctions and the statistical  query barrier. In STOC, pages 803-812, 2011.  M. Hardt, G. Rothblum, and R. Servedio. Private data release via learning thresholds. In SODA,  pages 168-187, 2012.  D. Haussler. Decision theoretic generalizations of the PAC model for neural net and other learning  applications. Information and Computation, 100(1):78-150, 1992. ISSN 0890-5401. LEARNING SUBMODULAR FUNCTIONS USING LOW-RANK DTS  A. Kalai and V. Kanade. Potential-based agnostic boosting. In Proceedings of NIPS, pages 880-888,  2009.  A. Kalai, A. Klivans, Y. Mansour, and R. Servedio. Agnostically learning halfspaces. SIAM Journal  on Computing, 37(6):1777-1805, 2008.  M. Kearns and R. Schapire. Efficient distribution-free learning of probabilistic concepts. Journal  of Computer and System Sciences, 48:464-497, 1994.  M. Kearns, R. Schapire, and L. Sellie. Toward efficient agnostic learning. Machine Learning, 17  (2-3):115-141, 1994.  Andreas Krause and Carlos Guestrin. Submodularity and its applications in optimized information  gathering. ACM TIST, 2(4):32, 2011.  Andreas Krause, Carlos Guestrin, Anupam Gupta, and Jon M. Kleinberg. Near-optimal sensor In IPSN, pages  placements: maximizing information while minimizing communication cost. 2-10, 2006.  Andreas Krause, Ajit Paul Singh, and Carlos Guestrin. Near-optimal sensor placements in gaussian processes: Theory, efficient algorithms and empirical studies. Journal of Machine Learning Research, 9:235-284, 2008.  E. Kushilevitz and Y. Mansour. Learning decision trees using the Fourier spectrum. SIAM Journal  on Computing, 22(6):1331-1348, 1993.  N. Linial, Y. Mansour, and N. Nisan. Constant depth circuits, Fourier transform and learnability.  Journal of the ACM, 40(3):607-620, 1993.  L´aszl´o Lov´asz. Submodular functions and convexity. Mathematical Programmming: The State of  the Art, pages 235-257, 1983.  Ryan O’Donnell and Rocco A. Servedio. Learning monotone decision trees in polynomial time.  SIAM J. Comput., 37(3):827-844, 2007.  Christos H. Papadimitriou, Michael Schapira, and Yaron Singer. On the hardness of being truthful.  In FOCS, pages 250-259, 2008.  Maurice Queyranne. A combinatorial algorithm for minimizing symmetric submodular functions.  In Proc. of 6th ACM-SIAM SODA, pages 98-101, 1995.  Sofya Raskhodnikova and Grigory Yaroslavtsev. Learning pseudo-boolean k-dnf and submodular  functions. In Proceedings of SODA, 2013.  Gregory Valiant. Finding correlations in subquadratic time, with applications to learning parities and juntas. In The 53rd Annual IEEE Symposium on the Foundations of Computer Science (FOCS), 2012.  L. G. Valiant. A theory of the learnable. Communications of the ACM, 27(11):1134-1142, 1984. FELDMAN KOTHARI VONDR ´AK  Jan Vondr´ak. Optimal approximation for the submodular welfare problem in the value oracle model.  In STOC, pages 67-74, 2008.  Jan Vondr´ak. A note on concentration of submodular functions, 2010. arXiv:1005.2791v1."}