{"1": "Dimitris Achlioptas. Database-friendly random projections.  In Proceedings of the twentieth ACM SIGMOD-SIGACT-SIGART symposium on Principles of database systems, pages 274-281. ACM, 2001.  Alexandr Andoni and Piotr Indyk. Nearest neighbors in high-dimensional spaces. CRC Handbook  of Discrete and Computational Geometry, 2017.  J Lawrence Carter and Mark N Wegman. Universal classes of hash functions. Journal of computer  and system sciences, 18(2):143-154, 1979.  A. Efros. How to stop worrying and learn to love nearest neighbors. https://nn2017.mit.edu/wp-  content/uploads/sites/5/2017/12/Efros-NIPS-NN-17.pdf, 2017.  Chirag Gupta, Arun Sai Suggala, Ankit Goyal, Harsha Vardhan Simhadri, Bhargavi Paranjape, Ashish Kumar, Saurabh Goyal, Raghavendra Udupa, Manik Varma, and Prateek Jain. Protonn: Compressed and accurate knn for resource-scarce devices. In International Conference on Ma- chine Learning, pages 1331-1340, 2017.  Sariel Har-Peled, Piotr Indyk, and Rajeev Motwani. Approximate nearest neighbor: Towards re-  moving the curse of dimensionality. Theory of computing, 8(1):321-350, 2012.  Piotr Indyk and Tal Wagner. Near-optimal (euclidean) metric compression. In Proceedings of the Twenty-Eighth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 710-723. SIAM, 2017.  Piotr Indyk, Ilya Razenshteyn, and Tal Wagner. Practical data-dependent metric compression with provable guarantees. In Advances in Neural Information Processing Systems, pages 2614-2623, 2017.  Thathachar S Jayram and David P Woodruff. Optimal bounds for johnson-lindenstrauss transforms and streaming problems with subconstant error. ACM Transactions on Algorithms (TALG), 9(3): 26, 2013.  Jeff Johnson, Matthijs Douze, and Herv´e J´egou.  Faiss: A library for efficient simi- larity search. https://code.facebook.com/posts/1373769912645926/faiss-a-library-for-efficient- similarity-search/, 2017a.  Jeff Johnson, Matthijs Douze, and Herv´e J´egou. Billion-scale similarity search with gpus. arXiv  preprint arXiv:1702.08734, 2017b.  William B Johnson and Joram Lindenstrauss. Extensions of lipschitz mappings into a hilbert space.  Contemporary mathematics, 26(189-206):1, 1984.  13   This work was supported by grants from the MITEI-Shell program, Amazon Research Award and Simons Investigator Award.  Acknowledgments  References  Dimitris Achlioptas. Database-friendly random projections.  In Proceedings of the twentieth ACM SIGMOD-SIGACT-SIGART symposium on Principles of database systems, pages 274-281. ACM, 2001.  Alexandr Andoni and Piotr Indyk. Nearest neighbors in high-dimensional spaces. CRC Handbook  of Discrete and Computational Geometry, 2017.  J Lawrence Carter and Mark N Wegman. Universal classes of hash functions. Journal of computer  and system sciences, 18(2):143-154, 1979.  A. Efros. How to stop worrying and learn to love nearest neighbors. https://nn2017.mit.edu/wp-  content/uploads/sites/5/2017/12/Efros-NIPS-NN-17.pdf, 2017.  Chirag Gupta, Arun Sai Suggala, Ankit Goyal, Harsha Vardhan Simhadri, Bhargavi Paranjape, Ashish Kumar, Saurabh Goyal, Raghavendra Udupa, Manik Varma, and Prateek Jain. Protonn: Compressed and accurate knn for resource-scarce devices. In International Conference on Ma- chine Learning, pages 1331-1340, 2017.  Sariel Har-Peled, Piotr Indyk, and Rajeev Motwani. Approximate nearest neighbor: Towards re-  moving the curse of dimensionality. Theory of computing, 8(1):321-350, 2012.  Piotr Indyk and Tal Wagner. Near-optimal (euclidean) metric compression. In Proceedings of the Twenty-Eighth Annual ACM-SIAM Symposium on Discrete Algorithms, pages 710-723. SIAM, 2017.  Piotr Indyk, Ilya Razenshteyn, and Tal Wagner. Practical data-dependent metric compression with provable guarantees. In Advances in Neural Information Processing Systems, pages 2614-2623, 2017.  Thathachar S Jayram and David P Woodruff. Optimal bounds for johnson-lindenstrauss transforms and streaming problems with subconstant error. ACM Transactions on Algorithms (TALG), 9(3): 26, 2013.  Jeff Johnson, Matthijs Douze, and Herv´e J´egou.  Faiss: A library for efficient simi- larity search. https://code.facebook.com/posts/1373769912645926/faiss-a-library-for-efficient- similarity-search/, 2017a.  Jeff Johnson, Matthijs Douze, and Herv´e J´egou. Billion-scale similarity search with gpus. arXiv  preprint arXiv:1702.08734, 2017b.  William B Johnson and Joram Lindenstrauss. Extensions of lipschitz mappings into a hilbert space.  Contemporary mathematics, 26(189-206):1, 1984. Daniel Kane, Raghu Meka, and Jelani Nelson. Almost optimal explicit johnson-lindenstrauss fam- ilies. In Approximation, Randomization, and Combinatorial Optimization. Algorithms and Tech- niques, pages 628-639. Springer, 2011.  Eyal Kushilevitz, Rafail Ostrovsky, and Yuval Rabani. Efficient search for approximate nearest  neighbor in high dimensional spaces. SIAM Journal on Computing, 30(2):457-474, 2000.  Marco Molinaro, David P Woodruff, and Grigory Yaroslavtsev. Beating the direct sum theorem in communication complexity with implications for sketching. In Proceedings of the twenty-fourth annual ACM-SIAM symposium on Discrete algorithms, pages 1738-1756. Society for Industrial and Applied Mathematics, 2013.  Ilan Newman. Private vs. common random bits in communication complexity. Information pro-  cessing letters, 39(2):67-71, 1991.  Gregory Shakhnarovich, Trevor Darrell, and Piotr Indyk. Nearest-neighbor methods in learning  and vision: theory and practice (neural information processing). The MIT press, 2006.  Jingdong Wang, Ting Zhang, Nicu Sebe, Heng Tao Shen, et al. A survey on learning to hash. IEEE  Transactions on Pattern Analysis and Machine Intelligence, 40(4):769-790, 2018.  Jun Wang, Wei Liu, Sanjiv Kumar, and Shih-Fu Chang. Learning to hash for indexing big data: a  survey. Proceedings of the IEEE, 104(1):34-57, 2016."}