{"1": "We are grateful to Adam Smith and Thomas Steinke for many helpful discussions about tracing attacks and private top-k selection.  Raef Bassily, Kobbi Nissim, Adam Smith, Thomas Steinke, Uri Stemmer, and Jonathan Ullman. Algorithmic stability for adaptive data analysis. In Proceedings of the 48th Annual ACM SIGACT Symposium on Theory of Computing, pages 1046-1059. ACM, 2016.  Amos Beimel, Kobbi Nissim, and Uri Stemmer. Private learning and sanitization: Pure vs. approxi-  mate differential privacy. In RANDOM, 2013.  Raghav Bhaskar, Srivatsan Laxman, Adam Smith, and Abhradeep Thakurta. Discovering frequent patterns in sensitive data. In Proceedings of the 16th ACM SIGKDD international conference on Knowledge discovery and data mining, pages 503-512. ACM, 2010.  Avrim Blum, Cynthia Dwork, Frank McSherry, and Kobbi Nissim. Practical privacy: the SuLQ  framework. In PODS, 2005.  Dan Boneh and James Shaw. Collusion-secure fingerprinting for digital data. IEEE Transactions on  Information Theory, 44(5):1897-1905, 1998.  13   which means that,  E[xa  (cid:12) (cid:12) B] ≥ λ = E[xa].  Since P [xa = −1] = (1 − E[xa])/2, we get that, P (cid:2)xa = −1 (cid:12) this back into (4), we get that the variables are positively correlated. (cid:105)  We have that, E  (cid:104)(cid:80)  i∈R,j∈v xij  = |R|kλ, and since Hoeffding’s inequality applies equally well  (cid:12) B(cid:3) ≤ P [xa = −1]. Substituting  to positively-correlated random variables Panconesi and Srinivasan (1997), we also have,  P (cid:101)XS  (cid:88)  i∈R,j∈v  xij ≤ |R|τc              ≤ P (cid:101)XS  (cid:88)  i∈R,j∈V   (cid:16)  ≤ exp   −  |R|(cid:112)2k ln(1/ρ)  (cid:17)2  2|R|k    = ρ|R|.    xij < |R|kλ − |R|(cid:112)2k ln(1/ρ)   Substituting this in equation 2, we get that, P (cid:101)XS  (cid:86) i∈R our definition of the distributions, XS, (cid:101)XS, we have, P XS  Ei  ≤ ρ|R|. Finally, we use the fact that, by  (cid:2)(cid:86)  i∈R Ei  (cid:3) ≤ P (cid:101)XS  (cid:2)(cid:86)  i∈R Ei  (cid:3) ≤ ρ|R|. This  (cid:20)  (cid:21)  completes the proof.  Acknowledgments  References  We are grateful to Adam Smith and Thomas Steinke for many helpful discussions about tracing attacks and private top-k selection.  Raef Bassily, Kobbi Nissim, Adam Smith, Thomas Steinke, Uri Stemmer, and Jonathan Ullman. Algorithmic stability for adaptive data analysis. In Proceedings of the 48th Annual ACM SIGACT Symposium on Theory of Computing, pages 1046-1059. ACM, 2016.  Amos Beimel, Kobbi Nissim, and Uri Stemmer. Private learning and sanitization: Pure vs. approxi-  mate differential privacy. In RANDOM, 2013.  Raghav Bhaskar, Srivatsan Laxman, Adam Smith, and Abhradeep Thakurta. Discovering frequent patterns in sensitive data. In Proceedings of the 16th ACM SIGKDD international conference on Knowledge discovery and data mining, pages 503-512. ACM, 2010.  Avrim Blum, Cynthia Dwork, Frank McSherry, and Kobbi Nissim. Practical privacy: the SuLQ  framework. In PODS, 2005.  Dan Boneh and James Shaw. Collusion-secure fingerprinting for digital data. IEEE Transactions on  Information Theory, 44(5):1897-1905, 1998. MITALI.BAFNA@GMAIL.COM  JULLMAN@CCS.NEU.EDU  Mark Bun, Jonathan Ullman, and Salil P. Vadhan. Fingerprinting codes and the price of approximate  differential privacy. In STOC, 2014.  Kamalika Chaudhuri, Daniel J Hsu, and Shuang Song. The large margin mechanism for differentially private maximization. In Advances in Neural Information Processing Systems, pages 1287-1295, 2014.  Irit Dinur and Kobbi Nissim. Revealing information while preserving privacy. In PODS, 2003.  Cynthia Dwork and Jing Lei. Differential privacy and robust statistics.  In Proceedings of the  forty-first annual ACM symposium on Theory of computing, pages 371-380. ACM, 2009.  Cynthia Dwork and Kobbi Nissim. Privacy-preserving datamining on vertically partitioned databases.  In CRYPTO, 2004.  Cynthia Dwork, Frank McSherry, Kobbi Nissim, and Adam Smith. Calibrating noise to sensitivity in  private data analysis. In TCC, 2006.  Cynthia Dwork, Moni Naor, Toniann Pitassi, and Guy N Rothblum. Differential privacy under continual observation. In Proceedings of the forty-second ACM symposium on Theory of computing, pages 715-724. ACM, 2010a.  Cynthia Dwork, Guy N. Rothblum, and Salil P. Vadhan. Boosting and differential privacy. In FOCS.  IEEE, 2010b.  Cynthia Dwork, Aaron Roth, et al. The algorithmic foundations of differential privacy. Foundations  and Trends R(cid:13) in Theoretical Computer Science, 9(3-4):211-407, 2014.  Cynthia Dwork, Adam D. Smith, Thomas Steinke, Jonathan Ullman, and Salil P. Vadhan. Robust  traceability from trace amounts. In FOCS, 2015a.  Cynthia Dwork, Weijie Su, and Li Zhang. Private false discovery rate control. arXiv preprint  arXiv:1511.03803, 2015b.  Cynthia Dwork, Adam Smith, Thomas Steinke, and Jonathan Ullman. Exposed! A survey of attacks  on private data. Annual Review of Statistics and Its Application, 2017.  Anupam Gupta, Katrina Ligett, Frank McSherry, Aaron Roth, and Kunal Talwar. Differentially private combinatorial optimization. In Proceedings of the twenty-first annual ACM-SIAM symposium on Discrete Algorithms, pages 1106-1125. Society for Industrial and Applied Mathematics, 2010.  Anupam Gupta, Aaron Roth, and Jonathan Ullman. Iterative constructions and private data release.  In TCC, 2012.  data analysis. In FOCS, 2010.  Moritz Hardt and Guy N. Rothblum. A multiplicative weights mechanism for privacy-preserving  Nils Homer, Szabolcs Szelinger, Margot Redman, David Duggan, Waibhav Tembe, Jill Muehling, John V Pearson, Dietrich A Stephan, Stanley F Nelson, and David W Craig. Resolving individuals contributing trace amounts of dna to highly complex mixtures using high-density snp genotyping microarrays. PLoS genetics, 4(8):e1000167, 2008. Prateek Jain and Abhradeep Thakurta. Mirror descent based database privacy. In Approximation, Randomization, and Combinatorial Optimization. Algorithms and Techniques, pages 579-590. Springer, 2012.  Michel Ledoux and Michel Talagrand. Probability in Banach Spaces: isoperimetry and processes.  Springer Science & Business Media, 2013.  Frank McSherry and Kunal Talwar. Mechanism design via differential privacy. In Foundations of Computer Science, 2007. FOCS’07. 48th Annual IEEE Symposium on, pages 94-103. IEEE, 2007.  Alessandro Panconesi and Aravind Srinivasan. Randomized distributed edge coloring via an extension  of the chernoff-hoeffding bounds. SIAM Journal on Computing, 26(2):350-368, 1997.  Aaron Roth and Tim Roughgarden. Interactive privacy via the median mechanism. In STOC, pages  765-774. ACM, June 5-8 2010.  Sriram Sankararaman, Guillaume Obozinski, Michael I Jordan, and Eran Halperin. Genomic privacy  and limits of individual detection in a pool. Nature genetics, 41(9):965-967, 2009.  Adam Smith and Abhradeep Thakurta. Differentially private model selection via stability arguments  and the robustness of the lasso. J Mach Learn Res Proc Track, 30:819-850, 2013.  Thomas Steinke and Jonathan Ullman. Between pure and approximate differential privacy. Journal  of Privacy and Confidentiality, 7, 2017a.  Thomas Steinke and Jonathan Ullman. Tight lower bounds for differentially private selection. arXiv  preprint arXiv:1704.03024, 2017b.  Gábor Tardos. Optimal probabilistic fingerprint codes. Journal of the ACM (JACM), 55(2):10, 2008.  Jonathan Ullman. Answering n2+o(1) counting queries with differential privacy is hard. In STOC,  2013.  Jonathan Ullman. Private multiplicative weights beyond linear queries. In PODS, 2015."}