{"1": "Pranjal Awasthi, Avrim Blum, Or Sheffet, and Aravindan Vijayaraghavan. Learning mixtures of ranking models. In Advances in Neural Information Processing Systems, pages 2609-2617, 2014.  Quentin Berthet, Philippe Rigollet, and Piyush Srivastava. Exact recovery in the ising blockmodel.  arXiv preprint arXiv:1612.03880, 2016.  Ioannis Caragiannis, Ariel D Procaccia, and Nisarg Shah. When do noisy votes reveal the truth?  ACM Transactions on Economics and Computation (TEAC), 4(3):15, 2016.  Harr Chen, S. R. K. Branavan, Regina Barzilay, and David R. Karger. Content modeling using latent  permutations. J. Artif. Intell. Res., 36:129-163, 2009.  Jean-Paul Doignon, Aleksandar Pekeˇc, and Michel Regenwetter. The repeated insertion model for rankings: Missing link between two subset choice models. Psychometrika, 69(1):33-54, 2004.  Michael A Fligner and Joseph S Verducci. Distance based ranking models. Journal of the Royal  Statistical Society. Series B (Methodological), pages 359-369, 1986.  Olga Klopp, Alexandre B Tsybakov, Nicolas Verzelen, et al. Oracle inequalities for network models  and sparse graphon estimation. The Annals of Statistics, 45(1):316-354, 2017.  Allen Liu and Ankur Moitra. Efficiently learning mixtures of Mallows models. In FOCS, pages  627-638. IEEE Computer Society, 2018.  Tyler Lu and Craig Boutilier. Learning Mallows models with pairwise preferences. In Proceedings  of the 28th International Conference on Machine Learning,, pages 145-152, 2011.  C. Mallows. Non-null ranking models. Biometrika, 44(1):114-130, 1957.  John I. Marden. Analyzing and Modeling Rank Data. Chapman & Hall, 1995.  Marina Meila and Le Bao. An exponential model for infinite rankings. Journal of Machine Learning  Research, 11:3481-3518, 2010.  (2):853-875, 2016.  Sumit Mukherjee. Estimation in exponential families on permutations. The Annals of Statistics, 44  4   Interestingly, our lower bound uses a general way to compute the total variation distance of two distributions that belong to the same exponential family. This theorem states that the total variation of two distributions in the same exponential family is equal to the distance between their parameters times the absolute deviation of a corresponding distribution in the family. This should be compared with the expression of the KL-divergence between two distributions in the same exponential fam- ily. Then our lower bound boils down to showing that for some range of parameters, the absolute deviation is within a constant from the standard deviation. With this proven, we get that the total variation distance is within a constant factor from the square root of the KL-divergence, and Fano’s inequality can be applied.  References  Pranjal Awasthi, Avrim Blum, Or Sheffet, and Aravindan Vijayaraghavan. Learning mixtures of ranking models. In Advances in Neural Information Processing Systems, pages 2609-2617, 2014.  Quentin Berthet, Philippe Rigollet, and Piyush Srivastava. Exact recovery in the ising blockmodel.  arXiv preprint arXiv:1612.03880, 2016.  Ioannis Caragiannis, Ariel D Procaccia, and Nisarg Shah. When do noisy votes reveal the truth?  ACM Transactions on Economics and Computation (TEAC), 4(3):15, 2016.  Harr Chen, S. R. K. Branavan, Regina Barzilay, and David R. Karger. Content modeling using latent  permutations. J. Artif. Intell. Res., 36:129-163, 2009.  Jean-Paul Doignon, Aleksandar Pekeˇc, and Michel Regenwetter. The repeated insertion model for rankings: Missing link between two subset choice models. Psychometrika, 69(1):33-54, 2004.  Michael A Fligner and Joseph S Verducci. Distance based ranking models. Journal of the Royal  Statistical Society. Series B (Methodological), pages 359-369, 1986.  Olga Klopp, Alexandre B Tsybakov, Nicolas Verzelen, et al. Oracle inequalities for network models  and sparse graphon estimation. The Annals of Statistics, 45(1):316-354, 2017.  Allen Liu and Ankur Moitra. Efficiently learning mixtures of Mallows models. In FOCS, pages  627-638. IEEE Computer Society, 2018.  Tyler Lu and Craig Boutilier. Learning Mallows models with pairwise preferences. In Proceedings  of the 28th International Conference on Machine Learning,, pages 145-152, 2011.  C. Mallows. Non-null ranking models. Biometrika, 44(1):114-130, 1957.  John I. Marden. Analyzing and Modeling Rank Data. Chapman & Hall, 1995.  Marina Meila and Le Bao. An exponential model for infinite rankings. Journal of Machine Learning  Research, 11:3481-3518, 2010.  (2):853-875, 2016.  Sumit Mukherjee. Estimation in exponential families on permutations. The Annals of Statistics, 44"}