{"1": "2015a.  J. Acharya, C. Daskalakis, and G. Kamath. Optimal testing for properties of distributions. In NIPS,  J. Acharya, I. Diakonikolas, C. Hegde, J. Li, and L. Schmidt. Fast and near-optimal algorithms for approximating distributions by histograms. In Proceedings of the 34th ACM Symposium on Principles of Database Systems, PODS 2015, pages 249-263, 2015b.  13   LEARNING MULTIVARIATE LOG-CONCAVE DISTRIBUTIONS  and therefore,  n = O(d/(cid:15))(d+1)/2 log2(1/(cid:15)) .  For the claim comparing the variation distance to (cid:107) · (cid:107)Ad,c(cid:15), note that, by Lemma 9, if c is chosen to be sufficiently small, there exist g, g(cid:48) ∈ Cd,c(cid:15) so that dTV (f, g), dTV (f (cid:48), g(cid:48)) ≤ (cid:15)/8. We then have that  dTV (f, f (cid:48)) ≤ dTV (f, g) + dTV (f (cid:48), g(cid:48)) + dTV (g, g(cid:48))  ≤ (cid:15)/4 + (cid:107)g − g(cid:48)(cid:107)Ad,c(cid:15) ≤ (cid:15)/4 + (cid:107)f − f (cid:48)(cid:107)Ad,c(cid:15) + dTV (f, g) + dTV (f (cid:48), g(cid:48)) ≤ (cid:107)f − f (cid:48)(cid:107)Ad,c(cid:15) + (cid:15)/2 .  This completes the proof of Lemma 13.  The proof of Proposition 7 and Theorem 3 is now complete.  4. Conclusions  In this paper, we gave the first sample complexity upper bound for learning log-concave densities on Rd. Our upper bound agrees with the previously known lower bound up to a multiplicative factor of ˜Od((cid:15)−2). No sample complexity upper bound was previously known for this problem for any d > 3.  Our result is a step towards understanding the learnability of log-concave densities in multiple dimensions. A number of interesting open problems remain. We outline the two immediate ones here:  • What is the optimal sample complexity of log-concave density estimation? It is a plausible (cid:0)(1/(cid:15))d/2+2(cid:1). We conjecture that the correct answer, under the total variation distance, is Θd believe that a more sophisticated version of our structural approximation results could give such an upper bound. On the other hand, it seems likely that an adaptation of the construction in Kim and Samworth (2016) could yield a matching lower bound.  • Is there a polynomial time algorithm (as a function of the sample complexity) to learn log- concave densities on Rd? The estimator underlying this work (Lemma 6) has been previously exploited Chan et al. (2013, 2014a); Acharya et al. (2017) to obtain computationally efficient learning algorithms for d = 1 - in fact, running in sample near-linear time Acharya et al. (2017). Obtaining a computationally efficient algorithm for the case of general dimension is a challenging and important open question.  References  2015a.  J. Acharya, C. Daskalakis, and G. Kamath. Optimal testing for properties of distributions. In NIPS,  J. Acharya, I. Diakonikolas, C. Hegde, J. Li, and L. Schmidt. Fast and near-optimal algorithms for approximating distributions by histograms. In Proceedings of the 34th ACM Symposium on Principles of Database Systems, PODS 2015, pages 249-263, 2015b. DIAKONIKOLAS KANE STEWART  J. Acharya, I. Diakonikolas, J. Li, and L. Schmidt. Sample-optimal density estimation in nearly- In Proceedings of the Twenty-Eighth Annual ACM-SIAM Symposium on Discrete linear time. Algorithms, SODA 2017, pages 1278-1289, 2017. Available at https://arxiv.org/abs/1506.00671.  M. Y. An. Log-concave probability distributions: Theory and statistical testing. Technical Report  Economics Working Paper Archive at WUSTL, Washington University at St. Louis, 1995.  M. Bagnoli and T. Bergstrom. Log-concave probability and its applications. Economic Theory, ISSN 09382259. URL http://www.jstor.org/stable/  26(2):pp. 445-469, 2005. 25055959.  F. Balabdaoui and C. R. Doss.  Inference for a Mixture of Symmetric Distributions under Log- Concavity. To appear in Journal of Bernoulli. Available at http://arxiv.org/abs/1411.4708, 2014.  Y. Baraud and L. Birge. Rho-estimators for shape restricted density estimation. Stochastic Processes  and their Applications, 126(12):3888 - 3912, 2016.  R.E. Barlow, D.J. Bartholomew, J.M. Bremner, and H.D. Brunk. Statistical Inference under Order  Restrictions. Wiley, New York, 1972.  G. Biau and L. Devroye. On the risk of estimates for block decreasing densities. Journal of Multi-  variate Analysis, 86(1):143 - 165, 2003.  L. Birg´e. Estimating a density under order restrictions: Nonasymptotic minimax risk. Annals of  Statistics, 15(3):995-1012, 1987a.  L. Birg´e. On the risk of histograms for estimating decreasing densities. Annals of Statistics, 15(3):  1013-1022, 1987b.  A. Blumer, A. Ehrenfeucht, D. Haussler, and M. Warmuth.  Learnability and the Vapnik-  Chervonenkis dimension. Journal of the ACM, 36(4):929-965, 1989.  E. M. Bronstein. Approximation of convex sets by polytopes. Journal of Mathematical Sciences,  153(6):727-762, 2008.  H. D. Brunk. On the estimation of parameters restricted by inequalities. The Annals of Mathematical  Statistics, 29(2):pp. 437-454, 1958. ISSN 00034851.  C. L. Canonne, I. Diakonikolas, T. Gouleakis, and R. Rubinfeld. Testing shape restrictions of  discrete distributions. In STACS, pages 25:1-25:14, 2016.  S. Chan, I. Diakonikolas, R. Servedio, and X. Sun. Learning mixtures of structured distributions  over discrete domains. In SODA, pages 1380-1394, 2013.  S. Chan, I. Diakonikolas, R. Servedio, and X. Sun. Efficient density estimation via piecewise  polynomial approximation. In STOC, pages 604-613, 2014a.  S. Chan, I. Diakonikolas, R. Servedio, and X. Sun. Near-optimal density estimation in near-linear  time using variable-width histograms. In NIPS, pages 1844-1852, 2014b. LEARNING MULTIVARIATE LOG-CONCAVE DISTRIBUTIONS  Y. Chen and R. J. Samworth. Smoothed log-concave maximum likelihood estimation with applica-  tions. Statist. Sinica, 23:1373-1398, 2013.  M. Cule, R. Samworth, and M. Stewart. Maximum likelihood estimation of a multi-dimensional  log-concave density. Journal of the Royal Statistical Society: Series B, 72:545-607, 2010.  C. Daskalakis, I. Diakonikolas, and R.A. Servedio. Learning k-modal distributions via testing. In  SODA, pages 1371-1385, 2012a.  STOC, pages 709-728, 2012b.  C. Daskalakis, I. Diakonikolas, and R.A. Servedio. Learning Poisson Binomial Distributions. In  C. Daskalakis, I. Diakonikolas, R. O’Donnell, R.A. Servedio, and L. Tan. Learning Sums of Inde-  pendent Integer Random Variables. In FOCS, pages 217-226, 2013.  C. Daskalakis, A. De, G. Kamath, and C. Tzamos. A size-free CLT for poisson multinomials and its applications. In Proceedings of the 48th Annual ACM Symposium on the Theory of Computing, STOC ’16, 2016.  L. Devroye and L. Gy¨orfi. Nonparametric Density Estimation: The L1 View. John Wiley & Sons,  1985.  L. Devroye and G. Lugosi. Combinatorial methods in density estimation. Springer, 2001.  I. Diakonikolas, M. Hardt, and L. Schmidt. Differentially private learning of structured discrete  distributions. In NIPS, pages 2566-2574, 2015.  I. Diakonikolas, D. M. Kane, and A. Stewart. Optimal learning via the fourier transform In Proceedings of the 29th Confer- Full version available at  for sums of independent integer random variables. ence on Learning Theory, COLT 2016, pages 831-849, 2016a. https://arxiv.org/abs/1505.00662.  I. Diakonikolas, D. M. Kane, and A. Stewart. Properly learning poisson binomial distributions in almost polynomial time. In Proceedings of the 29th Conference on Learning Theory, COLT 2016, pages 850-878, 2016b. Full version available at https://arxiv.org/abs/1511.04066.  I. Diakonikolas, D. M. Kane, and A. Stewart. The fourier transform of poisson multinomial distri-  butions and its algorithmic applications. In Proceedings of STOC’16, 2016c.  I. Diakonikolas, D. M. Kane, and A. Stewart. Efficient Robust Proper Learning of Log-concave  Distributions. Arxiv report, 2016d.  C. R. Doss and J. A. Wellner. Global rates of convergence of the mles of log-concave and s-concave  densities. Ann. Statist., 44(3):954-981, 06 2016.  L. Dumbgen and K. Rufibach. Maximum likelihood estimation of a log-concave density and its distribution function: Basic properties and uniform consistency. Bernoulli, 15(1):40-68, 2009.  L. Dumbgen, R. Samworth, and D. Schuhmacher. Approximation by log-concave distributions, with applications to regression. Ann. Statist., 39(2):702-730, 04 2011. doi: 10.1214/10-AOS853. DIAKONIKOLAS KANE STEWART  A.-L. Foug`eres. Estimation de densit´es unimodales. Canadian Journal of Statistics, 25:375-387,  1997.  Y. Gordon, M. Meyer, and S. Reisner. Volume approximation of convex sets by polytopes - a  constructive method. Stud. Math., 111:81-95, 1994.  Y. Gordon, M. Meyer, and S. Reisner. Constructing a polytope to approximate a convex body.  Geometriae Dedicata, 57(2):217-222, 1995.  U. Grenander. On the theory of mortality measurement. Skand. Aktuarietidskr., 39:125-153, 1956.  P. Groeneboom. Estimating a monotone density. In Proc. of the Berkeley Conference in Honor of  Jerzy Neyman and Jack Kiefer, pages 539-555, 1985.  P. Groeneboom and G. Jongbloed. Nonparametric Estimation under Shape Constraints: Estimators,  Algorithms and Asymptotics. Cambridge University Press, 2014.  P. M. Gruber. Aspects of approximation of convex bodies. Handbook of Convex Geometry, 1993.  Q. Han and J. A. Wellner. Approximation and estimation of s-concave densities via renyi diver-  gences. Ann. Statist., 44(3):1332-1359, 06 2016.  D. L. Hanson and G. Pledger. Consistency in concave regression. The Annals of Statistics, 4(6):pp.  1038-1050, 1976. ISSN 00905364.  P. J. Huber. Robust estimation of a location parameter. Ann. Math. Statist., 35(1):73-101, 03 1964.  H. K. Jankowski and J. A. Wellner. Estimation of a discrete monotone density. Electronic Journal  of Statistics, 3:1567-1605, 2009.  bridge, MA, 1994.  M. Kearns and U. Vazirani. An Introduction to Computational Learning Theory. MIT Press, Cam-  A. K. H. Kim and R. J. Samworth. Global rates of convergence in log-concave density estimation.  Ann. Statist., 44(6):2756-2779, 12 2016. Available at http://arxiv.org/abs/1404.2298.  R. Koenker and I. Mizera. Quasi-concave density estimation. Ann. Statist., 38(5):2998-3027, 2010.  L. Lov´asz and S. Vempala. The geometry of logconcave functions and sampling algorithms. Ran-  dom Structures and Algorithms, 30(3):307-358, 2007.  K. Pearson. Contributions to the mathematical theory of evolution. ii. skew variation in homoge- neous material. Philosophical Trans. of the Royal Society of London, 186:343-414, 1895. doi: 10.1098/rsta.1895.0010.  B.L.S. Prakasa Rao. Estimation of a unimodal density. Sankhya Ser. A, 31:23-36, 1969.  A. Saumard and J. A. Wellner. Log-concavity and strong log-concavity: A review. Statist. Surv., 8:  D.W. Scott. Multivariate Density Estimation: Theory, Practice and Visualization. Wiley, New York,  45-114, 2014.  1992. LEARNING MULTIVARIATE LOG-CONCAVE DISTRIBUTIONS  A. Seregin and J. A. Wellner. Nonparametric estimation of multivariate convex-transformed densi-  ties. Ann. Statist., 38(6):3751-3781, 12 2010.  B. W. Silverman. Density Estimation. Chapman and Hall, London, 1986.  R. P. Stanley. Log-concave and unimodal sequences in algebra, combinatorics, and geome- try. Annals of the New York Academy of Sciences, 576(1):500-535, 1989. ISSN 1749- 6632. doi: 10.1111/j.1749-6632.1989.tb16434.x. URL http://dx.doi.org/10.1111/ j.1749-6632.1989.tb16434.x.  A. B. Tsybakov. Introduction to Nonparametric Estimation. Springer Publishing Company, Incor-  porated, 2008.  G. Valiant and P. Valiant.  In Proceedings of the Forty-eighth Annual ACM Symposium on Theory of Computing, STOC ’16, pages 142-155, 2016.  Instance optimal learning of discrete distributions.  A. W. van der Vaart and J. A. Wellner. Weak convergence and empirical processes. Springer Series  in Statistics. Springer-Verlag, New York, 1996. With applications to statistics.  V. Vapnik and A. Chervonenkis. On the uniform convergence of relative frequencies of events to  their probabilities. Theory Probab. Appl., 16:264-280, 1971.  G. Walther. 2009.  Inference and modeling with log-concave distributions. Stat. Science, 24:319-327,  E.J. Wegman. Maximum likelihood estimation of a unimodal density. I. and II. Ann. Math. Statist.,  41:457-471, 2169-2174, 1970.  J. A. Wellner. Nonparametric estimation of s-concave and log-concave densities: an alternative to maximum likelihood. Talk given at European Meeting of Statisticians, Amsterdam, 2015. Available at https://www.stat.washington.edu/jaw/RESEARCH/TALKS/EMS-2015.1-rev1.pdf."}