{"1": "Nir Ailon. An active learning algorithm for ranking from pairwise preferences with an almost  optimal query complexity. Journal of Machine Learning Research, 13:137-164, 2012.  Nir Ailon, Moses Charikar, and Alantha Newman. Aggregating inconsistent information: Ranking  and clustering. Journal of the ACM, 55(5):23, 2008.  Noga Alon. Ranking tournaments. SIAM Journal of Discrete Mathematics, 20(1):137-142, 2006.  Ralph A. Bradley and Milton E. Terry. Rank analysis of incomplete block designs: I. The method  of paired comparisons. Biometrika, pages 324-345, 1952.  Mark Braverman and Elchanan Mossel. Noisy sorting without resampling. In Proceedings of the  19th Annual ACM-SIAM Symposium on Discrete Algorithms, 2008.  Mark Braverman and Elchanan Mossel.  Sorting from noisy information.  arXiv preprint  arXiv:0910.1191, 2009.  R´obert Busa-Fekete and Eyke H¨ullermeier. A survey of preference-based online learning with bandit algorithms. In Proceedings of the 25th International Conference on Algorithmic Learning Theory, 2014.  Jian-Feng Cai, Emmanuel J. Cand`es, and Zuowei Shen. A singular value thresholding algorithm for  matrix completion. SIAM Journal on Optimization, 20(4):1956-1982, 2010.  Emmanuel J. Cand`es and Benjamin Recht. Exact matrix completion via convex optimization. Foun-  dations of Computational Mathematics, 9(6):717-772, 2009.  Emmanuel J. Cand`es and Terence Tao. The power of convex relaxation: Near-optimal matrix com-  pletion. IEEE Transactions on Information Theory, 56(5):2053-2080, 2010.  A. H. Copeland. A ‘reasonable’ social welfare function.  In Seminar on Mathematics in Social  Sciences, University of Michigan, 1951.  Don Coppersmith, Lisa Fleischer, and Atri Rudra. Ordering by weighted number of wins gives a good ranking for weighted tournaments. In Proceedings of the 17th Annual ACM-SIAM Sympo- sium on Discrete Algorithms, 2006.  H. A. David. The Method of Paired Comparisons. Oxford University Press, 1988.  David F. Gleich and Lek-Heng Lim. Rank aggregation via nuclear norm minimization. In Pro- ceedings of the 17th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, 2011.  David R. Hunter. MM algorithms for generalized Bradley-Terry models. The Annals of Statistics,  32(1):384-406, 2004.  Prateek Jain, Raghu Meka, and Inderjit S. Dhillon. Guaranteed rank minimization via singular value  projection. In Advances in Neural Information Processing Systems, 2010.  25   WHEN CAN WE RANK WELL FROM COMPARISONS OF O(n log n) NON-ACTIVELY CHOSEN PAIRS?  References  Nir Ailon. An active learning algorithm for ranking from pairwise preferences with an almost  optimal query complexity. Journal of Machine Learning Research, 13:137-164, 2012.  Nir Ailon, Moses Charikar, and Alantha Newman. Aggregating inconsistent information: Ranking  and clustering. Journal of the ACM, 55(5):23, 2008.  Noga Alon. Ranking tournaments. SIAM Journal of Discrete Mathematics, 20(1):137-142, 2006.  Ralph A. Bradley and Milton E. Terry. Rank analysis of incomplete block designs: I. The method  of paired comparisons. Biometrika, pages 324-345, 1952.  Mark Braverman and Elchanan Mossel. Noisy sorting without resampling. In Proceedings of the  19th Annual ACM-SIAM Symposium on Discrete Algorithms, 2008.  Mark Braverman and Elchanan Mossel.  Sorting from noisy information.  arXiv preprint  arXiv:0910.1191, 2009.  R´obert Busa-Fekete and Eyke H¨ullermeier. A survey of preference-based online learning with bandit algorithms. In Proceedings of the 25th International Conference on Algorithmic Learning Theory, 2014.  Jian-Feng Cai, Emmanuel J. Cand`es, and Zuowei Shen. A singular value thresholding algorithm for  matrix completion. SIAM Journal on Optimization, 20(4):1956-1982, 2010.  Emmanuel J. Cand`es and Benjamin Recht. Exact matrix completion via convex optimization. Foun-  dations of Computational Mathematics, 9(6):717-772, 2009.  Emmanuel J. Cand`es and Terence Tao. The power of convex relaxation: Near-optimal matrix com-  pletion. IEEE Transactions on Information Theory, 56(5):2053-2080, 2010.  A. H. Copeland. A ‘reasonable’ social welfare function.  In Seminar on Mathematics in Social  Sciences, University of Michigan, 1951.  Don Coppersmith, Lisa Fleischer, and Atri Rudra. Ordering by weighted number of wins gives a good ranking for weighted tournaments. In Proceedings of the 17th Annual ACM-SIAM Sympo- sium on Discrete Algorithms, 2006.  H. A. David. The Method of Paired Comparisons. Oxford University Press, 1988.  David F. Gleich and Lek-Heng Lim. Rank aggregation via nuclear norm minimization. In Pro- ceedings of the 17th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, 2011.  David R. Hunter. MM algorithms for generalized Bradley-Terry models. The Annals of Statistics,  32(1):384-406, 2004.  Prateek Jain, Raghu Meka, and Inderjit S. Dhillon. Guaranteed rank minimization via singular value  projection. In Advances in Neural Information Processing Systems, 2010. RAJKUMAR AGARWAL  Kevin G. Jamieson and Rob Nowak. Active ranking using pairwise comparisons. In Advances in  Neural Information Processing Systems, 2011.  Xiaoye Jiang, Lek-Heng Lim, Yuan Yao, and Yinyu Ye. Statistical ranking and combinatorial Hodge  theory. Mathematical Programming, 127(1):203-244, 2011.  James P. Keener. The Perron-Frobenius theorem and the ranking of football teams. SIAM Review,  35(1):80-93, 1993.  43-62, 1955.  Maurice G. Kendall. Further contributions to the theory of paired comparisons. Biometrics, 11(1):  Claire Kenyon-Mathieu and Warren Schudy. How to rank with few errors. In Proceedings of the  39th Annual ACM Symposium on Theory of Computing, 2007.  Raghunandan Keshavan, Andrea Montanari, and Sewoong Oh. Matrix completion from noisy en-  tries. In Advances in Neural Information Processing Systems, 2009.  Jean Lafond. Low rank matrix completion with exponential family noise. In Proceedings of the  28th Conference on Learning Theory, 2015.  Tyler Lu and Craig Boutilier. Learning Mallows models with pairwise preferences. In Proceedings  of the 28th International Conference on Machine Learning, 2011.  R. D. Luce. Individual Choice Behavior: A Theoretical Analysis. Wiley, 1959.  Sahand Negahban, Sewoong Oh, and Devavrat Shah. Rank Centrality: Ranking from pair-wise  comparisons. arXiv preprint arXiv:1209.1688, 2012.  Arun Rajkumar and Shivani Agarwal. A statistical convergence perspective of algorithms for rank aggregation from pairwise data. In Proceedings of the 31st International Conference on Machine Learning, 2014.  Arun Rajkumar, Suprovat Ghoshal, Lek-Heng Lim, and Shivani Agarwal. Ranking from stochastic pairwise preferences: Recovering Condorcet winners and tournament solution sets at the top. In Proceedings of the 32nd International Conference on Machine Learning, 2015.  Thomas L. Saaty. The Analytic Hierarchy Process. McGraw Hill, 1980.  Nihar B. Shah, Sivaraman Balakrishnan, Adityanand Guntuboyina, and Martin J. Wainwright. Stochastically transitive models for pairwise comparisons: Statistical and computational issues. arXiv preprint arXiv:1510.05610.v2, 2015.  Louis L. Thurstone. A law of comparative judgment. Psychological Review, 34(4):273, 1927.  Fabian L. Wauthier, Michael I. Jordan, and Nebojsa Jojic. Efficient ranking from pairwise compar-  isons. In Proceedings of the 30th International Conference on Machine Learning, 2013.  Yisong Yue, Josef Broder, Robert Kleinberg, and Thorsten Joachims. The K-armed dueling bandits  problem. Journal of Computer and System Sciences, 78(5):1538-1556, 2012."}