{"1": "ESANN, 2014.  OS is supported in part by an FP7 Marie Curie CIG grant, the Intel ICRI-CI Institute, and Israel Sci- ence Foundation grant 425/13. We thank James Martens and the anonymous COLT 2016 reviewers for several helpful comments.  Andrew R. Barron. Approximation and estimation bounds for artificial neural networks. Machine  Learning, 14(1):115-133, 1994.  M. Bianchini and F. Scarselli. On the complexity of shallow and deep neural network classifiers. In  N. Cohen, O. Sharir, and A. Shashua. On the expressive power of deep learning: A tensor analysis.  arXiv preprint arXiv:1509.05009, 2015.  G. Cybenko. Approximation by superpositions of a sigmoidal function. Mathematics of control,  signals and systems, 2(4):303-314, 1989.  C. Debao. Degree of approximation by superpositions of a sigmoidal function. Approximation  Theory and its Applications, 9(3):17-28, 1993.  O. Delalleau and Y. Bengio. Shallow vs. deep sum-product networks. In NIPS, pages 666-674,  2011.  DLMF. NIST Digital Library of Mathematical Functions. http://dlmf.nist.gov/, Release 1.0.10 of  2015-08-07, 2015. URL http://dlmf.nist.gov/.  Ken-Ichi Funahashi. On the approximate realization of continuous mappings by neural networks.  Neural networks, 2(3):183-192, 1989.  Loukas Grafakos and Gerald Teschl. On fourier transforms of radial functions and distributions.  Journal of Fourier Analysis and Applications, 19(1):167-179, 2013.  Andr´as Hajnal, Wolfgang Maass, Pavel Pudl´ak, M´ari´o Szegedy, and Gy¨orgy Tur´an. Threshold circuits of bounded depth. Journal of Computer and System Sciences, 46(2):129-154, 1993.  J. H˚astad. Almost optimal lower bounds for small depth circuits. In Proceedings of the eighteenth  annual ACM symposium on Theory of computing, pages 6-20. ACM, 1986.  K. Hornik, M. Stinchcombe, and H. White. Multilayer feedforward networks are universal approx-  imators. Neural networks, 2(5):359-366, 1989.  John K. Hunter and Bruno Nachtergaele. Applied analysis. World Scientific Publishing Co., Inc.,  River Edge, NJ, 2001.  Ilia Krasikov. Approximations for the bessel and airy functions with an explicit error term. LMS  Journal of Computation and Mathematics, 17(01):209-225, 2014.  22   ELDAN SHAMIR  Acknowledgments  References  ESANN, 2014.  OS is supported in part by an FP7 Marie Curie CIG grant, the Intel ICRI-CI Institute, and Israel Sci- ence Foundation grant 425/13. We thank James Martens and the anonymous COLT 2016 reviewers for several helpful comments.  Andrew R. Barron. Approximation and estimation bounds for artificial neural networks. Machine  Learning, 14(1):115-133, 1994.  M. Bianchini and F. Scarselli. On the complexity of shallow and deep neural network classifiers. In  N. Cohen, O. Sharir, and A. Shashua. On the expressive power of deep learning: A tensor analysis.  arXiv preprint arXiv:1509.05009, 2015.  G. Cybenko. Approximation by superpositions of a sigmoidal function. Mathematics of control,  signals and systems, 2(4):303-314, 1989.  C. Debao. Degree of approximation by superpositions of a sigmoidal function. Approximation  Theory and its Applications, 9(3):17-28, 1993.  O. Delalleau and Y. Bengio. Shallow vs. deep sum-product networks. In NIPS, pages 666-674,  2011.  DLMF. NIST Digital Library of Mathematical Functions. http://dlmf.nist.gov/, Release 1.0.10 of  2015-08-07, 2015. URL http://dlmf.nist.gov/.  Ken-Ichi Funahashi. On the approximate realization of continuous mappings by neural networks.  Neural networks, 2(3):183-192, 1989.  Loukas Grafakos and Gerald Teschl. On fourier transforms of radial functions and distributions.  Journal of Fourier Analysis and Applications, 19(1):167-179, 2013.  Andr´as Hajnal, Wolfgang Maass, Pavel Pudl´ak, M´ari´o Szegedy, and Gy¨orgy Tur´an. Threshold circuits of bounded depth. Journal of Computer and System Sciences, 46(2):129-154, 1993.  J. H˚astad. Almost optimal lower bounds for small depth circuits. In Proceedings of the eighteenth  annual ACM symposium on Theory of computing, pages 6-20. ACM, 1986.  K. Hornik, M. Stinchcombe, and H. White. Multilayer feedforward networks are universal approx-  imators. Neural networks, 2(5):359-366, 1989.  John K. Hunter and Bruno Nachtergaele. Applied analysis. World Scientific Publishing Co., Inc.,  River Edge, NJ, 2001.  Ilia Krasikov. Approximations for the bessel and airy functions with an explicit error term. LMS  Journal of Computation and Mathematics, 17(01):209-225, 2014. THE POWER OF DEPTH FOR FEEDFORWARD NEURAL NETWORKS  W. Maass, G. Schnitger, and E. Sontag. A comparison of the computational power of sigmoid and boolean threshold circuits. In V. P. Roychowdhury, K. Y. Siu, and A. Orlitsky, editors, Theoretical Advances in Neural Computation and Learning, pages 127-151. Springer, 1994.  J. Martens and V. Medabalimi. On the expressive efficiency of sum product networks. arXiv preprint  arXiv:1411.7717, 2014.  James Martens. Private Communication, 2015.  James Martens, Arkadev Chattopadhya, Toni Pitassi, and Richard Zemel. On the representational  efficiency of restricted boltzmann machines. In NIPS, pages 2877-2885, 2013.  G. F Montufar, R. Pascanu, K. Cho, and Y. Bengio. On the number of linear regions of deep neural networks. In Advances in Neural Information Processing Systems, pages 2924-2932, 2014.  I. Parberry. Circuit complexity and neural networks. MIT press, 1994.  R. Pascanu, G. Montufar, and Y. Bengio. On the number of inference regions of deep feed forward  networks with piece-wise linear activations. arXiv preprint arXiv, 1312, 2013.  B. Rossman, R. Servedio, and L.-Y. Tan. An average-case depth hierarchy theorem for boolean  circuits. In FOCS, 2015.  D. E. Rumelhart, G. E. Hinton, and R. J. Williams. Learning internal representations by error propagation. In D. E. Rumelhart and J.L. McClelland, editors, Parallel distributed Processing, volume 1. MIT Press, 1986.  A. Shpilka and A. Yehudayoff. Arithmetic circuits: A survey of recent results and open questions.  Foundations and Trends R(cid:13) in Theoretical Computer Science, 5(3-4):207-388, 2010.  Sasha Sodin. Tail-Sensitive Gaussian Asymptotics for Marginals of Concentrated Measures in High Dimension. In Vitali D. Milman and Gideon Schechtman, editors, Geometric Aspects of Func- tional Analysis, volume 1910 of Lecture Notes in Mathematics, pages 271-295. Springer Berlin Heidelberg, 2007.  M. Telgarsky.  Representation benefits of deep feedforward networks.  arXiv preprint  arXiv:1509.08101, 2015. ELDAN SHAMIR"}