{"1": "Evrim Acar, Canan Aykut-Bingol, Haluk Bingol, Rasmus Bro, and Bülent Yener. Mul- tiway analysis of epilepsy tensors. Bioinformatics, 23(13):i10-i18, 2007. doi: 10.1093/ bioinformatics/btm210. URL http://dx.doi.org/10.1093/bioinformatics/btm210.  Zeyuan Allen-Zhu and Yuanzhi Li. Lazysvd: Even faster svd decomposition yet without agonizing pain. In Advances in Neural Information Processing Systems, pages 974-982, 2016.  Anima Anandkumar, Rong Ge, and Majid Janzamin. Analyzing tensor power method dynam- ics: Applications to learning overcomplete latent variable models. CoRR, abs/1411.1488, 2014a.  Animashree Anandkumar, Rong Ge, Daniel J. Hsu, and Sham Kakade. A tensor spectral approach to learning mixed membership community models. In COLT, volume 30 of JMLR Workshop and Conference Proceedings, pages 867-881. JMLR.org, 2013.  Animashree Anandkumar, Rong Ge, Daniel J. Hsu, Sham M. Kakade, and Matus Telgarsky. Tensor decompositions for learning latent variable models. Journal of Machine Learning Research, 15(1):2773-2832, 2014b.  Animashree Anandkumar, Rong Ge, and Majid Janzamin. Guaranteed non-orthogonal tensor  decomposition via alternating rank-1 updates. CoRR, abs/1402.5180, 2014c.  Animashree Anandkumar, Rong Ge, and Majid Janzamin. Analyzing tensor power method dynamics in overcomplete regime. Journal of Machine Learning Research, 18:22:1-22:40, 2017.  Boaz Barak, Jonathan A. Kelner, and David Steurer. Dictionary learning and tensor decomposition via the sum-of-squares method. In STOC, pages 143-151. ACM, 2015.  C.F. Beckmann and S.M. Smith. Tensorial extensions of independent component analysis for multisubject fmri analysis. NeuroImage, 25(1):294 - 311, 2005. ISSN 1053-8119. doi: https://doi.org/10.1016/j.neuroimage.2004.10.043. URL http://www.sciencedirect. com/science/article/pii/S1053811904006378.  Aditya Bhaskara, Moses Charikar, Ankur Moitra, and Aravindan Vijayaraghavan. Smoothed  analysis of tensor decompositions. In STOC, pages 594-603. ACM, 2014.  Chandler Davis and W. M. Kahan. The rotation of eigenvectors by a perturbation. III. SIAM J. Numer. Anal., 7:1-46, 1970. ISSN 0036-1429. doi: 10.1137/0707001. URL http://dx.doi.org/10.1137/0707001.  13   A Robust Spectral Algorithm for Overcomplete Tensor Decomposition  CFF-1408673, and a Microsoft PhD Fellowship. Tselil Schramm was supported by NSF awards CCF-1565264 and CNS-1618026. Jonathan Shi was supported by David Steurer’s NSF CAREER grant CCF-1350196 and CFF-1408673.  References  Evrim Acar, Canan Aykut-Bingol, Haluk Bingol, Rasmus Bro, and Bülent Yener. Mul- tiway analysis of epilepsy tensors. Bioinformatics, 23(13):i10-i18, 2007. doi: 10.1093/ bioinformatics/btm210. URL http://dx.doi.org/10.1093/bioinformatics/btm210.  Zeyuan Allen-Zhu and Yuanzhi Li. Lazysvd: Even faster svd decomposition yet without agonizing pain. In Advances in Neural Information Processing Systems, pages 974-982, 2016.  Anima Anandkumar, Rong Ge, and Majid Janzamin. Analyzing tensor power method dynam- ics: Applications to learning overcomplete latent variable models. CoRR, abs/1411.1488, 2014a.  Animashree Anandkumar, Rong Ge, Daniel J. Hsu, and Sham Kakade. A tensor spectral approach to learning mixed membership community models. In COLT, volume 30 of JMLR Workshop and Conference Proceedings, pages 867-881. JMLR.org, 2013.  Animashree Anandkumar, Rong Ge, Daniel J. Hsu, Sham M. Kakade, and Matus Telgarsky. Tensor decompositions for learning latent variable models. Journal of Machine Learning Research, 15(1):2773-2832, 2014b.  Animashree Anandkumar, Rong Ge, and Majid Janzamin. Guaranteed non-orthogonal tensor  decomposition via alternating rank-1 updates. CoRR, abs/1402.5180, 2014c.  Animashree Anandkumar, Rong Ge, and Majid Janzamin. Analyzing tensor power method dynamics in overcomplete regime. Journal of Machine Learning Research, 18:22:1-22:40, 2017.  Boaz Barak, Jonathan A. Kelner, and David Steurer. Dictionary learning and tensor decomposition via the sum-of-squares method. In STOC, pages 143-151. ACM, 2015.  C.F. Beckmann and S.M. Smith. Tensorial extensions of independent component analysis for multisubject fmri analysis. NeuroImage, 25(1):294 - 311, 2005. ISSN 1053-8119. doi: https://doi.org/10.1016/j.neuroimage.2004.10.043. URL http://www.sciencedirect. com/science/article/pii/S1053811904006378.  Aditya Bhaskara, Moses Charikar, Ankur Moitra, and Aravindan Vijayaraghavan. Smoothed  analysis of tensor decompositions. In STOC, pages 594-603. ACM, 2014.  Chandler Davis and W. M. Kahan. The rotation of eigenvectors by a perturbation. III. SIAM J. Numer. Anal., 7:1-46, 1970. ISSN 0036-1429. doi: 10.1137/0707001. URL http://dx.doi.org/10.1137/0707001. A Robust Spectral Algorithm for Overcomplete Tensor Decomposition  Lieven De Lathauwer, Bart De Moor, and Joos Vandewalle. Blind source separation by simultaneous third-order tensor diagonalization. In European Signal Processing Conference, 1996. EUSIPCO 1996. 8th, pages 1-4. IEEE, 1996.  Lieven De Lathauwer, Josphine Castaing, and Jean-Franois Cardoso. Fourth-order cumulant- based blind identification of underdetermined mixtures. IEEE Transactions on Signal Processing, 55(6):2965-2973, 2007.  Michael Elad. Sparse and Redundant Representations: From Theory to Applications in Signal and Image Processing. Springer Publishing Company, Incorporated, 1st edition, 2010. ISBN 144197010X, 9781441970107.  Rong Ge and Tengyu Ma. Decomposing overcomplete 3rd order tensors using sum-of-squares algorithms. In APPROX-RANDOM, volume 40 of LIPIcs, pages 829-849. Schloss Dagstuhl - Leibniz-Zentrum fuer Informatik, 2015.  Rong Ge and Tengyu Ma. On the optimization landscape of tensor decompositions. In  Advances in Neural Information Processing Systems, pages 3653-3663, 2017.  Rong Ge, Furong Huang, Chi Jin, and Yang Yuan. Escaping from saddle points - online stochastic gradient for tensor decomposition. In Peter Grünwald, Elad Hazan, and Satyen Kale, editors, Proceedings of The 28th Conference on Learning Theory, COLT 2015, Paris, France, July 3-6, 2015, volume 40 of JMLR Workshop and Conference Proceedings, pages 797-842. JMLR.org, 2015a. URL http://jmlr.org/proceedings/papers/v40/ Ge15.html.  Rong Ge, Qingqing Huang, and Sham M. Kakade. Learning mixtures of Gaussians in high dimensions [extended abstract]. In STOC’15—Proceedings of the 2015 ACM Symposium on Theory of Computing, pages 761-770. ACM, New York, 2015b.  Wu Hai-Long, Shibukawa Masami, and Oguma Koichi. An alternating trilinear decomposition algorithm with application to calibration of HPLC-DAD for simultaneous determination of overlapped chlorinated aromatic hydrocarbons. Journal of Chemometrics, 12(1):1-26. doi: 10.1002/(SICI)1099-128X(199801/02)12:1<1::AID-CEM492>3.0.CO;2-4.  Richard A Harshman. Foundations of the parafac procedure: Models and conditions for an\"  explanatory\" multi-modal factor analysis. 1970.  Christopher J. Hillar and Lek-Heng Lim. Most tensor problems are np-hard. J. ACM, 60(6):  45:1-45:39, 2013.  Samuel B Hopkins and David Steurer. Eﬃcient bayesian estimation from few samples: community detection and related problems. In Foundations of Computer Science (FOCS), 2017 IEEE 58th Annual Symposium on, pages 379-390. IEEE, 2017.  Samuel B. Hopkins, Jonathan Shi, and David Steurer. Tensor principal component analysis In COLT, volume 40 of JMLR Workshop and Conference  via sum-of-square proofs. Proceedings, pages 956-1006. JMLR.org, 2015. A Robust Spectral Algorithm for Overcomplete Tensor Decomposition  Samuel B. Hopkins, Tselil Schramm, Jonathan Shi, and David Steurer. Fast spectral algorithms from sum-of-squares proofs: tensor decomposition and planted sparse vectors. In STOC, pages 178-191. ACM, 2016.  Tamara G. Kolda and Brett W. Bader. Tensor decompositions and applications. SIAM  Review, 51(3):455-500, 2009.  Lieven De Lathauwer, Joséphine Castaing, and Jean-François Cardoso. Fourth-order cumulant-based blind identification of underdetermined mixtures. IEEE Trans. Signal Processing, 55(6-2):2965-2973, 2007.  Michael S. Lewicki and Terrence J. Sejnowski. Learning overcomplete representations. Neural Comput., 12(2):337-365, February 2000. ISSN 0899-7667. doi: 10.1162/089976600300015826. URL http://dx.doi.org/10.1162/089976600300015826.  Tengyu Ma, Jonathan Shi, and David Steurer. Polynomial-time tensor decompositions with  sum-of-squares. In FOCS, pages 438-446. IEEE Computer Society, 2016.  Marco Mondelli and Andrea Montanari. On the connection between learning two-layers neural networks and tensor decomposition. CoRR, abs/1802.07301, 2018. URL http: //arxiv.org/abs/1802.07301.  Emile Richard and Andrea Montanari. A statistical model for tensor PCA. In NIPS, pages  2897-2905, 2014.  Tselil Schramm and David Steurer. Fast and robust tensor decomposition with applications to dictionary learning. In COLT, volume 65 of Proceedings of Machine Learning Research, pages 1760-1793. PMLR, 2017.  Vatsal Sharan and Gregory Valiant. Orthogonalized ALS: A theoretically principled tensor decomposition algorithm for practical use. In ICML, volume 70 of Proceedings of Machine Learning Research, pages 3095-3104. PMLR, 2017.  Hermann Weyl. Das asymptotische verteilungsgesetz der eigenwerte linearer partieller diﬀer- entialgleichungen (mit einer anwendung auf die theorie der hohlraumstrahlung). Mathe- matische Annalen, 71(4):441-479, Dec 1912. ISSN 1432-1807. doi: 10.1007/BF01456804. URL https://doi.org/10.1007/BF01456804."}