{"1": "Guy Bresler. Efficiently learning ising models on arbitrary graphs. In Proceedings of the forty-  seventh annual ACM symposium on Theory of computing, pages 771-782. ACM, 2015.  Guy Bresler, Elchanan Mossel, and Allan Sly. Reconstruction of markov random fields from sam- ples: Some observations and algorithms. In Approximation, Randomization and Combinatorial Optimization. Algorithms and Techniques, pages 343-356. Springer, 2008.  Guy Bresler, David Gamarnik, and Devavrat Shah. Hardness of parameter estimation in graphical  models. In Advances in Neural Information Processing Systems, pages 1062-1070, 2014.  Yuxin Chen. Learning sparse ising models with missing data.  Myung Jin Choi, Joseph J Lim, Antonio Torralba, and Alan S Willsky. Exploiting hierarchical  context on a large database of object categories. 2010.  C Chow and Cong Liu. Approximating discrete probability distributions with dependence trees.  IEEE transactions on Information Theory, 14(3):462-467, 1968.  Sanjoy Dasgupta. Learning polytrees. In Proceedings of the Fifteenth conference on Uncertainty in  artificial intelligence, pages 134-141. Morgan Kaufmann Publishers Inc., 1999.  Linus Hamilton, Frederic Koehler, and Ankur Moitra. Information theoretic properties of markov random fields, and their algorithmic applications. In Advances in Neural Information Processing Systems, pages 2463-2472, 2017.  Ariel Jaimovich, Gal Elidan, Hanah Margalit, and Nir Friedman. Towards an integrated protein- protein interaction network: A relational markov network approach. Journal of Computational Biology, 13(2):145-164, 2006.  Sham Kakade, Dean Foster, and Eyal Even-Dar. (exponentiated) stochastic gradient descent for l1  constrained problems, 2008.  Adam Klivans and Raghu Meka. Learning graphical models using multiplicative weights. In Foun- dations of Computer Science (FOCS), 2017 IEEE 58th Annual Symposium on, pages 343-354. IEEE, 2017.  Daphne Koller, Nir Friedman, and Francis Bach. Probabilistic graphical models: principles and  techniques. MIT press, 2009.  Su-In Lee, Varun Ganapathi, and Daphne Koller. Efficient structure learning of markov networks using l 1-regularization. In Advances in neural Information processing systems, pages 817-824, 2007.  Erik M Lindgren, Vatsal Shah, Yanyao Shen, Alexandros G. Dimakis, and Adam Klivans. On robust  learning of ising models. 2018.  13   LEARNING ISING MODELS WITH INDEPENDENT FAILURES  Acknowledgments  We thank Shanshan Wu for useful discussions.  References  Guy Bresler. Efficiently learning ising models on arbitrary graphs. In Proceedings of the forty-  seventh annual ACM symposium on Theory of computing, pages 771-782. ACM, 2015.  Guy Bresler, Elchanan Mossel, and Allan Sly. Reconstruction of markov random fields from sam- ples: Some observations and algorithms. In Approximation, Randomization and Combinatorial Optimization. Algorithms and Techniques, pages 343-356. Springer, 2008.  Guy Bresler, David Gamarnik, and Devavrat Shah. Hardness of parameter estimation in graphical  models. In Advances in Neural Information Processing Systems, pages 1062-1070, 2014.  Yuxin Chen. Learning sparse ising models with missing data.  Myung Jin Choi, Joseph J Lim, Antonio Torralba, and Alan S Willsky. Exploiting hierarchical  context on a large database of object categories. 2010.  C Chow and Cong Liu. Approximating discrete probability distributions with dependence trees.  IEEE transactions on Information Theory, 14(3):462-467, 1968.  Sanjoy Dasgupta. Learning polytrees. In Proceedings of the Fifteenth conference on Uncertainty in  artificial intelligence, pages 134-141. Morgan Kaufmann Publishers Inc., 1999.  Linus Hamilton, Frederic Koehler, and Ankur Moitra. Information theoretic properties of markov random fields, and their algorithmic applications. In Advances in Neural Information Processing Systems, pages 2463-2472, 2017.  Ariel Jaimovich, Gal Elidan, Hanah Margalit, and Nir Friedman. Towards an integrated protein- protein interaction network: A relational markov network approach. Journal of Computational Biology, 13(2):145-164, 2006.  Sham Kakade, Dean Foster, and Eyal Even-Dar. (exponentiated) stochastic gradient descent for l1  constrained problems, 2008.  Adam Klivans and Raghu Meka. Learning graphical models using multiplicative weights. In Foun- dations of Computer Science (FOCS), 2017 IEEE 58th Annual Symposium on, pages 343-354. IEEE, 2017.  Daphne Koller, Nir Friedman, and Francis Bach. Probabilistic graphical models: principles and  techniques. MIT press, 2009.  Su-In Lee, Varun Ganapathi, and Daphne Koller. Efficient structure learning of markov networks using l 1-regularization. In Advances in neural Information processing systems, pages 817-824, 2007.  Erik M Lindgren, Vatsal Shah, Yanyao Shen, Alexandros G. Dimakis, and Adam Klivans. On robust  learning of ising models. 2018. LEARNING ISING MODELS WITH INDEPENDENT FAILURES  Po-Ling Loh and Martin J Wainwright. High-dimensional regression with noisy and missing data: Provable guarantees with non-convexity. In Advances in Neural Information Processing Systems, pages 2726-2734, 2011.  Daniel Marbach, James C Costello, Robert K¨uffner, Nicole M Vega, Robert J Prill, Diogo M Cama- cho, Kyle R Allison, Andrej Aderhold, Richard Bonneau, Yukun Chen, et al. Wisdom of crowds for robust gene network inference. Nature methods, 9(8):796, 2012.  Pradeep Ravikumar, Martin J Wainwright, John D Lafferty, et al. High-dimensional ising model selection using ?1-regularized logistic regression. The Annals of Statistics, 38(3):1287-1319, 2010.  Bero Roos. Binomial approximation to the poisson binomial distribution: The krawtchouk expan-  sion. Theory of Probability & Its Applications, 45(2):258-272, 2001.  Devavrat Shah and Dogyoon Song. Learning mixture model with missing values and its application  to rankings. arXiv preprint arXiv:1812.11917, 2018.  Gregory Valiant. Finding correlations in subquadratic time, with applications to learning parities  and the closest pair problem. Journal of the ACM (JACM), 62(2):13, 2015.  Marc Vuffray, Sidhant Misra, Andrey Lokhov, and Michael Chertkov. Interaction screening: Effi- cient and sample-optimal learning of ising models. In Advances in Neural Information Processing Systems, pages 2595-2603, 2016.  Shanshan Wu, Sujay Sanghavi, and Alexandros G Dimakis. Sparse logistic regression learns all  discrete pairwise graphical models. arXiv preprint arXiv:1810.11905, 2018.  Eunho Yang, Genevera Allen, Zhandong Liu, and Pradeep K Ravikumar. Graphical models via generalized linear models. In Advances in Neural Information Processing Systems, pages 1358- 1366, 2012.  Ming Yuan and Yi Lin. Model selection and estimation in the gaussian graphical model. Biometrika,  94(1):19-35, 2007. LEARNING ISING MODELS WITH INDEPENDENT FAILURES"}