{"1": "1. Ahmed, E., Jones, M., Marks, T.K.: An improved deep learning architecture for  person re-identification. In: CVPR (2015)  2. Almazan, J., Gajic, B., Murray, N., Larlus, D.: Re-id done right: towards good practices for person re-identification. arXiv preprint arXiv:1801.05339 (2018) 3. Anderson, P., He, X., Buehler, C., Teney, D., Johnson, M., Gould, S., Zhang, L.: Bottom-up and top-down attention for image captioning and visual question answering. arXiv preprint arXiv:1707.07998 (2017)  4. Antol, S., Agrawal, A., Lu, J., Mitchell, M., Batra, D., Lawrence Zitnick, C., Parikh,  D.: Vqa: Visual question answering. In: ICCV (2015)  5. Bai, S., Bai, X., Tian, Q.: Scalable person re-identification on supervised smoothed  manifold. In: CVPR (2017)  6. Bai, X., Yang, M., Huang, T., Dou, Z., Yu, R., Xu, Y.: Deep-person: Learning discriminative deep features for person re-identification. CoRR abs/1711.10658 (2017)  7. Barbosa, I.B., Cristani, M., Del Bue, A., Bazzani, L., Murino, V.: Re-identification  with rgb-d sensors. In: ECCV (2012)  8. Chen, D., Xu, D., Li, H., Sebe, N., Wang, X.: Group consistent similarity learning  via deep crf for person re-identification. In: CVPR (2018)  9. Chen, D., Yuan, Z., Chen, B., Zheng, N.: Similarity learning with spatial con-  straints for person re-identification. In: CVPR (2016)  10. Chen, D., Yuan, Z., Hua, G., Zheng, N., Wang, J.: Similarity learning on an explicit polynomial kernel feature map for person re-identification. In: CVPR (2015) 11. Chen, D., Yuan, Z., Wang, J., Chen, B., Hua, G., Zheng, N.: Exemplar-guided similarity learning on polynomial kernel feature map for person re-identification. International Journal of Computer Vision 123(3), 392-414 (2017)  12. Chen, W., Chen, X., Zhang, J., Huang, K.: Beyond triplet loss: A deep quadruplet  network for person re-identification. In: CVPR (2017)  13. Chen, X., Zitnick, C.L.: Mind’s eye: A recurrent visual representation for image  caption generation. In: CVPR (June 2015)  14. Chen, Y.C., Zhu, X., Zheng, W.S., Lai, J.H.: Person re-identification by camera correlation aware feature augmentation. IEEE Transactions on Pattern Analysis and Machine Intelligence 40(2), 392-408 (Feb 2018)  15. Chen, Y., Zhu, X., Gong, S.: Person re-identification by deep learning multi-scale  representations. In: ICCVW (2017)  16. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A Large-  Scale Hierarchical Image Database. In: CVPR (2009)  17. Farenzena, M., Bazzani, L., Perina, A., Murino, V., Cristani, M.: Person re- identification by symmetry-driven accumulation of local features. In: CVPR (2010) 18. Frome, A., Corrado, G.S., Shlens, J., Bengio, S., Dean, J., Mikolov, T., et al.: Devise: A deep visual-semantic embedding model. In: NIPS. pp. 2121-2129 (2013) 19. Johnson, J., Karpathy, A., Fei-Fei, L.: Densecap: Fully convolutional localization  networks for dense captioning. In: CVPR (2016)  20. Karpathy, A., Fei-Fei, L.: Deep visual-semantic alignments for generating image  descriptions. IEEE Trans. Pattern Anal. Mach. Intell. 39(4) (Apr 2017)  21. Karpathy, A., Joulin, A., Fei-Fei, L.: Deep fragment embeddings for bidirectional  image sentence mapping. In: NIPS (2014)  22. Koestinger, M., Hirzer, M., Wohlhart, P., Roth, P.M., Bischof, H.: Large scale metric learning from equivalence constraints. In: CVPR. pp. 2288-2295 (2012)   Re-ID by Global and Local Image-language AssociationReferences  1. Ahmed, E., Jones, M., Marks, T.K.: An improved deep learning architecture for  person re-identification. In: CVPR (2015)  2. Almazan, J., Gajic, B., Murray, N., Larlus, D.: Re-id done right: towards good practices for person re-identification. arXiv preprint arXiv:1801.05339 (2018) 3. Anderson, P., He, X., Buehler, C., Teney, D., Johnson, M., Gould, S., Zhang, L.: Bottom-up and top-down attention for image captioning and visual question answering. arXiv preprint arXiv:1707.07998 (2017)  4. Antol, S., Agrawal, A., Lu, J., Mitchell, M., Batra, D., Lawrence Zitnick, C., Parikh,  D.: Vqa: Visual question answering. In: ICCV (2015)  5. Bai, S., Bai, X., Tian, Q.: Scalable person re-identification on supervised smoothed  manifold. In: CVPR (2017)  6. Bai, X., Yang, M., Huang, T., Dou, Z., Yu, R., Xu, Y.: Deep-person: Learning discriminative deep features for person re-identification. CoRR abs/1711.10658 (2017)  7. Barbosa, I.B., Cristani, M., Del Bue, A., Bazzani, L., Murino, V.: Re-identification  with rgb-d sensors. In: ECCV (2012)  8. Chen, D., Xu, D., Li, H., Sebe, N., Wang, X.: Group consistent similarity learning  via deep crf for person re-identification. In: CVPR (2018)  9. Chen, D., Yuan, Z., Chen, B., Zheng, N.: Similarity learning with spatial con-  straints for person re-identification. In: CVPR (2016)  10. Chen, D., Yuan, Z., Hua, G., Zheng, N., Wang, J.: Similarity learning on an explicit polynomial kernel feature map for person re-identification. In: CVPR (2015) 11. Chen, D., Yuan, Z., Wang, J., Chen, B., Hua, G., Zheng, N.: Exemplar-guided similarity learning on polynomial kernel feature map for person re-identification. International Journal of Computer Vision 123(3), 392-414 (2017)  12. Chen, W., Chen, X., Zhang, J., Huang, K.: Beyond triplet loss: A deep quadruplet  network for person re-identification. In: CVPR (2017)  13. Chen, X., Zitnick, C.L.: Mind’s eye: A recurrent visual representation for image  caption generation. In: CVPR (June 2015)  14. Chen, Y.C., Zhu, X., Zheng, W.S., Lai, J.H.: Person re-identification by camera correlation aware feature augmentation. IEEE Transactions on Pattern Analysis and Machine Intelligence 40(2), 392-408 (Feb 2018)  15. Chen, Y., Zhu, X., Gong, S.: Person re-identification by deep learning multi-scale  representations. In: ICCVW (2017)  16. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A Large-  Scale Hierarchical Image Database. In: CVPR (2009)  17. Farenzena, M., Bazzani, L., Perina, A., Murino, V., Cristani, M.: Person re- identification by symmetry-driven accumulation of local features. In: CVPR (2010) 18. Frome, A., Corrado, G.S., Shlens, J., Bengio, S., Dean, J., Mikolov, T., et al.: Devise: A deep visual-semantic embedding model. In: NIPS. pp. 2121-2129 (2013) 19. Johnson, J., Karpathy, A., Fei-Fei, L.: Densecap: Fully convolutional localization  networks for dense captioning. In: CVPR (2016)  20. Karpathy, A., Fei-Fei, L.: Deep visual-semantic alignments for generating image  descriptions. IEEE Trans. Pattern Anal. Mach. Intell. 39(4) (Apr 2017)  21. Karpathy, A., Joulin, A., Fei-Fei, L.: Deep fragment embeddings for bidirectional  image sentence mapping. In: NIPS (2014)  22. Koestinger, M., Hirzer, M., Wohlhart, P., Roth, P.M., Bischof, H.: Large scale metric learning from equivalence constraints. In: CVPR. pp. 2288-2295 (2012)   16  D. Chen et al.  23. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Pereira, F., Burges, C.J.C., Bottou, L., Weinberger, K.Q. (eds.) NIPS (2012)  24. Li, D., Chen, X., Zhang, Z., Huang, K.: Learning deep context-aware features over  body and latent parts for person re-identification. In: CVPR (2017)  25. Li, S., Xiao, T., Li, H., Yang, W., Wang, X.: Identity-aware textual-visual matching  with latent co-attention. In: ICCV (2017)  26. Li, S., Xiao, T., Li, H., Zhou, B., Yue, D., Wang, X.: Person search with natural  language description. In: CVPR (2017)  27. Li, W., Zhao, R., Wang, X.: Human reidentification with transferred metric learn-  ing. In: ACCV (2012)  28. Li, W., Zhao, R., Xiao, T., Wang, X.: Deepreid: Deep filter pairing neural network  for person re-identification. In: CVPR (2014)  29. Li, W., Zhu, X., Gong, S.: Person re-identification by deep joint learning of multi-  loss classification. IJCAI (2017)  30. Li, Y., Duan, N., Zhou, B., Chu, X., Ouyang, W., Wang, X., Zhou, M.: Visual  question generation as dual task of visual question answering. In: CVPR (2018)  31. Liao, S., Hu, Y., Zhu, X., Li, S.Z.: Person re-identification by local maximal oc-  currence representation and metric learning. In: CVPR (2015)  32. Lin, J., Ren, L., Lu, J., Feng, J., Zhou, J.: Consistent-aware deep learning for  person re-identification in a camera network. In: CVPR (2017)  33. Lin, Y., Zheng, L., Zheng, Z., Wu, Y., Yang, Y.: Improving person re-identification  by attribute and identity learning. CoRR abs/1703.07220 (2017)  34. Liu, J., Shahroudy, A., Xu, D., Wang, G.: Spatio-temporal lstm with trust gates  for 3d human action recognition. In: ECCV (2016)  35. Liu, X., Li, H., Shao, J., Chen, D., Wang, X.: Show, tell and discriminate: Image  captioning by self-retrieval with partially labeled data. In: ECCV (2018)  36. Liu, X., Zhao, H., Tian, M., Sheng, L., Shao, J., Yi, S., Yan, J., Wang, X.:  Hydraplus-net: Attentive deep features for pedestrian analysis. In: ICCV (2017)  37. Ma, B., Su, Y., Jurie, F.: Bicov: a novel image representation for person re- identification and face verification. In: British Machive Vision Conference. pp. 11-pages (2012)  38. Mignon, A., Jurie, F.: Pcca: A new approach for distance learning from sparse  pairwise constraints. In: CVPR. IEEE (2012)  39. Mirza, M., Osindero, S.: Conditional generative adversarial nets. arXiv preprint  arXiv:1411.1784 (2014)  40. Qian, X., Fu, Y., Jiang, Y.G., Xiang, T., Xue, X.: Multi-scale deep learning archi-  tectures for person re-identification. In: ICCV (2017)  41. Reed, S., Akata, Z., Lee, H., Schiele, B.: Learning deep representations of fine-  grained visual descriptions. In: CVPR (2016)  42. Reed, S., Akata, Z., Yan, X., Logeswaran, L., Schiele, B., Lee, H.: Generative  adversarial text to image synthesis. In: ICML (2016)  43. Rennie, S.J., Marcheret, E., Mroueh, Y., Ross, J., Goel, V.: Self-critical sequence training for image captioning. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  44. Schumann, A., Stiefelhagen, R.: Person re-identification by deep learning attribute-  complementary information. In: CVPRW (2017)  45. Shen, Y., Li, H., Xiao, T., Yi, S., Chen, D., Wang, X.: Deep group-shuﬄing random  walk for person re-identification. In: CVPR (2018)  46. Shen, Y., Xiao, T., Li, H., Yi, S., Wang, X.: End-to-end deep kronecker-product  matching for person re-identification. In: CVPR (2018)   Re-ID by Global and Local Image-language Association47. Su, C., Li, J., Zhang, S., Xing, J., Gao, W., Tian, Q.: Pose-driven deep convolu-  tional model for person re-identification. In: ICCV (2017)  48. Su, C., Zhang, S., Xing, J., Gao, W., Tian, Q.: Deep attributes driven multi-camera  person re-identification. In: ECCV (2016)  49. Sun, Y., Zheng, L., Deng, W., Wang, S.: Svdnet for pedestrian retrieval. In: ICCV  (2017)  50. Varior, R.R., Haloi, M., Wang, G.: Gated siamese convolutional neural network  architecture for human re-identification. In: ECCV (2016)  51. Vinyals, O., Toshev, A., Bengio, S., Erhan, D.: Show and tell: A neural image  caption generator. In: CVPR. IEEE (2015)  52. Wang, F., Zuo, W., Lin, L., Zhang, D., Zhang, L.: Joint learning of single-image and cross-image representations for person re-identification. In: CVPR (2016) 53. Wang, X., Doretto, G., Sebastian, T., Rittscher, J., Tu, P.: Shape and appearance  context modeling. In: ICCV (2007)  54. Wu, A., Zheng, W.S., Yu, H.X., Gong, S., Lai, J.: Rgb-infrared cross-modality  person re-identification. In: ICCV (2017)  55. Xiao, T., Li, H., Ouyang, W., Wang, X.: Learning deep feature representations  with domain guided dropout for person re-identification. In: CVPR (2016)  56. Xiao, T., Li, S., Wang, B., Lin, L., Wang, X.: End-to-end deep learning for person  search. CoRR abs/1604.01850 (2016)  57. Xu, K., Ba, J., Kiros, R., Cho, K., Courville, A., Salakhudinov, R., Zemel, R., Bengio, Y.: Show, attend and tell: Neural image caption generation with visual attention. In: ICML. pp. 2048-2057 (2015)  58. Zhang, L., Xiang, T., Gong, S.: Learning a discriminative null space for person  re-identification. In: CVPR (2016)  59. Zhao, H., Tian, M., Sun, S., Shao, J., Yan, J., Yi, S., Wang, X., Tang, X.: Spindle net: Person re-identification with human body region guided feature decomposition and fusion. In: CVPR (2017)  60. Zhao, L., Li, X., Zhuang, Y., Wang, J.: Deeply-learned part-aligned representations  for person re-identification. In: ICCV (2017)  61. Zheng, L., Huang, Y., Lu, H., Yang, Y.: Pose invariant embedding for deep person  re-identification. CoRR abs/1701.07732 (2017)  62. Zheng, L., Shen, L., Tian, L., Wang, S., Wang, J., Tian, Q.: Scalable person re-  identification: A benchmark. In: ICCV (2015)  63. Zheng, Z., Zheng, L., Garrett, M., Yang, Y., Shen, Y.: Dual-path convolutional image-text embedding. CoRR abs/1711.05535 (2017), http://arxiv.org/abs/ 1711.05535  64. Zheng, Z., Zheng, L., Yang, Y.: Unlabeled samples generated by gan improve the  person re-identification baseline in vitro. In: ICCV (2017)  65. Zhong, Z., Zheng, L., Cao, D., Li, S.: Re-ranking person re-identification with  k-reciprocal encoding. In: CVPR (2017)  66. Zhou, J., Yu, P., Tang, W., Wu, Y.: Eﬃcient online local metric adaptation via  negative samples for person re-identification. In: ICCV (2017)  67. Zhou, S., Wang, J., Wang, J., Gong, Y., Zheng, N.: Point to set similarity based  deep feature learning for person re-identification. In: CVPR (2017)"}