{"1": "1. Sivic, J., Zisserman, A.: Video Google: A text retrieval approach to object matching  in videos. In: ICCV. (2003)  2. Philbin, J., Chum, O., Isard, M., Sivic, J., Zisserman, A.: Object retrieval with  large vocabularies and fast spatial matching. In: CVPR. (June 2007)  3. Philbin, J., Chum, O., Isard, M., Sivic, J., Zisserman, A.: Lost in quantization: Improving particular object retrieval in large scale image databases. In: CVPR. (June 2008)  4. J´egou, H., Douze, M., Schmid, C.: Improving bag-of-features for large scale image  search. IJCV 87(3) (February 2010) 316-336  5. J´egou, H., Schmid, C., Harzallah, H., Verbeek, J.: Accurate image search using the contextual dissimilarity measure. IEEE Trans. PAMI 32(1) (January 2010) 2-11 6. van Gemert, J.C., Veenman, C., Smeulders, A.W., Geusebroek, J.: Visual word  ambiguity. IEEE Trans. PAMI 32(7) (July 2010) 1271-1283  7. Babenko, A., Lempitsky, V.: The inverted multi-index. In: CVPR. (June 2012) 8. J´egou, H., Douze, M., Schmid, C., P´erez, P.: Aggregating local descriptors into a  compact image representation. In: CVPR. (June 2010)  9. Perronnin, F., Dance, C.R.: Fisher kernels on visual vocabularies for image cate-  gorization. In: CVPR. (June 2007)  10. Perronnin, F., J.S´anchez, Mensink, T.: Improving the fisher kernel for large-scale  image classification. In: ECCV. (September 2010)  11. Babenko, A., Slesarev, A., Chigorin, A., Lempitsky, V.: Neural codes for image  retrieval. In: ECCV. (2014)  12. Tolias, G., Sicre, R., J´egou, H.: Particular object retrieval with integral max-  pooling of cnn activations. ICLR (2016)  13. Gordo, A., Almazan, J., Revaud, J., Larlus, D.: Deep image retrieval: Learning  global representations for image search. ECCV (2016)  14. Radenovi´c, F., Tolias, G., Chum, O.: CNN image retrieval learns from bow: Un-  supervised fine-tuning with hard examples. ECCV (2016)  15. Radenovi´c, F., Tolias, G., Chum, O.: Fine-tuning cnn image retrieval with no  human annotation. arXiv preprint arXiv:1711.02512 (2017)  16. Muja, M., Lowe, D.G.: Scalable nearest neighbor algorithms for high dimensional  17. Nist´er, D., Stew´enius, H.: Scalable recognition with a vocabulary tree. In: CVPR.  data. IEEE Trans. PAMI 36 (2014)  (June 2006) 2161-2168  18. Indyk, P., Motwani, R.: Approximate nearest neighbors: towards removing the  curse of dimensionality. In: STOC. (1998) 604-613  19. Gionis, A., Indyk, P., Motwani, R.: Similarity search in high dimension via hashing.  In: VLDB. (1999) 518-529  20. Datar, M., Immorlica, N., Indyk, P., Mirrokni, V.: Locality-sensitive hashing In: Proceedings of the Symposium on  scheme based on p-stable distributions. Computational Geometry. (2004)  21. Lv, Q., Charikar, M., Li, K.: Image similarity search with compact data structures.  22. Norouzi, M., Punjani, A., Fleet, D.J.: Fast search in hamming space with multi-  In: CIKM. (November 2004) 208-217  index hashing. In: CVPR. (2012)  23. Weiss, Y., Torralba, A., Fergus, R.: Spectral hashing. In: NIPS. (December 2009) 24. Raginsky, M., Lazebnik, S.: Locality-sensitive binary codes from shift-invariant  kernels. In: NIPS. (2010)   Local Orthogonal-Group TestingReferences  1. Sivic, J., Zisserman, A.: Video Google: A text retrieval approach to object matching  in videos. In: ICCV. (2003)  2. Philbin, J., Chum, O., Isard, M., Sivic, J., Zisserman, A.: Object retrieval with  large vocabularies and fast spatial matching. In: CVPR. (June 2007)  3. Philbin, J., Chum, O., Isard, M., Sivic, J., Zisserman, A.: Lost in quantization: Improving particular object retrieval in large scale image databases. In: CVPR. (June 2008)  4. J´egou, H., Douze, M., Schmid, C.: Improving bag-of-features for large scale image  search. IJCV 87(3) (February 2010) 316-336  5. J´egou, H., Schmid, C., Harzallah, H., Verbeek, J.: Accurate image search using the contextual dissimilarity measure. IEEE Trans. PAMI 32(1) (January 2010) 2-11 6. van Gemert, J.C., Veenman, C., Smeulders, A.W., Geusebroek, J.: Visual word  ambiguity. IEEE Trans. PAMI 32(7) (July 2010) 1271-1283  7. Babenko, A., Lempitsky, V.: The inverted multi-index. In: CVPR. (June 2012) 8. J´egou, H., Douze, M., Schmid, C., P´erez, P.: Aggregating local descriptors into a  compact image representation. In: CVPR. (June 2010)  9. Perronnin, F., Dance, C.R.: Fisher kernels on visual vocabularies for image cate-  gorization. In: CVPR. (June 2007)  10. Perronnin, F., J.S´anchez, Mensink, T.: Improving the fisher kernel for large-scale  image classification. In: ECCV. (September 2010)  11. Babenko, A., Slesarev, A., Chigorin, A., Lempitsky, V.: Neural codes for image  retrieval. In: ECCV. (2014)  12. Tolias, G., Sicre, R., J´egou, H.: Particular object retrieval with integral max-  pooling of cnn activations. ICLR (2016)  13. Gordo, A., Almazan, J., Revaud, J., Larlus, D.: Deep image retrieval: Learning  global representations for image search. ECCV (2016)  14. Radenovi´c, F., Tolias, G., Chum, O.: CNN image retrieval learns from bow: Un-  supervised fine-tuning with hard examples. ECCV (2016)  15. Radenovi´c, F., Tolias, G., Chum, O.: Fine-tuning cnn image retrieval with no  human annotation. arXiv preprint arXiv:1711.02512 (2017)  16. Muja, M., Lowe, D.G.: Scalable nearest neighbor algorithms for high dimensional  17. Nist´er, D., Stew´enius, H.: Scalable recognition with a vocabulary tree. In: CVPR.  data. IEEE Trans. PAMI 36 (2014)  (June 2006) 2161-2168  18. Indyk, P., Motwani, R.: Approximate nearest neighbors: towards removing the  curse of dimensionality. In: STOC. (1998) 604-613  19. Gionis, A., Indyk, P., Motwani, R.: Similarity search in high dimension via hashing.  In: VLDB. (1999) 518-529  20. Datar, M., Immorlica, N., Indyk, P., Mirrokni, V.: Locality-sensitive hashing In: Proceedings of the Symposium on  scheme based on p-stable distributions. Computational Geometry. (2004)  21. Lv, Q., Charikar, M., Li, K.: Image similarity search with compact data structures.  22. Norouzi, M., Punjani, A., Fleet, D.J.: Fast search in hamming space with multi-  In: CIKM. (November 2004) 208-217  index hashing. In: CVPR. (2012)  23. Weiss, Y., Torralba, A., Fergus, R.: Spectral hashing. In: NIPS. (December 2009) 24. Raginsky, M., Lazebnik, S.: Locality-sensitive binary codes from shift-invariant  kernels. In: NIPS. (2010)   16  Ahmet Iscen, Ondˇrej Chum  25. J´egou, H., Douze, M., Schmid, C.: Product quantization for nearest neighbor  search. IEEE Trans. PAMI 33(1) (January 2011) 117-128  26. Ge, T., He, K., Ke, Q., Sun, J.: Optimized product quantization for approximate  nearest neighbor search. In: CVPR. (June 2013)  27. Kalantidis, Y., Avrithis, Y.: Locally optimized product quantization for approxi-  mate nearest neighbor search. In: CVPR. (2014)  28. Jain, H., Zepeda, J., P´erez, P., Gribonval, R.: Subic: A supervised, structured  binary code for image search. In: ICCV. (2017)  29. Jain, H., Zepeda, J., P´erez, P., Gribonval, R.: Learning a complete image indexing  pipeline. (2018)  30. Dorfman, R.: The detection of defective members of large populations. The Annals  of Mathematical Statistics 14(4) (1943) 436-440  31. Iscen, A., Furon, T., Gripon, V., Rabbat, M., J´egou, H.: Memory vectors for  similarity search in high-dimensional spaces. IEEE Trans. Big Data 4(1) (2018)  32. Shi, M., Furon, T., J´egou, H.: A group testing framework for similarity search in  high-dimensional spaces. In: ACM Multimedia. (November 2014)  33. Iscen, A., Amsaleg, L., Furon, T.: Scaling group testing similarity search. In: ACM  34. Iscen, A., Rabbat, M., Furon, T.: Eﬃcient large-scale similarity search using matrix  factorization. In: CVPR. (2016)  35. Rao, C.R., Mitra, S.K.: Generalized inverse of matrices and its applications. Vol-  ICMR. (2016)  ume 7. (1971)  36. Aldridge, M., Baldassini, L., Johnson, O.: Group testing algorithms: bounds and  simulations. IEEE Trans. Inform. Theory (2014)  37. Bickson, D., Baron, D., Ihler, A., Avissar, H., Dolev, D.: Fault identification via nonparametric belief propagation. IEEE Transactions on Signal Processing 59(6) (2011) 2602-2613  38. Cheraghchi, M., Hormati, A., Karbasi, A., Vetterli, M.: Compressed sensing with probabilistic measurements: A group testing solution. In: 47th Annual Allerton Conference on Communication, Control, and Computing. (2009)  39. Gilbert, A., Indyk, P.: Sparse recovery using sparse matrices. Proceedings of the  IEEE 98(6) (2010) 937-947  40. Sejdinovic, D., Johnson, O.: Note on noisy group testing: asymptotic bounds In: 48th Annual Allerton Conference on  and belief propagation reconstruction. Communication, Control, and Computing. (2010)  41. Pati, Y.C., Rezaiifar, R., Krishnaprasad, P.: Orthogonal matching pursuit: Re- cursive function approximation with applications to wavelet decomposition. In: ASILOMAR. (1993) 40-44  42. Davis, G.M., Mallat, S.G., Zhang, Z.: Adaptive time-frequency decompositions with matching pursuit. In: SPIE’s International Symposium on Optical Engineer- ing and Photonics in Aerospace Sensing. (1994) 402-413  43. Radenovi´c, F., Iscen, A., Tolias, G., Avrithis, Y., Chum, O.: Revisiting oxford and  paris: Large-scale image retrieval benchmarking. In: CVPR. (2018)  44. Agarwal, P.K., Har-Peled, S., Varadarajan, K.R.: Approximating extent measures  of points. Journal of the ACM 51(4) (2004) 606-635  45. Feldman, D., Feigin, M., Sochen, N.: Learning big (image) data via coresets for  dictionaries. Journal of Mathematical Imaging and Vision 46(3) (2013) 276-291  46. Johnson, J., Douze, M., J´egou, H.: Billion-scale similarity search with gpus. arXiv  preprint arXiv:1702.08734 (2017)   Local Orthogonal-Group Testing47. Malkov, Y.A., Yashunin, D.: Eﬃcient and robust approximate nearest neigh- arXiv preprint  bor search using hierarchical navigable small world graphs. arXiv:1603.09320 (2016)"}