{"1": "1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., et al.: Tensorﬂow: Large-scale machine learning on heterogeneous distributed systems. arXiv preprint arXiv:1603.04467 (2016)  2. Achlioptas, P., Diamanti, O., Mitliagkas, I., Guibas, L.: Learning Representations and Gen- erative Models for 3D Point Clouds. In: International Conference on Machine Learning (ICML) (2018)  3. Birdal, T., Ilic, S.: Point pair features based object detection and pose estimation revisited.  In: 3D Vision. pp. 527-535. IEEE (2015)  4. Birdal, T., Ilic, S.: Cad priors for accurate and ﬂexible instance reconstruction. In: Computer  Vision (ICCV), 2017 IEEE International Conference on. pp. 133-142. IEEE (2017)  5. Birdal, T., Ilic, S.: A point sampling algorithm for 3d matching of irregular geometries. In: International Conference on Intelligent Robots and Systems (IROS 2017). IEEE (2017) 6. Bobkov, D., Chen, S., Jian, R., Iqbal, M.Z., Steinbach, E.: Noise-resistant deep learning for object classification in three-dimensional point clouds using a point pair descriptor. IEEE Robotics and Automation Letters 3(2), 865-872 (2018)  7. Cao, Z., Huang, Q., Karthik, R.: 3d object classification via spherical projections. In: 3D  Vision (3DV), 2017 International Conference on. pp. 566-574. IEEE (2017)  8. Deng, H., Birdal, T., Ilic, S.: Ppfnet: Global context aware local features for robust 3d point  matching. Computer Vision and Pattern Recognition (CVPR). IEEE 1 (2018)  9. Elbaz, G., Avraham, T., Fischer, A.: 3d point cloud registration for localization using a deep neural network auto-encoder. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017)  10. Guo, Y., Sohel, F.A., Bennamoun, M., Wan, J., Lu, M.: Rops: A local feature descriptor for 3d rigid objects based on rotational projection statistics. In: Communications, Signal Processing, and their Applications (ICCSPA), 2013 1st International Conference on. pp. 1- 6. IEEE (2013)  11. Hackel, T., Savinov, N., Ladicky, L., Wegner, J.D., Schindler, K., Pollefeys, M.: SEMAN- TIC3D.NET: A new large-scale point cloud classification benchmark. In: ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences. vol. IV-1-W1, pp. 91-98 (2017)  12. Halber, M., Funkhouser, T.: Fine-to-coarse global registration of rgb-d scans. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017) 13. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Pro- ceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016)  14. Hoppe, H., DeRose, T., Duchamp, T., McDonald, J., Stuetzle, W.: Surface reconstruction  from unorganized points, vol. 26.2. ACM (1992)  15. Huang, H., Kalogerakis, E., Chaudhuri, S., Ceylan, D., Kim, V.G., Yumer, E.: Learning local shape descriptors from part correspondences with multiview convolutional networks. ACM Transactions on Graphics 37(1) (2017)  16. Johnson, A.E., Hebert, M.: Using spin images for efficient object recognition in cluttered 3d scenes. IEEE Transactions on pattern analysis and machine intelligence 21(5), 433-449 (1999)  17. Kehl, W., Milletari, F., Tombari, F., Ilic, S., Navab, N.: Deep learning of local rgb-d patches for 3d object detection and 6d pose estimation. In: European Conference on Computer Vi- sion. pp. 205-220. Springer (2016)  18. Khoury, M., Zhou, Q.Y., Koltun, V.: Learning compact geometric features. In: The IEEE  International Conference on Computer Vision (ICCV) (Oct 2017)   PPF-FoldNetReferences  1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., et al.: Tensorﬂow: Large-scale machine learning on heterogeneous distributed systems. arXiv preprint arXiv:1603.04467 (2016)  2. Achlioptas, P., Diamanti, O., Mitliagkas, I., Guibas, L.: Learning Representations and Gen- erative Models for 3D Point Clouds. In: International Conference on Machine Learning (ICML) (2018)  3. Birdal, T., Ilic, S.: Point pair features based object detection and pose estimation revisited.  In: 3D Vision. pp. 527-535. IEEE (2015)  4. Birdal, T., Ilic, S.: Cad priors for accurate and ﬂexible instance reconstruction. In: Computer  Vision (ICCV), 2017 IEEE International Conference on. pp. 133-142. IEEE (2017)  5. Birdal, T., Ilic, S.: A point sampling algorithm for 3d matching of irregular geometries. In: International Conference on Intelligent Robots and Systems (IROS 2017). IEEE (2017) 6. Bobkov, D., Chen, S., Jian, R., Iqbal, M.Z., Steinbach, E.: Noise-resistant deep learning for object classification in three-dimensional point clouds using a point pair descriptor. IEEE Robotics and Automation Letters 3(2), 865-872 (2018)  7. Cao, Z., Huang, Q., Karthik, R.: 3d object classification via spherical projections. In: 3D  Vision (3DV), 2017 International Conference on. pp. 566-574. IEEE (2017)  8. Deng, H., Birdal, T., Ilic, S.: Ppfnet: Global context aware local features for robust 3d point  matching. Computer Vision and Pattern Recognition (CVPR). IEEE 1 (2018)  9. Elbaz, G., Avraham, T., Fischer, A.: 3d point cloud registration for localization using a deep neural network auto-encoder. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017)  10. Guo, Y., Sohel, F.A., Bennamoun, M., Wan, J., Lu, M.: Rops: A local feature descriptor for 3d rigid objects based on rotational projection statistics. In: Communications, Signal Processing, and their Applications (ICCSPA), 2013 1st International Conference on. pp. 1- 6. IEEE (2013)  11. Hackel, T., Savinov, N., Ladicky, L., Wegner, J.D., Schindler, K., Pollefeys, M.: SEMAN- TIC3D.NET: A new large-scale point cloud classification benchmark. In: ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences. vol. IV-1-W1, pp. 91-98 (2017)  12. Halber, M., Funkhouser, T.: Fine-to-coarse global registration of rgb-d scans. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017) 13. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Pro- ceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016)  14. Hoppe, H., DeRose, T., Duchamp, T., McDonald, J., Stuetzle, W.: Surface reconstruction  from unorganized points, vol. 26.2. ACM (1992)  15. Huang, H., Kalogerakis, E., Chaudhuri, S., Ceylan, D., Kim, V.G., Yumer, E.: Learning local shape descriptors from part correspondences with multiview convolutional networks. ACM Transactions on Graphics 37(1) (2017)  16. Johnson, A.E., Hebert, M.: Using spin images for efficient object recognition in cluttered 3d scenes. IEEE Transactions on pattern analysis and machine intelligence 21(5), 433-449 (1999)  17. Kehl, W., Milletari, F., Tombari, F., Ilic, S., Navab, N.: Deep learning of local rgb-d patches for 3d object detection and 6d pose estimation. In: European Conference on Computer Vi- sion. pp. 205-220. Springer (2016)  18. Khoury, M., Zhou, Q.Y., Koltun, V.: Learning compact geometric features. In: The IEEE  International Conference on Computer Vision (ICCV) (Oct 2017)   16  Haowen Deng, Tolga Birdal, Slobodan Ilic  19. Kinga, D., Adam, J.B.: A method for stochastic optimization. In: International Conference  on Learning Representations (ICLR) (2015)  20. Klokov, R., Lempitsky, V.: Escape from cells: Deep kd-networks for the recognition of 3d point cloud models. In: 2017 IEEE International Conference on Computer Vision (ICCV). pp. 863-872. IEEE (2017)  21. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep convolutional neural networks. In: Pereira, F., Burges, C.J.C., Bottou, L., Weinberger, K.Q. (eds.) Ad- vances in Neural Information Processing Systems 25, pp. 1097-1105. Curran Associates, Inc. (2012)  22. Lai, K., Bo, L., Fox, D.: Unsupervised feature learning for 3d scene labeling. In: Robotics and Automation (ICRA), 2014 IEEE International Conference on. pp. 3050-3057. IEEE (2014)  23. Lowe, D.G.: Object recognition from local scale-invariant features. In: Computer vision, 1999. The proceedings of the seventh IEEE international conference on. vol. 2, pp. 1150- 1157. Ieee (1999)  24. Maaten, L.v.d., Hinton, G.: Visualizing data using t-sne. Journal of machine learning research  25. Manessi, F., Rozza, A., Manzo, M.: Dynamic graph convolutional networks. arXiv preprint  9(Nov), 2579-2605 (2008)  arXiv:1704.06199 (2017)  26. Maturana, D., Scherer, S.: Voxnet: A 3d convolutional neural network for real-time object recognition. In: Intelligent Robots and Systems (IROS), 2015 IEEE/RSJ International Con- ference on. pp. 922-928. IEEE (2015)  27. Mur-Artal, R., Montiel, J.M.M., Tardos, J.D.: Orb-slam: a versatile and accurate monocular  slam system. IEEE Transactions on Robotics 31(5), 1147-1163 (2015)  28. Noh, H., Araujo, A., Sim, J., Weyand, T., Han, B.: Large-scale image retrieval with attentive deep local features. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017)  29. Qi, C.R., Liu, W., Wu, C., Su, H., Guibas, L.J.: Frustum pointnets for 3d object detection from rgb-d data. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2018)  30. Qi, C.R., Su, H., Mo, K., Guibas, L.J.: Pointnet: Deep learning on point sets for 3d classi- fication and segmentation. Proc. Computer Vision and Pattern Recognition (CVPR), IEEE 1(2), 4 (2017)  31. Qi, C.R., Yi, L., Su, H., Guibas, L.J.: Pointnet++: Deep hierarchical feature learning on point sets in a metric space. In: Guyon, I., Luxburg, U.V., Bengio, S., Wallach, H., Fergus, R., Vishwanathan, S., Garnett, R. (eds.) Advances in Neural Information Processing Systems 30, pp. 5099-5108. Curran Associates, Inc. (2017)  32. Qi, X., Liao, R., Jia, J., Fidler, S., Urtasun, R.: 3d graph neural networks for rgbd seman- tic segmentation. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017)  33. Riegler, G., Ulusoy, O., Geiger, A.: Octnet: Learning deep 3d representations at high resolu- tions. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR) (Jul 2017) 34. Rusu, R.B., Blodow, N., Beetz, M.: Fast point feature histograms (fpfh) for 3d registration. In: Robotics and Automation, 2009. ICRA’09. IEEE International Conference on. pp. 3212- 3217. IEEE (2009)  35. Salti, S., Tombari, F., Di Stefano, L.: Shot: Unique signatures of histograms for surface and texture description. Computer Vision and Image Understanding 125, 251-264 (2014) 36. Shen, Y., Feng, C., Yang, Y., Tian, D.: Neighbors Do Help: Deeply Exploiting Local Struc-  tures of Point Clouds. ArXiv e-prints (Dec 2017)   PPF-FoldNet37. Shotton, J., Glocker, B., Zach, C., Izadi, S., Criminisi, A., Fitzgibbon, A.: Scene coordinate regression forests for camera relocalization in rgb-d images. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2930-2937 (2013)  38. Tatarchenko, M., Dosovitskiy, A., Brox, T.: Octree generating networks: Efficient convo- lutional architectures for high-resolution 3d outputs. In: IEEE International Conference on Computer Vision (ICCV) (2017)  39. Tatarchenko, M., Park, J., Koltun, V., Zhou, Q.Y.: Tangent convolutions for dense prediction in 3d. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2018) 40. Tombari, F., Salti, S., Di Stefano, L.: Unique shape context for 3d data description. In: Pro-  ceedings of the ACM workshop on 3D object retrieval. pp. 57-62. ACM (2010)  41. Valentin, J., Dai, A., Nießner, M., Kohli, P., Torr, P., Izadi, S., Keskin, C.: Learning to nav- igate the energy landscape. In: 3D Vision (3DV), 2016 Fourth International Conference on. pp. 323-332. IEEE (2016)  42. van der Maaten, L.: Barnes-Hut-SNE. ArXiv e-prints (Jan 2013) 43. Wang, P.S., Liu, Y., Guo, Y.X., Sun, C.Y., Tong, X.: O-cnn: Octree-based convolutional neu- ral networks for 3d shape analysis. ACM Transactions on Graphics (TOG) 36(4), 72 (2017) 44. Wang, Y., Sun, Y., Liu, Z., Sarma, S.E., Bronstein, M.M., Solomon, J.M.: Dynamic Graph  CNN for Learning on Point Clouds. ArXiv e-prints (Jan 2018)  45. Wu, J., Zhang, C., Xue, T., Freeman, B., Tenenbaum, J.: Learning a probabilistic latent space of object shapes via 3d generative-adversarial modeling. In: Advances in Neural Information Processing Systems. pp. 82-90 (2016)  46. Wu, Z., Song, S., Khosla, A., Yu, F., Zhang, L., Tang, X., Xiao, J.: 3d shapenets: A deep representation for volumetric shapes. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 1912-1920 (2015)  47. Xiao, J., Owens, A., Torralba, A.: Sun3d: A database of big spaces reconstructed using sfm and object labels. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 1625-1632 (2013)  48. Yang, Y., Feng, C., Shen, Y., Tian, D.: Foldingnet: Point cloud auto-encoder via deep grid deformation. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2018)  49. Yi, K.M., Trulls, E., Lepetit, V., Fua, P.: Lift: Learned invariant feature transform. In: Euro-  pean Conference on Computer Vision. pp. 467-483. Springer (2016)  50. Yu, L., Li, X., Fu, C.W., Cohen-Or, D., Heng, P.A.: Pu-net: Point cloud upsampling network. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2018) 51. Zeng, A., Song, S., Nießner, M., Fisher, M., Xiao, J., Funkhouser, T.: 3dmatch: Learning  local geometric descriptors from rgb-d reconstructions. In: CVPR (2017)"}