{"1": "1. Piva, A.: An overview on image forensics. ISRN Signal Processing 2013 (2013)   14  Jinseok Park, Donghyeon Cho, Wonhyuk Ahn, and Heung-Kyu Lee  Table 3. F-measures for two manipulations using the proposed network and the Barni network, respectively.  Copy-move (F-measure) Blurring (F-measure)  Proposed 0.7595 0.7783  Barni [33] 0.6323 0.6450  (a) Manipulated  (b) GT  (c) SQ-90/90  (d) SQ-90/91  (e) SQ-90/95  Fig. 7. Detecting results according to changing the second quality factor. (a) is a manipulated image by changing the color of a bird, (b) is the ground truth and, (c) - (e) are the detection results for images generated according to each quality factor.  it was impossible to detect the operation area. Because the DCT coeﬃcients of a single JPEG block and a double JPEG block were almost identical, the network could not distinguish between the two classes. Fig. 7 shows the detection results according to changing the second quality factor (standard quality factor). Although it was impossible to detect image manipulation with the same quality factor, as the quality factor diﬀerence increased, the proposed network could detect the manipulation region.  6 Conclusion  Current double JPEG detection methods only work in very limited situations and cannot be applied to real situations. To overcome this limits, we have cre- ated a new dataset using JPEG quantization tables from actual forensic images and designed a novel deep CNN for double JPEG detection using statistical his- togram features from each block with a vectorized quantization table. We have also proven that the proposed network can detect various manipulations with mixed JPEG quality factors.  Acknowledgements  This work was supported by the Institute for Information & communications Technology Promotion (IITP) grant funded by the Korean government (MSIP) (2017-0-01671, Development of high reliability image and video authentication service for smart media environment).  References  1. Piva, A.: An overview on image forensics. ISRN Signal Processing 2013 (2013)   Double JPEG Detection in Mixed JPEG Quality Factors2. Stamm, M.C., Wu, M., Liu, K.R.: Information forensics: An overview of the first  decade. IEEE Access 1 (2013) 167-200  3. Shi, Y.Q., Chen, C., Chen, W.: A natural image model approach to splicing detec- tion. In: Proceedings of the 9th workshop on Multimedia & security, ACM (2007) 51-62  4. Chen, W., Shi, Y.Q., Su, W.: Image splicing detection using 2-d phase congruency and statistical moments of characteristic function. In: Security, Steganography, and Watermarking of Multimedia Contents IX. Volume 6505., International Society for Optics and Photonics (2007) 65050R  5. Cozzolino, D., Poggi, G., Verdoliva, L.: Splicebuster: A new blind image splicing detector. In: Information Forensics and Security (WIFS), 2015 IEEE International Workshop on, IEEE (2015) 1-6  6. Rao, Y., Ni, J.: A deep learning approach to detection of splicing and copy-move forgeries in images. In: Information Forensics and Security (WIFS), 2016 IEEE International Workshop on, IEEE (2016) 1-6  7. Chen, C., McCloskey, S., Yu, J.:  Image splicing detection via camera response function analysis. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 5087-5096  8. Fridrich, A.J., Soukal, B.D., Luk´aˇs, A.J.: Detection of copy-move forgery in digital images. In: in Proceedings of Digital Forensic Research Workshop, Citeseer (2003) 9. Ryu, S.J., Lee, M.J., Lee, H.K.: Detection of copy-rotate-move forgery using zernike moments. In: International Workshop on Information Hiding, Springer (2010) 51- 65  10. Li, J., Li, X., Yang, B., Sun, X.: Segmentation-based image copy-move forgery detection scheme. IEEE Transactions on Information Forensics and Security 10(3) (2015) 507-518  11. Zhou, Z., Wang, Y., Wu, Q.J., Yang, C.N., Sun, X.: Eﬀective and eﬃcient global context verification for image copy detection. IEEE Transactions on Information Forensics and Security 12(1) (2017) 48-63  12. Choi, C.H., Lee, H.Y., Lee, H.K.: Estimation of color modification in digital images by cfa pattern change. Forensic science international 226(1-3) (2013) 94-105 13. Hou, J.U., Lee, H.K.: Detection of hue modification using photo response nonuni- formity. IEEE Transactions on Circuits and Systems for Video Technology 27(8) (2017) 1826-1832  14. Zhou, P., Han, X., Morariu, V.I., Davis, L.S.: Two-stream neural networks for In: 2017 IEEE Conference on Computer Vision and  tampered face detection. Pattern Recognition Workshops (CVPRW). IEEE. (2017) 1831-1839  15. Swaminathan, A., Wu, M., Liu, K.R.: Digital image forensics via intrinsic fin- IEEE transactions on information forensics and security 3(1) (2008)  gerprints. 101-117  16. Cao, H., Kot, A.C.: Accurate detection of demosaicing regularity for digital image forensics. IEEE Transactions on Information Forensics and Security 4(4) (2009) 899-910  17. Stamm, M.C., Liu, K.R.: Forensic detection of image manipulation using statistical intrinsic fingerprints. IEEE Transactions on Information Forensics and Security 5(3) (2010) 492-506  18. Popescu, A.C., Farid, H.: Exposing digital forgeries in color filter array interpolated  images. IEEE Transactions on Signal Processing 53(10) (2005) 3948-3959  19. Ferrara, P., Bianchi, T., De Rosa, A., Piva, A.:  Image forgery localization via fine-grained analysis of cfa artifacts. IEEE Transactions on Information Forensics and Security 7(5) (2012) 1566-1577   16  Jinseok Park, Donghyeon Cho, Wonhyuk Ahn, and Heung-Kyu Lee  20. Popescu, A.C., Farid, H.: Exposing digital forgeries by detecting traces of resam-  pling. IEEE Transactions on signal processing 53(2) (2005) 758-767  21. Kirchner, M., Gloe, T.: On resampling detection in re-compressed images.  In: Information Forensics and Security, 2009. WIFS 2009. First IEEE International Workshop on, IEEE (2009) 21-25  22. Mahdian, B., Saic, S.: Blind authentication using periodic properties of inter- polation. IEEE Transactions on Information Forensics and Security 3(3) (2008) 529-538  23. Pennebaker, W.B., Mitchell, J.L.: JPEG: Still image data compression standard.  Springer Science & Business Media (1992)  24. Luk´aˇs, J., Fridrich, J.: Estimation of primary quantization matrix in double com- pressed jpeg images. In: Proc. Digital Forensic Research Workshop. (2003) 5-8 25. Fu, D., Shi, Y.Q., Su, W.: A generalized benford’s law for jpeg coeﬃcients and its applications in image forensics. In: Security, Steganography, and Watermarking of Multimedia Contents IX. Volume 6505., International Society for Optics and Photonics (2007) 65051L  26. Li, B., Shi, Y.Q., Huang, J.: Detecting doubly compressed jpeg images by using mode based first digit features. In: Multimedia Signal Processing, 2008 IEEE 10th Workshop on, IEEE (2008) 730-735  27. Lin, Z., He, J., Tang, X., Tang, C.K.: Fast, automatic and fine-grained tampered jpeg image detection via dct coeﬃcient analysis. Pattern Recognition 42(11) (2009) 2492-2501  28. Farid, H.: Exposing digital forgeries from jpeg ghosts. information forensics and security 4(1) (2009) 154-160  IEEE transactions on  29. Bianchi, T., Piva, A.: Analysis of non-aligned double jpeg artifacts for the local- ization of image forgeries. In: Information Forensics and Security (WIFS), 2011 IEEE International Workshop on, IEEE (2011) 1-6  30. Bianchi, T., De Rosa, A., Piva, A.: Improved dct coeﬃcient analysis for forgery localization in jpeg images. In: Acoustics, Speech and Signal Processing (ICASSP), 2011 IEEE International Conference on, IEEE (2011) 2444-2447  31. Chen, Y.L., Hsu, C.T.: Detecting recompression of jpeg images via periodicity analysis of compression artifacts for tampering detection. IEEE Transactions on Information Forensics and Security 6(2) (2011) 396-406  32. Wang, Q., Zhang, R.: Double jpeg compression forensics based on a convolutional neural network. EURASIP Journal on Information Security 2016(1) (2016) 23 33. Barni, M., Bondi, L., Bonettini, N., Bestagini, P., Costanzo, A., Maggini, M., Tondi, B., Tubaro, S.: Aligned and non-aligned double jpeg detection using con- volutional neural networks. Journal of Visual Communication and Image Repre- sentation 49 (2017) 153-163  34. Dang-Nguyen, D.T., Pasquini, C., Conotter, V., Boato, G.: Raise: A raw images dataset for digital image forensics. In: Proceedings of the 6th ACM Multimedia Systems Conference, ACM (2015) 219-224  35. Gloe, T., B¨ohme, R.: The dresden image database for benchmarking digital image  forensics. Journal of Digital Forensic Practice 3(2-4) (2010) 150-159  36. Bas, P., Filler, T., Pevn`y, T.: break our steganographic system: The ins and outs of organizing boss. In: International Workshop on Information Hiding, Springer (2011) 59-70  37. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)   Double JPEG Detection in Mixed JPEG Quality Factors38. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International conference on machine learning. (2015) 448-456"}