{"1": "1. Adelson, E.H., Pentland, A.P.: The perception of shading and reﬂectance. Perception as  Bayesian inference (1996)  2. Barron, J.T., Malik, J.: Intrinsic scene properties from a single rgb-d image. In: CVPR (2013) 3. Barron, J.T., Malik, J.: Shape, illumination, and reﬂectance from shading. PAMI (2015) 4. Barrow, H., Tenenbaum, J.: Recovering intrinsic scene characteristics from images. Com-  puter vision systems (1978)  5. Bell, M., Freeman, E.: Learning local evidence for shading and reﬂectance. In: ICCV (2001) 6. Bell, S., Bala, K., Snavely, N.: Intrinsic images in the wild. TOG (2014) 7. Bonneel, N., Sunkavalli, K., Tompkin, J., Sun, D., Paris, S., Pfister, H.: Interactive intrinsic  video editing. TOG (2014)  8. Bousseau, A., Paris, S., Durand, F.: User-assisted intrinsic images. In: TOG (2009) 9. Butler, D.J., Wulff, J., Stanley, G.B., Black, M.J.: A naturalistic open source movie for optical  ﬂow evaluation. In: ECCV (2012)  10. Chang, A.X., Funkhouser, T., Guibas, L., Hanrahan, P., Huang, Q., Li, Z., Savarese, S., Savva, M., Song, S., Su, H., et al.: Shapenet: An information-rich 3d model repository. arXiv (2015)  11. Chen, Q., Koltun, V.: A simple model for intrinsic image decomposition with depth cues. In:  12. Chen, W., Fu, Z., Yang, D., Deng, J.: Single-image depth perception in the wild. In: NIPS  ICCV (2013)  (2016)  13. Eigen, D., Puhrsch, C., Fergus, R.: Depth map prediction from a single image using a multi-  14. Finlayson, G.D., Hordley, S.D., Drew, M.S.: Removing shadows from images using retinex.  scale deep network. In: NIPS (2014)  In: Color and imaging conference (2002)  left-right consistency. In: CVPR (2016)  15. Godard, C., Mac Aodha, O., Brostow, G.J.: Unsupervised monocular depth estimation with  16. Grosse, R., Johnson, M.K., Adelson, E.H., Freeman, W.T.: Ground truth dataset and baseline  evaluations for intrinsic image algorithms. In: ICCV (2009)  17. Hauagge, D., Wehrwein, S., Bala, K., Snavely, N.: Photometric ambient occlusion. In: CVPR  (2013)  (2015)  18. Hauagge, D.C., Wehrwein, S., Upchurch, P., Bala, K., Snavely, N.: Reasoning about photo  collections using models of outdoor illumination. In: BMVC (2014)  19. Horn, B.: Robot vision (1986) 20. Hui, Z., Sankaranarayanan, A.C., Sunkavalli, K., Hadap, S.: White balance under mixed  illumination using ﬂash photography. In: ICCP (2016)  21. Janner, M., Wu, J., Kulkarni, T.D., Yildirim, I., Tenenbaum, J.: Self-supervised intrinsic im-  age decomposition. In: NIPS (2017)  22. Jayaraman, D., Grauman, K.: Learning image representations tied to ego-motion. In: ICCV  23. Jeon, J., Cho, S., Tong, X., Lee, S.: Intrinsic image decomposition using structure-texture  separation and surface normals. In: ECCV (2014)  24. Karsch, K., Hedau, V., Forsyth, D., Hoiem, D.: Rendering synthetic objects into legacy pho-  tographs. In: TOG (2011)  25. Kim, S., Park, K., Sohn, K., Lin, S.: Unified depth prediction and intrinsic image decompo-  sition from a single image via joint convolutional neural fields. In: ECCV (2016)  26. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. arXiv (2014) 27. Kong, N., Black, M.J.: Intrinsic depth: Improving depth transfer with intrinsic images. In:  ICCV (2015)   Unsupervised Single Image Intrinsic DecompositionReferences  1. Adelson, E.H., Pentland, A.P.: The perception of shading and reﬂectance. Perception as  Bayesian inference (1996)  2. Barron, J.T., Malik, J.: Intrinsic scene properties from a single rgb-d image. In: CVPR (2013) 3. Barron, J.T., Malik, J.: Shape, illumination, and reﬂectance from shading. PAMI (2015) 4. Barrow, H., Tenenbaum, J.: Recovering intrinsic scene characteristics from images. Com-  puter vision systems (1978)  5. Bell, M., Freeman, E.: Learning local evidence for shading and reﬂectance. In: ICCV (2001) 6. Bell, S., Bala, K., Snavely, N.: Intrinsic images in the wild. TOG (2014) 7. Bonneel, N., Sunkavalli, K., Tompkin, J., Sun, D., Paris, S., Pfister, H.: Interactive intrinsic  video editing. TOG (2014)  8. Bousseau, A., Paris, S., Durand, F.: User-assisted intrinsic images. In: TOG (2009) 9. Butler, D.J., Wulff, J., Stanley, G.B., Black, M.J.: A naturalistic open source movie for optical  ﬂow evaluation. In: ECCV (2012)  10. Chang, A.X., Funkhouser, T., Guibas, L., Hanrahan, P., Huang, Q., Li, Z., Savarese, S., Savva, M., Song, S., Su, H., et al.: Shapenet: An information-rich 3d model repository. arXiv (2015)  11. Chen, Q., Koltun, V.: A simple model for intrinsic image decomposition with depth cues. In:  12. Chen, W., Fu, Z., Yang, D., Deng, J.: Single-image depth perception in the wild. In: NIPS  ICCV (2013)  (2016)  13. Eigen, D., Puhrsch, C., Fergus, R.: Depth map prediction from a single image using a multi-  14. Finlayson, G.D., Hordley, S.D., Drew, M.S.: Removing shadows from images using retinex.  scale deep network. In: NIPS (2014)  In: Color and imaging conference (2002)  left-right consistency. In: CVPR (2016)  15. Godard, C., Mac Aodha, O., Brostow, G.J.: Unsupervised monocular depth estimation with  16. Grosse, R., Johnson, M.K., Adelson, E.H., Freeman, W.T.: Ground truth dataset and baseline  evaluations for intrinsic image algorithms. In: ICCV (2009)  17. Hauagge, D., Wehrwein, S., Bala, K., Snavely, N.: Photometric ambient occlusion. In: CVPR  (2013)  (2015)  18. Hauagge, D.C., Wehrwein, S., Upchurch, P., Bala, K., Snavely, N.: Reasoning about photo  collections using models of outdoor illumination. In: BMVC (2014)  19. Horn, B.: Robot vision (1986) 20. Hui, Z., Sankaranarayanan, A.C., Sunkavalli, K., Hadap, S.: White balance under mixed  illumination using ﬂash photography. In: ICCP (2016)  21. Janner, M., Wu, J., Kulkarni, T.D., Yildirim, I., Tenenbaum, J.: Self-supervised intrinsic im-  age decomposition. In: NIPS (2017)  22. Jayaraman, D., Grauman, K.: Learning image representations tied to ego-motion. In: ICCV  23. Jeon, J., Cho, S., Tong, X., Lee, S.: Intrinsic image decomposition using structure-texture  separation and surface normals. In: ECCV (2014)  24. Karsch, K., Hedau, V., Forsyth, D., Hoiem, D.: Rendering synthetic objects into legacy pho-  tographs. In: TOG (2011)  25. Kim, S., Park, K., Sohn, K., Lin, S.: Unified depth prediction and intrinsic image decompo-  sition from a single image via joint convolutional neural fields. In: ECCV (2016)  26. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. arXiv (2014) 27. Kong, N., Black, M.J.: Intrinsic depth: Improving depth transfer with intrinsic images. In:  ICCV (2015)   16  W.C. Ma, H. Chu, B. Zhou, R. Urtasun, and A. Torralba  28. Kong, N., Gehler, P.V., Black, M.J.: Intrinsic video. In: ECCV (2014) 29. Laffont, P.Y., Bazin, J.C.: Intrinsic decomposition of image sequences from local temporal  variations. In: ICCV (2015)  30. Laffont, P.Y., Bousseau, A., Drettakis, G.: Rich intrinsic image decomposition of outdoor  scenes from multiple views. TVCG (2013)  31. Land, E.H., McCann, J.J.: Lightness and retinex theory. Journal of the Optical Society of  32. Larsson, G., Maire, M., Shakhnarovich, G.: Learning representations for automatic coloriza-  33. Li, Z., Snavely, N.: Learning intrinsic image decomposition from watching the world. In:  34. Liu, X., Jiang, L., Wong, T.T., Fu, C.W.: Statistical invariance for texture synthesis. TVCG  America (1971)  tion. In: ECCV (2016)  CVPR (2018)  (2012)  In: CVPR (2015)  35. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation.  36. Matsushita, Y., Nishino, K., Ikeuchi, K., Sakauchi, M.: Illumination normalization with time-  dependent intrinsic images for video surveillance. PAMI (2004)  37. Meka, A., Maximov, M., Zollh¨ofer, M., Chatterjee, A., Richardt, C., Theobalt, C.: Live in-  trinsic material estimation. arXiv (2018)  38. Meka, A., Zollh¨ofer, M., Richardt, C., Theobalt, C.: Live intrinsic video. TOG (2016) 39. Narihira, T., Maire, M., Yu, S.X.: Direct intrinsics: Learning albedo-shading decomposition  by convolutional regression. In: ICCV (2015)  40. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose estimation. In:  ECCV (2016)  41. Oh, B.M., Chen, M., Dorsey, J., Durand, F.: Image-based modeling and photo editing. In:  Computer graphics and interactive techniques (2001)  42. Omer, I., Werman, M.: Color lines: Image specific color representation. In: CVPR (2004) 43. Pathak, D., Krahenbuhl, P., Donahue, J., Darrell, T., Efros, A.A.: Context encoders: Feature  learning by inpainting. In: CVPR (2016)  44. Rezende, D.J., Eslami, S.A., Mohamed, S., Battaglia, P., Jaderberg, M., Heess, N.: Unsuper-  vised learning of 3d structure from images. In: NIPS (2016)  45. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomedical image  segmentation. In: MIC-CAI (2015)  46. Rother, C., Kiefel, M., Zhang, L., Sch¨olkopf, B., Gehler, P.V.: Recovering intrinsic images  with a global sparsity prior on reﬂectance. In: NIPS (2011)  47. Shen, J., Yang, X., Jia, Y., Li, X.: Intrinsic images using optimization. In: CVPR (2011) 48. Shi, J., Dong, Y., Su, H., Yu, S.X.: Learning non-lambertian object intrinsics across shapenet  categories (2017)  49. Shu, Z., Yumer, E., Hadap, S., Sunkavalli, K., Shechtman, E., Samaras, D.: Neural face  editing with intrinsic image disentangling. In: CVPR (2017)  50. Tappen, M.F., Freeman, W.T., Adelson, E.H.: Recovering intrinsic images from a single im-  age. In: NIPS (2003)  capture. In: NIPS (2017)  51. Tung, H.Y., Tung, H.W., Yumer, E., Fragkiadaki, K.: Self-supervised learning of motion  52. Tung, H.Y.F., Harley, A.W., Seto, W., Fragkiadaki, K.: Adversarial inverse graphics net- works: Learning 2d-to-3d lifting and image-to-image translation from unpaired supervision. In: ICCV (2017)  53. Vijayanarasimhan, S., Ricco, S., Schmid, C., Sukthankar, R., Fragkiadaki, K.: Sfm-net:  Learning of structure and motion from video. arXiv (2017)  54. Wang, X., Gupta, A.: Unsupervised learning of visual representations using videos. In: ICCV  (2015)   Unsupervised Single Image Intrinsic Decomposition55. Weiss, Y.: Deriving intrinsic images from image sequences. In: ICCV (2001) 56. Yan, X., Yang, J., Yumer, E., Guo, Y., Lee, H.: Perspective transformer nets: Learning single-  view 3d object reconstruction without 3d supervision. In: NIPS (2016)  57. Yang, J., Reed, S.E., Yang, M.H., Lee, H.: Weakly-supervised disentangling with recurrent  transformations for 3d view synthesis. In: NIPS (2015)  58. Zhang, R., Isola, P., Efros, A.A.: Colorful image colorization. In: ECCV (2016) 59. Zhao, H., Gan, C., Rouditchenko, A., Vondrick, C., McDermott, J., Torralba, A.: The sound  60. Zhou, T., Brown, M., Snavely, N., Lowe, D.G.: Unsupervised learning of depth and ego-  61. Zhou, T., Krahenbuhl, P., Efros, A.A.: Learning data-driven reﬂectance priors for intrinsic  62. Zoran, D., Isola, P., Krishnan, D., Freeman, W.T.: Learning ordinal relationships for mid-  of pixels. arXiv (2018)  motion from video. In: CVPR (2017)  image decomposition. In: ICCV (2015)  level vision. In: ICCV (2015)"}