{"1": "1. Kendall, A., Martirosyan, H., Dasgupta, S., Henry, P., Kennedy, R., Bachrach, A., Bry, A.: End-to-end learning of geometry and context for deep stereo regression. Proc. ICCV (2017)  2. Vijayanarasimhan, S., Ricco, S., Schmid, C., Sukthankar, R., Fragkiadaki, K.: Sfm- net: Learning of structure and motion from video. arXiv preprint arXiv:1704.07804 (2017)  3. Kar, A., H¨ane, C., Malik, J.: Learning multi-view stereo machine. Proc. NIPS  (2017)  4. Kim, K., Gu, J., Tyree, S., Molchanov, P., Niessner, M., Kautz, J.: A lightweight  approach for on-the-ﬂy reﬂectance estimation. Proc. ICCV (2017)  5. Wu, L., Ganesh, A., Shi, B., Matsushita, Y., Wang, Y., Ma, Y.: Robust photometric stereo via low-rank matrix completion and recovery. In: Proc. ACCV. (2010) 6. Ikehata, S., Wipf, D., Matsushita, Y., Aizawa, K.: Robust photometric stereo using  sparse regression. In: Proc. CVPR. (2012)  7. Ikehata, S., Wipf, D., Matsushita, Y., Aizawa, K.: Photometric stereo using sparse bayesian regression for general diﬀuse surfaces. IEEE Trans. Pattern Anal. Mach. Intell. 36(9) (2014) 1816-1831  8. Quau, Y., Wu, T., Lauze, F., Durou, J.D., Cremers, D.: A non-convex variational approach to photometric stereo under inaccurate lighting. In: Proc. CVPR. (2017)  9. Cycles. https://www.cycles-renderer.org/  10. Burley, B.: Physically-based shading at disney, part of practical physically based shading in film and game production. SIGGRAPH 2012 Course Notes (2012) 11. Shi, B., Mo, Z., Wu, Z., D.Duan, Yeung, S.K., Tan, P.: A benchmark dataset and evaluation for non-lambertian and uncalibrated photometric stereo. IEEE Trans. Pattern Anal. Mach. Intell. (2018) (to appear)  12. Woodham, P.: Photometric method for determining surface orientation from mul-  tiple images. Opt. Engg 19(1) (1980) 139-144  13. Alldrin, N., Zickler, T., Kriegman, D.: Photometric stereo with non-parametric  and spatially-varying reﬂectance. In: Proc. CVPR. (2008)  14. Goldman, D.B., Curless, B., Hertzmann, A., Seitz, S.M.: Shape and spatially- varying brdfs from photometric stereo. IEEE Trans. Pattern Anal. Mach. Intell. 32(6) (2010) 1060-1071  15. Higo, T., Matsushita, Y., Ikeuchi, K.: Consensus photometric stereo. In: Proc.  CVPR. (2010)  16. Shi, B., Tan, P., Matsushita, Y., Ikeuchi, K.: Elevation angle from reﬂectance  monotonicity. In: Proc. ECCV. (2012)  17. Ikehata, S., Aizawa, K.: Photometric stereo using constrained bivariate regression  for general isotropic surfaces. In: Proc. CVPR. (2014)  18. Shi, B., Tan, P., Matsushita, Y., Ikeuchi, K.: Bi-polynomial modeling of low- frequency reﬂectances. IEEE Trans. Pattern Anal. Mach. Intell. 36(6) (2014) 1078- 1091  19. Santo, H., Samejima, M., Sugano, Y., Shi, B., Matsushita, Y.: Deep photomet- ric stereo network. In: International Workshop on Physics Based Vision meets Deep Learning (PBDL) in Conjunction with IEEE International Conference on Computer Vision (ICCV). (2017)  20. Hui, Z., Sankaranarayanan, A.C.: Shape and spatially-varying reﬂectance esti- mation from virtual exemplars. IEEE Trans. Pattern Anal. Mach. Intell. 39(10) (2017) 2060-2073   CNN-PSReferences  1. Kendall, A., Martirosyan, H., Dasgupta, S., Henry, P., Kennedy, R., Bachrach, A., Bry, A.: End-to-end learning of geometry and context for deep stereo regression. Proc. ICCV (2017)  2. Vijayanarasimhan, S., Ricco, S., Schmid, C., Sukthankar, R., Fragkiadaki, K.: Sfm- net: Learning of structure and motion from video. arXiv preprint arXiv:1704.07804 (2017)  3. Kar, A., H¨ane, C., Malik, J.: Learning multi-view stereo machine. Proc. NIPS  (2017)  4. Kim, K., Gu, J., Tyree, S., Molchanov, P., Niessner, M., Kautz, J.: A lightweight  approach for on-the-ﬂy reﬂectance estimation. Proc. ICCV (2017)  5. Wu, L., Ganesh, A., Shi, B., Matsushita, Y., Wang, Y., Ma, Y.: Robust photometric stereo via low-rank matrix completion and recovery. In: Proc. ACCV. (2010) 6. Ikehata, S., Wipf, D., Matsushita, Y., Aizawa, K.: Robust photometric stereo using  sparse regression. In: Proc. CVPR. (2012)  7. Ikehata, S., Wipf, D., Matsushita, Y., Aizawa, K.: Photometric stereo using sparse bayesian regression for general diﬀuse surfaces. IEEE Trans. Pattern Anal. Mach. Intell. 36(9) (2014) 1816-1831  8. Quau, Y., Wu, T., Lauze, F., Durou, J.D., Cremers, D.: A non-convex variational approach to photometric stereo under inaccurate lighting. In: Proc. CVPR. (2017)  9. Cycles. https://www.cycles-renderer.org/  10. Burley, B.: Physically-based shading at disney, part of practical physically based shading in film and game production. SIGGRAPH 2012 Course Notes (2012) 11. Shi, B., Mo, Z., Wu, Z., D.Duan, Yeung, S.K., Tan, P.: A benchmark dataset and evaluation for non-lambertian and uncalibrated photometric stereo. IEEE Trans. Pattern Anal. Mach. Intell. (2018) (to appear)  12. Woodham, P.: Photometric method for determining surface orientation from mul-  tiple images. Opt. Engg 19(1) (1980) 139-144  13. Alldrin, N., Zickler, T., Kriegman, D.: Photometric stereo with non-parametric  and spatially-varying reﬂectance. In: Proc. CVPR. (2008)  14. Goldman, D.B., Curless, B., Hertzmann, A., Seitz, S.M.: Shape and spatially- varying brdfs from photometric stereo. IEEE Trans. Pattern Anal. Mach. Intell. 32(6) (2010) 1060-1071  15. Higo, T., Matsushita, Y., Ikeuchi, K.: Consensus photometric stereo. In: Proc.  CVPR. (2010)  16. Shi, B., Tan, P., Matsushita, Y., Ikeuchi, K.: Elevation angle from reﬂectance  monotonicity. In: Proc. ECCV. (2012)  17. Ikehata, S., Aizawa, K.: Photometric stereo using constrained bivariate regression  for general isotropic surfaces. In: Proc. CVPR. (2014)  18. Shi, B., Tan, P., Matsushita, Y., Ikeuchi, K.: Bi-polynomial modeling of low- frequency reﬂectances. IEEE Trans. Pattern Anal. Mach. Intell. 36(6) (2014) 1078- 1091  19. Santo, H., Samejima, M., Sugano, Y., Shi, B., Matsushita, Y.: Deep photomet- ric stereo network. In: International Workshop on Physics Based Vision meets Deep Learning (PBDL) in Conjunction with IEEE International Conference on Computer Vision (ICCV). (2017)  20. Hui, Z., Sankaranarayanan, A.C.: Shape and spatially-varying reﬂectance esti- mation from virtual exemplars. IEEE Trans. Pattern Anal. Mach. Intell. 39(10) (2017) 2060-2073   16  S. Ikehata  21. Taniai, T., Maehara, T.: Neural Inverse Rendering for General Reﬂectance Pho-  tometric Stereo. In: Proc. ICML. (2018)  22. Goldman, D., Curless, B., Hertzmann, A., Seitz, S.: Shape and spatially-varying  brdfs from photometric stereo. In: Proc. ICCV. (October 2005)  23. Ward, G.: Measuring and modeling anisotropic reﬂection. Computer Graphics  24. Chandraker, M., Ramamoorthi, R.: What an image reveals about material re-  26(2) (1992) 265-272  ﬂectance. In: Proc. ICCV. (2011)  25. Shen, H.L., Han, T.Q., Li, C.: Eﬃcient photometric stereo using kernel regression.  IEEE Transactions on Image Processing 26(1) (2017) 439-451  26. Silver, W.M.: Determining shape and reﬂectance using multiple images. Master’s  thesis, MIT (1980)  27. Hertzmann, A., Seitz, S.: Example-based photometric stereo: shape reconstruction with general, varying brdfs. IEEE Trans. Pattern Anal. Mach. Intell. 27(8) (2005) 1254-1264  28. G. Huang, Z. Liu, L.M.K.W.: Densely connected convolutional networks. In: Proc.  CVPR. (2017)  29. Matusik, W., Pfister, H., Brand, M., McMillan, L.: A data-driven reﬂectance  model. ACM Trans. on Graph. 22(3) (2003) 759-769  30. Alldrin, N., Kriegman, D.: Toward reconstructing surfaces with arbitrary isotropic reﬂectance: A stratified photometric stereo approach. In: Proc. ICCV. (2007) 31. Stark, M., Arvo, J., Smits, B.: Barycentric parameterizations for isotropic brdfs. IEEE Trans. on Visualization and Computer Graphics 11(2) (2011) 126-138 32. Montes, R., Urena, C.: An overview of brdf models. Technical report, LSI-2012-001  en Digibug Coleccion: TIC167 - Articulos (2012)  33. Simard, P.Y., Steinkraus, D., Platt, J.C.: Best practices for convolutional neural  networks applied to visual document analysis. In Proc. ICDAR (2003)  34. Schmidt, U., Roth, S.: Learning rotation-aware features: From invariant priors to  equivariant descriptors. Proc. CVPR (2012)  35. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In proc. ICLR  (2014)  36. Chang, A.X., Funkhouser, T., Guibas, L., Hanrahan, P., Huang, Q., Li, Z., Savarese, S., Savva, M., Song, S., Su, H., Xiao, J., Yi, L., Yu, F.: ShapeNet: An Information-Rich 3D Model Repository. Technical Report arXiv:1512.03012 [cs.GR], Stanford University — Princeton University — Toyota Technological In- stitute at Chicago (2015)  37. Blender. https://www.cycles-renderer.org/ 38. Chollet, F., et al.: Keras. https://github.com/keras-team/keras (2015)"}