{"1": "SIGGRAPH (2002)  (2004)  1. Welsh, T., Ashikhmin, M., Mueller, K.: Transferring color to greyscale images.  2. Levin, A., Lischinski, D., Weiss, Y.: Colorization using optimization. SIGGRAPH  3. Chia, A.Y.S., Zhuo, S., Gupta, R.K., Tai, Y.W., Cho, S.Y., Tan, P., Lin, S.: Se-  mantic colorization with internet images. SIGGRAPH (2011)  4. Gupta, R.K., Chia, A.Y.S., Rajan, D., Ng, E.S., Zhiyong, H.: Image colorization  using similar images. ACM Multimedia (2012)  5. Cohen-Or, D., Lischinski, D.: Colorization by example. Eurographics Symposium  on Rendering (2005)  6. Morimoto, Y., Taguchi, Y., Naemura, T.: Automatic colorization of grayscale  images using multiple images on the web. SIGGRAPH (2009)  7. Charpiat, G., Hofmann, M., Sch¨olkopf, B.: Automatic image colorization via mul-  8. Deshpande, A., Rock, J., Forsyth, D.: Learning large-scale automatic image col-  timodal predictions. ECCV (2008)  orization. ICCV (2015)  9. Cheng, Z., Yang, Q., Sheng, B.: Deep colorization. ICCV (2015)  10. Iizuka, S., Simo-Serra, E., Ishikawa, H.: Let there be color!: joint end-to-end learn- ing of global and local image priors for automatic image colorization with simul- taneous classification. SIGGRAPH (2016)  11. Larsson, G., Maire, M., Shakhnarovich, G.: Learning representations for automatic  colorization. ECCV (2016)  12. Zhang, R., Isola, P., Efros, A.A.: Colorful image colorization. ECCV (2016) 13. Varga, D., Szir´anyi, T.: Twin deep convolutional neural network for example-based  image colorization. CAIP (2017)  14. Zhang, R., Zhu, J.Y., Isola, P., Geng, X., Lin, A.S., Yu, T., Efros, A.A.: Real-time user-guided image colorization with learned deep priors. SIGGRAPH (2017) 15. Deshpande, A., Lu, J., Yeh, M.C., Forsyth, D.: Learning diverse image colorization.  CVPR (2017)  16. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con-  ditional adversarial networks. CVPR (2017)  17. Guadarrama, S., Dahl, R., Bieber, D., Norouzi, M., Shlens, J., Murphy, K.: Pix-  color: Pixel recursive colorization. BMVC (2017)  18. Royer, A., Kolesnikov, A., Lampert, C.H.: Probabilistic image colorization. BMVC  (2017)  19. Cao, Y., Zhou, Z., Zhang, W., Yu, Y.: Unsupervised diverse colorization via gen-  erative adversarial networks. arXiv preprint arXiv:1702.06674 (2017)  20. Zhu, J.Y., Zhang, R., Pathak, D., Darrell, T., Efros, A.A., Wang, O., Shechtman,  E.: Toward multimodal image-to-image translation. In: NIPS. (2017) 21. Kingma, D.P., Welling, M.: Auto-encoding variational bayes. ICLR (2014) 22. Learned-Miller, E., Huang, G.B., RoyChowdhury, A., Li, H., Hua, G.: Labeled faces in the wild: A survey. In: Advances in face detection and facial image analysis. (2016)  23. Yu, F., Seﬀ, A., Zhang, Y., Song, S., Funkhouser, T., Xiao, J.: Lsun: Construction of a large-scale image dataset using deep learning with humans in the loop. CoRR, abs/1506.03365 (2015)  24. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recog- nition challenge. IJCV (2015)   Structural Consistency and Controllability for Diverse ColorizationReferences  SIGGRAPH (2002)  (2004)  1. Welsh, T., Ashikhmin, M., Mueller, K.: Transferring color to greyscale images.  2. Levin, A., Lischinski, D., Weiss, Y.: Colorization using optimization. SIGGRAPH  3. Chia, A.Y.S., Zhuo, S., Gupta, R.K., Tai, Y.W., Cho, S.Y., Tan, P., Lin, S.: Se-  mantic colorization with internet images. SIGGRAPH (2011)  4. Gupta, R.K., Chia, A.Y.S., Rajan, D., Ng, E.S., Zhiyong, H.: Image colorization  using similar images. ACM Multimedia (2012)  5. Cohen-Or, D., Lischinski, D.: Colorization by example. Eurographics Symposium  on Rendering (2005)  6. Morimoto, Y., Taguchi, Y., Naemura, T.: Automatic colorization of grayscale  images using multiple images on the web. SIGGRAPH (2009)  7. Charpiat, G., Hofmann, M., Sch¨olkopf, B.: Automatic image colorization via mul-  8. Deshpande, A., Rock, J., Forsyth, D.: Learning large-scale automatic image col-  timodal predictions. ECCV (2008)  orization. ICCV (2015)  9. Cheng, Z., Yang, Q., Sheng, B.: Deep colorization. ICCV (2015)  10. Iizuka, S., Simo-Serra, E., Ishikawa, H.: Let there be color!: joint end-to-end learn- ing of global and local image priors for automatic image colorization with simul- taneous classification. SIGGRAPH (2016)  11. Larsson, G., Maire, M., Shakhnarovich, G.: Learning representations for automatic  colorization. ECCV (2016)  12. Zhang, R., Isola, P., Efros, A.A.: Colorful image colorization. ECCV (2016) 13. Varga, D., Szir´anyi, T.: Twin deep convolutional neural network for example-based  image colorization. CAIP (2017)  14. Zhang, R., Zhu, J.Y., Isola, P., Geng, X., Lin, A.S., Yu, T., Efros, A.A.: Real-time user-guided image colorization with learned deep priors. SIGGRAPH (2017) 15. Deshpande, A., Lu, J., Yeh, M.C., Forsyth, D.: Learning diverse image colorization.  CVPR (2017)  16. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con-  ditional adversarial networks. CVPR (2017)  17. Guadarrama, S., Dahl, R., Bieber, D., Norouzi, M., Shlens, J., Murphy, K.: Pix-  color: Pixel recursive colorization. BMVC (2017)  18. Royer, A., Kolesnikov, A., Lampert, C.H.: Probabilistic image colorization. BMVC  (2017)  19. Cao, Y., Zhou, Z., Zhang, W., Yu, Y.: Unsupervised diverse colorization via gen-  erative adversarial networks. arXiv preprint arXiv:1702.06674 (2017)  20. Zhu, J.Y., Zhang, R., Pathak, D., Darrell, T., Efros, A.A., Wang, O., Shechtman,  E.: Toward multimodal image-to-image translation. In: NIPS. (2017) 21. Kingma, D.P., Welling, M.: Auto-encoding variational bayes. ICLR (2014) 22. Learned-Miller, E., Huang, G.B., RoyChowdhury, A., Li, H., Hua, G.: Labeled faces in the wild: A survey. In: Advances in face detection and facial image analysis. (2016)  23. Yu, F., Seﬀ, A., Zhang, Y., Song, S., Funkhouser, T., Xiao, J.: Lsun: Construction of a large-scale image dataset using deep learning with humans in the loop. CoRR, abs/1506.03365 (2015)  24. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recog- nition challenge. IJCV (2015)   16  Safa Messaoud, David Forsyth, and Alexander G. Schwing  25. Varga, D., Szir´anyi, T.: Twin deep convolutional neural network for example-based  image colorization. ICCAIP (2017)  26. van den Oord, A., Kalchbrenner, N., Espeholt, L., Vinyals, O., Graves, A., et al.:  Conditional image generation with pixelcnn decoders. NIPS (2016)  27. Bishop, C.M.: Mixture density networks. Aston University (1994) 28. Laﬀont, P.Y., Ren, Z., Tao, X., Qian, C., Hays, J.: Transient attributes for high-  level understanding and editing of outdoor scenes. SIGGRAPH (2014)  29. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. (2016)  30. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con-  ditional adversarial networks. CVPR (2017)  31. Yu, A., Grauman, K.: Fine-grained visual comparisons with local learning.  In:  CVPR. (2014)  32. Zhu, J.Y., Kr¨ahenb¨uhl, P., Shechtman, E., Efros, A.A.: Generative visual manip-  ulation on the natural image manifold. In: ECCV. (2016)  33. Kindermann, R., Snell, J.L.: Markov random fields and their applications. Amer-  ican Mathematical Society (1980)  34. Schwing, A.G., Hazan, T., Pollefeys, M., Urtasun, R.: Distributed Message Passing  for Large Scale Graphical Models. In: Proc. CVPR. (2011)  35. Schwing, A.G., Hazan, T., Pollefeys, M., Urtasun, R.: Globally Convergent Dual MAP LP Relaxation Solvers using Fenchel-Young Margins. In: Proc. NIPS. (2012) 36. Schwing, A.G., Hazan, T., Pollefeys, M., Urtasun, R.: Globally Convergent Parallel MAP LP Relaxation Solver using the Frank-Wolfe Algorithm. In: Proc. ICML. (2014)  37. Meshi, O., Schwing, A.G.: Asynchronous Parallel Coordinate Minimization for  MAP Inference. In: Proc. NIPS. (2017)  38. Rue, H.: Gaussian markov random fields: theory and applications. CRC press  (2008)  39. Vemulapalli, R., Tuzel, O., Liu, M.Y., Chellapa, R.: Gaussian conditional random  field network for semantic segmentation. CVPR (2016)  40. Chandra, S., Usunier, N., Kokkinos, I.: Dense and low-rank gaussian crfs using  deep embeddings. ICCV (2017)  41. Chandra, S., Kokkinos, I.: Fast, exact and multi-scale inference for semantic image  segmentation with deep gaussian crfs. ECCV (2016)  42. Jancsary, J., Nowozin, S., Sharp, T., Rother, C.: Regression tree fieldsan eﬃcient,  non-parametric approach to image labeling problems. CVPR (2012)  43. Tappen, M.F., Liu, C., Adelson, E.H., Freeman, W.T.: Learning gaussian condi-  tional random fields for low-level vision. CVPR (2007)  44. Vemulapalli, R., Tuzel, O., Liu, M.Y.: Deep gaussian conditional random field network: A model-based deep network for discriminative denoising. CVPR (2016) 45. Sohn, K., Lee, H., Yan, X.: Learning structured output representation using deep  conditional generative models. NIPS (2015)  46. Wang, L., Schwing, A.G., Lazebnik, S.: Diverse and Accurate Image Description Using a Variational Auto-Encoder with an Additive Gaussian Encoding Space. In: NIPS. (2017)  47. Jain  , U., Zhang  , Z., Schwing, A.G.: Creativity: Generating Diverse Questions  ∗  ∗  using Variational Autoencoders. In: Proc. CVPR. (2017)  equal contribution.  ∗  48. Huang, G., Mattar, M., Lee, H., Learned-Miller, E.G.: Learning to align from  scratch. NIPS (2012)   Structural Consistency and Controllability for Diverse Colorization49. Wang, Z., Bovik, A.C., Sheikh, H.R., Simoncelli, E.P.: Image quality assessment:  from error visibility to structural similarity. IEEE TIP (2004)  50. Endo, Y., Iizuka, S., Kanamori, Y., Mitani, J.: Deepprop: Extracting deep features  from a single image for edit propagation. Eurographics (2016) 51. Barron, J.T., Poole, B.: The fast bilateral solver. In: ECCV. (2016)"}