{"1": "1. Lee, N., Choi, W., Vernaza, P., Choy, C., Torr, P., Chandraker, M.: DESIRE: Distance Future Prediction in Dynamic Scenes with Interacting Agents. (2017) 2. Alahi, A., Goel, K., Ramanathan, V., Robicquet, A., Fei-Fei, L., Savarese, S.: Social  LSTM: Human Trajectory Prediction in Crowded Spaces. (2016)  3. Jain, A., Singh, A., Koppula, H., Soh, S., Saxena, A.: Recurrent Neural Networks  for Driver Activity Anticipation via Sensory-Fusion Architecture. (2016)  4. Akhter, I., Simon, T., Khan, S., Matthews, I., Sheikh, Y.: Bilinear spatiotemporal  basis models. ACM Transactions on Graphics (TOG) (2012)  5. Lucey, P., Bialkowski, A., Carr, P., Morgan, S., Matthews, I., Sheikh, Y.: Repre- senting and Discovering Adversarial Team Behaviors using Player Roles. (2013) 6. Insafutdinov, E., Andriluka, M., Pishchulin, L., Tang, S., Levinkov, E., Andres, B., Schiele, B.: ArtTrack: Articulated Multi-Person Tracking in the Wild. (2017) 7. Le, H., Yue, Y., Carr, P., Lucey, P.: Coordinated Multi-Agent Imitation Learning.  8. Yamaguchi, K., Berg, A., Ortiz, L., Berg, T.: Who are you with and where are  9. Butt, A., Collins, R.: Multi-target Tracking by Lagrangian Relaxation to Min-Cost  (2017)  (2016)  you going? (2011)  Network Flow. (2013)  10. Wang, S., Fowlkes, C.: Learning Optimal Parameters for Multi-Target Tracking.  11. Maksai, A., Wang, X., Fua, P.: What Players do with the Ball: A Physically  Constrained Interaction Modeling. (2016)  12. Kim, K., Grundmann, M., Shamir, A., Matthews, I., Hodgins, J., Essa, I.: Motion  Fields to PRedict Play Evolution in Dynamic Sports Scenes. (2010)  13. Chen, J., Le, H., Carr, P., Yue, Y., Little, J.: Learning Online Smooth Predictors  for Realtime Camera Planning using Recurrent Decision Trees. (2016)  14. Zheng, S., Yue, Y., Lucey, P.: Generating Long-term Trajectories Using Deep  15. Felsen, P., Agrawal, P., Malik, J.: What will Happen Next?: Forecasting Player  Hierarchical Networks. (2016)  Moves in Sports Videos. (2017)  16. Su, S., Hong, J.P., Shi, J., Park, H.S.: Social behavior prediction from first person  videos. CoRR abs/1611.09464 (2016)  17. Koren, Y., Bell, R., Volinksy, C.: Matrix factorization techniques for recommender  systems. Computer 42(8) (2009)  18. Deng, Z., Navarathna, R., Carr, P., Mandt, S., Yue, Y., Matthews, I., Mori, G.: Factorized Variational Autoencoders for Modeling Audience Reactions to Movies. (2017)  19. Charles, J., Pfister, T., Magee, D., Hogg, D., Zisserman, A.: Personalizing Human  20. Kingma, D.P., Welling, M.: Auto-encoding variational bayes. arXiv preprint  Video Pose Estimation. (2016)  arXiv:1312.6114 (2013)  21. Gregor, K., Danihelka, I., Graves, A., Wierstra, D.: DRAW: A recurrent neural  network for image generation. CoRR abs/1502.04623 (2015)  22. Bowman, S.R., Vilnis, L., Vinyals, O., Dai, A.M., J´ozefowicz, R., Bengio, S.: Gen-  erating sentences from a continuous space. CoRR abs/1511.06349 (2015)  23. Kingma, D., Mohamed, S., Rezende, D., Welling, M.: Semi-Supervised Learning  with Deep Generative Models. (2014)   Predicting Fine-Grained Adversarial Multi-Agent MotionReferences  1. Lee, N., Choi, W., Vernaza, P., Choy, C., Torr, P., Chandraker, M.: DESIRE: Distance Future Prediction in Dynamic Scenes with Interacting Agents. (2017) 2. Alahi, A., Goel, K., Ramanathan, V., Robicquet, A., Fei-Fei, L., Savarese, S.: Social  LSTM: Human Trajectory Prediction in Crowded Spaces. (2016)  3. Jain, A., Singh, A., Koppula, H., Soh, S., Saxena, A.: Recurrent Neural Networks  for Driver Activity Anticipation via Sensory-Fusion Architecture. (2016)  4. Akhter, I., Simon, T., Khan, S., Matthews, I., Sheikh, Y.: Bilinear spatiotemporal  basis models. ACM Transactions on Graphics (TOG) (2012)  5. Lucey, P., Bialkowski, A., Carr, P., Morgan, S., Matthews, I., Sheikh, Y.: Repre- senting and Discovering Adversarial Team Behaviors using Player Roles. (2013) 6. Insafutdinov, E., Andriluka, M., Pishchulin, L., Tang, S., Levinkov, E., Andres, B., Schiele, B.: ArtTrack: Articulated Multi-Person Tracking in the Wild. (2017) 7. Le, H., Yue, Y., Carr, P., Lucey, P.: Coordinated Multi-Agent Imitation Learning.  8. Yamaguchi, K., Berg, A., Ortiz, L., Berg, T.: Who are you with and where are  9. Butt, A., Collins, R.: Multi-target Tracking by Lagrangian Relaxation to Min-Cost  (2017)  (2016)  you going? (2011)  Network Flow. (2013)  10. Wang, S., Fowlkes, C.: Learning Optimal Parameters for Multi-Target Tracking.  11. Maksai, A., Wang, X., Fua, P.: What Players do with the Ball: A Physically  Constrained Interaction Modeling. (2016)  12. Kim, K., Grundmann, M., Shamir, A., Matthews, I., Hodgins, J., Essa, I.: Motion  Fields to PRedict Play Evolution in Dynamic Sports Scenes. (2010)  13. Chen, J., Le, H., Carr, P., Yue, Y., Little, J.: Learning Online Smooth Predictors  for Realtime Camera Planning using Recurrent Decision Trees. (2016)  14. Zheng, S., Yue, Y., Lucey, P.: Generating Long-term Trajectories Using Deep  15. Felsen, P., Agrawal, P., Malik, J.: What will Happen Next?: Forecasting Player  Hierarchical Networks. (2016)  Moves in Sports Videos. (2017)  16. Su, S., Hong, J.P., Shi, J., Park, H.S.: Social behavior prediction from first person  videos. CoRR abs/1611.09464 (2016)  17. Koren, Y., Bell, R., Volinksy, C.: Matrix factorization techniques for recommender  systems. Computer 42(8) (2009)  18. Deng, Z., Navarathna, R., Carr, P., Mandt, S., Yue, Y., Matthews, I., Mori, G.: Factorized Variational Autoencoders for Modeling Audience Reactions to Movies. (2017)  19. Charles, J., Pfister, T., Magee, D., Hogg, D., Zisserman, A.: Personalizing Human  20. Kingma, D.P., Welling, M.: Auto-encoding variational bayes. arXiv preprint  Video Pose Estimation. (2016)  arXiv:1312.6114 (2013)  21. Gregor, K., Danihelka, I., Graves, A., Wierstra, D.: DRAW: A recurrent neural  network for image generation. CoRR abs/1502.04623 (2015)  22. Bowman, S.R., Vilnis, L., Vinyals, O., Dai, A.M., J´ozefowicz, R., Bengio, S.: Gen-  erating sentences from a continuous space. CoRR abs/1511.06349 (2015)  23. Kingma, D., Mohamed, S., Rezende, D., Welling, M.: Semi-Supervised Learning  with Deep Generative Models. (2014)   16  P. Felsen, P. Lucey and S. Ganguly  24. Sohn, K., Lee, H., Yan, X.: Learning Structured Output Representation using  Deep Conditional Generative Models. (2015)  25. van den Oord, A., Kalchbrenner, N., Kavukcuoglu, K.: Pixel recurrent neural  networks. CoRR abs/1601.06759 (2016)  26. Pathak, D., Krahenbuhl, P., Donahue, J., Darrell, T., Efros, A.A.: Context en-  coders: Feature learning by inpainting. (June 2016)  27. Walker, J., Doersch, C., Gupta, A., Hebert, M.: An uncertain future: Forecasting from static images using variational autoencoders. CoRR abs/1606.07873 (2016) 28. Sha, L., Lucey, P., Zheng, S., Kim, T., Yue, Y., Sridharan, S.: Fine-Grained Re-  trieval of Sports Plays using Tree-Based Alignment of Trajectories. (2017)"}