{"1": "1. Barath, D., Toth, T., Hajder, L.: A Minimal Solution for Two-View Focal-Length Estimation Using Two Aﬃne Correspondences. In: Conf. on Computer Vision and Pattern Recognition (July 2017)  2. Bentolila, J., Francos, J.M.: Conic epipolar constraints from aﬃne correspondences.  Computer Vision and Image Understanding 122, 105-114 (2014)  3. Bentolila, J., Francos, J.M.: Homography and Fundamental Matrix Estimation from Region Matches Using an Aﬃne Error Metric. Journal of Mathematical Imag- ing and Vision 49, 481-491 (2014)  4. Chum, O., Matas, J., Kittler, J.: Locally optimized RANSAC. In: Michaelis, B., Krell, G. (eds.) Pattern Recognition. pp. 236-243. Springer, Berlin, Heidelberg (2003)   14  I. Eichhardt, D. Chetverikov  Fig. 7. Image of a scene “Sarok” used for real-world evaluation taken by a Point Gray Blackﬂy camera with YV2.8x2.8SA-2 wide-FoV lens attached.  7 Conclusion  In the paper a new method (2AC) was presented for relative pose estimation based on novel epipolar constraints using Aﬃne Correspondences. The mini- mum number of correspondences needed for pose estimation is reduced to two. The method is applicable to arbitrary central-projection models including cam- or omnidirectional). The pinhole- eras [23] with wide fields of view (e.g. over 180 camera based approach [21] was shown to be a specialization of the proposed one. Stability tests showed that if the “aﬃnity” is noisy, the pinhole based method [21] is outperformed. Additionally, 2AC needs no prior image un-distortion. Tests in- dicate that the five-point algorithm [17] is inferior in runtime and in the number of iterations when using MSAC [25] and LO+ [10]. The quality of estimated pose is also worse after bundle adjustment. The proposed LO-RANSAC approach uses raw ACs to provide state-of-the-art quality in less time.  ➦  Based on the new epipolar constraints, other AC-based solvers can be con- structed, e.g. to estimate additional camera parameters. With more constraints given per correspondence, fewer samples are needed for model estimation, thus robust estimation combined with such a solver will terminate earlier. The sup- plementary material contains additional evaluation and other material, e.g. Ja- cobians of projection functions.  References  1. Barath, D., Toth, T., Hajder, L.: A Minimal Solution for Two-View Focal-Length Estimation Using Two Aﬃne Correspondences. In: Conf. on Computer Vision and Pattern Recognition (July 2017)  2. Bentolila, J., Francos, J.M.: Conic epipolar constraints from aﬃne correspondences.  Computer Vision and Image Understanding 122, 105-114 (2014)  3. Bentolila, J., Francos, J.M.: Homography and Fundamental Matrix Estimation from Region Matches Using an Aﬃne Error Metric. Journal of Mathematical Imag- ing and Vision 49, 481-491 (2014)  4. Chum, O., Matas, J., Kittler, J.: Locally optimized RANSAC. In: Michaelis, B., Krell, G. (eds.) Pattern Recognition. pp. 236-243. Springer, Berlin, Heidelberg (2003)   Aﬃne Correspondences for Rapid Relative Pose Estimation5. Eichhardt, I., Hajder, L.: Computer vision meets geometric modeling: Multi-view reconstruction of surface points and normals using aﬃne correspondences. In: In- ternational Conf. on Computer Vision Workshops. pp. 2427-2435 (Oct 2017) 6. Faugeras, O.: Three-dimensional computer vision: a geometric viewpoint. M. I. T.  Press (1993)  7. Fischler, M.A., Bolles, R.C.: Random sample consensus: a paradigm for model fitting with applications to image analysis and automated cartography. Communi- cations of the ACM 24(6), 381-395 (1981)  8. Hartley, R.I.: In defense of the eight-point algorithm. IEEE Trans. Pattern Analysis  and Machine Intelligence 19(6), 580-593 (1997)  9. K¨oser, K., Koch, R.: Diﬀerential spatial resection-pose estimation using a single local image feature. In: Proc. European Conf. on Computer Vision. pp. 312-325. Springer (2008)  10. Lebeda, K., Matas, J., Chum, O.: Fixing the locally optimized RANSAC-full ex- perimental evaluation. In: Proc. British Machine Vision Conf. pp. 1-11. Citeseer (2012)  11. Li, H., Hartley, R.: Five-point motion estimation made easy. In: Proc. International  Conf. on Pattern Recognition. vol. 1, pp. 630-633. IEEE (2006)  12. Lindeberg, T., G˚arding, J.: Shape-adapted smoothing in estimation of 3-D shape cues from aﬃne deformations of local 2-D brightness structure. Image and Vision Computing 15(6), 415-434 (1997)  13. Matas, J., Chum, O., Urban, M., Pajdla, T.: Robust wide-baseline stereo from maximally stable extremal regions. Image and Vision Computing 22(10), 761-767 (2004)  14. Mikolajczyk, K., Schmid, C.: An aﬃne invariant interest point detector. In: Proc.  European Conf. on Computer Vision. pp. 128-142. Springer (2002)  15. Moln´ar, J., Eichhardt, I.: A diﬀerential geometry approach to camera-independent  image correspondence. Computer Vision and Image Understanding (2018)  16. Morel, J.M., Yu, G.: ASIFT: A new framework for fully aﬃne invariant image  comparison. SIAM Journal on Imaging Sciences 2(2), 438-469 (2009)  17. Nist´er, D.: An eﬃcient solution to the five-point relative pose problem. IEEE Trans.  Pattern Analysis and Machine Intelligence 26(6), 756-770 (2004)  18. Perdoch, M., Matas, J., Chum, O.: Epipolar geometry from two correspondences. In: Proc. International Conf. on Pattern Recognition. vol. 4, pp. 215-219. IEEE (2006)  19. Pritts, J., Kukelova, Z., Larsson, V., Chum, O.: Radially-distorted conjugate trans- lations. In: Conf. on Computer Vision and Pattern Recognition (June 2018) 20. Raposo, C., Barreto, J.P.: πMatch: Monocular vSLAM and Piecewise Planar Re- construction Using Fast Plane Correspondences. In: Proc. European Conf. on Com- puter Vision. pp. 380-395. Springer (2016)  21. Raposo, C., Barreto, J.P.: Theory and Practice of Structure-from-Motion using Aﬃne Correspondences. In: Conf. on Computer Vision and Pattern Recognition. pp. 5470-5478 (2016)  22. Riggi, F., Toews, M., Arbel, T.: Fundamental matrix estimation via TIP-transfer of invariant parameters. In: Proc. International Conf. on Pattern Recognition. vol. 2, pp. 21-24. IEEE (2006)  23. Scaramuzza, D., Martinelli, A., Siegwart, R.: A ﬂexible technique for accurate omnidirectional camera calibration and structure from motion. In: Proc. IEEE Conf. on Computer Vision Systems. pp. 45-45. IEEE (2006)   16  I. Eichhardt, D. Chetverikov  24. Strecha, C., Von Hansen, W., Van Gool, L., Fua, P., Thoennessen, U.: On bench- marking camera calibration and multi-view stereo for high resolution imagery. In: Conf. on Computer Vision and Pattern Recognition. pp. 1-8. IEEE (2008)  25. Torr, P., Zisserman, A.: Robust computation and parametrization of multiple view relations. In: Conf. on Computer Vision and Pattern Recognition. pp. 727-732. IEEE (1998)  26. Tuytelaars, T., Mikolajczyk, K.: Local invariant feature detectors: a survey. Foun- dations and trends➤ in computer graphics and vision 3(3), 177-280 (2008) 27. Vedaldi, A., Fulkerson, B.: VLFeat - an open and portable library of computer  vision algorithms. In: Proc. ACM Conf. on Multimedia (2010)  28. Xu, Y., Monasse, P., G´eraud, T., Najman, L.: Tree-based morse regions: A topo- logical approach to local feature detection. IEEE Trans. Image Processing 23(12), 5612-5625 (2014)  29. Zhang, Z., Rebecq, H., Forster, C., Scaramuzza, D.: Benefit of large field-of-view cameras for visual odometry. In: Proc. IEEE Conf. on Robotics and Automation. pp. 801-808. IEEE (2016)"}