{"1": "1. Badrinarayanan, V., Kendall, A., Cipolla, R.: Segnet: A deep convolutional encoder-decoder architecture for image segmentation. IEEE Trans. Pattern Anal. Mach. Intell. 39(12), 2481-2495 (2017)  2. Chen, L., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Seman- tic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. IEEE Trans. Pattern Anal. Mach. Intell. 40(4), 834-848 (2018) 3. Chen, X., Shrivastava, A., Gupta, A.: Enriching visual knowledge bases via object discovery and segmentation. In: CVPR. pp. 2035-2042. IEEE Computer Society (2014)  4. Chollet, F.: Information-theoretical label embeddings for large-scale image classi-  fication. CoRR abs/1607.05691 (2016)  5. Church, K.W., Hanks, P.: Word association norms, mutual  22-29  (Mar  informa- 1990),  and lexicography. Comput. Linguist. 16(1),  tion, http://dl.acm.org/citation.cfm?id=89086.89095  6. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. pp. 3213-3223. IEEE Computer Society (2016)  7. Dai, J., He, K., Sun, J.: Boxsup: Exploiting bounding boxes to supervise convolu-  tional networks for semantic segmentation. pp. 1635-1643 (2015)  8. Dai, J., He, K., Sun, J.: Instance-aware semantic segmentation via multi-task net-  work cascades. In: CVPR. pp. 3150-3158. IEEE Computer Society (2016)  9. Everingham, M., Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual object classes (voc) challenge. Int. J. Comput. Vision 88(2), 303-338 (Jun 2010), http://dx.doi.org/10.1007/s11263-009-0275-4  10. Frome, A., Corrado, G.S., Shlens, J., Bengio, S., Dean, J., Ranzato, M., Mikolov, T.: Devise: A deep visual-semantic embedding model. In: Burges, C.J.C., Bottou, L., Ghahramani, Z., Weinberger, K.Q. (eds.) NIPS. pp. 2121-2129 (2013)  11. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.B.: Mask R-CNN. In: ICCV. pp.  2980-2988. IEEE Computer Society (2017)  12. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. pp. 770-778. IEEE Computer Society (2016)  13. Hong, S., Noh, H., Han, B.: Decoupled deep neural network for semi-supervised semantic segmentation. In: Cortes, C., Lawrence, N.D., Lee, D.D., Sugiyama, M., Garnett, R. (eds.) NIPS. pp. 1495-1503 (2015)  14. Hong, S., Yeo, D., Kwak, S., Lee, H., Han, B.: Weakly supervised semantic seg-  mentation using web-crawled videos pp. 2224-2232 (2017)  15. Hu, R., Doll´ar, P., He, K., Darrell, T., Girshick, R.: Learning to Segment Every  Thing. In: CVPR (2018)  16. Jayaraman, D., Grauman, K.: Zero-shot recognition with unreliable attributes. In: Ghahramani, Z., Welling, M., Cortes, C., Lawrence, N.D., Weinberger, K.Q. (eds.) NIPS, pp. 3464-3472 (2014)  17. Kolesnikov, A., Lampert, C.H.: Seed, expand and constrain: Three principles for weakly-supervised image segmentation. In: Leibe, B., Matas, J., Sebe, N., Welling, M. (eds.) ECCV (4). Lecture Notes in Computer Science, vol. 9908, pp. 695-711. Springer (2016)  18. Krasin, I., Duerig, T., Alldrin, N., Ferrari, V., Abu-El-Haija, S., Kuznetsova, A., Rom, H., Uijlings, J., Popov, S., Veit, A., Belongie, S., Gomes, V., Gupta, A., Sun, C., Chechik, G., Cai, D., Feng, Z., Narayanan, D., Murphy, K.: Openimages:   Large-Scale Segmentation from Semantic ConceptsReferences  1. Badrinarayanan, V., Kendall, A., Cipolla, R.: Segnet: A deep convolutional encoder-decoder architecture for image segmentation. IEEE Trans. Pattern Anal. Mach. Intell. 39(12), 2481-2495 (2017)  2. Chen, L., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Seman- tic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. IEEE Trans. Pattern Anal. Mach. Intell. 40(4), 834-848 (2018) 3. Chen, X., Shrivastava, A., Gupta, A.: Enriching visual knowledge bases via object discovery and segmentation. In: CVPR. pp. 2035-2042. IEEE Computer Society (2014)  4. Chollet, F.: Information-theoretical label embeddings for large-scale image classi-  fication. CoRR abs/1607.05691 (2016)  5. Church, K.W., Hanks, P.: Word association norms, mutual  22-29  (Mar  informa- 1990),  and lexicography. Comput. Linguist. 16(1),  tion, http://dl.acm.org/citation.cfm?id=89086.89095  6. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. pp. 3213-3223. IEEE Computer Society (2016)  7. Dai, J., He, K., Sun, J.: Boxsup: Exploiting bounding boxes to supervise convolu-  tional networks for semantic segmentation. pp. 1635-1643 (2015)  8. Dai, J., He, K., Sun, J.: Instance-aware semantic segmentation via multi-task net-  work cascades. In: CVPR. pp. 3150-3158. IEEE Computer Society (2016)  9. Everingham, M., Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual object classes (voc) challenge. Int. J. Comput. Vision 88(2), 303-338 (Jun 2010), http://dx.doi.org/10.1007/s11263-009-0275-4  10. Frome, A., Corrado, G.S., Shlens, J., Bengio, S., Dean, J., Ranzato, M., Mikolov, T.: Devise: A deep visual-semantic embedding model. In: Burges, C.J.C., Bottou, L., Ghahramani, Z., Weinberger, K.Q. (eds.) NIPS. pp. 2121-2129 (2013)  11. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.B.: Mask R-CNN. In: ICCV. pp.  2980-2988. IEEE Computer Society (2017)  12. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. pp. 770-778. IEEE Computer Society (2016)  13. Hong, S., Noh, H., Han, B.: Decoupled deep neural network for semi-supervised semantic segmentation. In: Cortes, C., Lawrence, N.D., Lee, D.D., Sugiyama, M., Garnett, R. (eds.) NIPS. pp. 1495-1503 (2015)  14. Hong, S., Yeo, D., Kwak, S., Lee, H., Han, B.: Weakly supervised semantic seg-  mentation using web-crawled videos pp. 2224-2232 (2017)  15. Hu, R., Doll´ar, P., He, K., Darrell, T., Girshick, R.: Learning to Segment Every  Thing. In: CVPR (2018)  16. Jayaraman, D., Grauman, K.: Zero-shot recognition with unreliable attributes. In: Ghahramani, Z., Welling, M., Cortes, C., Lawrence, N.D., Weinberger, K.Q. (eds.) NIPS, pp. 3464-3472 (2014)  17. Kolesnikov, A., Lampert, C.H.: Seed, expand and constrain: Three principles for weakly-supervised image segmentation. In: Leibe, B., Matas, J., Sebe, N., Welling, M. (eds.) ECCV (4). Lecture Notes in Computer Science, vol. 9908, pp. 695-711. Springer (2016)  18. Krasin, I., Duerig, T., Alldrin, N., Ferrari, V., Abu-El-Haija, S., Kuznetsova, A., Rom, H., Uijlings, J., Popov, S., Veit, A., Belongie, S., Gomes, V., Gupta, A., Sun, C., Chechik, G., Cai, D., Feng, Z., Narayanan, D., Murphy, K.: Openimages:   16  Y. Wang, Z. Lin, X. Shen, J, Zhang, and S. Cohen  A public dataset for large-scale multi-label and multi-class image classification. Dataset available from https://github.com/openimages (2017)  19. Krishna, R., Zhu, Y., Groth, O., Johnson, J., Hata, K., Kravitz, J., Chen, S., Kalantidis, Y., Li, L., Shamma, D.A., Bernstein, M.S., Fei-Fei, L.: Visual genome: Connecting language and vision using crowdsourced dense image annotations. In- ternational Journal of Computer Vision 123(1), 32-73 (2017)  20. Kttel, D., Guillaumin, M., Ferrari, V.: Segmentation propagation in imagenet. In: Fitzgibbon, A.W., Lazebnik, S., Perona, P., Sato, Y., Schmid, C. (eds.) ECCV (7). Lecture Notes in Computer Science, vol. 7578, pp. 459-473. Springer (2012) 21. Lampert, C.H., Nickisch, H., Harmeling, S.: Attribute-based classification for IEEE Trans. Pattern Anal. Mach. zero-shot visual object categorization. Intell. 36(3), 453-465 (Mar 2014). https://doi.org/10.1109/TPAMI.2013.140, http://dx.doi.org/10.1109/TPAMI.2013.140  22. Li, Y., Qi, H., Dai, J., Ji, X., Wei, Y.: Fully convolutional instance-aware se- mantic segmentation. In: 2017 IEEE Conference on Computer Vision and Pat- tern Recognition, CVPR 2017, Honolulu, HI, USA, July 21-26, 2017. pp. 4438- 4446. IEEE Computer Society (2017). https://doi.org/10.1109/CVPR.2017.472, https://doi.org/10.1109/CVPR.2017.472  23. Li, Z., Hoiem, D.: Learning without forgetting. In: Leibe, B., Matas, J., Sebe, N., Welling, M. (eds.) ECCV (4). Lecture Notes in Computer Science, vol. 9908, pp. 614-629. Springer (2016)  24. Lin, T., Maire, M., Belongie, S.J., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft COCO: common objects in context. In: ECCV (5). Lecture Notes in Computer Science, vol. 8693, pp. 740-755. Springer (2014)  25. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmentation. In: Proceedings of the 2015 IEEE International Conference on Computer Vision (ICCV). pp. 1520-1528. IEEE Computer So- ciety, Washington, DC, USA (2015). https://doi.org/10.1109/ICCV.2015.178, http://dx.doi.org/10.1109/ICCV.2015.178  ICCV ’15,  26. Norouzi, M., Mikolov, T., Bengio, S., Singer, Y., Shlens, J., Frome, A., Corrado, G., Dean, J.: Zero-shot learning by convex combination of semantic embeddings. In: International Conference on Learning Representations (ICLR) (2014)  27. Parikh, D., Grauman, K.: Relative attributes. In: Metaxas, D.N., Quan, L., San- feliu, A., Gool, L.J.V. (eds.) ICCV. pp. 503-510. IEEE Computer Society (2011) 28. Pathak, D., Kr¨ahenb¨uhl, P., Darrell, T.: Constrained convolutional neural networks for weakly supervised segmentation. In: 2015 IEEE International Conference on Computer Vision, ICCV 2015, Santiago, Chile, December 7-13, 2015. pp. 1796- 1804. IEEE Computer Society (2015). https://doi.org/10.1109/ICCV.2015.209, https://doi.org/10.1109/ICCV.2015.209  29. Ren, S., He, K., Girshick, R.B., Sun, J.: Faster r-cnn: Towards real-time object  detection with region proposal networks. pp. 91-99 (2015)  30. Rubinstein, M., Joulin, A., Kopf, J., Liu, C.: Unsupervised joint object discovery  and segmentation in internet images. pp. 1939-1946 (2013)  31. Shelhamer, E., Long, J., Darrell, T.: Fully convolutional networks for semantic segmentation. IEEE Trans. Pattern Anal. Mach. Intell. 39(4), 640-651 (2017) 32. Socher, R., Ganjoo, M., Manning, C.D., Ng, A.Y.: Zero-shot learning through cross-modal transfer. In: Burges, C.J.C., Bottou, L., Ghahramani, Z., Weinberger, K.Q. (eds.) NIPS. pp. 935-943 (2013)  33. Xu, N., Price, B.L., Cohen, S., Yang, J., Huang, T.S.: Deep grabcut for object selection. CoRR abs/1707.00243 (2017), http://arxiv.org/abs/1707.00243   Large-Scale Segmentation from Semantic Concepts34. Zhang, J., Lin, Z.L., Brandt, J., Shen, X., Sclaroﬀ, S.: Top-down neural attention by excitation backprop. In: Leibe, B., Matas, J., Sebe, N., Welling, M. (eds.) ECCV (4). Lecture Notes in Computer Science, vol. 9908, pp. 543-559. Springer (2016)  35. Zhao, H., Puig, X., Zhou, B., Fidler, S., Torralba, A.: Open vocabulary scene  parsing. In: ICCV. pp. 2021-2029. IEEE Computer Society (2017)  36. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In:  CVPR. pp. 6230-6239. IEEE Computer Society (2017)  37. Zhou, B., Khosla, A., Lapedriza, ., Oliva, A., Torralba, A.: Learning deep features for discriminative localization. In: CVPR. pp. 2921-2929. IEEE Computer Society (2016)  38. Zhou, B., Zhao, H., Puig, X., Fidler, S., Barriuso, A., Torralba, A.: Scene parsing through ade20k dataset. In: CVPR. pp. 5122-5130. IEEE Computer Society (2017)"}