{"1": "York (2006)  1. Bishop, C.M.: Mixture density networks (1994) 2. Bishop, C.M.: Pattern Recognition and Machine Learning. Springer-Verlag New  3. Chang, H., Garcia-Hernando, G., Tang, D., Kim, T.K.: Spatio-temporal hough forest for eﬃcient detection-localisation-recognition of fingerwriting in egocentric camera. CVIU 148, 87-96 (2016). https://doi.org/10.1016/j.cviu.2016.01.010 4. Charles, J., Pfister, T., Magee, D., Hogg, D., Zisserman, A.: Personalizing human  video pose estimation. In: CVPR (2016)  5. Chen, X., Yuille, A.: Parsing occluded people by ﬂexible compositions. In: CVPR  (2014)  6. Constantinopoulos, C., Titsias, M.K., Likas, A.: Bayesian feature and model selection for gaussian mixture models. TPAMI 28(6), 1013-1018 (June 2006). https://doi.org/10.1109/TPAMI.2006.111  7. Garcia-Hernando, G., Yuan, S., Baek, S., Kim, T.: First-person hand action bench- mark with RGB-D videos and 3d hand pose annotations. CoRR abs/1704.02463 (2017), http://arxiv.org/abs/1704.02463  8. Ghiasi, G., Yang, Y., Ramanan, D., Fowlkes, C.C.: Parsing occluded people. In:  CVPR (2014)  9. Guo, H., Wang, G., Chen, X., Zhang, C., Qiao, F., Yang, H.: Region ensemble net- work: Improving convolutional network for hand pose estimation. In: ICIP (2017) 10. Haque, A., Peng, B., Luo, Z., Alahi, A., Yeung, S., Fei-Fei, L.: Towards viewpoint  invariant 3d human pose estimation. In: ECCV (2016)  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  12. Hsiao, E., Hebert, M.: Occlusion reasoning for object detectionunder arbitrary  In: CVPR (2016)  viewpoint. In: CVPR (2012)  13. Jang, Y., Noh, S.T., Chang, H.J., Kim, T.K., Woo, W.: 3d finger cape: Clicking action and position estimation under self-occlusions in egocentric viewpoint. IEEE Transactions on Visualization and Computer Graphics (TVCG), vol. 21, no. 4, pp.501-510, April 2015 (2015)  14. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In: ICLR (2014) 15. Kinoshita, K., Delcroix, M., Ogawa, A., Higuchi, T., Nakatani, T.: Deep mix- ture density network for statistical model-based feature enhancement. In: ICASSP (2017)  16. Mueller, F., Mehta, D., Sotnychenko, O., Sridhar, S., Casas, D., Theobalt, C.: Real-time hand tracking under occlusion from an egocentric rgb-d sensor. In: ICCV (2017)  17. Navaratnam, R., Fitzgibbon, A.W., Cipolla, R.: The joint manifold model for semi-  supervised multi-valued regression. In: ICCV (2007)  18. Oberweger, M., Wohlhart, P., Lepetit, V.: Hands deep in deep learning for hand  pose estimation. In: Computer Vision Winter Workshop (CVWW) (2015)  19. Oberweger, M., Wohlhart, P., Lepetit, V.: Training a feedback loop for hand pose  estimation. In: ICCV (2015)  20. Oberweger, M., Lepetit, V.: Deepprior++: Improving fast and accurate 3d hand  pose estimation. In: ICCV Workshops (2017)  21. Oikonomidis, I., Kyriazis, N., Argyros, A.: Eﬃcient model-based 3D tracking of  hand articulations using Kinect. In: BMVC (2011)   Occlusion-aware Hand Pose EstimationReferences  York (2006)  1. Bishop, C.M.: Mixture density networks (1994) 2. Bishop, C.M.: Pattern Recognition and Machine Learning. Springer-Verlag New  3. Chang, H., Garcia-Hernando, G., Tang, D., Kim, T.K.: Spatio-temporal hough forest for eﬃcient detection-localisation-recognition of fingerwriting in egocentric camera. CVIU 148, 87-96 (2016). https://doi.org/10.1016/j.cviu.2016.01.010 4. Charles, J., Pfister, T., Magee, D., Hogg, D., Zisserman, A.: Personalizing human  video pose estimation. In: CVPR (2016)  5. Chen, X., Yuille, A.: Parsing occluded people by ﬂexible compositions. In: CVPR  (2014)  6. Constantinopoulos, C., Titsias, M.K., Likas, A.: Bayesian feature and model selection for gaussian mixture models. TPAMI 28(6), 1013-1018 (June 2006). https://doi.org/10.1109/TPAMI.2006.111  7. Garcia-Hernando, G., Yuan, S., Baek, S., Kim, T.: First-person hand action bench- mark with RGB-D videos and 3d hand pose annotations. CoRR abs/1704.02463 (2017), http://arxiv.org/abs/1704.02463  8. Ghiasi, G., Yang, Y., Ramanan, D., Fowlkes, C.C.: Parsing occluded people. In:  CVPR (2014)  9. Guo, H., Wang, G., Chen, X., Zhang, C., Qiao, F., Yang, H.: Region ensemble net- work: Improving convolutional network for hand pose estimation. In: ICIP (2017) 10. Haque, A., Peng, B., Luo, Z., Alahi, A., Yeung, S., Fei-Fei, L.: Towards viewpoint  invariant 3d human pose estimation. In: ECCV (2016)  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  12. Hsiao, E., Hebert, M.: Occlusion reasoning for object detectionunder arbitrary  In: CVPR (2016)  viewpoint. In: CVPR (2012)  13. Jang, Y., Noh, S.T., Chang, H.J., Kim, T.K., Woo, W.: 3d finger cape: Clicking action and position estimation under self-occlusions in egocentric viewpoint. IEEE Transactions on Visualization and Computer Graphics (TVCG), vol. 21, no. 4, pp.501-510, April 2015 (2015)  14. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In: ICLR (2014) 15. Kinoshita, K., Delcroix, M., Ogawa, A., Higuchi, T., Nakatani, T.: Deep mix- ture density network for statistical model-based feature enhancement. In: ICASSP (2017)  16. Mueller, F., Mehta, D., Sotnychenko, O., Sridhar, S., Casas, D., Theobalt, C.: Real-time hand tracking under occlusion from an egocentric rgb-d sensor. In: ICCV (2017)  17. Navaratnam, R., Fitzgibbon, A.W., Cipolla, R.: The joint manifold model for semi-  supervised multi-valued regression. In: ICCV (2007)  18. Oberweger, M., Wohlhart, P., Lepetit, V.: Hands deep in deep learning for hand  pose estimation. In: Computer Vision Winter Workshop (CVWW) (2015)  19. Oberweger, M., Wohlhart, P., Lepetit, V.: Training a feedback loop for hand pose  estimation. In: ICCV (2015)  20. Oberweger, M., Lepetit, V.: Deepprior++: Improving fast and accurate 3d hand  pose estimation. In: ICCV Workshops (2017)  21. Oikonomidis, I., Kyriazis, N., Argyros, A.: Eﬃcient model-based 3D tracking of  hand articulations using Kinect. In: BMVC (2011)   16  Qi Ye, Tae-Kyun Kim  22. Oikonomidis, I., Kyriazis, N., Argyros, A.: Tracking the articulated motion of two  strongly interacting hands. In: CVPR (2012)  23. Oikonomidis, I., Kyriazis, N., Argyros, A.A.: Full dof tracking of a hand interacting with an object by modeling occlusions and physical constraints. In: ICCV (2011) 24. Poier, G., Roditakis, K., Schulter, S., Michel, D., Bischof, H., Argyros, A.: Hybrid  one-shot 3d hand pose estimation by exploiting uncertainties. In: BMVC (2015)  25. Qian, C., Sun, X., Wei, Y., Tang, X., Sun, J.: Realtime and robust hand tracking  from depth. In: ICCV (2014)  26. Rafi, U., Gall, J., Leibe, B.: A semantic occlusion model for human pose estimation  from a single depth image. In: CVPR Workshops (2015)  27. Rogez, G., Supancic, J.S., Ramanan, D.: First-person pose recognition using ego-  centric workspaces. In: CVPR (2015)  28. Rogez, G., Supancic III, J.S., Khademi, M., Montiel, J.M.M., Ramanan, D.: 3d hand pose detection in egocentric rgb-d images. In: ECCV Workshops (2014) 29. Rohrbach, M., Amin, S., Andriluka, M., Schiele, B.: A database for fine grained  activity detection of cooking activities. In: CVPR (2012)  30. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomedi- cal image segmentation. In: International Conference on Medical Image Computing and Computer-Assisted Intervention. pp. 234-241. Springer (2015)  31. Sharp, T., Keskin, C., Robertson, D., Taylor, J., Shotton, J., Kim, D., Rhemann, C., Leichter, I., Vinnikov, A., Wei, Y., Freedman, D., Kohli, P., Krupka, E., Fitzgib- bon, A., Izadi, S.: Accurate, robust, and ﬂexible real-time hand tracking. In: CHI (2015)  32. Sigal, L., Black, M.J.: Measure locally, reason globally: Occlusion-sensitive articu-  lated pose estimation. In: CVPR (2006)  33. Sridhar, S., Mueller, F., Zollhoefer, M., Casas, D., Oulasvirta, A., Theobalt, C.: Real-time joint tracking of a hand manipulating an object from rgb-d input. In: ECCV (2016)  34. Sun, X., Wei, Y., Liang, S., Tang, X., Sun, J.: Cascaded hand pose regression. In:  CVPR (2015)  35. Tan, D.J., Cashman, T., Taylor, J., Fitzgibbon, A., Tarlow, D., Khamis, S., Izadi, S., Shotton, J.: Fits like a glove: Rapid and reliable hand shape personalization. In: CVPR (2016)  36. Tang, D., Taylor, J., Kohli, P., Keskin, C., Kim, T.K., Shotton, J.: Opening the black box: Hierarchical sampling optimization for estimating human hand pose. In: ICCV (2015)  37. Tang, D., Chang, H.J., Tejani, A., Kim, T.K.: Latent regression forest: Structured  estimation of 3D hand posture. In: CVPR (2014)  38. Tang, D., Yu, T.H., Kim, T.K.: Real-time articulated hand pose estimation using  semi-supervised transductive regression forests. In: ICCV (2013)  39. Taylor, J., Bordeaux, L., Cashman, T., Corish, B., Keskin, C., Sharp, T., Soto, E., Sweeney, D., Valentin, J., Luﬀ, B., et al.: Eﬃcient and precise interactive hand tracking through joint, continuous optimization of pose and correspondences. TOG 35(4), 143 (2016)  40. Tome, D., Russell, C., Agapito, L.: Lifting from the deep: Convolutional 3d pose  estimation from a single image. In: CVPR (2017)  41. Tompson, J., Stein, M., Lecun, Y., Perlin, K.: Real-time continuous pose recovery  of human hands using convolutional networks. TOG 33(5), 169 (2014)  42. Tzionas, D., Ballan, L., Srikantha, A., Aponte, P., Pollefeys, M., Gall, J.: Cap- turing hands in action using discriminative salient points and physics simula-   Occlusion-aware Hand Pose Estimationtion. IJCV 118(2), 172-193 (Jun 2016). https://doi.org/10.1007/s11263-016-0895- 4, http://dx.doi.org/10.1007/s11263-016-0895-4  43. Variani, E., McDermott, E., Heigold, G.: A gaussian mixture model layer jointly optimized with discriminative features within a deep neural network architecture. In: ICASSP (2015)  44. Wang, T., He, X., Barnes, N.: Learning structured hough voting for joint object  detection and occlusion reasoning. In: CVPR (2013)  45. Yang, W., Ouyang, W., Li, H., Wang, X.: End-to-end learning of deformable mix- ture of parts and deep convolutional neural networks for human pose estimation. In: CVPR (2016)  46. Ye, Q., Yuan, S., Kim, T.K.: Spatial attention deep net with partial pso for hier-  archical hybrid hand pose estimation. In: ECCV (2016)  47. Yin, F., Chai, Xiujuanand Chen, X.: Iterative reference driven metric learning for  signer independent isolated sign language recognition. In: ECCV (2016)  48. Yuan, S., Ye, Q., Stenger, B., Kim, T.K.: Bighand2.2m benchmark: Hand pose  data set and state of the art analysis. In: CVPR (2017)  49. Zen, H., Senior, A.: Deep mixture density networks for acoustic modeling in sta-  tistical parametric speech synthesis. In: ICASSP (2014)  50. Zhou, X., Wan, Q., Zhang, W., Xue, X., Wei, Y.: Model-based deep hand pose  estimation. In: IJCAI (2016)"}