{"1": "1. Marchand, E., Uchiyama, H., Spindler, F.: Pose estimation for augmented reality: a hands-on survey. IEEE transactions on visualization and computer graphics 22(12) (2016) 2633-2651 1  2. Murphy-Chutorian, E., Trivedi, M.M.: Head pose estimation in computer vision: A survey. IEEE transactions on pattern analysis and machine intelligence 31(4) (2009) 607-626 1, 3  3. Poirson, P., Ammirato, P., Fu, C.Y., Liu, W., Kosecka, J., Berg, A.C.: Fast single shot detection and pose estimation. In: 3D Vision (3DV), 2016 Fourth International Conference on, IEEE (2016) 676-684 1, 3, 4  4. Massa, F., Marlet, R., Aubry, M.: Crafting a multi-task cnn for viewpoint estimation.  arXiv preprint arXiv:1609.03894 (2016) 1, 3  5. Beyer, L., Hermans, A., Leibe, B.: Biternion nets: Continuous head pose regression In: German Conference on Pattern Recognition,  from discrete training labels. Springer International Publishing (2015) 157-168 1, 3, 4, 5, 7, 12  6. Berger, J.O.: Statistical Decision Theory and Bayesian Analysis. Springer (1980)  2, 11  7. Xiang, Y., Mottaghi, R., Savarese, S.: Beyond pascal: A benchmark for 3d object detection in the wild. In: Applications of Computer Vision (WACV), 2014 IEEE Winter Conference on, IEEE (2014) 75-82 2  8. Siriteerakul, T.: Advance in head pose estimation from low resolution images: A  review. International Journal of Computer Science Issues 9(2) (2012) 3  9. Odobez, J.M.:  IDIAP Head Pose Database. https://www.idiap.ch/dataset/  headpose 3, 11, 12  10. Gourier, N., Hall, D., Crowley, J.L.: Estimating face orientation from robust detection of salient facial structures. In: FG Net Workshop on Visual Observation of Deictic Gestures. Volume 6. (2004) 3  11. Demirkus, M., Clark, J.J., Arbel, T.: Robust semi-automatic head pose labeling for real-world face video sequences. Multimedia Tools and Applications 70(1) (2014) 495-523 3  12. Murphy-Chutorian, E., Doshi, A., Trivedi, M.M.: Head pose estimation for driver assistance systems: A robust algorithm and experimental evaluation. In: Intelligent Transportation Systems Conference, 2007. ITSC 2007. IEEE, IEEE (2007) 709-714 3  13. Fisher, R., Santos-Victor, J., Crowley, J.: Caviar: Context aware vision using  image-based active recognition (2005) 3, 7, 11, 12  14. Benfold, B., Reid, I.: Unsupervised learning of a scene-specific coarse gaze estimator. In: Computer Vision (ICCV), 2011 IEEE International Conference on, IEEE (2011) 2344-2351 3  15. Fanelli, G., Gall, J., Van Gool, L.: Real time head pose estimation with random regression forests. In: Computer Vision and Pattern Recognition (CVPR), 2011 IEEE Conference on, IEEE (2011) 617-624 3  16. Chamveha, I., Sugano, Y., Sugimura, D., Siriteerakul, T., Okabe, T., Sato, Y., Sugimoto, A.: Head direction estimation from low resolution images with scene adaptation. Computer Vision and Image Understanding 117(10) (2013) 1502-1511 3  17. Chen, C., Odobez, J.M.: We are not contortionists: Coupled adaptive learning for head and body orientation estimation in surveillance video. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 1544-1551 3   Deep Directional Statistics: Pose Estimation with Uncertainty QuantificationReferences  1. Marchand, E., Uchiyama, H., Spindler, F.: Pose estimation for augmented reality: a hands-on survey. IEEE transactions on visualization and computer graphics 22(12) (2016) 2633-2651 1  2. Murphy-Chutorian, E., Trivedi, M.M.: Head pose estimation in computer vision: A survey. IEEE transactions on pattern analysis and machine intelligence 31(4) (2009) 607-626 1, 3  3. Poirson, P., Ammirato, P., Fu, C.Y., Liu, W., Kosecka, J., Berg, A.C.: Fast single shot detection and pose estimation. In: 3D Vision (3DV), 2016 Fourth International Conference on, IEEE (2016) 676-684 1, 3, 4  4. Massa, F., Marlet, R., Aubry, M.: Crafting a multi-task cnn for viewpoint estimation.  arXiv preprint arXiv:1609.03894 (2016) 1, 3  5. Beyer, L., Hermans, A., Leibe, B.: Biternion nets: Continuous head pose regression In: German Conference on Pattern Recognition,  from discrete training labels. Springer International Publishing (2015) 157-168 1, 3, 4, 5, 7, 12  6. Berger, J.O.: Statistical Decision Theory and Bayesian Analysis. Springer (1980)  2, 11  7. Xiang, Y., Mottaghi, R., Savarese, S.: Beyond pascal: A benchmark for 3d object detection in the wild. In: Applications of Computer Vision (WACV), 2014 IEEE Winter Conference on, IEEE (2014) 75-82 2  8. Siriteerakul, T.: Advance in head pose estimation from low resolution images: A  review. International Journal of Computer Science Issues 9(2) (2012) 3  9. Odobez, J.M.:  IDIAP Head Pose Database. https://www.idiap.ch/dataset/  headpose 3, 11, 12  10. Gourier, N., Hall, D., Crowley, J.L.: Estimating face orientation from robust detection of salient facial structures. In: FG Net Workshop on Visual Observation of Deictic Gestures. Volume 6. (2004) 3  11. Demirkus, M., Clark, J.J., Arbel, T.: Robust semi-automatic head pose labeling for real-world face video sequences. Multimedia Tools and Applications 70(1) (2014) 495-523 3  12. Murphy-Chutorian, E., Doshi, A., Trivedi, M.M.: Head pose estimation for driver assistance systems: A robust algorithm and experimental evaluation. In: Intelligent Transportation Systems Conference, 2007. ITSC 2007. IEEE, IEEE (2007) 709-714 3  13. Fisher, R., Santos-Victor, J., Crowley, J.: Caviar: Context aware vision using  image-based active recognition (2005) 3, 7, 11, 12  14. Benfold, B., Reid, I.: Unsupervised learning of a scene-specific coarse gaze estimator. In: Computer Vision (ICCV), 2011 IEEE International Conference on, IEEE (2011) 2344-2351 3  15. Fanelli, G., Gall, J., Van Gool, L.: Real time head pose estimation with random regression forests. In: Computer Vision and Pattern Recognition (CVPR), 2011 IEEE Conference on, IEEE (2011) 617-624 3  16. Chamveha, I., Sugano, Y., Sugimura, D., Siriteerakul, T., Okabe, T., Sato, Y., Sugimoto, A.: Head direction estimation from low resolution images with scene adaptation. Computer Vision and Image Understanding 117(10) (2013) 1502-1511 3  17. Chen, C., Odobez, J.M.: We are not contortionists: Coupled adaptive learning for head and body orientation estimation in surveillance video. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 1544-1551 3   16  S. Prokudin et al.  18. Flohr, F., Dumitru-Guzu, M., Kooij, J.F.P., Gavrila, D.: A probabilistic framework for joint pedestrian head and body orientation estimation. IEEE Transactions on Intelligent Transportation Systems 16 (2015) 1872-1882 3  19. Osadchy, M., Cun, Y.L., Miller, M.L.: Synergistic face detection and pose estimation with energy-based models. Journal of Machine Learning Research 8(May) (2007) 1197-1215 3  20. Dantone, M., Gall, J., Fanelli, G., Van Gool, L.: Real-time facial feature detection using conditional regression forests. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 2578-2585 3  21. Zhu, X., Ramanan, D.: Face detection, pose estimation, and landmark localization in the wild. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 2879-2886 3  22. Lu, J., Tan, Y.P.: Ordinary preserving manifold analysis for human age and head pose estimation. IEEE Transactions on Human-Machine Systems 43(2) (2013) 249-258 3  23. Huang, D., Storer, M., De la Torre, F., Bischof, H.: Supervised local subspace learning for continuous head pose estimation. In: Computer Vision and Pattern Recognition (CVPR), 2011 IEEE Conference on, IEEE (2011) 2921-2928 3  24. Tosato, D., Spera, M., Cristani, M., Murino, V.: Characterizing humans on rieman- nian manifolds. IEEE Transactions on Pattern Analysis and Machine Intelligence 35(8) (2013) 1972-1984 3  25. BenAbdelkader, C.: Robust head pose estimation using supervised manifold learning.  Computer Vision-ECCV 2010 (2010) 518-531 3  26. Geng, X., Xia, Y.: Head pose estimation based on multivariate label distribution. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2014) 1837-1842 3  27. Kazemi, V., Sullivan, J.: One millisecond face alignment with an ensemble of regression trees. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2014) 1867-1874 3  28. Ba, S.O., Odobez, J.M.: A probabilistic framework for joint head tracking and pose estimation. In: Pattern Recognition, 2004. ICPR 2004. Proceedings of the 17th International Conference on. Volume 4., IEEE (2004) 264-267 3  29. Demirkus, M., Precup, D., Clark, J.J., Arbel, T.: Probabilistic temporal head pose estimation using a hierarchical graphical model. In: European Conference on Computer Vision, Springer (2014) 328-344 3  30. Kendall, A., Gal, Y.: What uncertainties do we need in bayesian deep learning for  computer vision? arXiv preprint arXiv:1703.04977 (2017) 3, 14  31. Savarese, S., Fei-Fei, L.: 3d generic object categorization, localization and pose In: Computer Vision, 2007. ICCV 2007. IEEE 11th International  estimation. Conference on, IEEE (2007) 1-8 3  32. Ozuysal, M., Lepetit, V., Fua, P.: Pose estimation for category specific multiview object localization. In: 2009 IEEE Conference on Computer Vision and Pattern Recognition. (2009) 778-785 3  33. Xiang, Y., Mottaghi, R., Savarese, S.: Beyond pascal: A benchmark for 3d object detection in the wild. In: IEEE Winter Conference on Applications of Computer Vision (WACV). (2014) 3, 12  34. Pepik, B., Gehler, P., Stark, M., Schiele, B.: 3d2pm - 3d deformable part models. In: Proceedings of the European Conference on Computer Vision (ECCV). Lecture Notes in Computer Science, Firenze, Springer (October 2012) 356-370 3   Deep Directional Statistics: Pose Estimation with Uncertainty Quantification35. Pepik, B., Stark, M., Gehler, P., Schiele, B.: Teaching 3d geometry to deformable part models. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR), Providence, RI, USA, IEEE (June 2012) 3362 -3369 oral presentation. 3 36. Su, H., Qi, C.R., Li, Y., Guibas, L.J.: Render for cnn: Viewpoint estimation in images using cnns trained with rendered 3d model views. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 2686-2694 3, 4, 12, 13 37. Braun, M., Rao, Q., Wang, Y., Flohr, F.: Pose-rcnn: Joint object detection and pose estimation using 3d object proposals. In: Intelligent Transportation Systems (ITSC), 2016 IEEE 19th International Conference on, IEEE (2016) 1546-1551 4  38. Tulsiani, S., Malik, J.: Viewpoints and keypoints. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 1510-1519 4, 12, 13  39. Crivellaro, A., Rad, M., Verdie, Y., Moo Yi, K., Fua, P., Lepetit, V.: A novel representation of parts for accurate 3d object detection and tracking in monocular images. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 4391-4399 4  40. Rad, M., Lepetit, V.: Bb8: A scalable, accurate, robust to partial occlusion method for predicting the 3d poses of challenging objects without using depth. In: International Conference on Computer Vision. Volume 1. (2017) 5 4  41. Grabner, A., Roth, P.M., Lepetit, V.: 3d pose estimation and 3d model retrieval for objects in the wild. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2018) 3022-3031 4, 13  42. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014) 5, 11  43. Szegedy, C., Ioﬀe, S., Vanhoucke, V., Alemi, A.A.: Inception-v4, inception-resnet and the impact of residual connections on learning. In: AAAI. Volume 4. 12 5, 11 44. Mardia, K.V., Jupp, P.E.: Directional statistics. Volume 494. John Wiley & Sons  45. Kingma, D.P., Welling, M.: Auto-encoding variational bayes. arXiv preprint  (2009) 5, 14  arXiv:1312.6114 (2013) 9  46. Rezende, D.J., Mohamed, S., Wierstra, D.: Stochastic backpropagation and approx- imate inference in deep generative models. arXiv preprint arXiv:1401.4082 (2014) 9  47. Sohn, K., Lee, H., Yan, X.: Learning structured output representation using deep conditional generative models. In: Advances in Neural Information Processing Systems. (2015) 3483-3491 9  48. Doersch, C.: Tutorial on variational autoencoders. arXiv preprint arXiv:1606.05908  (2016) 9  49. Burda, Y., Grosse, R., Salakhutdinov, R.: Importance weighted autoencoders. arXiv  preprint arXiv:1509.00519 (2015) 10  50. Premachandran, V., Tarlow, D., Batra, D.: Empirical minimum Bayes risk predic- tion: How to extract an extra few % performance from vision models with just three more parameters. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2014) 1043-1050 11  51. Bouchacourt, D., Mudigonda, P.K., Nowozin, S.: DISCO Nets: DISsimilarity COeﬃcients Networks. In: Advances in Neural Information Processing Systems. (2016) 352-360 11  52. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014) 11  53. Bergstra, J., Bengio, Y.: Random search for hyper-parameter optimization. Journal  of Machine Learning Research 13(Feb) (2012) 281-305 11   18  S. Prokudin et al.  54. Benfold, B., Reid, I.: Stable multi-target tracking in real-time surveillance video. In: Computer Vision and Pattern Recognition (CVPR), 2011 IEEE Conference on, IEEE (2011) 3457-3464 11, 12  55. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual object classes (voc) challenge. International journal of computer vision 88(2) (2010) 303-338 12  56. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on, IEEE (2009) 248-255 12  57. Good, I.J.: Rational decisions. Journal of the Royal Statistical Society. Series B  (Methodological) (1952) 107-114 13  58. Gneiting, T., Raftery, A.E.: Strictly proper scoring rules, prediction, and estimation. Journal of the American Statistical Association 102(477) (2007) 359-378 13"}