{"1": "1. Barbosa, I.B., Cristani, M., Caputo, B., Rognhaugen, A., Theoharis, T.: Looking beyond appearances: Synthetic training data for deep cnns in re-identification. arXiv preprint arXiv:1701.03153 (2017)  2. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR (2017)  3. Chen, Y., Zhu, X., Gong, S.: Person re-identification by deep learning multi-scale representations. In: In International Conference on Computer Vision, Workshop on Cross-Domain Human Identification (CHI) (2017)  4. Cheng, D.S., Cristani, M., Stoppa, M., Bazzani, L., Murino, V.: Custom pictorial  structures for re-identification. In: BMVC (2011)  5. Dai, J., Li, Y., He, K., Sun, J.: R-FCN: object detection via region-based fully  convolutional networks. In: NIPS (2016)  6. Das, A., Chakraborty, A., Roy-Chowdhury, A.K.: Consistent Re-identification in  a Camera Network. Springer International Publishing (2014)  7. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Li, F.F.: Imagenet: A large-scale  hierarchical image database. In: CVPR (2009)  8. Diba, A., Pazandeh, A.M., Pirsiavash, H., Gool, L.V.: Deepcamp: Deep convolu-  tional action & attribute mid-level patterns. In: CVPR (2016)  9. Engel, C., Baumgartner, P., Holzmann, M., Nutzel, J.F.: Person re-identification  by support vector ranking. In: BMVC (2010)  10. Felzenszwalb, P., McAllester, D., Ramanan, D.: A discriminatively trained, multi-  scale, deformable part model. In: CVPR (2008)  11. Geng, M., Wang, Y., Xiang, T., Tian, Y.: Deep transfer learning for person re-  identification. arXiv preprint arXiv:1611.05244 (2016)  12. Gheissari, N., Sebastian, T.B., Hartley, R.: Person reidentification using spatiotem-  13. Gray, D., Tao, H.: Viewpoint invariant pedestrian recognition with an ensemble of  poral appearance. In: CVPR (2006)  localized features. In: ECCV (2008)  In: CVPR (2016)  14. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  15. Hermans, A., Beyer, L., Leibe, B.: In defense of the triplet loss for person re-  identification. arXiv preprint arXiv: 1703.07737 (2017)  16. Insafutdinov, E., Pishchulin, L., Andres, B., Andriluka, M., Schiele, B.: Deepercut: A deeper, stronger, and faster multi-person pose estimation model. In: ECCV (2016)  17. Jose, C., Fleuret, F.: Scalable metric learning via weighted approximate rank com-  ponent analysis. In: ECCV (2016)  18. Karanam, S., Gou, M., Wu, Z., Rates-Borras, A., Camps, O., Radke, R.J.: A comprehensive evaluation and benchmark for person re-identification: Features, metrics, and datasets. arXiv preprint arXiv: 1605.09653 (2016)  19. Li, W., Zhao, R., Xiao, T., Wang, X.: Deepreid: Deep filter pairing neural network  for person re-identification. In: CVPR (2014)  20. Li, W., Zhu, X., Gong, S.: Person re-identification by deep joint learning of multi-  loss classification. In: IJCAI (2017)  21. Li, W., Zhu, X., Gong, S.: Harmonious attention network for person re-  identification. arXiv preprint arXiv:1802.08122 (2018)  22. Li, Y., Liu, L., Shen, C., van den Hengel, A.: Mining mid-level visual patterns with  deep CNN activations. International Journal of Computer Vision (2017)   Beyond Part Models: Person Retrieval with Refined Part PoolingReferences  1. Barbosa, I.B., Cristani, M., Caputo, B., Rognhaugen, A., Theoharis, T.: Looking beyond appearances: Synthetic training data for deep cnns in re-identification. arXiv preprint arXiv:1701.03153 (2017)  2. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR (2017)  3. Chen, Y., Zhu, X., Gong, S.: Person re-identification by deep learning multi-scale representations. In: In International Conference on Computer Vision, Workshop on Cross-Domain Human Identification (CHI) (2017)  4. Cheng, D.S., Cristani, M., Stoppa, M., Bazzani, L., Murino, V.: Custom pictorial  structures for re-identification. In: BMVC (2011)  5. Dai, J., Li, Y., He, K., Sun, J.: R-FCN: object detection via region-based fully  convolutional networks. In: NIPS (2016)  6. Das, A., Chakraborty, A., Roy-Chowdhury, A.K.: Consistent Re-identification in  a Camera Network. Springer International Publishing (2014)  7. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Li, F.F.: Imagenet: A large-scale  hierarchical image database. In: CVPR (2009)  8. Diba, A., Pazandeh, A.M., Pirsiavash, H., Gool, L.V.: Deepcamp: Deep convolu-  tional action & attribute mid-level patterns. In: CVPR (2016)  9. Engel, C., Baumgartner, P., Holzmann, M., Nutzel, J.F.: Person re-identification  by support vector ranking. In: BMVC (2010)  10. Felzenszwalb, P., McAllester, D., Ramanan, D.: A discriminatively trained, multi-  scale, deformable part model. In: CVPR (2008)  11. Geng, M., Wang, Y., Xiang, T., Tian, Y.: Deep transfer learning for person re-  identification. arXiv preprint arXiv:1611.05244 (2016)  12. Gheissari, N., Sebastian, T.B., Hartley, R.: Person reidentification using spatiotem-  13. Gray, D., Tao, H.: Viewpoint invariant pedestrian recognition with an ensemble of  poral appearance. In: CVPR (2006)  localized features. In: ECCV (2008)  In: CVPR (2016)  14. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  15. Hermans, A., Beyer, L., Leibe, B.: In defense of the triplet loss for person re-  identification. arXiv preprint arXiv: 1703.07737 (2017)  16. Insafutdinov, E., Pishchulin, L., Andres, B., Andriluka, M., Schiele, B.: Deepercut: A deeper, stronger, and faster multi-person pose estimation model. In: ECCV (2016)  17. Jose, C., Fleuret, F.: Scalable metric learning via weighted approximate rank com-  ponent analysis. In: ECCV (2016)  18. Karanam, S., Gou, M., Wu, Z., Rates-Borras, A., Camps, O., Radke, R.J.: A comprehensive evaluation and benchmark for person re-identification: Features, metrics, and datasets. arXiv preprint arXiv: 1605.09653 (2016)  19. Li, W., Zhao, R., Xiao, T., Wang, X.: Deepreid: Deep filter pairing neural network  for person re-identification. In: CVPR (2014)  20. Li, W., Zhu, X., Gong, S.: Person re-identification by deep joint learning of multi-  loss classification. In: IJCAI (2017)  21. Li, W., Zhu, X., Gong, S.: Harmonious attention network for person re-  identification. arXiv preprint arXiv:1802.08122 (2018)  22. Li, Y., Liu, L., Shen, C., van den Hengel, A.: Mining mid-level visual patterns with  deep CNN activations. International Journal of Computer Vision (2017)   16  Y. Sun et al.  23. Liao, S., Hu, Y., Zhu, X., Li, S.Z.: Person re-identification by local maximal oc-  currence representation and metric learning. In: CVPR (2015)  24. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S.E., Fu, C., Berg, A.C.:  SSD: single shot multibox detector. In: ECCV (2016)  25. Liu, X., Zhao, H., Tian, M., Sheng, L., Shao, J., Yi, S., Yan, J., Wang, X.:  Hydraplus-net: Attentive deep features for pedestrian analysis. In: ICCV (2017)  26. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  27. M., J.O., Tuytelaars, T.: Modeling visual compatibility through hierarchical mid-  segmentation. In: CVPR (2015)  level elements. In: ECCV (2016)  28. Ma, A.J., Yuen, P.C., Li, J.: Domain transfer support vector ranking for person  re-identification without target camera label information. In: ICCV (2013)  29. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti-  mation. In: ECCV (2016)  30. Ristani, E., Solera, F., Zou, R., Cucchiara, R., Tomasi, C.: Performance measures and a data set for multi-target, multi-camera tracking. In: European Conference on Computer Vision workshop on Benchmarking Multi-Target Tracking (2016) 31. Su, C., Li, J., Zhang, S., Xing, J., Gao, W., Tian, Q.: Pose-driven deep convolu-  tional model for person re-identification. In: ICCV (2017)  32. Sun, Y., Zheng, L., Deng, W., Wang, S.: SVDNet for pedestrian retrieval. In: ICCV  (2017)  33. Szegedy, C., Ioﬀe, S., Vanhoucke, V., Alemi, A.: Inception-v4, inception-resnet and  the impact of residual connections on learning. In: AAAI (2017)  34. Ustinova, E., Ganin, Y., Lempitsky, V.: Multiregion bilinear convolutional neural networks for person re-identification. arXiv preprint arXiv: 1512.05300 (2015) 35. Wei, L., Zhang, S., Yao, H., Gao, W., Tian, Q.: GLAD: Global-local-alignment  descriptor for pedestrian retrieval. ACM Multimedia (2017)  36. Wei, S.E., Ramakrishna, V., Kanade, T., Sheikh, Y.: Convolutional pose machines.  In: CVPR (2016)  37. Xiao, T., Li, H., Ouyang, W., Wang, X.: Learning deep feature representations  with domain guided dropout for person re-identification. In: CVPR (2016)  38. Xu, K., Ba, J., Kiros, R., Cho, K., Courville, A., Salakhutdinov, R., Zemel, R., Bengio, Y.: Show, attend and tell: Neural image caption generation with visual attention. In: ICML (2015)  39. Yao, H., Zhang, S., Zhang, Y., Li, J., Tian, Q.: Deep representation learning with part loss for person re-identification. arXiv preprint arXiv:1707.00798 (2017) 40. Zhang, Y., Xiang, T., Hospedales, T.M., Lu, H.: Deep mutual learning. arXiv  preprint arXiv: 1705.00384 (2017)  41. Zhao, L., Li, X., Wang, J., Zhuang, Y.: Deeply-learned part-aligned representations  for person re-identification. In: ICCV (2017)  42. Zheng, L., Huang, Y., Lu, H., Yang, Y.: Pose invariant embedding for deep person  re-identification. arXiv preprint arXiv:1701.07732 (2017)  43. Zheng, L., Shen, L., Tian, L., Wang, S., Wang, J., Tian, Q.: Scalable person re-  identification: A benchmark. In: ICCV (2015)  44. Zheng, L., Yang, Y., Hauptmann, A.G.: Person re-identification: Past, present and  future. arXiv preprint arXiv:1610.02984 (2016)  45. Zheng, W., Gong, S., Xiang, T.: Reidentification by relative distance comparison.  TPAMI (2013)  46. Zheng, Z., Zheng, L., Yang, Y.: Pedestrian alignment network for large-scale person  re-identification. arXiv preprint arXiv: 1707.00408 (2017)   Beyond Part Models: Person Retrieval with Refined Part Pooling47. Zheng, Z., Zheng, L., Yang, Y.: Unlabeled samples generated by gan improve the  person re-identification baseline in vitro. In: ICCV (2017)  48. Zhong, Z., Zheng, L., Cao, D., Li, S.: Re-ranking person re-identification with  k-reciprocal encoding. In: CVPR (2017)  49. Zhong, Z., Zheng, L., Kang, G., Li, S., Yang, Y.: Random erasing data augmenta-  tion. arXiv preprint arXiv: 1708.04896 (2017)  50. Zhong, Z., Zheng, L., Zheng, Z., Li, S., Yang, Y.: Camera style adaptation for  person re-identification. arXiv preprint arXiv:1711.10295 (2017)"}