{"1": "1. Ait-Aider, O., Andreﬀ, N., Lavest, J.M., Martinet, P.: Simultaneous object pose and velocity computation using a single view from a rolling shutter camera. In: European Conference on Computer Vision, Springer (2006) 56-68  2. Ait-Aider, O., Bartoli, A., Andreﬀ, N.: Kinematics from lines in a single rolling shutter image. In: 2007 IEEE Conference on Computer Vision and Pattern Recog- nition, IEEE (2007) 1-6  3. Ait-Aider, O., Berry, F.: Structure and kinematics triangulation with a rolling shutter stereo rig. Proceedings of the IEEE International Conference on Computer Vision (Iccv) (2009) 1835-1840  4. Saurer, O., Pollefeys, M., Hee Lee, G.: Sparse to dense 3d reconstruction from rolling shutter images. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (June 2016)  5. Saurer, O., Koser, K., Bouguet, J.Y., Pollefeys, M.: Rolling Shutter Stereo. Com-  puter Vision (ICCV), 2013 IEEE International Conference on (2013)  6. Hedborg, J., Ringaby, E., Forss´en, P.E., Felsberg, M.: Structure and motion esti- mation from rolling shutter video. In: Computer Vision Workshops (ICCV Work- shops). (2011)  7. Hedborg, J., Forssen, P.E., Felsberg, M., Ringaby, E.: Rolling shutter bundle  adjustment. In: Computer Vision and Pattern Recognition (CVPR). (2012)  8. Dai, Y., Li, H., Kneip, L.: Rolling shutter camera relative pose: generalized epipolar geometry. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 4132-4140  9. Kim, J.H., Cadena, C., Reid, I.: Direct semi-dense slam for rolling shutter cameras. In: 2016 IEEE International Conference on Robotics and Automation (ICRA). (May 2016) 1308-1315  10. Albl, C., Sugimoto, A., Pajdla, T.: Degeneracies in rolling shutter sfm. In: Euro-  pean Conference on Computer Vision, Springer (2016) 36-51  11. Ito, E., Okatani, T.: Self-calibration-based approach to critical motion sequences of rolling-shutter structure from motion. In: Computer Vision and Pattern Recog- nition (CVPR), 2017 IEEE Conference on  12. Haralick, R.M., Lee, D., Ottenburg, K., Nolle, M.: Analysis and solutions of the three point perspective pose estimation problem. In: Computer Vision and Pattern Recognition, 1991. Proceedings CVPR’91., IEEE Computer Society Conference on, IEEE (1991) 592-598  13. Gao, X.S., Hou, X.R., Tang, J., Cheng, H.F.: Complete solution classification for the perspective-three-point problem. IEEE transactions on pattern analysis and machine intelligence 25(8) (2003) 930-943  14. Wu, Y., Hu, Z.: Pnp problem revisited. Journal of Mathematical Imaging and  Vision 24(1) (2006) 131-141  15. Quan, L., Lan, Z.: Linear n-point camera pose determination. IEEE Transactions  on pattern analysis and machine intelligence 21(8) (1999) 774-780  16. Leng, D., Sun, W.: Finding all the solutions of pnp problem. In: Imaging Systems and Techniques, 2009. IST’09. IEEE International Workshop on, IEEE (2009) 348- 352  17. Albl, C., Kukelova, Z., Pajdla, T.: R6p-rolling shutter absolute camera pose. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 2292-2300   Rolling Shutter Pose and Ego-motion Estimation using Shape-from-TemplateReferences  1. Ait-Aider, O., Andreﬀ, N., Lavest, J.M., Martinet, P.: Simultaneous object pose and velocity computation using a single view from a rolling shutter camera. In: European Conference on Computer Vision, Springer (2006) 56-68  2. Ait-Aider, O., Bartoli, A., Andreﬀ, N.: Kinematics from lines in a single rolling shutter image. In: 2007 IEEE Conference on Computer Vision and Pattern Recog- nition, IEEE (2007) 1-6  3. Ait-Aider, O., Berry, F.: Structure and kinematics triangulation with a rolling shutter stereo rig. Proceedings of the IEEE International Conference on Computer Vision (Iccv) (2009) 1835-1840  4. Saurer, O., Pollefeys, M., Hee Lee, G.: Sparse to dense 3d reconstruction from rolling shutter images. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (June 2016)  5. Saurer, O., Koser, K., Bouguet, J.Y., Pollefeys, M.: Rolling Shutter Stereo. Com-  puter Vision (ICCV), 2013 IEEE International Conference on (2013)  6. Hedborg, J., Ringaby, E., Forss´en, P.E., Felsberg, M.: Structure and motion esti- mation from rolling shutter video. In: Computer Vision Workshops (ICCV Work- shops). (2011)  7. Hedborg, J., Forssen, P.E., Felsberg, M., Ringaby, E.: Rolling shutter bundle  adjustment. In: Computer Vision and Pattern Recognition (CVPR). (2012)  8. Dai, Y., Li, H., Kneip, L.: Rolling shutter camera relative pose: generalized epipolar geometry. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 4132-4140  9. Kim, J.H., Cadena, C., Reid, I.: Direct semi-dense slam for rolling shutter cameras. In: 2016 IEEE International Conference on Robotics and Automation (ICRA). (May 2016) 1308-1315  10. Albl, C., Sugimoto, A., Pajdla, T.: Degeneracies in rolling shutter sfm. In: Euro-  pean Conference on Computer Vision, Springer (2016) 36-51  11. Ito, E., Okatani, T.: Self-calibration-based approach to critical motion sequences of rolling-shutter structure from motion. In: Computer Vision and Pattern Recog- nition (CVPR), 2017 IEEE Conference on  12. Haralick, R.M., Lee, D., Ottenburg, K., Nolle, M.: Analysis and solutions of the three point perspective pose estimation problem. In: Computer Vision and Pattern Recognition, 1991. Proceedings CVPR’91., IEEE Computer Society Conference on, IEEE (1991) 592-598  13. Gao, X.S., Hou, X.R., Tang, J., Cheng, H.F.: Complete solution classification for the perspective-three-point problem. IEEE transactions on pattern analysis and machine intelligence 25(8) (2003) 930-943  14. Wu, Y., Hu, Z.: Pnp problem revisited. Journal of Mathematical Imaging and  Vision 24(1) (2006) 131-141  15. Quan, L., Lan, Z.: Linear n-point camera pose determination. IEEE Transactions  on pattern analysis and machine intelligence 21(8) (1999) 774-780  16. Leng, D., Sun, W.: Finding all the solutions of pnp problem. In: Imaging Systems and Techniques, 2009. IST’09. IEEE International Workshop on, IEEE (2009) 348- 352  17. Albl, C., Kukelova, Z., Pajdla, T.: R6p-rolling shutter absolute camera pose. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 2292-2300   16  Y. Lao, O.Ait-Aider and A. Bartoli  18. Saurer, O., Pollefeys, M., Lee, G.H.: A minimal solution to the rolling shutter pose estimation problem. In: Intelligent Robots and Systems (IROS), 2015 IEEE/RSJ International Conference on, IEEE (2015) 1328-1334  19. Albl, C., Kukelova, Z., Pajdla, T.: Rolling shutter absolute pose problem with known vertical direction. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 3355-3363  20. Bartoli, A., G´erard, Y., Chadebecq, F., Collins, T., Pizarro, D.: Shape-from- template. IEEE transactions on pattern analysis and machine intelligence 37(10) (2015) 2099-2118  21. Duchamp, G., Ait-Aider, O., Royer, E., Lavest, J.M.: A rolling shutter compliant method for localisation and reconstruction. In: VISAPP (3). (2015) 277-284 22. Magerand, L., Bartoli, A., Ait-Aider, O., Pizarro, D.: Global optimization of ob- ject pose and motion from a single rolling shutter image with automatic 2d-3d matching. In: European Conference on Computer Vision, Springer (2012) 456-469 23. Hartley, R., Zisserman, A.: Multiple view geometry in computer vision. Cambridge  university press (2003)  24. Magerand, L., Bartoli, A.: A generic rolling shutter camera model and its ap- In: International symposium on 3D data  plication to dynamic pose estimation. processing, visualization and transmission. (2010)  25. Salzmann, M., Fua, P.: Linear local models for monocular reconstruction of de- formable surfaces. IEEE Transactions on Pattern Analysis and Machine Intelli- gence 33(5) (2011) 931-944  26. Brunet, F., Bartoli, A., Hartley, R.I.: Monocular template-based 3d surface re- construction: Convex inextensible and nonconvex isometric methods. Computer Vision and Image Understanding 125 (2014) 138-154  27. Collins, T., Bartoli, A.:  [poster] realtime shape-from-template: System and ap- plications. In: Mixed and Augmented Reality (ISMAR), 2015 IEEE International Symposium on, IEEE (2015) 116-119  28. Chhatkuli, A., Pizarro, D., Bartoli, A., Collins, T.: A stable analytical framework for isometric shape-from-template by surface integration. IEEE transactions on pattern analysis and machine intelligence 39(5) (2017) 833-850  29. Malti, A., Bartoli, A., Hartley, R.: A linear least-squares solution to elastic shape- from-template. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 1629-1637  30. Malti, A., Herzet, C.: Elastic shape-from-template with spatially sparse deforming forces. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 3337-3345  31. Haouchine, N., Dequidt, J., Berger, M.O., Cotin, S.: Single view augmentation In: Mixed and Augmented Reality (ISMAR), 2014 IEEE  of 3d elastic objects. International Symposium on, IEEE (2014) 229-236  32. Rengarajan, V., Balaji, Y., Rajagopalan, A.: Unrolling the shutter: Cnn to correct motion distortions. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 2291-2299  33. Zhuang, B., Cheong, L.F., Lee, G.H.: Rolling-shutter-aware diﬀerential sfm and image rectification. In: Proceedings of the IEEE International Conference on Com- puter Vision. (2017) 948-956  34. Haralick, R.M., Lee, D., Ottenburg, K., Nolle, M.: Analysis and solutions of the three point perspective pose estimation problem. In: Computer Vision and Pattern Recognition, 1991. Proceedings CVPR’91., IEEE Computer Society Conference on, IEEE (1991) 592-598   Rolling Shutter Pose and Ego-motion Estimation using Shape-from-Template35. Horn, B.K., Hilden, H.M., Negahdaripour, S.: Closed-form solution of absolute  orientation using orthonormal matrices. JOSA A 5(7) (1988) 1127-1135"}