{"1": "1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., et al.: Tensorﬂow: Large-scale machine learning on heterogeneous distributed systems. arXiv (2016)  2. Arandjelovic, R., Zisserman, A.: Three Things Everyone Should Know to Improve  Object Retrieval. CVPR (2012)  3. Balntas, V., Lenc, K., Vedaldi, A., Mikolajczyk, K.: HPatches: A Benchmark and  Evaluation of Handcrafted and Learned Local Lescriptors. CVPR (2017)  4. Balntas, V., Riba, E., Ponsa, D., Mikolajczyk, K.: Learning Local Feature Descrip- tors with Triplets and Shallow Convolutional Neural Networks. BMVC (2016) 5. Balntas, V., Johns, E., Tang, L., Mikolajczyk, K.: PN-Net: Conjoined Triple Deep  Network for Learning Local Image Descriptors. arXiv (2016)  6. Brown, M.A., Hua, G., Winder, S.A.J.: Discriminative Learning of Local Image  Descriptors. PAMI (2011)  7. G, V.K.B., Carneiro, G., Reid, I.: Learning Local Image Descriptors with Deep Siamese and Triplet Convolutional Networks by Minimizing Global Loss Functions. CVPR (2016)  8. Han, X., Leung, T., Jia, Y., Sukthankar, R., Berg, A.C.: MatchNet - Unifying  Feature and Metric Learning for Patch-based Matching. CVPR (2015)  9. Heinly, Jared, Dunn, Enrique, Frahm, Jan-Michael: Comparative Evaluation of  Binary Features. ECCV (2012)  10. Kaplan, A., Avraham, T., Lindenbaum, M.: Interpreting the ratio criterion for  matching sift descriptors. ECCV (2016)  11. Labatut, P., Pons, J.P., Keriven, R.: Eﬃcient multi-view reconstruction of large- scale scenes using interest points, delaunay triangulation and graph cuts. ICCV (2007)  12. Li, S., Yuan, L., Sun, J., Quan, L.: Dual-feature warping-based motion model  estimation. ICCV (2015)  13. Lin, J., Morere, O., Chandrasekhar, V., Veillard, A., Goh, H.: Deephash: Getting  regularization, depth and fine-tuning right. arXiv (2015)  14. Lowe, D.G.: Distinctive Image Features from Scale-Invariant Keypoints. IJCV  (2004)  PAMI (2005)  15. Markuˇs, N., Pandˇzi´c, I.S., Ahlberg, J.: Learning local descriptors by optimizing  the keypoint-correspondence criterion. ICPR (2016)  16. Mikolajczyk, K., Schmid, C.: A Performance Evaluation of Local Descriptors.  17. Mishchuk, A., Mishkin, D., Radenovic, F.: Working Hard to Know Your Neighbor’s  Margins: Local Descriptor Learning Loss. NIPS (2017)  18. Mishkin, D., Matas, J., Perdoch, M., Lenc, K.: Wxbs: Wide baseline stereo gener-  alizations. BMVC (2015)  19. Mitra, R., Doiphode, N., Gautam, U., Narayan, S., Ahmed, S., Chandran, S., Jain,  A.: A large dataset for improving patch matching. arXiv, year=2018  20. Morel, J.M., Yu, G.: Asift: A new framework for fully aﬃne invariant image com-  parison. SIAM journal on imaging sciences  21. Movshovitz-Attias, Y., Toshev, A., Leung, T.K., Ioﬀe, S., Singh, S.: No Fuss Dis-  tance Metric Learning using Proxies. ICCV (2017)  22. Philbin, J., Chum, O., Isard, M., Sivic, J., Zisserman, A.: Object retrieval with  large vocabularies and fast spatial matching. CVPR (2007)   GeoDesc: Learning Local Descriptors by Integrating Geometry ConstraintsReferences  1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., et al.: Tensorﬂow: Large-scale machine learning on heterogeneous distributed systems. arXiv (2016)  2. Arandjelovic, R., Zisserman, A.: Three Things Everyone Should Know to Improve  Object Retrieval. CVPR (2012)  3. Balntas, V., Lenc, K., Vedaldi, A., Mikolajczyk, K.: HPatches: A Benchmark and  Evaluation of Handcrafted and Learned Local Lescriptors. CVPR (2017)  4. Balntas, V., Riba, E., Ponsa, D., Mikolajczyk, K.: Learning Local Feature Descrip- tors with Triplets and Shallow Convolutional Neural Networks. BMVC (2016) 5. Balntas, V., Johns, E., Tang, L., Mikolajczyk, K.: PN-Net: Conjoined Triple Deep  Network for Learning Local Image Descriptors. arXiv (2016)  6. Brown, M.A., Hua, G., Winder, S.A.J.: Discriminative Learning of Local Image  Descriptors. PAMI (2011)  7. G, V.K.B., Carneiro, G., Reid, I.: Learning Local Image Descriptors with Deep Siamese and Triplet Convolutional Networks by Minimizing Global Loss Functions. CVPR (2016)  8. Han, X., Leung, T., Jia, Y., Sukthankar, R., Berg, A.C.: MatchNet - Unifying  Feature and Metric Learning for Patch-based Matching. CVPR (2015)  9. Heinly, Jared, Dunn, Enrique, Frahm, Jan-Michael: Comparative Evaluation of  Binary Features. ECCV (2012)  10. Kaplan, A., Avraham, T., Lindenbaum, M.: Interpreting the ratio criterion for  matching sift descriptors. ECCV (2016)  11. Labatut, P., Pons, J.P., Keriven, R.: Eﬃcient multi-view reconstruction of large- scale scenes using interest points, delaunay triangulation and graph cuts. ICCV (2007)  12. Li, S., Yuan, L., Sun, J., Quan, L.: Dual-feature warping-based motion model  estimation. ICCV (2015)  13. Lin, J., Morere, O., Chandrasekhar, V., Veillard, A., Goh, H.: Deephash: Getting  regularization, depth and fine-tuning right. arXiv (2015)  14. Lowe, D.G.: Distinctive Image Features from Scale-Invariant Keypoints. IJCV  (2004)  PAMI (2005)  15. Markuˇs, N., Pandˇzi´c, I.S., Ahlberg, J.: Learning local descriptors by optimizing  the keypoint-correspondence criterion. ICPR (2016)  16. Mikolajczyk, K., Schmid, C.: A Performance Evaluation of Local Descriptors.  17. Mishchuk, A., Mishkin, D., Radenovic, F.: Working Hard to Know Your Neighbor’s  Margins: Local Descriptor Learning Loss. NIPS (2017)  18. Mishkin, D., Matas, J., Perdoch, M., Lenc, K.: Wxbs: Wide baseline stereo gener-  alizations. BMVC (2015)  19. Mitra, R., Doiphode, N., Gautam, U., Narayan, S., Ahmed, S., Chandran, S., Jain,  A.: A large dataset for improving patch matching. arXiv, year=2018  20. Morel, J.M., Yu, G.: Asift: A new framework for fully aﬃne invariant image com-  parison. SIAM journal on imaging sciences  21. Movshovitz-Attias, Y., Toshev, A., Leung, T.K., Ioﬀe, S., Singh, S.: No Fuss Dis-  tance Metric Learning using Proxies. ICCV (2017)  22. Philbin, J., Chum, O., Isard, M., Sivic, J., Zisserman, A.: Object retrieval with  large vocabularies and fast spatial matching. CVPR (2007)   16  Z. Luo, T. Shen, L. Zhou, S. Zhu, R. Zhang, Y. Yao, T. Fang and L. Quan  23. Radenovic, F., Tolias, G., Chum, O.: CNN Image Retrieval Learns from BoW -  Unsupervised Fine-Tuning with Hard Examples. ECCV (2016)  24. Schnberger, J.L., Frahm, J.M.: Structure-from-motion revisited. CVPR (2016) 25. Sch¨onberger, J.L., Hardmeier, H., Sattler, T., Pollefeys, M.: Comparative evalua-  tion of hand-crafted and learned local features. CVPR (2017)  26. Shen, T., Zhu, S., Fang, T., Zhang, R., Quan, L.: Graph-based consistent matching for structure-from-motion. European Conference on Computer Vision (2016) 27. Simo-Serra, E., Trulls, E., Ferraz, L., Kokkinos, I., Fua, P., Moreno-Noguer, F.: Discriminative Learning of Deep Convolutional Feature Point Descriptors. CVPR (2015)  28. Sohn, K.: Improved Deep Metric Learning with Multi-class N-pair Loss Objective.  29. Tian, BFY, Wu, F: L2-Net: Deep Learning of Discriminative Patch Descriptor in  NIPS (2016)  Euclidean Space. CVPR (2017)  30. Wilson, K., Snavely, N.: Robust Global Translations with 1DSfM. ECCV (2014) 31. Winder, S., Hua, G., Brown, M.: Picking the best daisy. CVPR (2009) 32. Wu, C.: Siftgpu: A gpu implementation of sift. http://cs. unc. edu/˜ ccwu/siftgpu  (2007)  33. Yao, Y., Luo, Z., Li, S., Fang, T., Quan, L.: Mvsnet: Depth inference for unstruc-  tured multi-view stereo. arXiv (2018)  34. Yi, K.M., Trulls, E., Lepetit, V., Fua, P.: LIFT - Learned Invariant Feature Trans-  35. Yi, K.M., Verdie, Y., Fua, P., Lepetit, V.: Learning to Assign Orientations to  form. ECCV (2016)  Feature Points. CVPR (2015)  36. Zagoruyko, S., Komodakis, N.: Learning to compare image patches via convolu-  tional neural networks. CVPR (2015)  37. Zhang, R., Li, S., Fang, T., Zhu, S., Quan, L.: Joint Camera Clustering and Surface  Segmentation for Large-Scale Multi-view Stereo. ICCV (2015)  38. Zhang, R., Zhu, S., Fang, T., Quan, L.: Distributed very large scale bundle adjust-  ment by global camera consensus. ICCV (2017)  39. Zhang, X., Yu, F.X., Kumar, S., Chang, S.F.: Learning spread-out local feature  descriptors. CVPR (2017)  40. Zhou, L., Zhu, S., Shen, T., Wang, J., Fang, T., Quan, L.: Progressive large scale-  invariant image matching in scale space. ICCV (2017)  41. Zhu, S., Fang, T., Xiao, J., Quan, L.: Local readjustment for high-resolution 3d  reconstruction. CVPR (2014)  42. Zhu, S., Zhang, R., Zhou, L., Shen, T., Fang, T., Tan, P., Quan, L.: Very large-scale  global sfm by distributed motion averaging. CVPR (2018)"}