{"1": "1. Xian, Y., Lorenz, T., Schiele, B., Akata, Z.: Feature generating networks for zero- shot learning. In: 31st IEEE Conference on Computer Vision and Pattern Recog- nition (CVPR 2018), Salt Lake City, UT, USA (2018)  2. Xian, Y., Schiele, B., Akata, Z.: Zero-shot learning - the Good, the Bad and the In: 30th IEEE Conference on Computer Vision and Pattern Recognition  Ugly. (CVPR 2017), Honolulu, HI, USA, IEEE Computer Society (2017) 3077-3086 3. Zhang, Z., Saligrama, V.: Zero-shot learning via semantic similarity embedding. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 4166-4174  4. Lampert, C.H., Nickisch, H., Harmeling, S.: Attribute-based classification for zero- IEEE Transactions on Pattern Analysis and  shot visual object categorization. Machine Intelligence 36(3) (2014) 453-465  5. Qiao, R., Liu, L., Shen, C., van den Hengel, A.: Less is more: zero-shot learning from online textual documents with noise suppression. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 2249-2257  6. Socher, R., Ganjoo, M., Manning, C.D., Ng, A.: Zero-shot learning through cross- In: Advances in neural information processing systems. (2013)  modal transfer. 935-943  7. Yu, F.X., Cao, L., Feris, R.S., Smith, J.R., Chang, S.F.: Designing category- level attributes for discriminative visual recognition. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2013) 771-778  8. Long, Y., Liu, L., Shen, F., Shao, L., Li, X.: Zero-shot learning using synthesised unseen visual data with diﬀusion regularisation. IEEE Transactions on Pattern Analysis and Machine Intelligence (2017)  9. Bucher, M., Herbin, S., Jurie, F.: Generating visual representations for zero-shot In: International Conference on Computer Vision (ICCV) Work- classification. shops: TASK-CV: Transferring and Adapting Source Knowledge in Computer Vi- sion. (2017)  10. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation In: Computer Vision (ICCV), 2017  using cycle-consistent adversarial networks. IEEE International Conference on. (2017)  11. Tran, T., Pham, T., Carneiro, G., Palmer, L., Reid, I.: A bayesian data augmen- In: Advances in Neural Information  tation approach for learning deep models. Processing Systems. (2017) 2794-2803  12. Welinder, P., Branson, S., Mita, T., Wah, C., Schroﬀ, F., Belongie, S., Perona, P.:  Caltech-ucsd birds 200. (2010)  13. Nilsback, M.E., Zisserman, A.: Automated ﬂower classification over a large number of classes. In: Computer Vision, Graphics & Image Processing, 2008. ICVGIP’08. Sixth Indian Conference on, IEEE (2008) 722-729  14. Farhadi, A., Endres, I., Hoiem, D., Forsyth, D.: Describing objects by their at- tributes. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on, IEEE (2009) 1778-1785  15. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A Large-  Scale Hierarchical Image Database. In: CVPR09. (2009)  16. Chen, L., Zhang, H., Xiao, J., Liu, W., Chang, S.F.: Zero-shot visual recogni- In: The IEEE  tion using semantics-preserving adversarial embedding networks. Conference on Computer Vision and Pattern Recognition (CVPR). (June 2018)   Multi-modal Cycle-consistent Generalized Zero-Shot LearningReferences  1. Xian, Y., Lorenz, T., Schiele, B., Akata, Z.: Feature generating networks for zero- shot learning. In: 31st IEEE Conference on Computer Vision and Pattern Recog- nition (CVPR 2018), Salt Lake City, UT, USA (2018)  2. Xian, Y., Schiele, B., Akata, Z.: Zero-shot learning - the Good, the Bad and the In: 30th IEEE Conference on Computer Vision and Pattern Recognition  Ugly. (CVPR 2017), Honolulu, HI, USA, IEEE Computer Society (2017) 3077-3086 3. Zhang, Z., Saligrama, V.: Zero-shot learning via semantic similarity embedding. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 4166-4174  4. Lampert, C.H., Nickisch, H., Harmeling, S.: Attribute-based classification for zero- IEEE Transactions on Pattern Analysis and  shot visual object categorization. Machine Intelligence 36(3) (2014) 453-465  5. Qiao, R., Liu, L., Shen, C., van den Hengel, A.: Less is more: zero-shot learning from online textual documents with noise suppression. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 2249-2257  6. Socher, R., Ganjoo, M., Manning, C.D., Ng, A.: Zero-shot learning through cross- In: Advances in neural information processing systems. (2013)  modal transfer. 935-943  7. Yu, F.X., Cao, L., Feris, R.S., Smith, J.R., Chang, S.F.: Designing category- level attributes for discriminative visual recognition. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2013) 771-778  8. Long, Y., Liu, L., Shen, F., Shao, L., Li, X.: Zero-shot learning using synthesised unseen visual data with diﬀusion regularisation. IEEE Transactions on Pattern Analysis and Machine Intelligence (2017)  9. Bucher, M., Herbin, S., Jurie, F.: Generating visual representations for zero-shot In: International Conference on Computer Vision (ICCV) Work- classification. shops: TASK-CV: Transferring and Adapting Source Knowledge in Computer Vi- sion. (2017)  10. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation In: Computer Vision (ICCV), 2017  using cycle-consistent adversarial networks. IEEE International Conference on. (2017)  11. Tran, T., Pham, T., Carneiro, G., Palmer, L., Reid, I.: A bayesian data augmen- In: Advances in Neural Information  tation approach for learning deep models. Processing Systems. (2017) 2794-2803  12. Welinder, P., Branson, S., Mita, T., Wah, C., Schroﬀ, F., Belongie, S., Perona, P.:  Caltech-ucsd birds 200. (2010)  13. Nilsback, M.E., Zisserman, A.: Automated ﬂower classification over a large number of classes. In: Computer Vision, Graphics & Image Processing, 2008. ICVGIP’08. Sixth Indian Conference on, IEEE (2008) 722-729  14. Farhadi, A., Endres, I., Hoiem, D., Forsyth, D.: Describing objects by their at- tributes. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on, IEEE (2009) 1778-1785  15. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A Large-  Scale Hierarchical Image Database. In: CVPR09. (2009)  16. Chen, L., Zhang, H., Xiao, J., Liu, W., Chang, S.F.: Zero-shot visual recogni- In: The IEEE  tion using semantics-preserving adversarial embedding networks. Conference on Computer Vision and Pattern Recognition (CVPR). (June 2018)   16  Rafael Felix, Vijay Kumar B G, Ian Reid, Gustavo Carneiro  17. Annadani, Y., Biswas, S.: Preserving semantic relations for zero-shot learning. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (June 2018)  18. Akata, Z., Perronnin, F., Harchaoui, Z., Schmid, C.: Label-embedding for im- age classification. IEEE transactions on pattern analysis and machine intelligence 38(7) (2016) 1425-1438  19. Frome, A., Corrado, G.S., Shlens, J., Bengio, S., Dean, J., Mikolov, T., et al.: De- vise: A deep visual-semantic embedding model. In: Advances in neural information processing systems. (2013) 2121-2129  20. Akata, Z., Reed, S., Walter, D., Lee, H., Schiele, B.: Evaluation of output embed- dings for fine-grained image classification. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 2927-2936  21. Romera-Paredes, B., Torr, P.: An embarrassingly simple approach to zero-shot learning. In: International Conference on Machine Learning. (2015) 2152-2161 22. Elyor Kodirov, T.X., Gong, S.: Semantic Autoencoder for Zero-shot Learning.  IEEE CVPR 2017 (2017)  23. Xian, Y., Akata, Z., Sharma, G., Nguyen, Q., Hein, M., Schiele, B.: Latent em- beddings for zero-shot classification. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 69-77  24. Norouzi, M., Mikolov, T., Bengio, S., Singer, Y., Shlens, J., Frome, A., Corrado, G., Dean, J.: Zero-shot learning by convex combination of semantic embeddings. (2014)  25. Changpinyo, S., Chao, W.L., Gong, B., Sha, F.: Synthesized classifiers for zero- shot learning. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 5327-5336  26. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2016) 770-778  27. Mikolov, T., Sutskever, I., Chen, K., Corrado, G.S., Dean, J.: Distributed repre- sentations of words and phrases and their compositionality. In: Advances in neural information processing systems. (2013) 3111-3119  28. Yan, X., Yang, J., Sohn, K., Lee, H.: Attribute2image: Conditional image genera- tion from visual attributes. In: European Conference on Computer Vision, Springer (2016) 776-791  29. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein gan.  arXiv preprint  arXiv:1701.07875 (2017)  30. Lampert, C.H., Nickisch, H., Harmeling, S.: Learning to detect unseen object In: Computer Vision and Pattern  classes by between-class attribute transfer. Recognition, 2009. CVPR 2009. IEEE Conference on. (June 2009) 951-958  31. Reed, S., Akata, Z., Lee, H., Schiele, B.: Learning deep representations of fine- grained visual descriptions. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 49-58  32. Wang, P., Liu, L., Shen, C., Huang, Z., van den Hengel, A., Shen, H.T.: Multi- attention network for one shot learning. In: 2017 IEEE conference on computer vision and pattern recognition, CVPR. (2017) 22-25  33. Xiao, J., Hays, J., Ehinger, K.A., Oliva, A., Torralba, A.: Sun database: Large-scale scene recognition from abbey to zoo. In: Computer vision and pattern recognition (CVPR), 2010 IEEE conference on, IEEE (2010) 3485-3492  34. Maas, A.L., Hannun, A.Y., Ng, A.Y.: Rectifier nonlinearities improve neural net-  work acoustic models. In: Proc. icml. Volume 30. (2013) 3   Multi-modal Cycle-consistent Generalized Zero-Shot Learning35. Nair, V., Hinton, G.E.: Rectified linear units improve restricted boltzmann ma- chines. In: Proceedings of the 27th international conference on machine learning (ICML-10). (2010) 807-814  36. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., et al.: Tensorﬂow: A system for large-scale machine learning. In: OSDI. Volume 16. (2016) 265-283"}