{"1": "1. Activitynet challenge 2016. http://activity-net.org/challenges/2016/ (2016) 2. Aggarwal, J.K., Ryoo, M.S.: Human activity analysis: A review. In: ACM Com-  puting Surveys (2011)  3. Aliakbarian, M.S., Saleh, F., Salzmann, M., Fernando, B., Petersson, L., Anders-  son, L.: Encouraging lstms to anticipate actions very early. In: ICCV (2017)  4. Asadi-Aghbolaghi, M., Clap´es, A., Bellantonio, M., Escalante, H.J., Ponce-L´opez, V., Bar´o, X., Guyon, I., Kasaei, S., Escalera, S.: A survey on deep learning based approaches for action and gesture recognition in image sequences. In: FG (2017) 5. Boreczky, J.S., Rowe, L.A.: Comparison of video shot boundary detection tech-  niques. Journal of Electronic Imaging (1996)  6. Buch, S., Escorcia, V., Ghanem, B., Fei-Fei, L., Niebles, J.C.: End-to-end, single-  stream temporal action detection in untrimmed videos. In: BMVC (2017)  7. Buch, S., Escorcia, V., Shen, C., Ghanem, B., Niebles, J.C.: Sst: Single-stream  temporal action proposals. In: CVPR (2017)  8. Cao, Y., Barrett, D., Barbu, A., Narayanaswamy, S., Yu, H., Michaux, A., Lin, Y., Dickinson, S., Mark Siskind, J., Wang, S.: Recognize human activities from partially observed videos. In: CVPR (2013)  9. Carreira, J., Zisserman, A.: Quo vadis, action recognition? a new model and the  10. Chen, Y., Kalantidis, Y., Li, J., Yan, S., Feng, J.: Multi-fiber networks for video  kinetics dataset. In: CVPR (2017)  recognition. In: ECCV (2018)  11. Cheng, G., Wan, Y., Saudagar, A.N., Namuduri, K., Buckles, B.P.: Advances in human action recognition: A survey (2015), http://arxiv.org/abs/1501.05964 12. Dai, X., Singh, B., Zhang, G., Davis, L.S., Chen, Y.Q.: Temporal context network  for activity localization in videos. In: ICCV (2017)  13. Dai, Z., Yang, Z., Yang, F., Cohen, W.W., Salakhutdinov, R.: Good semi-  supervised learning that requires a bad gan. In: NIPS (2017)  14. Dave, A., Russakovsky, O., Ramanan, D.: Predictive-corrective networks for action  detection. In: CVPR (2017)  15. Escorcia, V., Heilbron, F.C., Niebles, J.C., Ghanem, B.: Daps: Deep action pro-  posals for action understanding. In: ECCV (2016)  16. Feichtenhofer, C., Pinz, A., Zisserman, A.: Convolutional two-stream network fu-  sion for video action recognition. In: CVPR (2016)  17. Gan, C., Wang, N., Yang, Y., Yeung, D.Y., Hauptmann, A.G.: Devnet: A deep event network for multimedia event detection and evidence recounting. In: CVPR (2015)  18. Gao, J., Chen, K., Nevatia, R.: Ctap: Complementary temporal action proposal  19. Gao, J., Sun, C., Yang, Z., Nevatia, R.: Tall: Temporal activity localization via  20. Gao, J., Yang, Z., Nevatia, R.: Cascaded boundary regression for temporal action  21. Gao, J., Yang, Z., Nevatia, R.: Red: Reinforced encoder-decoder networks for action  generation. ECCV (2018)  language query. In: ICCV (2017)  detection. In: BMVC (2017)  anticipation. In: BMVC (2017)  22. Gao, J., Yang, Z., Sun, C., Chen, K., Nevatia, R.: Turn tap: Temporal unit regres-  sion network for temporal action proposals. In: ICCV (2017)  23. Geest, R.D., Gavves, E., Ghodrati, A., Li, Z., Snoek, C., Tuytelaars, T.: Online  action detection. In: ECCV (2016)   Online Detection of Action Start in Untrimmed, Streaming VideosReferences  1. Activitynet challenge 2016. http://activity-net.org/challenges/2016/ (2016) 2. Aggarwal, J.K., Ryoo, M.S.: Human activity analysis: A review. In: ACM Com-  puting Surveys (2011)  3. Aliakbarian, M.S., Saleh, F., Salzmann, M., Fernando, B., Petersson, L., Anders-  son, L.: Encouraging lstms to anticipate actions very early. In: ICCV (2017)  4. Asadi-Aghbolaghi, M., Clap´es, A., Bellantonio, M., Escalante, H.J., Ponce-L´opez, V., Bar´o, X., Guyon, I., Kasaei, S., Escalera, S.: A survey on deep learning based approaches for action and gesture recognition in image sequences. In: FG (2017) 5. Boreczky, J.S., Rowe, L.A.: Comparison of video shot boundary detection tech-  niques. Journal of Electronic Imaging (1996)  6. Buch, S., Escorcia, V., Ghanem, B., Fei-Fei, L., Niebles, J.C.: End-to-end, single-  stream temporal action detection in untrimmed videos. In: BMVC (2017)  7. Buch, S., Escorcia, V., Shen, C., Ghanem, B., Niebles, J.C.: Sst: Single-stream  temporal action proposals. In: CVPR (2017)  8. Cao, Y., Barrett, D., Barbu, A., Narayanaswamy, S., Yu, H., Michaux, A., Lin, Y., Dickinson, S., Mark Siskind, J., Wang, S.: Recognize human activities from partially observed videos. In: CVPR (2013)  9. Carreira, J., Zisserman, A.: Quo vadis, action recognition? a new model and the  10. Chen, Y., Kalantidis, Y., Li, J., Yan, S., Feng, J.: Multi-fiber networks for video  kinetics dataset. In: CVPR (2017)  recognition. In: ECCV (2018)  11. Cheng, G., Wan, Y., Saudagar, A.N., Namuduri, K., Buckles, B.P.: Advances in human action recognition: A survey (2015), http://arxiv.org/abs/1501.05964 12. Dai, X., Singh, B., Zhang, G., Davis, L.S., Chen, Y.Q.: Temporal context network  for activity localization in videos. In: ICCV (2017)  13. Dai, Z., Yang, Z., Yang, F., Cohen, W.W., Salakhutdinov, R.: Good semi-  supervised learning that requires a bad gan. In: NIPS (2017)  14. Dave, A., Russakovsky, O., Ramanan, D.: Predictive-corrective networks for action  detection. In: CVPR (2017)  15. Escorcia, V., Heilbron, F.C., Niebles, J.C., Ghanem, B.: Daps: Deep action pro-  posals for action understanding. In: ECCV (2016)  16. Feichtenhofer, C., Pinz, A., Zisserman, A.: Convolutional two-stream network fu-  sion for video action recognition. In: CVPR (2016)  17. Gan, C., Wang, N., Yang, Y., Yeung, D.Y., Hauptmann, A.G.: Devnet: A deep event network for multimedia event detection and evidence recounting. In: CVPR (2015)  18. Gao, J., Chen, K., Nevatia, R.: Ctap: Complementary temporal action proposal  19. Gao, J., Sun, C., Yang, Z., Nevatia, R.: Tall: Temporal activity localization via  20. Gao, J., Yang, Z., Nevatia, R.: Cascaded boundary regression for temporal action  21. Gao, J., Yang, Z., Nevatia, R.: Red: Reinforced encoder-decoder networks for action  generation. ECCV (2018)  language query. In: ICCV (2017)  detection. In: BMVC (2017)  anticipation. In: BMVC (2017)  22. Gao, J., Yang, Z., Sun, C., Chen, K., Nevatia, R.: Turn tap: Temporal unit regres-  sion network for temporal action proposals. In: ICCV (2017)  23. Geest, R.D., Gavves, E., Ghodrati, A., Li, Z., Snoek, C., Tuytelaars, T.: Online  action detection. In: ECCV (2016)   16  Z. Shou et al.  24. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S.,  Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  25. Heilbron, F.C., Escorcia, V., Ghanem, B., Niebles, J.C.: Activitynet: A large-scale  video benchmark for human activity understanding. In: CVPR (2015)  26. Heilbron, F.C., Barrios, W., Escorcia, V., Ghanem, B.: Scc: Semantic context cas-  cade for eﬃcient action detection. In: CVPR (2017)  27. Heilbron, F.C., Niebles, J.C., Ghanem, B.: Fast temporal activity proposals for eﬃcient detection of human actions in untrimmed videos. In: CVPR (2016) 28. Hoai, M., De la Torre, F.: Max-margin early event detectors. In: CVPR (2012) 29. Hoai, M., De la Torre, F.: Max-margin early event detectors. In: IJCV (2014) 30. Huang, D., Yao, S., Wang, Y., De La Torre, F.: Sequential max-margin event  detectors. In: ECCV (2014)  31. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with condi-  tional adversarial networks. In: CVPR (2017)  32. J´egou, H., Douze, M., Schmid, C., P´erez., P.: Aggregating local descriptors into a  compact image representation. In: CVPR (2010)  33. Jiang, Y.G., Liu, J., Zamir, A.R., Toderici, G., Laptev, I., Shah, M., Sukthankar, R.: THUMOS challenge: Action recognition with a large number of classes. http://crcv.ucf.edu/THUMOS14/ (2014)  34. Kang, S.M., Wildes, R.P.: Review of action recognition and detection methods.  arXiv preprint arXiv:1610.06906 (2016)  35. Karpathy, A., Toderici, G., Shetty, S., Leung, T., Sukthankar, R., Fei-Fei, L.: Large- scale video classification with convolutional neural networks. In: CVPR (2014) 36. Kong, Y., Kit, D., Fu, Y.: A discriminative model with multiple temporal scales  for action prediction. In: ECCV (2014)  37. Kong, Y., Tao, Z., Fu, Y.: Deep sequential context networks for action prediction.  38. Lan, T., Chen, T.C., Savarese, S.: A hierarchical representation for future action  In: CVPR (2017)  prediction. In: ECCV (2014)  39. Li, Y., Lan, C., Xing, J., Zeng, W., Yuan, C., Liu, J.: Online human action detection using joint classification-regression recurrent neural networks. In: ECCV (2016) 40. Lin, T., Zhao, X., Shou, Z.: Single shot temporal action detection. In: ACM MM  (2017)  41. Liu, C., Li, Y., Hu, Y., Liu, J.: Online action detection and forecast via multitask  deep recurrent neural networks. In: ICASSP (2017)  42. Ma, S., Sigal, L., Sclaroﬀ, S.: Learning activity progression in lstms for activity  detection and early detection. In: CVPR (2016)  43. Odena, A., Olah, C., Shlens, J.: Conditional image synthesis with auxiliary classifier  gans. In: ICML (2017)  44. Perronnin, F., S´anchez, J., Mensink., T.: Improving the fisher kernel for large-scale  image classification. In: ECCV (2010)  45. Poppe, R.: A survey on vision-based human action recognition. In: Image and  vision computing (2010)  46. Radford, A., Metz, L., Chintala, S.: Unsupervised representation learning with deep convolutional generative adversarial networks. arXiv preprint arXiv:1511.06434 (2015)  47. Richard, A., Gall, J.: Temporal action detection using a statistical language model.  48. Ryoo, M.S.: Human activity prediction: Early recognition of ongoing activities from  In: CVPR (2016)  streaming videos. In: ICCV (2011)   Online Detection of Action Start in Untrimmed, Streaming Videos49. Salimans, T., Goodfellow, I., Zaremba, W., Cheung, V., Radford, A., Chen, X.:  Improved techniques for training gans. In: NIPS (2016)  50. Shou, Z., Wang, D., Chang, S.F.: Temporal action localization in untrimmed videos  via multi-stage cnns. In: CVPR (2016)  51. Shou, Z., Chan, J., Zareian, A., Miyazawa, K., Chang, S.F.: Cdc: Convolutional- de-convolutional networks for precise temporal action localization in untrimmed videos. In: CVPR (2017)  52. Shou, Z., Pan, J., Chan, J., Miyazawa, K., Mansour, H., Vetro, A., Giro-i Nieto, X., Chang, S.F.: Online detection of action start in untrimmed, streaming videos. arXiv preprint arXiv:1802.06822 (2018)  53. Sigurdsson, G.A., Divvala, S., Farhadi, A., Gupta, A.: Asynchronous temporal  fields for action recognition. In: CVPR (2017)  54. Simonyan, K., Zisserman, A.: Two-stream convolutional networks for action recog-  nition in videos. In: NIPS (2014)  55. Singh, G., Saha, S., Cuzzolin, F.: Online real time multiple spatiotemporal action  localisation and prediction on a single platform. In: ICCV (2017)  56. Smeaton, A.F., Over, P., Doherty, A.R.: Video shot boundary detection: Seven years of trecvid activity. Computer Vision and Image Understanding (2010) 57. Soomro, K., Idrees, H., Shah, M.: Predicting the where and what of actors and  actions through online action localization. In: CVPR (2016)  58. Springenberg, J.T.: Unsupervised and semi-supervised learning with categorical  generative adversarial networks. In: ICLR (2016)  59. Sun, C., Shetty, S., Sukthankar, R., Nevatia, R.: Temporal localization of fine- grained actions in videos by domain transfer from web images. In: ACM MM (2015)  60. Tran, D., Bourdev, L., Fergus, R., Torresani, L., Paluri, M.: Learning spatiotem-  poral features with 3d convolutional networks. In: ICCV (2015)  61. Tran, D., Ray, J., Shou, Z., Chang, S.F., Paluri, M.: Convnet architecture search for spatiotemporal feature learning. arXiv preprint arXiv:1708.05038 (2017) 62. Tzeng, E., Hoﬀman, J., Saenko, K., Darrell, T.: Adversarial discriminative domain  63. Vondrick, C., Pirsiavash, H., Torralba, A.: Anticipating the future by watching  adaptation. In: CVPR (2017)  unlabeled video. In: CVPR (2016)  64. Vondrick, C., Torralba, A.: Generating the future with adversarial transformers.  65. Wang, H., Kl¨aser, A., Schmid, C., Liu, C.L.: Action Recognition by Dense Trajec-  66. Wang, H., Schmid, C.: Action recognition with improved trajectories. In: ICCV  67. Wang, L., Xiong, Y., Wang, Z., Qiao, Y., Lin, D., Tang, X., Gool, L.V.: Temporal segment networks: Towards good practices for deep action recognition. In: ECCV (2016)  68. Warhade, K., Merchant, S.N., Desai, U.B., et al.: Video Shot Boundary Detection.  River Publishers (2011)  69. Weinland, D., Ronfard, R., Boyer, E.: A survey of vision-based methods for ac- tion representation, segmentation and recognition. In: Computer Vision and Image Understanding (2011)  70. Xu, H., Das, A., Saenko, K.: R-c3d: Region convolutional 3d network for temporal  71. Xu, Z., Yang, Y., Hauptmann, A.G.: A discriminative cnn video representation for  activity detection. In: ICCV (2017)  event detection. In: CVPR (2015)  In: CVPR (2017)  tories. In: CVPR (2011)  (2013)   18  Z. Shou et al.  72. Yang, Z., Gao, J., Nevatia, R.: Spatio-temporal action detection with cascade pro-  posal and location anticipation. In: BMVC (2017)  73. Yeung, S., Russakovsky, O., Mori, G., Fei-Fei, L.: End-to-end learning of action  detection from frame glimpses in videos. In: CVPR (2016)  74. Yu, G., Yuan, J., Liu, Z.: Predicting human activities using spatio-temporal struc-  ture of interest points. In: ACM MM (2012)  75. Yuan, J., Ni, B., Yang, X., Kassim, A.: Temporal action localization with pyramid  of score distribution features. In: CVPR (2016)  76. Yuan, Z., Stroud, J.C., Lu, T., Deng, J.: Temporal action localization by structured  maximal sums. In: CVPR (2017)  77. Zhao, Y., Xiong, Y., Wang, L., Wu, Z., Tang, X., Lin, D.: Temporal action detection  with structured segment networks. In: ICCV (2017)  78. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation  using cycle-consistent adversarial networks. In: ICCV (2017)"}