{"1": "1. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask R-CNN. In: IEEE International  Conference on Computer Vision (ICCV). (2017) 2980-2988  2. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: Towards real-time object detection with region proposal networks. In: Advances in Neural Information Pro- cessing Systems. (2015) 91-99  3. Huang, J., Rathod, V., Sun, C., Zhu, M., Korattikara, A., Fathi, A., Fischer, I., Wojna, Z., Song, Y., Guadarrama, S., et al.: Speed/accuracy trade-oﬀs for modern convolutional object detectors. In: IEEE CVPR. (2017)  4. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, In: European  P., Zitnick, C.L.: Microsoft COCO: Common objects in context. Conference on Computer Vision, Springer (2014) 740-755  5. Krishna, R., Zhu, Y., Groth, O., Johnson, J., Hata, K., Kravitz, J., Chen, S., Kalantidis, Y., Li, L.J., Shamma, D.A., et al.: Visual genome: Connecting language and vision using crowdsourced dense image annotations. International Journal of Computer Vision 123(1) (2017) 32-73  6. Dai, J., He, K., Sun, J.: Boxsup: Exploiting bounding boxes to supervise convolu- tional networks for semantic segmentation. In: Proceedings of the IEEE Interna- tional Conference on Computer Vision. (2015) 1635-1643  7. Papandreou, G., Chen, L.C., Murphy, K.P., Yuille, A.L.: Weakly-and semi- supervised learning of a deep convolutional network for semantic image segmenta- tion. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 1742-1750  8. Khoreva, A., Benenson, R., Hosang, J., Hein, M., Schiele, B.: Simple does it: Weakly supervised instance and semantic segmentation. In: IEEE International Conference on Computer Vision and Pattern Recognition. (2017) 876-885  9. Rother, C., Kolmogorov, V., Blake, A.: Grabcut: Interactive foreground extraction using iterated graph cuts. In: ACM transactions on graphics (TOG). Volume 23., ACM (2004) 309-314  10. Pont-Tuset, J., Arbelaez, P., Barron, J.T., Marques, F., Malik, J.: Multiscale combinatorial grouping for image segmentation and object proposal generation. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(1) (2017) 128-140  11. Rajchl, M., Lee, M.C., Oktay, O., Kamnitsas, K., Passerat-Palmbach, J., Bai, W., Damodaram, M., Rutherford, M.A., Hajnal, J.V., Kainz, B., et al.: Deepcut: Object segmentation from bounding box annotations using convolutional neural networks. IEEE Transactions on Medical Imaging 36(2) (2017) 674-683  12. Pathak, D., Krahenbuhl, P., Darrell, T.: Constrained convolutional neural networks In: Proceedings of the IEEE International  for weakly supervised segmentation. Conference on Computer Vision. (2015) 1796-1804  13. Wei, Y., Feng, J., Liang, X., Cheng, M.M., Zhao, Y., Yan, S.: Object region mining with adversarial erasing: A simple classification to semantic segmentation approach. In: IEEE CVPR. (2017)  14. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., In: Advances in Neural  Courville, A., Bengio, Y.: Generative adversarial nets. Information Processing Systems. (2014) 2672-2680  15. Karras, T., Aila, T., Laine, S., Lehtinen, J.: Progressive growing of GANs for improved quality, stability, and variation. In: International Conference on Learning Representations (ICLR). (2018)   Learning to Segment via Cut-and-PasteReferences  1. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask R-CNN. In: IEEE International  Conference on Computer Vision (ICCV). (2017) 2980-2988  2. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: Towards real-time object detection with region proposal networks. In: Advances in Neural Information Pro- cessing Systems. (2015) 91-99  3. Huang, J., Rathod, V., Sun, C., Zhu, M., Korattikara, A., Fathi, A., Fischer, I., Wojna, Z., Song, Y., Guadarrama, S., et al.: Speed/accuracy trade-oﬀs for modern convolutional object detectors. In: IEEE CVPR. (2017)  4. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, In: European  P., Zitnick, C.L.: Microsoft COCO: Common objects in context. Conference on Computer Vision, Springer (2014) 740-755  5. Krishna, R., Zhu, Y., Groth, O., Johnson, J., Hata, K., Kravitz, J., Chen, S., Kalantidis, Y., Li, L.J., Shamma, D.A., et al.: Visual genome: Connecting language and vision using crowdsourced dense image annotations. International Journal of Computer Vision 123(1) (2017) 32-73  6. Dai, J., He, K., Sun, J.: Boxsup: Exploiting bounding boxes to supervise convolu- tional networks for semantic segmentation. In: Proceedings of the IEEE Interna- tional Conference on Computer Vision. (2015) 1635-1643  7. Papandreou, G., Chen, L.C., Murphy, K.P., Yuille, A.L.: Weakly-and semi- supervised learning of a deep convolutional network for semantic image segmenta- tion. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 1742-1750  8. Khoreva, A., Benenson, R., Hosang, J., Hein, M., Schiele, B.: Simple does it: Weakly supervised instance and semantic segmentation. In: IEEE International Conference on Computer Vision and Pattern Recognition. (2017) 876-885  9. Rother, C., Kolmogorov, V., Blake, A.: Grabcut: Interactive foreground extraction using iterated graph cuts. In: ACM transactions on graphics (TOG). Volume 23., ACM (2004) 309-314  10. Pont-Tuset, J., Arbelaez, P., Barron, J.T., Marques, F., Malik, J.: Multiscale combinatorial grouping for image segmentation and object proposal generation. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(1) (2017) 128-140  11. Rajchl, M., Lee, M.C., Oktay, O., Kamnitsas, K., Passerat-Palmbach, J., Bai, W., Damodaram, M., Rutherford, M.A., Hajnal, J.V., Kainz, B., et al.: Deepcut: Object segmentation from bounding box annotations using convolutional neural networks. IEEE Transactions on Medical Imaging 36(2) (2017) 674-683  12. Pathak, D., Krahenbuhl, P., Darrell, T.: Constrained convolutional neural networks In: Proceedings of the IEEE International  for weakly supervised segmentation. Conference on Computer Vision. (2015) 1796-1804  13. Wei, Y., Feng, J., Liang, X., Cheng, M.M., Zhao, Y., Yan, S.: Object region mining with adversarial erasing: A simple classification to semantic segmentation approach. In: IEEE CVPR. (2017)  14. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., In: Advances in Neural  Courville, A., Bengio, Y.: Generative adversarial nets. Information Processing Systems. (2014) 2672-2680  15. Karras, T., Aila, T., Laine, S., Lehtinen, J.: Progressive growing of GANs for improved quality, stability, and variation. In: International Conference on Learning Representations (ICLR). (2018)   16  Tal Remez, Jonathan Huang, and Matthew Brown  16. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with condi- tional adversarial networks. In: International Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 1125-1134  17. Luc, P., Couprie, C., Chintala, S., Verbeek, J.: Semantic Segmentation using Ad- versarial Networks. In: NIPS Workshop on Adversarial Training, Barcelona, Spain (December 2016)  18. Hu, R., Doll´ar, P., He, K., Darrell, T., Girshick, R.: Learning to segment every thing. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2018)  19. Dwibedi, D., Misra, I., Hebert, M.: Cut, paste and learn: Surprisingly easy synthesis for instance detection. In: Proceedings of the IEEE International Conference on Computer Vision. (2017) 1301-1310  20. Georgakis, G., Mousavian, A., Berg, A.C., Kosecka, J.: Synthesizing training data In: Robotics Science and Systems (RSS).  for object detection in indoor scenes. (2017)  21. Abu Alhaija, H., Mustikovela, S.K., Mescheder, L., Geiger, A., Rother, C.: Aug- mented reality meets computer vision: Eﬃcient data generation for urban driving scenes. International Journal of Computer Vision (Mar 2018)  22. Mao, X., Li, Q., Xie, H., Lau, R.Y., Wang, Z., Smolley, S.P.: Least squares gener- ative adversarial networks. In: 2017 IEEE International Conference on Computer Vision (ICCV), IEEE (2017) 2813-2821  23. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., et al.: Tensorﬂow: A system for large-scale machine learning. In: OSDI. Volume 16. (2016) 265-283  24. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. In: Interna-  tional Conference on Learning Representations (ICLR). (2015)  25. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward neural networks. In: Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics. (2010) 249-256  26. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The PASCAL Visual Object Classes Challenge 2012 (VOC2012) Results. http://www.pascal-network.org/challenges/VOC/voc2012/workshop/index.html  27. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The Cityscapes dataset for semantic urban scene understanding. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2016)  28. Doersch, C., Gupta, A., Efros, A.A.: Unsupervised visual representation learning by context prediction. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 1422-1430  29. Tung, H.Y.F., Harley, A.W., Seto, W., Fragkiadaki, K.: Adversarial inverse graph- ics networks: Learning 2d-to-3d lifting and image-to-image translation from un- paired supervision. In: The IEEE International Conference on Computer Vision (ICCV). Volume 2. (2017)"}