{"1": "ing 33, 25  1. Abdulnabi, A.H., Wang, G., Lu, J., Jia, K.: Multi-task cnn model for attribute  prediction. IEEE Transactions on Multimedia 17(11), 1949-1959 (2015)  2. Anoop, R.S.C.B.F., Gould, C.S.: Deeppermnet: Visual permutation learning. learn-   14  Z. Meng et al.  Table 5. Relative attribute learning evaluated on UT-Zappos50K-lexicon dataset. It contains 50025 images of shoes with annotations on 4000 ordered pairs for each of 10 fine-grained attributes. The method in [2] does not directly work on this dataset because of its “ordered sequence” requirement on the input data.  Souri et al.[3] 88.93  Method  Ours  comfort casual simple sporty colorful durable supportive bold sleek open Mean 88.40 88.27 86.80 89.31 89.27 88.00 87.53 89.13 90.07 90.07  91.67 89.20 88.27 91.33 88.80 89.82 90.13 92.60 91.87  91.00 92.73  5 Conclusions  We presented a simple framework that can perform both relative attribute learn- ing and attribute prediction. To exploit the underlying relationships between latent representations of a variety of attributes among a collection of images in a dataset, we proposed a simple framework based on natural instantiation of graph neural network. This formulation of a graph neural network can eﬀectively encode the correlational information among multiple images and the multiple attributes as demonstrated in our experiments on three diﬀerent datasets. Our framework can be used to learn the relative attributes either one at a time or all at once with only a modest increase in the number of parameters compared to other multi-task based methods. Because our framework learns mainly from pairs of images and does not require a full ranking it concurrently is less stringent on the annotation requirements of the training dataset. To the best of our knowl- edge, this proposal is among the first to explore the eﬃcacy of multi-task GNN formulations for relative attribute learning. Our experiments also demonstrate the eﬀectiveness of this architecture in achieving or surpassing the state-of-the- art results even for binary attributes prediction, where each attribute is predicted in a binary classification setup. The project webpage includes results on other applications, including predicting body mass index (BMI) that were not covered in detail in the main paper.  6 Acknowledgment  This work was partially supported by funding from American Family Insurance and UW CPCP AI117924. Partial support from NSF CAREER award 1252725, NIH grants R01 AG040396, BRAIN Initiative R01-EB022883, and Waisman ID- DRC U54-HD090256 is also acknowledged. The authors are grateful to Haoliang Sun for help with illustrations and other suggestions/advice on this project. The code will appear in https://github.com/zihangm/RAL_GNN.  References  ing 33, 25  1. Abdulnabi, A.H., Wang, G., Lu, J., Jia, K.: Multi-task cnn model for attribute  prediction. IEEE Transactions on Multimedia 17(11), 1949-1959 (2015)  2. Anoop, R.S.C.B.F., Gould, C.S.: Deeppermnet: Visual permutation learning. learn-   Graph Neural Networks for Relative Attribute Learning3. Bronstein, M.M., Bruna, J., LeCun, Y., Szlam, A., Vandergheynst, P.: Geometric deep learning: going beyond euclidean data. IEEE Signal Processing Magazine 34(4), 18-42 (2017)  4. Burges, C., Shaked, T., Renshaw, E., Lazier, A., Deeds, M., Hamilton, N., Hul- lender, G.: Learning to rank using gradient descent. In: Proceedings of the 22nd international conference on Machine learning. pp. 89-96. ACM (2005)  5. Chen, H., Gallagher, A., Girod, B.: Describing clothing by semantic attributes. In:  European conference on computer vision. pp. 609-623. Springer (2012)  6. Farhadi, A., Endres, I., Hoiem, D., Forsyth, D.: Describing objects by their at- tributes. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on. pp. 1778-1785. IEEE (2009)  7. Frieze, A., Karo´nski, M.: Introduction to random graphs. Cambridge University  8. Garcia, V., Bruna, J.: Few-shot learning with graph neural networks. arXiv preprint  Press (2015)  arXiv:1711.04043 (2017)  9. Gilmer, J., Schoenholz, S.S., Riley, P.F., Vinyals, O., Dahl, G.E.: Neural message  passing for quantum chemistry. arXiv preprint arXiv:1704.01212 (2017)  10. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward neural networks. In: Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics. pp. 249-256 (2010)  11. Gori, M., Monfardini, G., Scarselli, F.: A new model for learning in graph domains. In: Neural Networks, 2005. IJCNN’05. Proceedings. 2005 IEEE International Joint Conference on. vol. 2, pp. 729-734. IEEE (2005)  12. Han, H., Jain, A.K., Shan, S., Chen, X.: Heterogeneous face attribute estimation: A deep multi-task learning approach. IEEE transactions on pattern analysis and machine intelligence (2017)  13. Jamieson, K.G., Jain, L., Fernandez, C., Glattard, N.J., Nowak, R.: Next: A sys- tem for real-world development, evaluation, and application of active learning. In: Advances in Neural Information Processing Systems. pp. 2656-2664 (2015)  14. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  15. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Advances in neural information processing systems. pp. 1097-1105 (2012)  16. Li, Y., Tarlow, D., Brockschmidt, M., Zemel, R.: Gated graph sequence neural  networks. arXiv preprint arXiv:1511.05493 (2015)  17. Oliva, A., Torralba, A.: Modeling the shape of the scene: A holistic representation of the spatial envelope. International journal of computer vision 42(3), 145-175 (2001)  18. Parikh, D., Grauman, K.: Relative attributes. In: Computer Vision (ICCV), 2011  IEEE International Conference on. pp. 503-510. IEEE (2011)  19. Scarselli, F., Gori, M., Tsoi, A.C., Hagenbuchner, M., Monfardini, G.: The graph neural network model. IEEE Transactions on Neural Networks 20(1), 61-80 (2009) 20. Singh, K.K., Lee, Y.J.: End-to-end localization and ranking for relative attributes. In: European Conference on Computer Vision. pp. 753-769. Springer (2016) 21. Souri, Y., Noury, E., Adeli, E.: Deep relative attributes. In: Asian Conference on  Computer Vision. pp. 118-133. Springer (2016)  22. Wang, F., Han, H., Shan, S., Chen, X.: Deep multi-task learning for joint prediction of heterogeneous face attributes. In: Automatic Face & Gesture Recognition (FG 2017), 2017 12th IEEE International Conference on. pp. 173-179. IEEE (2017)   16  Z. Meng et al.  23. Xiao, F., Jae Lee, Y.: Discovering the spatial extent of relative attributes. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 1458- 1466 (2015)  24. Yu, A., Grauman, K.: Fine-grained visual comparisons with local learning. In:  Computer Vision and Pattern Recognition (CVPR) (Jun 2014)  25. Yu, A., Grauman, K.: Semantic jitter: Dense supervision for visual comparisons via synthetic images. In: International Conference on Computer Vision (ICCV) (Oct 2017)"}