{"1": "1. Altwaijry, H., Veit, A., Belongie, S.J., Tech, C.: Learning to detect and match  keypoints with deep architectures. In: BMVC (2016) 4  2. Andriluka, M., Pishchulin, L., Gehler, P., Schiele, B.: 2d human pose estimation: New benchmark and state of the art analysis. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2014) 7, 8  3. Bourdev, L., Maji, S., Brox, T., Malik, J.: Detecting people using mutually consis- tent poselet activations. In: European conference on computer vision. pp. 168-181. Springer (2010) 7, 9  4. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR. vol. 1, p. 7 (2017) 1, 3, 6  5. Cignoni,  P.,  Callieri, M.,  Corsini, M., Dellepiane, M., Ganov- an Open-Source Mesh Process- elli, F., Ranzuglia, G.: MeshLab: (eds.) Eurograph- ing Tool. ics Italian Chapter Conference. The Eurographics Association (2008). https://doi.org/10.2312/LocalChapterEvents/ItalChap/ItalianChapConf2008/129- 136 7  In: Scarano, V., Chiara, R.D., Erra, U.  6. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016) 11  7. Horn, B.K.: Closed-form solution of absolute orientation using unit quaternions.  JOSA A 4(4), 629-642 (1987) 8  8. Huang, X., Shen, C., Boix, X., Zhao, Q.: Salicon: Reducing the semantic gap in  saliency prediction by adapting deep neural networks. In: ICCV (2015) 4  9. Kanazawa, A., Tulsiani, S., Efros, A.A., Malik, J.: Learning category-specific mesh  reconstruction from image collections. arXiv (2018) 1  10. Kar, A., Tulsiani, S., Carreira, J., Malik, J.: Category-specific object reconstruction from a single image. In: Computer Vision and Pattern Regognition (CVPR) (2015) 1  11. Kendall, A., Grimes, M., Cipolla, R.: Posenet: A convolutional network for real- time 6-dof camera relocalization. In: Computer Vision (ICCV), 2015 IEEE Inter- national Conference on. pp. 2938-2946. IEEE (2015) 3  12. Lepetit, V., Moreno-Noguer, F., Fua, P.: Epnp: An accurate o (n) solution to the pnp problem. International journal of computer vision 81(2), 155 (2009) 3, 4 13. Li, S., Chan, A.B.: 3d human pose estimation from monocular images with deep convolutional neural network. In: Asian Conference on Computer Vision. pp. 332- 347. Springer (2014) 3  14. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision. pp. 740-755. Springer (2014) 7  15. Long, J.L., Zhang, N., Darrell, T.: Do convnets learn correspondence? In: Advances in Neural Information Processing Systems. pp. 1601-1609 (2014) 1, 3, 9, 10, 12 16. Lowe, D.G.: Distinctive image features from scale-invariant keypoints. Interna-  tional journal of computer vision 60(2), 91-110 (2004) 4, 12  17. Lu, C.P., Hager, G.D., Mjolsness, E.: Fast and globally convergent pose estimation from video images. IEEE Transactions on Pattern Analysis and Machine Intelli- gence 22(6), 610-622 (2000) 3  18. Mahendran, S., Ali, H., Vidal, R.: Joint object category and 3d pose estimation  from 2d images. arXiv preprint arXiv:1711.07426 (2017) 11   StarMapReferences  1. Altwaijry, H., Veit, A., Belongie, S.J., Tech, C.: Learning to detect and match  keypoints with deep architectures. In: BMVC (2016) 4  2. Andriluka, M., Pishchulin, L., Gehler, P., Schiele, B.: 2d human pose estimation: New benchmark and state of the art analysis. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2014) 7, 8  3. Bourdev, L., Maji, S., Brox, T., Malik, J.: Detecting people using mutually consis- tent poselet activations. In: European conference on computer vision. pp. 168-181. Springer (2010) 7, 9  4. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR. vol. 1, p. 7 (2017) 1, 3, 6  5. Cignoni,  P.,  Callieri, M.,  Corsini, M., Dellepiane, M., Ganov- an Open-Source Mesh Process- elli, F., Ranzuglia, G.: MeshLab: (eds.) Eurograph- ing Tool. ics Italian Chapter Conference. The Eurographics Association (2008). https://doi.org/10.2312/LocalChapterEvents/ItalChap/ItalianChapConf2008/129- 136 7  In: Scarano, V., Chiara, R.D., Erra, U.  6. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016) 11  7. Horn, B.K.: Closed-form solution of absolute orientation using unit quaternions.  JOSA A 4(4), 629-642 (1987) 8  8. Huang, X., Shen, C., Boix, X., Zhao, Q.: Salicon: Reducing the semantic gap in  saliency prediction by adapting deep neural networks. In: ICCV (2015) 4  9. Kanazawa, A., Tulsiani, S., Efros, A.A., Malik, J.: Learning category-specific mesh  reconstruction from image collections. arXiv (2018) 1  10. Kar, A., Tulsiani, S., Carreira, J., Malik, J.: Category-specific object reconstruction from a single image. In: Computer Vision and Pattern Regognition (CVPR) (2015) 1  11. Kendall, A., Grimes, M., Cipolla, R.: Posenet: A convolutional network for real- time 6-dof camera relocalization. In: Computer Vision (ICCV), 2015 IEEE Inter- national Conference on. pp. 2938-2946. IEEE (2015) 3  12. Lepetit, V., Moreno-Noguer, F., Fua, P.: Epnp: An accurate o (n) solution to the pnp problem. International journal of computer vision 81(2), 155 (2009) 3, 4 13. Li, S., Chan, A.B.: 3d human pose estimation from monocular images with deep convolutional neural network. In: Asian Conference on Computer Vision. pp. 332- 347. Springer (2014) 3  14. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision. pp. 740-755. Springer (2014) 7  15. Long, J.L., Zhang, N., Darrell, T.: Do convnets learn correspondence? In: Advances in Neural Information Processing Systems. pp. 1601-1609 (2014) 1, 3, 9, 10, 12 16. Lowe, D.G.: Distinctive image features from scale-invariant keypoints. Interna-  tional journal of computer vision 60(2), 91-110 (2004) 4, 12  17. Lu, C.P., Hager, G.D., Mjolsness, E.: Fast and globally convergent pose estimation from video images. IEEE Transactions on Pattern Analysis and Machine Intelli- gence 22(6), 610-622 (2000) 3  18. Mahendran, S., Ali, H., Vidal, R.: Joint object category and 3d pose estimation  from 2d images. arXiv preprint arXiv:1711.07426 (2017) 11   16  Zhou X., Karpur A., Luo L., Huang Q.  19. Mousavian, A., Anguelov, D., Flynn, J., Koˇseck´a, J.: 3d bounding box estimation using deep learning and geometry. In: Computer Vision and Pattern Recognition (CVPR), 2017 IEEE Conference on. pp. 5632-5640. IEEE (2017) 3, 4, 10, 11 20. Newell, A., Deng, J.: Pixels to graphs by associative embedding. In: Advances in  Neural Information Processing Systems. pp. 2168-2177 (2017) 8  21. Newell, A., Huang, Z., Deng, J.: Associative embedding: End-to-end learning for joint detection and grouping. In: Advances in Neural Information Processing Sys- tems. pp. 2274-2284 (2017) 3, 6, 8  22. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose estima- tion. In: European Conference on Computer Vision. pp. 483-499. Springer (2016) 1, 3, 4, 5, 8, 10  23. Papadopoulos, D.P., Uijlings, J.R., Keller, F., Ferrari, V.: Extreme clicking for eﬃcient object annotation. In: 2017 IEEE International Conference on Computer Vision (ICCV). pp. 4940-4949. IEEE (2017) 7  24. Pavlakos, G., Zhou, X., Chan, A., Derpanis, K.G., Daniilidis, K.: 6-dof object pose from semantic keypoints. In: Robotics and Automation (ICRA), 2017 IEEE International Conference on. pp. 2011-2018. IEEE (2017) 1, 2, 3, 4, 5, 7, 10, 11, 12  25. Pavlakos, G., Zhou, X., Derpanis, K.G., Daniilidis, K.: Coarse-to-fine volumet- ric prediction for single-image 3d human pose. In: Computer Vision and Pattern Recognition (CVPR), 2017 IEEE Conference on. pp. 1263-1272. IEEE (2017) 1, 3 26. Ronchi, M.R., Perona, P.: Benchmarking and error diagnosis in multi-instance pose estimation. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017) 10  27. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014) 11, 12  28. Su, H., Qi, C.R., Li, Y., Guibas, L.J.: Render for cnn: Viewpoint estimation in images using cnns trained with rendered 3d model views. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 2686-2694 (2015) 3, 4, 9, 10, 11  29. Szeto, R., Corso, J.J.: Click here: Human-localized keypoints as guidance for view-  point estimation. arXiv preprint arXiv:1703.09859 (2017) 4  30. Taylor, J., Shotton, J., Sharp, T., Fitzgibbon, A.: The vitruvian manifold: Inferring dense correspondences for one-shot human pose estimation. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on. pp. 103-110. IEEE (2012) 6  31. Tompson, J., Goroshin, R., Jain, A., LeCun, Y., Bregler, C.: Eﬃcient object local- ization using convolutional networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 648-656 (2015) 3  32. Tompson, J.J., Jain, A., LeCun, Y., Bregler, C.: Joint training of a convolutional network and a graphical model for human pose estimation. In: Advances in neural information processing systems. pp. 1799-1807 (2014) 3, 4, 5  33. Toshev, A., Szegedy, C.: Deeppose: Human pose estimation via deep neural net- works. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 1653-1660 (2014) 3, 4  34. Tulsiani, S., Carreira, J., Malik, J.: Pose induction for novel object categories. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 64-72 (2015) 11, 14  35. Tulsiani, S., Malik, J.: Viewpoints and keypoints. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1510-1519 (2015) 1, 2, 3, 4, 5, 9, 10, 11   StarMap36. Tulsiani, S., Zhou, T., Efros, A.A., Malik, J.: Multi-view supervision for single-view reconstruction via diﬀerentiable ray consistency. In: Computer Vision and Pattern Regognition (CVPR) (2017) 1  37. Wei, L., Huang, Q., Ceylan, D., Vouga, E., Li, H.: Dense human body corre- spondences using convolutional networks. In: 2016 IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2016, Las Vegas, NV, USA, June 27-30, 2016. pp. 1544-1553 (2016) 6  38. Wei, S.E., Ramakrishna, V., Kanade, T., Sheikh, Y.: Convolutional pose machines. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recog- nition. pp. 4724-4732 (2016) 3  39. Wu, J., Wang, Y., Xue, T., Sun, X., Freeman, W.T., Tenenbaum, J.B.: MarrNet: 3D Shape Reconstruction via 2.5D Sketches. In: Advances In Neural Information Processing Systems (2017) 1, 3  40. Wu, J., Xue, T., Lim, J.J., Tian, Y., Tenenbaum, J.B., Torralba, A., Freeman, W.T.: Single image 3d interpreter network. In: European Conference on Computer Vision. pp. 365-382. Springer (2016) 1, 3, 5  41. Xiang, Y., Kim, W., Chen, W., Ji, J., Choy, C., Su, H., Mottaghi, R., Guibas, L., Savarese, S.: Objectnet3d: A large scale database for 3d object recognition. In: European Conference on Computer Vision. pp. 160-176. Springer (2016) 2, 7, 14 42. Xiang, Y., Mottaghi, R., Savarese, S.: Beyond pascal: A benchmark for 3d object detection in the wild. In: Applications of Computer Vision (WACV), 2014 IEEE Winter Conference on. pp. 75-82. IEEE (2014) 2, 6, 7, 9, 11, 12, 13, 14  43. Xu, K., Ba, J., Kiros, R., Cho, K., Courville, A., Salakhudinov, R., Zemel, R., Bengio, Y.: Show, attend and tell: Neural image caption generation with visual attention. In: International Conference on Machine Learning. pp. 2048-2057 (2015) 4  44. Yang, W., Li, S., Ouyang, W., Li, H., Wang, X.: Learning feature pyramids for hu- man pose estimation. In: The IEEE International Conference on Computer Vision (ICCV). vol. 2 (2017) 3  45. Yi, L., Kim, V.G., Ceylan, D., Shen, I., Yan, M., Su, H., Lu, C., Huang, Q., Sheﬀer, A., Guibas, L., et al.: A scalable active framework for region annotation in 3d shape collections. ACM Transactions on Graphics (TOG) 35(6), 210 (2016) 7  46. Yuan, S., Garcia-Hernando, G., Stenger, B., Moon, G., Chang, J.Y., Lee, K.M., Molchanov, P., Kautz, J., Honari, S., Ge, L., et al.: 3d hand pose estimation: From current achievements to future goals. arXiv preprint arXiv:1712.03917 (2017) 1 47. Zhang, N., Donahue, J., Girshick, R., Darrell, T.: Part-based r-cnns for fine-grained category detection. In: European conference on computer vision. pp. 834-849. Springer (2014) 1  48. Zhou, T., Krahenbuhl, P., Aubry, M., Huang, Q., Efros, A.A.: Learning dense corre- spondence via 3d-guided cycle consistency. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 117-126 (2016) 5  49. Zhou, X., Huang, Q., Sun, X., Xue, X., Wei, Y.: Towards 3d human pose estimation in the wild: A weakly-supervised approach. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017) 3, 7  50. Zhou, X., Karpur, A., Gan, C., Luo, L., Huang, Q.: Unsupervised domain adaptation for 3d keypoint prediction from a single depth scan. arXiv preprint arXiv:1712.05765 (2017) 3  51. Zhou, X., Sun, X., Zhang, W., Liang, S., Wei, Y.: Deep kinematic pose regression.  arXiv preprint arXiv:1609.05317 (2016) 1  52. Zhou, X., Wan, Q., Zhang, W., Xue, X., Wei, Y.: Model-based deep hand pose  estimation. arXiv preprint arXiv:1606.06854 (2016) 1"}