{"1": "1. Al-Halah, Z., Stiefelhagen, R., Grauman, K.: Fashion forward: Forecasting visual  style in fashion. In: ICCV (2017)  2. Bell, S., Bala, K.: Learning visual similarity for product design with convolutional  neural networks. ACM Trans. on Graphics (SIGGRAPH) 34(4) (2015)  3. Bromley, J., Bentz, J., Bottou, L., Guyon, I., LeCun, Y., Moore, C., S¨ackinger, E., Shah, R.: Signature verification using a ”siamese” time delay neural network. In: IJPRAI (1993)  4. Chen, H., Gallagher, A., Girod, B.: Describing clothing by semantic attributes. In:  ECCV (2012)  5. Chen, Q., Huang, J., Feris, R., Brown, L.M., Dong, J., Yan, S.: Deep domain adap- tation for describing people based on fine-grained clothing attributes. In: CVPR (2015)  6. Corbiere, C., Ben-Younes, H., Rame, A., Ollion, C.: Leveraging weakly annotated data for fashion image retrieval and label prediction. In: ICCV Workshops (2017) 7. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: CVPR (2009)  8. Di, W., Wah, C., Bhardwaj, A., Piramuthu, R., Sundaresan, N.: Style finder: Fine-  grained clothing style detection and retrieval. In: CVPR Workshops (2013)  9. Garcia, N., Vogiatzis, G.: Dress like a star: Retrieving fashion products from videos.  In: ICCV Workshops (2017)  10. Gomez, L., Patel, Y., Rusinol, M., Karatzas, D., Jawahar, C.V.: Self-supervised learning of visual features through embedding images into text topic spaces. In: CVPR (2017)  11. Hadi Kiapour, M., Han, X., Lazebnik, S., Berg, A.C., Berg, T.L.: Where to buy it:  Matching street clothing photos in online shops. In: ICCV (2015)  12. Han, X., Wu, Z., Jiang, Y.G., Davis, L.S.: Learning fashion compatibility with  bidirectional lstms. In: ACM MM (2017)  13. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  14. He, R., Packer, C., McAuley, J.: Learning compatibility across categories for het- erogeneous item recommendation. In: International Conference on Data Mining (2016)  15. Hsiao, W.L., Grauman, K.: Learning the latent ”look”: Unsupervised discovery of  a style-coherent embedding from fashion images. In: ICCV (2017)  16. Kiapour, M.H., Yamaguchi, K., Berg, A.C., Berg, T.L.: Hipster wars: Discovering  elements of fashion styles. In: ECCV (2014)  17. Klein, B., Lev, G., Sadeh, G., Wolf, L.: Fisher vectors derived from hybrid gaussian-  laplacian mixture models for image annotation. In: CVPR (2015)  18. Li, Y., Cao, L., Zhu, J., Luo, J.: Mining fashion outfit composition using an end-to- end deep learning approach on set data. IEEE Trans. Multimedia 19(8), 1946-1955 (2017)  19. Liu, S., Feng, J., Song, Z., Zhang, T., Lu, H., Xu, C., Yan, S.: Hi, magic closet,  tell me what to wear! In: ACM MM (2012)  20. Liu, Z., Luo, P., Qiu, S., Wang, X., Tang, X.: Deepfashion: Powering robust clothes  recognition and retrieval with rich annotations. In: CVPR (2016)  21. van der Maaten, L., Hinton, G.E.: Visualizing high-dimensional data using t-SNE.  JMLR 9, 2579-2605 (2008)   Learning Type-Aware Embeddings for Fashion CompatibilityReferences  1. Al-Halah, Z., Stiefelhagen, R., Grauman, K.: Fashion forward: Forecasting visual  style in fashion. In: ICCV (2017)  2. Bell, S., Bala, K.: Learning visual similarity for product design with convolutional  neural networks. ACM Trans. on Graphics (SIGGRAPH) 34(4) (2015)  3. Bromley, J., Bentz, J., Bottou, L., Guyon, I., LeCun, Y., Moore, C., S¨ackinger, E., Shah, R.: Signature verification using a ”siamese” time delay neural network. In: IJPRAI (1993)  4. Chen, H., Gallagher, A., Girod, B.: Describing clothing by semantic attributes. In:  ECCV (2012)  5. Chen, Q., Huang, J., Feris, R., Brown, L.M., Dong, J., Yan, S.: Deep domain adap- tation for describing people based on fine-grained clothing attributes. In: CVPR (2015)  6. Corbiere, C., Ben-Younes, H., Rame, A., Ollion, C.: Leveraging weakly annotated data for fashion image retrieval and label prediction. In: ICCV Workshops (2017) 7. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: CVPR (2009)  8. Di, W., Wah, C., Bhardwaj, A., Piramuthu, R., Sundaresan, N.: Style finder: Fine-  grained clothing style detection and retrieval. In: CVPR Workshops (2013)  9. Garcia, N., Vogiatzis, G.: Dress like a star: Retrieving fashion products from videos.  In: ICCV Workshops (2017)  10. Gomez, L., Patel, Y., Rusinol, M., Karatzas, D., Jawahar, C.V.: Self-supervised learning of visual features through embedding images into text topic spaces. In: CVPR (2017)  11. Hadi Kiapour, M., Han, X., Lazebnik, S., Berg, A.C., Berg, T.L.: Where to buy it:  Matching street clothing photos in online shops. In: ICCV (2015)  12. Han, X., Wu, Z., Jiang, Y.G., Davis, L.S.: Learning fashion compatibility with  bidirectional lstms. In: ACM MM (2017)  13. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  14. He, R., Packer, C., McAuley, J.: Learning compatibility across categories for het- erogeneous item recommendation. In: International Conference on Data Mining (2016)  15. Hsiao, W.L., Grauman, K.: Learning the latent ”look”: Unsupervised discovery of  a style-coherent embedding from fashion images. In: ICCV (2017)  16. Kiapour, M.H., Yamaguchi, K., Berg, A.C., Berg, T.L.: Hipster wars: Discovering  elements of fashion styles. In: ECCV (2014)  17. Klein, B., Lev, G., Sadeh, G., Wolf, L.: Fisher vectors derived from hybrid gaussian-  laplacian mixture models for image annotation. In: CVPR (2015)  18. Li, Y., Cao, L., Zhu, J., Luo, J.: Mining fashion outfit composition using an end-to- end deep learning approach on set data. IEEE Trans. Multimedia 19(8), 1946-1955 (2017)  19. Liu, S., Feng, J., Song, Z., Zhang, T., Lu, H., Xu, C., Yan, S.: Hi, magic closet,  tell me what to wear! In: ACM MM (2012)  20. Liu, Z., Luo, P., Qiu, S., Wang, X., Tang, X.: Deepfashion: Powering robust clothes  recognition and retrieval with rich annotations. In: CVPR (2016)  21. van der Maaten, L., Hinton, G.E.: Visualizing high-dimensional data using t-SNE.  JMLR 9, 2579-2605 (2008)   16  Vasileva et al .  22. Mikolov, T., Chen, K., Corrado, G., Dean, J.: Eﬃcient estimation of word repre-  sentations in vector space. arXiv:1301.3781 (2013)  23. M.Schultz, Joachims, T.: Learning a distance metric from relative comparisons. In:  NIPS (2003)  24. Rubio, A., Yu, L., Simo-Serra, E., Moreno-Noguer, F.: Multi-modal embedding for  main product detection in fashion. In: ICCV Workshops (2017)  25. Salvador, A., Hynes, N., Aytar, Y., Marin, J., Oﬂi, F., Weber, I., Torralba, A.: Learning cross-modal embeddings for cooking recipes and food images. In: CVPR (2017)  26. Schroﬀ, F., Kalenichenko, D., Philbin, J.: Facenet: A unified embedding for face  recognition and clustering. In: CVPR (2015)  27. Simo-Serra, E., Fidler, S., Moreno-Noguer, F., Urtasun, R.: Neuroaesthetics in  fashion: Modeling the perception of fashionability. In: CVPR (2015)  28. Simo-Serra, E., Ishikawa, H.: Fashion style in 128 ﬂoats: Joint ranking and classi-  fication using weak data for feature extraction. In: CVPR (2016)  29. Singh, K.K., Lee, Y.J.: End-to-end localization and ranking for relative attributes.  In: ECCV (2016)  30. Song, Y., Li, Y., Wu, B., Chen, C.Y., Zhang, X., Adam, H.: Learning unified  embedding for apparel recognition. In: ICCV Workshops (2017)  31. Szegedy, C., Vanhoucke, V., Ioﬀe, S., Shlens, J., Wojna, Z.: Rethinking the incep-  tion architecture for computer vision. In: CVPR (2016)  32. Vaccaro, K., Shivakumar, S., Ding, Z., Karahalios, K., Kumar, R.: The elements of fashion style. In: Proceedings of the 29th Annual Symposium on User Interface Software and Technology (2016)  33. Veit, A., Belongie, S., Karaletsos, T.: Conditional similarity networks. In: CVPR  (2017)  34. Veit, A., Kovacs, B., Bell, S., McAuley, J., Bala, K., Belongie, S.: Learning visual  clothing style with heterogeneous dyadic co-occurrences. In: ICCV (2015)  35. Wu, C.Y., Manmatha, R., Smola, A.J., Krahenbuhl, P.: Sampling matters in deep  embedding learning. In: ICCV (2017)  36. Xiao, H., Huang, M., Zhu, X.: Ssp: Semantic space projection for knowledge graph  embedding with text descriptions. In: AAAI (2017)  37. Yamaguchi, K., Okatani, T., Sudo, K., Murasaki, K., Taniguchi, Y.: Mix and match: Joint model for clothing and attribute recognition. In: BMVC (2015) 38. Yu, A., Grauman, K.: Fine-Grained Visual Comparisons with Local Learning. In:  CVPR (2014)  (2015)  39. Yu, A., Grauman, K.: Just noticeable diﬀerences in visual attributes. In: ICCV  40. Yu, A., Grauman, K.: Semantic jitter: Dense supervision for visual comparisons  via synthetic images. In: ICCV (2017)  41. Zhao, B., Feng, J., Wu, X., Yan, S.: Memory-augmented attribute manipulation  networks for interactive fashion search. In: CVPR (2017)  42. Zhu, S., Urtasun, R., Fidler, S., Lin, D., Change Loy, C.: Be your own prada:  Fashion synthesis with structural coherence. In: ICCV (2017)  43. Zhuang, B., Lin, G., Shen, C., Reid, I.: Fast training of triplet-based deep binary  embedding networks. In: CVPR (2016)"}