{"1": "1. Alemdar, H., Leroy, V., Prost-Boucle, A., P´etrot, F.: Ternary neural networks for resource-eﬃcient ai applications. In: Neural Networks (IJCNN), 2017 International Joint Conference on. pp. 2547-2554. IEEE (2017) 4, 5, 9  2. Ambai, M., Matsumoto, T., Yamashita, T., Fujiyoshi, H.: Ternary weight decom- position and binary activation encoding for fast and compact neural network. In: Proc. Int. Conf. Learn. Represent. (2017) 2  3. Bagherinezhad, H., Rastegari, M., Farhadi, A.: Lcnn: Lookup-based convolutional  neural network. In: Proc. IEEE Conf. Comp. Vis. Patt. Recogn. (2017) 9  4. Bengio, Y., L´eonard, N., Courville, A.: Estimating or propagating gradi- ents through stochastic neurons for conditional computation. arXiv preprint arXiv:1308.3432 (2013) 8  5. Courbariaux, M., Bengio, Y., David, J.: Low precision arithmetic for deep learning.  CoRR, abs/1412.7024 4 (2014) 2  6. Courbariaux, M., Bengio, Y., David, J.P.: Binaryconnect: Training deep neural net- works with binary weights during propagations. In: Proc. Adv. Neural Inf. Process. Syst. pp. 3123-3131 (2015) 4, 9  7. Courbariaux, M., Hubara, I., Soudry, D., El-Yaniv, R., Bengio, Y.: Binarized neural networks: Training deep neural networks with weights and activations constrained to+ 1 or-1. In: Proc. Adv. Neural Inf. Process. Syst. pp. 4107-4115 (2016) 2, 4, 8, 9  8. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully con- volutional networks. In: Proc. Adv. Neural Inf. Process. Syst. pp. 379-387 (2016) 1  9. Deng, L., Jiao, P., Pei, J., Wu, Z., Li, G.: Gated xnor networks: Deep neural net- works with ternary weights and activations under a unified discretization frame- work. arXiv preprint arXiv:1705.09283 (2017) 4, 9  10. Denil, M., Shakibi, B., Dinh, L., De Freitas, N., et al.: Predicting parameters in deep learning. In: Proc. Adv. Neural Inf. Process. Syst. pp. 2148-2156 (2013) 2 11. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The PASCAL Visual Object Classes Challenge 2007 (VOC2007) Results. http://www.pascal-network.org/challenges/VOC/voc2007/workshop/index.html 11  12. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The PASCAL Visual Object Classes Challenge 2012 (VOC2012) Results. http://www.pascal-network.org/challenges/VOC/voc2012/workshop/index.html 11  13. Girshick, R.: Fast r-cnn. In: Proc. IEEE Conf. Comp. Vis. pp. 1440-1448 (2015) 1 14. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: Proc. IEEE Conf. Comp. Vis. Patt. Recogn. pp. 580-587 (2014) 1  15. Gupta, S., Agrawal, A., Gopalakrishnan, K., Narayanan, P.: Deep learning with limited numerical precision. In: Proc. Int. Conf. Mach. Learn. pp. 1737-1746 (2015) 2  16. Han, S., Mao, H., Dally, W.J.: Deep compression: Compressing deep neural net- works with pruning, trained quantization and huﬀman coding. In: Proc. Int. Conf. Learn. Represent. (2016) 2  17. Han, S., Pool, J., Tran, J., Dally, W.: Learning both weights and connections for eﬃcient neural network. In: Proc. Adv. Neural Inf. Process. Syst. pp. 1135-1143 (2015) 2   TBNReferences  1. Alemdar, H., Leroy, V., Prost-Boucle, A., P´etrot, F.: Ternary neural networks for resource-eﬃcient ai applications. In: Neural Networks (IJCNN), 2017 International Joint Conference on. pp. 2547-2554. IEEE (2017) 4, 5, 9  2. Ambai, M., Matsumoto, T., Yamashita, T., Fujiyoshi, H.: Ternary weight decom- position and binary activation encoding for fast and compact neural network. In: Proc. Int. Conf. Learn. Represent. (2017) 2  3. Bagherinezhad, H., Rastegari, M., Farhadi, A.: Lcnn: Lookup-based convolutional  neural network. In: Proc. IEEE Conf. Comp. Vis. Patt. Recogn. (2017) 9  4. Bengio, Y., L´eonard, N., Courville, A.: Estimating or propagating gradi- ents through stochastic neurons for conditional computation. arXiv preprint arXiv:1308.3432 (2013) 8  5. Courbariaux, M., Bengio, Y., David, J.: Low precision arithmetic for deep learning.  CoRR, abs/1412.7024 4 (2014) 2  6. Courbariaux, M., Bengio, Y., David, J.P.: Binaryconnect: Training deep neural net- works with binary weights during propagations. In: Proc. Adv. Neural Inf. Process. Syst. pp. 3123-3131 (2015) 4, 9  7. Courbariaux, M., Hubara, I., Soudry, D., El-Yaniv, R., Bengio, Y.: Binarized neural networks: Training deep neural networks with weights and activations constrained to+ 1 or-1. In: Proc. Adv. Neural Inf. Process. Syst. pp. 4107-4115 (2016) 2, 4, 8, 9  8. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully con- volutional networks. In: Proc. Adv. Neural Inf. Process. Syst. pp. 379-387 (2016) 1  9. Deng, L., Jiao, P., Pei, J., Wu, Z., Li, G.: Gated xnor networks: Deep neural net- works with ternary weights and activations under a unified discretization frame- work. arXiv preprint arXiv:1705.09283 (2017) 4, 9  10. Denil, M., Shakibi, B., Dinh, L., De Freitas, N., et al.: Predicting parameters in deep learning. In: Proc. Adv. Neural Inf. Process. Syst. pp. 2148-2156 (2013) 2 11. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The PASCAL Visual Object Classes Challenge 2007 (VOC2007) Results. http://www.pascal-network.org/challenges/VOC/voc2007/workshop/index.html 11  12. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The PASCAL Visual Object Classes Challenge 2012 (VOC2012) Results. http://www.pascal-network.org/challenges/VOC/voc2012/workshop/index.html 11  13. Girshick, R.: Fast r-cnn. In: Proc. IEEE Conf. Comp. Vis. pp. 1440-1448 (2015) 1 14. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: Proc. IEEE Conf. Comp. Vis. Patt. Recogn. pp. 580-587 (2014) 1  15. Gupta, S., Agrawal, A., Gopalakrishnan, K., Narayanan, P.: Deep learning with limited numerical precision. In: Proc. Int. Conf. Mach. Learn. pp. 1737-1746 (2015) 2  16. Han, S., Mao, H., Dally, W.J.: Deep compression: Compressing deep neural net- works with pruning, trained quantization and huﬀman coding. In: Proc. Int. Conf. Learn. Represent. (2016) 2  17. Han, S., Pool, J., Tran, J., Dally, W.: Learning both weights and connections for eﬃcient neural network. In: Proc. Adv. Neural Inf. Process. Syst. pp. 1135-1143 (2015) 2   16  D. Wan, F. Shen, L. Liu, F. Zhu, J. Qin, L. Shao, H. Shen  18. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proc. IEEE Conf. Comp. Vis. Patt. Recogn. pp. 770-778 (2016) 1, 10, 11, 12 19. Hinton, G., Vinyals, O., Dean, J.: Distilling the knowledge in a neural network. In: NIPS 2014 Deep Learning and Representation Learning Workshop (2014) 2 20. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: Proc. Int. Conf. Mach. Learn. pp. 448-456 (2015) 8  21. Jaderberg, M., Vedaldi, A., Zisserman, A.: Speeding up convolutional neural net-  works with low rank expansions. In: BMVC (2014) 2  22. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. arXiv preprint arXiv:1408.5093 (2014) 5  23. Jin, J., Dundar, A., Culurciello, E.: Flattened convolutional neural networks for  feedforward acceleration. arXiv preprint arXiv:1412.5474 (2014) 2  24. Juefei-Xu, F., Boddeti, V.N., Savvides, M.: Local binary convolutional neural net-  works. In: Proc. IEEE Conf. Comp. Vis. Patt. Recogn. (2017) 5, 9  25. Kim, M., Smaragdis, P.: Bitwise neural networks. CoRR abs/1601.06071 (2015)(2009) 9  (2015) 1  26. Kim, Y.D., Park, E., Yoo, S., Choi, T., Yang, L., Shin, D.: Compression of deep convolutional neural networks for fast and low power mobile applications. arXiv preprint arXiv:1511.06530 (2015) 2  27. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In: Proc. Int.  Conf. Learn. Represent. (2015) 8  28. Krizhevsky, A., Hinton, G.: Learning multiple layers of features from tiny images  29. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Proc. Adv. Neural Inf. Process. Syst. pp. 1097-1105 (2012) 1  30. Lebedev, V., Ganin, Y., Rakhuba, M., Oseledets, I., Lempitsky, V.: Speeding-up convolutional neural networks using fine-tuned cp-decomposition. In: Proc. Int. Conf. Learn. Represent. (2015) 2  31. LeCun, Y., Bengio, Y., Hinton, G.: Deep learning. Nature 521(7553), 436-444  32. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to document recognition. Proceedings of the IEEE 86(11), 2278-2324 (1998) 9 33. Li, F., Zhang, B., Liu, B.: Ternary weight networks. In: The 1st International  Workshop on Eﬃcient Methods for Deep Neural Networks (2016) 4, 6, 9  34. Li, Z., Ni, B., Zhang, W., Yang, X., Gao, W.: Performance guaranteed network acceleration via high-order residual quantization. In: Proc. IEEE Conf. Comp. Vis. (2017) 4, 8, 9  35. Lin, D., Talathi, S., Annapureddy, S.: Fixed point quantization of deep convolu-  tional networks. In: Proc. Int. Conf. Mach. Learn. pp. 2849-2858 (2016) 2  36. Lin, Z., Courbariaux, M., Memisevic, R., Bengio, Y.: Neural networks with few  multiplications. In: Proc. Int. Conf. Learn. Represent. (2016) 2  37. Liu, L., Shao, L., Shen, F., Yu, M.: Discretely coding semantic rank orders for image hashing. In: Proceeding of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2862-2871 (2017) 1  38. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd: Single shot multibox detector. In: Proc. Eur. Conf. Comp. Vis. pp. 21-37 (2016) 1, 11   TBN39. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proc. IEEE Conf. Comp. Vis. Patt. Recogn. pp. 3431-3440 (2015) 1  40. Netzer, Y., Wang, T., Coates, A., Bissacco, A., Wu, B., Ng, A.Y.: Reading digits in natural images with unsupervised feature learning. In: NIPS workshop on deep learning and unsupervised feature learning. vol. 2011, p. 5 (2011) 9  41. Pinheiro, P.O., Collobert, R., Doll´ar, P.: Learning to segment object candidates.  In: Proc. Adv. Neural Inf. Process. Syst. pp. 1990-1998 (2015) 1  42. Rastegari, M., Ordonez, V., Redmon, J., Farhadi, A.: Xnor-net: Imagenet classi- fication using binary convolutional neural networks. In: Proc. Eur. Conf. Comp. Vis. (2016) 2, 3, 4, 5, 6, 8, 9, 12  43. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de- tection with region proposal networks. In: Proc. Adv. Neural Inf. Process. Syst. pp. 91-99 (2015) 1, 11  44. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recog- nition challenge. Int. J. Comp. Vis. 115(3), 211-252 (2015) 9  45. Shen, F., Gao, X., Liu, L., Yang, Y., Shen, H.T.: Deep asymmetric pairwise hashing. In: Proceedings of the 2017 ACM on Multimedia Conference. pp. 1522-1530. ACM (2017) 1  46. Shen, F., Xu, Y., Liu, L., Yang, Y., Huang, Z., Shen, H.T.: Unsupervised deep hashing with similarity-adaptive and discrete optimization. IEEE transactions on pattern analysis and machine intelligence (2018) 1  47. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. In: Proc. Int. Conf. Learn. Represent. (2015) 1  48. Soudry, D., Hubara, I., Meir, R.: Expectation backpropagation: Parameter-free training of multilayer neural networks with continuous or discrete weights. In: Proc. Adv. Neural Inf. Process. Syst. pp. 963-971 (2014) 2  49. Soudry, D., Hubara, I., Meir, R.: Expectation backpropagation: Parameter-free training of multilayer neural networks with continuous or discrete weights. In: Proc. Adv. Neural Inf. Process. Syst. pp. 963-971 (2014) 4  50. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A.: Going deeper with convolutions. In: Proc. IEEE Conf. Comp. Vis. Patt. Recogn. pp. 1-9 (2015) 1  51. Tang, W., Hua, G., Wang, L.: How to train a compact binary neural network with  high accuracy? In: Proc. AAAI Conf. Artif. Intell. pp. 2625-2631 (2017) 9  52. Wang, P., Cheng, J.: Accelerating convolutional neural networks for mobile appli- cations. In: Proceedings of the 2016 ACM on Multimedia Conference. pp. 541-545. ACM (2016) 2  53. Wang, P., Cheng, J.: Fixed-point factorized networks. In: Proc. IEEE Conf. Comp.  Vis. Patt. Recogn. (2017) 5, 9  54. Wen, W., Wu, C., Wang, Y., Chen, Y., Li, H.: Learning structured sparsity in deep neural networks. In: Proc. Adv. Neural Inf. Process. Syst. pp. 2074-2082 (2016) 2 55. Wu, J., Leng, C., Wang, Y., Hu, Q., Cheng, J.: Quantized convolutional neural networks for mobile devices. In: Proc. IEEE Conf. Comp. Vis. Patt. Recogn. pp. 4820-4828 (2016) 2  56. Wu, J., Leng, C., Wang, Y., Hu, Q., Cheng, J.: Quantized convolutional neural networks for mobile devices. In: Proc. IEEE Conf. Comp. Vis. Patt. Recogn. pp. 4820-4828 (2016) 2   18  D. Wan, F. Shen, L. Liu, F. Zhu, J. Qin, L. Shao, H. Shen  57. Zhang, X., Zou, J., He, K., Sun, J.: Accelerating very deep convolutional networks for classification and detection. IEEE Trans. Pattern Anal. Mach. Intell. 38(10), 1943-1955 (2016) 2  58. Zhou, A., Yao, A., Guo, Y., Xu, L., Chen, Y.: Incremental network quantization: Towards lossless cnns with low-precision weights. In: Proc. Int. Conf. Learn. Rep- resent. (2017) 2  59. Zhou, S., Wu, Y., Ni, Z., Zhou, X., Wen, H., Zou, Y.: Dorefa-net: Training low bitwidth convolutional neural networks with low bitwidth gradients. In: Proc. IEEE Conf. Comp. Vis. Patt. Recogn. (2016) 4, 9  60. Zhu, C., Han, S., Mao, H., Dally, W.J.: Trained ternary quantization. In: Proc.  Int. Conf. Learn. Represent. (2017) 4, 9"}