{"1": "1. Badrinarayanan, V., Kendall, A., Cipolla, R.: Segnet: A deep convolutional encoder-decoder architecture for image segmentation. IEEE transactions on pat- tern analysis and machine intelligence 39(12), 2481-2495 (2017)  2. Bhagoji, A.N., He, W., Li, B., Song, D.: Exploring the space of black-box attacks  on deep neural networks. arXiv preprint arXiv:1712.09491 (2017)  3. Brostow, G.J., Shotton, J., Fauqueur, J., Cipolla, R.: Segmentation and recognition using structure from motion point clouds. In: ECCV ’08 Proceedings of the 10th European Conference on Computer Vision: Part I. pp. 44-57 (2008)  4. Carlini, N., Wagner, D.: Adversarial examples are not easily detected: Bypassing ten detection methods. In: Proceedings of the 10th ACM Workshop on Artificial Intelligence and Security. pp. 3-14. ACM (2017)  5. Carlini, N., Wagner, D.A.: Towards evaluating the robustness of neural networks. In: 2017 IEEE Symposium on Security and Privacy, SP 2017, San Jose, CA, USA, May 22-26, 2017. pp. 39-57 (2017). https://doi.org/10.1109/SP.2017.49, https: //doi.org/10.1109/SP.2017.49  6. Chan, T.F., Wong, C.K.: Total variation blind deconvolution. IEEE transactions  on Image Processing 7(3), 370-375 (1998)  7. Chen, H., Zhang, H., Chen, P.Y., Yi, J., Hsieh, C.J.: Attacking visual language grounding with adversarial examples: A case study on neural image captioning. In: Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). vol. 1, pp. 2587-2597 (2018)  8. Chen, P.Y., Sharma, Y., Zhang, H., Yi, J., Hsieh, C.J.: Ead: elastic-net attacks to deep neural networks via adversarial examples. arXiv preprint arXiv:1709.04114 (2017)  9. Chen, P.Y., Zhang, H., Sharma, Y., Yi, J., Hsieh, C.J.: Zoo: Zeroth order optimiza- tion based black-box attacks to deep neural networks without training substitute models. In: Proceedings of the 10th ACM Workshop on Artificial Intelligence and Security. pp. 15-26. ACM (2017)  10. Cisse, M., Adi, Y., Neverova, N., Keshet, J.: Houdini: Fooling deep structured  prediction models. arXiv preprint arXiv:1707.05373 (2017)  11. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 3213-3223 (2016)  12. Cui, W., Wang, Y., Fan, Y., Feng, Y., Lei, T.: Localized fcm clustering with spatial information for medical image segmentation and bias field estimation. Journal of Biomedical Imaging 2013, 13 (2013)  13. Das, N., Shanbhogue, M., Chen, S.T., Hohman, F., Chen, L., Kounavis, M.E., Chau, D.H.: Keeping the bad guys out: Protecting and vaccinating deep learning with jpeg compression. arXiv preprint arXiv:1705.02900 (2017)  14. Dziugaite, G.K., Ghahramani, Z., Roy, D.M.: A study of the eﬀect of jpg compres-  sion on adversarial images. arXiv preprint arXiv:1608.00853 (2016)  15. Everingham, M., Eslami, S.M.A., Van Gool, L., Williams, C.K.I., Winn, J., Zisser- man, A.: The pascal visual object classes challenge: A retrospective. International Journal of Computer Vision 111(1), 98-136 (Jan 2015)  16. Evtimov, I., Eykholt, K., Fernandes, E., Kohno, T., Li, B., Prakash, A., Rahmati, A., Song, D.: Robust physical-world attacks on machine learning models. arXiv preprint arXiv:1707.08945 (2017)   Characterizing Adversarial Examples Based on Spatial ConsistencyReferences  1. Badrinarayanan, V., Kendall, A., Cipolla, R.: Segnet: A deep convolutional encoder-decoder architecture for image segmentation. IEEE transactions on pat- tern analysis and machine intelligence 39(12), 2481-2495 (2017)  2. Bhagoji, A.N., He, W., Li, B., Song, D.: Exploring the space of black-box attacks  on deep neural networks. arXiv preprint arXiv:1712.09491 (2017)  3. Brostow, G.J., Shotton, J., Fauqueur, J., Cipolla, R.: Segmentation and recognition using structure from motion point clouds. In: ECCV ’08 Proceedings of the 10th European Conference on Computer Vision: Part I. pp. 44-57 (2008)  4. Carlini, N., Wagner, D.: Adversarial examples are not easily detected: Bypassing ten detection methods. In: Proceedings of the 10th ACM Workshop on Artificial Intelligence and Security. pp. 3-14. ACM (2017)  5. Carlini, N., Wagner, D.A.: Towards evaluating the robustness of neural networks. In: 2017 IEEE Symposium on Security and Privacy, SP 2017, San Jose, CA, USA, May 22-26, 2017. pp. 39-57 (2017). https://doi.org/10.1109/SP.2017.49, https: //doi.org/10.1109/SP.2017.49  6. Chan, T.F., Wong, C.K.: Total variation blind deconvolution. IEEE transactions  on Image Processing 7(3), 370-375 (1998)  7. Chen, H., Zhang, H., Chen, P.Y., Yi, J., Hsieh, C.J.: Attacking visual language grounding with adversarial examples: A case study on neural image captioning. In: Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). vol. 1, pp. 2587-2597 (2018)  8. Chen, P.Y., Sharma, Y., Zhang, H., Yi, J., Hsieh, C.J.: Ead: elastic-net attacks to deep neural networks via adversarial examples. arXiv preprint arXiv:1709.04114 (2017)  9. Chen, P.Y., Zhang, H., Sharma, Y., Yi, J., Hsieh, C.J.: Zoo: Zeroth order optimiza- tion based black-box attacks to deep neural networks without training substitute models. In: Proceedings of the 10th ACM Workshop on Artificial Intelligence and Security. pp. 15-26. ACM (2017)  10. Cisse, M., Adi, Y., Neverova, N., Keshet, J.: Houdini: Fooling deep structured  prediction models. arXiv preprint arXiv:1707.05373 (2017)  11. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 3213-3223 (2016)  12. Cui, W., Wang, Y., Fan, Y., Feng, Y., Lei, T.: Localized fcm clustering with spatial information for medical image segmentation and bias field estimation. Journal of Biomedical Imaging 2013, 13 (2013)  13. Das, N., Shanbhogue, M., Chen, S.T., Hohman, F., Chen, L., Kounavis, M.E., Chau, D.H.: Keeping the bad guys out: Protecting and vaccinating deep learning with jpeg compression. arXiv preprint arXiv:1705.02900 (2017)  14. Dziugaite, G.K., Ghahramani, Z., Roy, D.M.: A study of the eﬀect of jpg compres-  sion on adversarial images. arXiv preprint arXiv:1608.00853 (2016)  15. Everingham, M., Eslami, S.M.A., Van Gool, L., Williams, C.K.I., Winn, J., Zisser- man, A.: The pascal visual object classes challenge: A retrospective. International Journal of Computer Vision 111(1), 98-136 (Jan 2015)  16. Evtimov, I., Eykholt, K., Fernandes, E., Kohno, T., Li, B., Prakash, A., Rahmati, A., Song, D.: Robust physical-world attacks on machine learning models. arXiv preprint arXiv:1707.08945 (2017)   16  Xiao et al.  17. Goodfellow, I.J., Shlens, J., Szegedy, C.: Explaining and harnessing adversarial  examples. arXiv preprint arXiv:1412.6572 (2014)  18. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016)  19. He, W., Wei, J., Chen, X., Carlini, N., Song, D.: Adversarial example defense: En- sembles of weak defenses are not strong. In: 11th USENIX Workshop on Oﬀensive Technologies (WOOT 17). USENIX Association, Vancouver, BC (2017), https: //www.usenix.org/conference/woot17/workshop-program/presentation/he 20. Hinton, G., Deng, L., Yu, D., Dahl, G.E., Mohamed, A.r., Jaitly, N., Senior, A., Vanhoucke, V., Nguyen, P., Sainath, T.N., et al.: Deep neural networks for acoustic modeling in speech recognition: The shared views of four research groups. IEEE Signal processing magazine 29(6), 82-97 (2012)  21. Hosseini, H., Chen, Y., Kannan, S., Zhang, B., Poovendran, R.: Blocking trans- ferability of adversarial examples in black-box learning systems. arXiv preprint arXiv:1703.04318 (2017)  22. Johnson, B., Xie, Z.: Unsupervised image segmentation evaluation and refinement using a multi-scale approach. ISPRS Journal of Photogrammetry and Remote Sens- ing 66(4), 473-483 (2011)  23. Krähenbühl, P., Koltun, V.: Eﬃcient inference in fully connected crfs with gaussian edge potentials. In: Advances in neural information processing systems. pp. 109- 117 (2011)  24. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Advances in neural information processing systems. pp. 1097-1105 (2012)  25. Leung, T., Malik, J.: Representing and recognizing the visual appearance of ma- terials using three-dimensional textons. International journal of computer vision 43(1), 29-44 (2001)  26. Lin, G., Shen, C., Van Den Hengel, A., Reid, I.: Eﬃcient piecewise training of deep structured models for semantic segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3194-3203 (2016)  27. Liu, Y., Chen, X., Liu, C., Song, D.: Delving into transferable adversarial examples  and black-box attacks. arXiv preprint arXiv:1611.02770 (2016)  28. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 3431-3440 (2015)  29. Ma, X., Li, B., Wang, Y., Erfani, S.M., Wijewickrema, S., Houle, M.E., Schoenebeck, G., Song, D., Bailey, J.: Characterizing adversarial subspaces using local intrinsic dimensionality. arXiv preprint arXiv:1801.02613 (2018)  30. Madry, A., Makelov, A., Schmidt, L., Tsipras, D., Vladu, A.: Towards deep learning models resistant to adversarial attacks. arXiv preprint arXiv:1706.06083 (2017) 31. Nguyen, A., Yosinski, J., Clune, J.: Deep neural networks are easily fooled: High confidence predictions for unrecognizable images. In: Computer Vision and Pattern Recognition (CVPR), 2015 IEEE Conference on. pp. 427-436. IEEE (2015) 32. Noda, K., Arie, H., Suga, Y., Ogata, T.: Multimodal integration learning of robot behavior using deep neural networks. Robotics and Autonomous Systems 62(6), 721-736 (2014)  33. Papernot, N., McDaniel, P., Goodfellow, I.: Transferability in machine learning: from phenomena to black-box attacks using adversarial samples. arXiv preprint arXiv:1605.07277 (2016)   Characterizing Adversarial Examples Based on Spatial Consistency34. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomedi- cal image segmentation. In: International Conference on Medical image computing and computer-assisted intervention. pp. 234-241. Springer (2015)  35. Saha, P.K., Udupa, J.K., Odhner, D.: Scale-based fuzzy connected image segmenta- tion: theory, algorithms, and validation. Computer Vision and Image Understand- ing 77(2), 145-174 (2000)  36. Shannon, C.E.: Communication theory of secrecy systems. Bell Labs Technical  Journal 28(4), 656-715 (1949)  37. Sharif, M., Bhagavatula, S., Bauer, L., Reiter, M.K.: Accessorize to a crime: Real and stealthy attacks on state-of-the-art face recognition. In: Proceedings of the 2016 ACM SIGSAC Conference on Computer and Communications Security. pp. 1528-1540. ACM (2016)  38. Szegedy, C., Zaremba, W., Sutskever, I., Bruna, J., Erhan, D., Goodfellow, I., Fer- gus, R.: Intriguing properties of neural networks. arXiv preprint arXiv:1312.6199 (2013)  39. Tabacof, P., Valle, E.: Exploring the space of adversarial images. In: Neural Net- works (IJCNN), 2016 International Joint Conference on. pp. 426-433. IEEE (2016) 40. Tong, L., Li, B., Hajaj, C., Xiao, C., Vorobeychik, Y.: Hardening classifiers against  evasion: the good, the bad, and the ugly. CoRR, abs/1708.08327 (2017)  41. Tramèr, F., Kurakin, A., Papernot, N., Boneh, D., McDaniel, P.: Ensemble adver- sarial training: Attacks and defenses. arXiv preprint arXiv:1705.07204 (2017) 42. Weng, T.W., Zhang, H., Chen, H., Song, Z., Hsieh, C.J., Boning, D., Dhillon, I.S., Daniel, L.: Towards fast computation of certified robustness for relu networks. arXiv preprint arXiv:1804.09699 (2018)  43. Weng, T.W., Zhang, H., Chen, P.Y., Yi, J., Su, D., Gao, Y., Hsieh, C.J., Daniel, L.: Evaluating the robustness of neural networks: An extreme value theory ap- proach. In: International Conference on Learning Representations (2018), https: //openreview.net/forum?id=BkUHlMZ0b  44. Wu, Z., Shen, C., Hengel, A.v.d.: Wider or deeper: Revisiting the resnet model for  visual recognition. arXiv preprint arXiv:1611.10080 (2016)  45. Xiao, C., Li, B., yan Zhu, J., He, W., Liu, M., Song, D.: Generating ad- versarial examples with adversarial networks. In: Proceedings of the Twenty- Seventh International Joint Conference on Artificial Intelligence, IJCAI-18. pp. 3905-3911. International Joint Conferences on Artificial Intelligence Organization (7 2018). https://doi.org/10.24963/ijcai.2018/543, https://doi.org/10.24963/ ijcai.2018/543  46. Xiao, C., Sarabi, A., Liu, Y., Li, B., Liu, M., Dumitras, T.: From patching delays to infection symptoms: Using risk profiles for an early discovery of vulnerabili- ties exploited in the wild. In: 27th USENIX Security Symposium (USENIX Secu- rity 18). USENIX Association, Baltimore, MD (2018), https://www.usenix.org/ conference/usenixsecurity18/presentation/xiao  47. Xiao, C., Zhu, J.Y., Li, B., He, W., Liu, M., Song, D.: Spatially transformed adver- sarial examples. In: International Conference on Learning Representations (2018), https://openreview.net/forum?id=HyydRMZC-  48. Xie, C., Wang, J., Zhang, Z., Ren, Z., Yuille, A.: Mitigating adversarial eﬀects through randomization. In: International Conference on Learning Representations (2018)  49. Xie, C., Wang, J., Zhang, Z., Zhou, Y., Xie, L., Yuille, A.: Adversarial examples for semantic segmentation and object detection. In: International Conference on Computer Vision. IEEE (2017)   18  Xiao et al.  50. Yu, F., Koltun, V.: Multi-scale context aggregation by dilated convolutions. In:  International Conference on Learning Representations (ICLR) (2016)  51. Yu, F., Koltun, V., Funkhouser, T.: Dilated residual networks. In: Computer Vision  and Pattern Recognition (CVPR) (2017)  52. Yu, F., Wang, D., Darrell, T.: Deep layer aggregation. arXiv preprint  arXiv:1707.06484 (2017)  53. Yu, F., Xian, W., Chen, Y., Liu, F., Liao, M., Madhavan, V., Darrell, T.: Bdd100k: A diverse driving video database with scalable annotation tooling. arXiv preprint arXiv:1805.04687 (2018)  54. Zeng, D., Liu, K., Lai, S., Zhou, G., Zhao, J.: Relation classification via convolu- tional deep neural network. In: Proceedings of COLING 2014, the 25th Interna- tional Conference on Computational Linguistics: Technical Papers. pp. 2335-2344 (2014)  55. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). pp. 2881-2890 (2017)"}