{"1": "1. Angelova, A., Krizhevsky, A., Vanhoucke, V., Ogale, A.S., Ferguson, D.: Real-time pedestrian detection with deep network cascades. In: BMVC. vol. 2, p. 4 (2015) 2. Benenson, R., Mathias, M., Timofte, R., Van Gool, L.: Pedestrian detection at 100  frames per second. In: CVPR. pp. 2903-2910 (2012)  3. Benenson, R., Mathias, M., Tuytelaars, T., Van Gool, L.: Seeking the strongest  rigid detector. In: CVPR. pp. 3666-3673 (2013)  4. Brazil, G., Yin, X., Liu, X.: Illuminating pedestrians via simultaneous detection  and segmentation. In: ICCV. pp. 4950-4959 (2017)  5. Cai, Z., Fan, Q., Feris, R.S., Vasconcelos, N.: A unified multi-scale deep convolu- tional neural network for fast object detection. In: ECCV. pp. 354-370 (2016) 6. Cai, Z., Saberian, M., Vasconcelos, N.: Learning complexity-aware cascades for  deep pedestrian detection. In: ICCV. pp. 3361-3369 (2015)  7. Dalal, N., Triggs, B.: Histograms of oriented gradients for human detection. In:  8. Doll´ar, P., Belongie, S.J., Perona, P.: The fastest pedestrian detector in the west.  9. Doll´ar, P., Tu, Z., Perona, P., Belongie, S.: Integral channel features. In: BMVC.  CVPR. pp. 886-893 (2005)  In: BMVC. vol. 2, p. 7 (2010)  pp. 91.1-91.11 (2009)  In: CVPR. pp. 304-311 (2009)  10. Doll´ar, P., Wojek, C., Schiele, B., Perona, P.: Pedestrian detection: A benchmark.  11. Du, X., El-Khamy, M., Lee, J., Davis, L.: Fused dnn: A deep neural network fusion approach to fast and robust pedestrian detection. In: WACV. pp. 953-961 (2017) 12. Enzweiler, M., Eigenstetter, A., Schiele, B., Gavrila, D.M.: Multi-cue pedestrian classification with partial occlusion handling. In: CVPR. pp. 990-997 (2010) 13. Felzenszwalb, P.F., Girshick, R.B., McAllester, D., Ramanan, D.: Object detection with discriminatively trained part-based models. TPAMI 32(9), 1627-1645 (2010) 14. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the kitti  vision benchmark suite. In: CVPR. pp. 3354-3361 (2012) 15. Girshick, R.: Fast r-cnn. In: ICCV. pp. 1440-1448 (2015) 16. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward  neural networks. In: AISTATS. pp. 249-256 (2010)  17. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Hypercolumns for object seg-  mentation and fine-grained localization. In: CVPR. pp. 447-456 (2015)  18. Hu, Q., Wang, P., Shen, C., van den Hengel, A., Porikli, F.: Pushing the limits of  deep cnns for pedestrian detection. TCSVT p. accepted (2017)  19. Li, J., Liang, X., Shen, S., Xu, T., Feng, J., Yan, S.: Scale-aware fast r-cnn for  pedestrian detection. TMM p. accepted (2017)  20. Liang-Chieh, C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.: Semantic image segmentation with deep convolutional nets and fully connected crfs. In: ICLR (2015)  21. Lim, J.J., Zitnick, C.L., Doll´ar, P.: Sketch tokens: A learned mid-level representa-  tion for contour and object detection. In: CVPR. pp. 3158-3165 (2013)  22. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature  pyramid networks for object detection. In: CVPR. p. 4 (2017)  23. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  Single shot multibox detector. In: ECCV. pp. 21-37 (2016)  24. Liu, W., Rabinovich, A., Berg, A.C.: Parsenet: Looking wider to see better. In:  ICLR. p. 3 (2016)   Graininess-Aware Deep Feature Learning for Pedestrian DetectionReferences  1. Angelova, A., Krizhevsky, A., Vanhoucke, V., Ogale, A.S., Ferguson, D.: Real-time pedestrian detection with deep network cascades. In: BMVC. vol. 2, p. 4 (2015) 2. Benenson, R., Mathias, M., Timofte, R., Van Gool, L.: Pedestrian detection at 100  frames per second. In: CVPR. pp. 2903-2910 (2012)  3. Benenson, R., Mathias, M., Tuytelaars, T., Van Gool, L.: Seeking the strongest  rigid detector. In: CVPR. pp. 3666-3673 (2013)  4. Brazil, G., Yin, X., Liu, X.: Illuminating pedestrians via simultaneous detection  and segmentation. In: ICCV. pp. 4950-4959 (2017)  5. Cai, Z., Fan, Q., Feris, R.S., Vasconcelos, N.: A unified multi-scale deep convolu- tional neural network for fast object detection. In: ECCV. pp. 354-370 (2016) 6. Cai, Z., Saberian, M., Vasconcelos, N.: Learning complexity-aware cascades for  deep pedestrian detection. In: ICCV. pp. 3361-3369 (2015)  7. Dalal, N., Triggs, B.: Histograms of oriented gradients for human detection. In:  8. Doll´ar, P., Belongie, S.J., Perona, P.: The fastest pedestrian detector in the west.  9. Doll´ar, P., Tu, Z., Perona, P., Belongie, S.: Integral channel features. In: BMVC.  CVPR. pp. 886-893 (2005)  In: BMVC. vol. 2, p. 7 (2010)  pp. 91.1-91.11 (2009)  In: CVPR. pp. 304-311 (2009)  10. Doll´ar, P., Wojek, C., Schiele, B., Perona, P.: Pedestrian detection: A benchmark.  11. Du, X., El-Khamy, M., Lee, J., Davis, L.: Fused dnn: A deep neural network fusion approach to fast and robust pedestrian detection. In: WACV. pp. 953-961 (2017) 12. Enzweiler, M., Eigenstetter, A., Schiele, B., Gavrila, D.M.: Multi-cue pedestrian classification with partial occlusion handling. In: CVPR. pp. 990-997 (2010) 13. Felzenszwalb, P.F., Girshick, R.B., McAllester, D., Ramanan, D.: Object detection with discriminatively trained part-based models. TPAMI 32(9), 1627-1645 (2010) 14. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the kitti  vision benchmark suite. In: CVPR. pp. 3354-3361 (2012) 15. Girshick, R.: Fast r-cnn. In: ICCV. pp. 1440-1448 (2015) 16. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward  neural networks. In: AISTATS. pp. 249-256 (2010)  17. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Hypercolumns for object seg-  mentation and fine-grained localization. In: CVPR. pp. 447-456 (2015)  18. Hu, Q., Wang, P., Shen, C., van den Hengel, A., Porikli, F.: Pushing the limits of  deep cnns for pedestrian detection. TCSVT p. accepted (2017)  19. Li, J., Liang, X., Shen, S., Xu, T., Feng, J., Yan, S.: Scale-aware fast r-cnn for  pedestrian detection. TMM p. accepted (2017)  20. Liang-Chieh, C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.: Semantic image segmentation with deep convolutional nets and fully connected crfs. In: ICLR (2015)  21. Lim, J.J., Zitnick, C.L., Doll´ar, P.: Sketch tokens: A learned mid-level representa-  tion for contour and object detection. In: CVPR. pp. 3158-3165 (2013)  22. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature  pyramid networks for object detection. In: CVPR. p. 4 (2017)  23. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  Single shot multibox detector. In: ECCV. pp. 21-37 (2016)  24. Liu, W., Rabinovich, A., Berg, A.C.: Parsenet: Looking wider to see better. In:  ICLR. p. 3 (2016)   16  Chunze Lin, Jiwen Lu, Gang Wang, and Jie Zhou  25. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  segmentation. In: CVPR. pp. 3431-3440 (2015)  26. Luo, P., Tian, Y., Wang, X., Tang, X.: Switchable deep network for pedestrian  detection. In: CVPR. pp. 899-906 (2014)  27. Mao, J., Xiao, T., Jiang, Y., Cao, Z.: What can help pedestrian detection? In:  CVPR. pp. 3127-3136 (2017)  28. Mathias, M., Benenson, R., Timofte, R., Van Gool, L.: Handling occlusions with  franken-classifiers. In: ICCV. pp. 1505-1512 (2013)  29. Milan, A., Leal-Taix´e, L., Reid, I., Roth, S., Schindler, K.: Mot16: A benchmark  for multi-object tracking. arXiv preprint arXiv:1603.00831 (2016)  30. Nam, W., Doll´ar, P., Han, J.H.: Local decorrelation for improved pedestrian de-  tection. In: NIPS. pp. 424-432 (2014)  31. Ouyang, W., Wang, X.: A discriminative deep model for pedestrian detection with  occlusion handling. In: CVPR. pp. 3258-3265 (2012)  32. Ouyang, W., Zhou, H., Li, H., Li, Q., Yan, J., Wang, X.: Jointly learning deep features, deformable parts, occlusion and classification for pedestrian detection. TPAMI p. accepted (2017)  33. Paisitkriangkrai, S., Shen, C., Van Den Hengel, A.: Strengthening the eﬀectiveness of pedestrian detection with spatially pooled features. In: ECCV. pp. 546-561 (2014)  34. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified,  real-time object detection. In: CVPR. pp. 779-788 (2016)  35. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de-  tection with region proposal networks. In: NIPS. pp. 91-99 (2015)  36. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. In: ICLR (2015)  37. Tian, Y., Luo, P., Wang, X., Tang, X.: Deep learning strong parts for pedestrian  detection. In: CVPR. pp. 1904-1912 (2015)  38. Tian, Y., Luo, P., Wang, X., Tang, X.: Pedestrian detection aided by deep learning  semantic tasks. In: CVPR. pp. 5079-5087 (2015)  39. Viola, P., Jones, M.J., Snow, D.: Detecting pedestrians using patterns of motion  and appearance. In: IJCV. p. 734 (2003)  40. Wang, X., Han, T.X., Yan, S.: An hog-lbp human detector with partial occlusion  handling. In: ICCV. pp. 32-39 (2009)  41. Yang, F., Choi, W., Lin, Y.: Exploit all the layers: Fast and accurate cnn object detector with scale dependent pooling and cascaded rejection classifiers. In: CVPR. pp. 2129-2137 (2016)  42. Yu, F., Li, W., Li, Q., Liu, Y., Shi, X., Yan, J.: Poi: Multiple object tracking with high performance detection and appearance feature. In: ECCV. pp. 36-42 (2016) 43. Zhang, L., Lin, L., Liang, X., He, K.: Is faster r-cnn doing well for pedestrian  detection? In: ECCV. pp. 443-457 (2016)  44. Zhang, S., Bauckhage, C., Cremers, A.B.: Informed haar-like features improve  pedestrian detection. In: CVPR. pp. 947-954 (2014)  45. Zhang, S., Benenson, R., Omran, M., Hosang, J., Schiele, B.: How far are we from  solving pedestrian detection? In: CVPR. pp. 1259-1267 (2016)  46. Zhang, S., Benenson, R., Schiele, B.: Filtered channel features for pedestrian de-  tection. In: CVPR. p. 4 (2015)  47. Zhou, C., Yuan, J.: Learning to integrate occlusion-specific detectors for heavily  occluded pedestrian detection. In: ACCV. pp. 305-320 (2016)  48. Zhou, C., Yuan, J.: Multi-label learning of part detectors for heavily occluded  pedestrian detection. In: ICCV. pp. 3486-3495 (2017)"}