{"1": "1. Adelson, E.H., Bergen, J.R.: The plenoptic function and the elements of early  vision. In: Computational Models of Visual Processing. (1991) 3-20  2. Levoy, M., Hanrahan, P.: Light field rendering. In: Proceedings of the 23rd annual conference on Computer graphics and interactive techniques, ACM (1996) 31-42 3. Gortler, S.J., Grzeszczuk, R., Szeliski, R., Cohen, M.F.: The lumigraph. In: Pro- ceedings of the 23rd Annual Conference on Computer Graphics and Interactive Techniques. (1996) 43-54  4. Tanimoto, M., Tehrani, M.P., Fujii, T., Yendo, T.: Free-viewpoint TV.  IEEE  Signal Processing Magazine 28(1) (2011) 67-76  5. Shi, L., Hassanieh, H., Davis, A., Katabi, D., Durand, F.: Light field reconstruction using sparsity in the continuous fourier domain. ACM Transactions on Graphics (TOG) 34(1) (2014) 12  6. Kalantari, N.K., Wang, T.C., Ramamoorthi, R.: Learning-based view synthesis for light field cameras. ACM Transactions on Graphics (Proceedings of SIGGRAPH Asia 2016) 35(6) (2016)  7. Wanner, S., Goldluecke, B.: Variational light field analysis for disparity estima- IEEE transactions on pattern analysis and machine  tion and super-resolution. intelligence 36(3) (2014) 606-619  8. Wang, T.C., Efros, A.A., Ramamoorthi, R.: Depth estimation with occlusion mod- eling using light-field cameras. IEEE transactions on pattern analysis and machine intelligence 38(11) (2016) 2170-2181  9. Williem, W., Park, I.K., Lee, K.M.: Robust light field depth estimation using IEEE Transactions on Pattern Analysis and  occlusion-noise aware data costs. Machine Intelligence PP(99) (2017) 1-1  10. Isaksen, A., McMillan, L., Gortler, S.J.: Dynamically reparameterized light fields. In: Proceedings of the 27th Annual Conference on Computer Graphics and Inter- active Techniques. (2000) 297-306  11. Ng, R., Levoy, M., Br´edif, M., Duval, G., Horowitz, M., Hanrahan, P.: Light field photography with a hand-held plenoptic camera. Computer Science Technical Report CSTR 2(11) (2005) 1-11  12. Bishop, T.E., Zanetti, S., Favaro, P.: Light field superresolution. In: Computational  Photography (ICCP), 2009 IEEE International Conference on, IEEE (2009) 1-9  13. Wetzstein, G., Lanman, D., Hirsch, M., Raskar, R.: Tensor Displays: Compres- sive Light Field Synthesis using Multilayer Displays with Directional Backlighting. ACM Trans. Graph. (Proc. SIGGRAPH) 31(4) (2012) 1-11  14. Huang, F.C., Chen, K., Wetzstein, G.: The light field stereoscope: immersive computer graphics via factored near-eye light field displays with focus cues. ACM Transactions on Graphics (TOG) 34(4) (2015) 60  15. Lee, S., Jang, C., Moon, S., Cho, J., Lee, B.: Additive light field displays: realization of augmented reality with holographic optical elements. ACM Transactions on Graphics (TOG) 35(4) (2016) 60  16. Saito, T., Kobayashi, Y., Takahashi, K., Fujii, T.: Displaying real-world light fields with stacked multiplicative layers: Requirement and data conversion for input multiview images. Journal of Display Technology 12(11) (2016) 1290-1300  17. Maeno, K., Nagahara, H., Shimada, A., Taniguchi, R.I.: Light field distortion In: IEEE Conference on Computer  feature for transparent object recognition. Vision and Pattern Recognition. (2013) 2786-2793   Learning to Capture Light Fields through a Coded Aperture CameraReferences  1. Adelson, E.H., Bergen, J.R.: The plenoptic function and the elements of early  vision. In: Computational Models of Visual Processing. (1991) 3-20  2. Levoy, M., Hanrahan, P.: Light field rendering. In: Proceedings of the 23rd annual conference on Computer graphics and interactive techniques, ACM (1996) 31-42 3. Gortler, S.J., Grzeszczuk, R., Szeliski, R., Cohen, M.F.: The lumigraph. In: Pro- ceedings of the 23rd Annual Conference on Computer Graphics and Interactive Techniques. (1996) 43-54  4. Tanimoto, M., Tehrani, M.P., Fujii, T., Yendo, T.: Free-viewpoint TV.  IEEE  Signal Processing Magazine 28(1) (2011) 67-76  5. Shi, L., Hassanieh, H., Davis, A., Katabi, D., Durand, F.: Light field reconstruction using sparsity in the continuous fourier domain. ACM Transactions on Graphics (TOG) 34(1) (2014) 12  6. Kalantari, N.K., Wang, T.C., Ramamoorthi, R.: Learning-based view synthesis for light field cameras. ACM Transactions on Graphics (Proceedings of SIGGRAPH Asia 2016) 35(6) (2016)  7. Wanner, S., Goldluecke, B.: Variational light field analysis for disparity estima- IEEE transactions on pattern analysis and machine  tion and super-resolution. intelligence 36(3) (2014) 606-619  8. Wang, T.C., Efros, A.A., Ramamoorthi, R.: Depth estimation with occlusion mod- eling using light-field cameras. IEEE transactions on pattern analysis and machine intelligence 38(11) (2016) 2170-2181  9. Williem, W., Park, I.K., Lee, K.M.: Robust light field depth estimation using IEEE Transactions on Pattern Analysis and  occlusion-noise aware data costs. Machine Intelligence PP(99) (2017) 1-1  10. Isaksen, A., McMillan, L., Gortler, S.J.: Dynamically reparameterized light fields. In: Proceedings of the 27th Annual Conference on Computer Graphics and Inter- active Techniques. (2000) 297-306  11. Ng, R., Levoy, M., Br´edif, M., Duval, G., Horowitz, M., Hanrahan, P.: Light field photography with a hand-held plenoptic camera. Computer Science Technical Report CSTR 2(11) (2005) 1-11  12. Bishop, T.E., Zanetti, S., Favaro, P.: Light field superresolution. In: Computational  Photography (ICCP), 2009 IEEE International Conference on, IEEE (2009) 1-9  13. Wetzstein, G., Lanman, D., Hirsch, M., Raskar, R.: Tensor Displays: Compres- sive Light Field Synthesis using Multilayer Displays with Directional Backlighting. ACM Trans. Graph. (Proc. SIGGRAPH) 31(4) (2012) 1-11  14. Huang, F.C., Chen, K., Wetzstein, G.: The light field stereoscope: immersive computer graphics via factored near-eye light field displays with focus cues. ACM Transactions on Graphics (TOG) 34(4) (2015) 60  15. Lee, S., Jang, C., Moon, S., Cho, J., Lee, B.: Additive light field displays: realization of augmented reality with holographic optical elements. ACM Transactions on Graphics (TOG) 35(4) (2016) 60  16. Saito, T., Kobayashi, Y., Takahashi, K., Fujii, T.: Displaying real-world light fields with stacked multiplicative layers: Requirement and data conversion for input multiview images. Journal of Display Technology 12(11) (2016) 1290-1300  17. Maeno, K., Nagahara, H., Shimada, A., Taniguchi, R.I.: Light field distortion In: IEEE Conference on Computer  feature for transparent object recognition. Vision and Pattern Recognition. (2013) 2786-2793   16  Y. Inagaki, Y. Kobayashi, K. Takahashi, T. Fujii and H. Nagahara  18. andJun Yan Zhu, T.C.W., Hiroaki, E., Chandraker, M., Efros, A., Ramamoorthi, In: R.: A 4d light-field dataset and cnn architectures for material recognition. European Conference on Computer Vision (ECCV). (2016) 121-138  19. MIT Media Lab’s Camera Culture Group: Compressive light field camera http://cameraculture.media.mit.edu/projects/compressive-light-field-camera/. 20. Computer Graphics Laboratory, Stanford University: The (new) stanford light  field archive (2018) http://lightfield.stanford.edu. 21. Heidelberg Collaboratory for Image Processing:  http://hci-lightfield.iwr.uni-heidelberg.de/.  22. Heidelberg Collaboratory for  Image Processing:  marks for densely sampled 4D light fields. heidelberg.de/?page id=713 (2016)  4D light field dataset (2018)  Datasets and bench- http://lightfieldgroup.iwr.uni-  23. Wilburn, B., Joshi, N., Vaish, V., Talvala, E.V., Antunez, E., Barth, A., Adams, A., Horowitz, M., Levoy, M.: High performance imaging using large camera arrays. ACM Transactions on Graphics (TOG) 24(3) (2005) 765-776  24. Fujii, T., Mori, K., Takeda, K., Mase, K., Tanimoto, M., Suenaga, Y.: Multipoint measuring system for video and sound-100-camera and microphone system. In: 2006 IEEE International Conference on Multimedia and Expo, IEEE (2006) 437- 440  25. Taguchi, Y., Koike, T., Takahashi, K., Naemura, T.: TransCAIP: A live 3D TV system using a camera array and an integral photography display with interactive control of viewing parameters. IEEE Transactions on Visualization and Computer Graphics 15(5) (Sept 2009) 841-852  26. Adelson, E.H., Wang, J.Y.: Single lens stereo with a plenoptic camera.  IEEE  transactions on pattern analysis and machine intelligence 14(2) (1992) 99-106 27. Arai, J., Okano, F., Hoshino, H., Yuyama, I.: Gradient-index lens-array method based on real-time integral photography for three-dimensional images. Applied optics 37(11) (1998) 2034-2045  28. Ng, R.: Digital light field photography. PhD thesis, stanford university (2006) 29. Veeraraghavan, A., Raskar, R., Agrawal, A., Mohan, A., Tumblin, J.: Dappled pho- tography: Mask enhanced cameras for heterodyned light fields and coded aperture refocusing. ACM Transactions on Graphics (TOG) 26(3) (2007) 69  30. Liang, C.K., Lin, T.H., Wong, B.Y., Liu, C., Chen, H.H.: Programmable aperture photography: multiplexed light field acquisition. ACM Transactions on Graphics (TOG) 27(3) (2008) 55  31. Nagahara, H., Zhou, C., Watanabe, T., Ishiguro, H., Nayar, S.K.: Programmable In: European Conference on Computer Vision,  aperture camera using LCoS. Springer (2010) 337-350  32. Babacan, S.D., Ansorge, R., Luessi, M., Mataran, P.R., Molina, R., Katsaggelos, IEEE Transactions on image processing  A.K.: Compressive light field sensing. 21(12) (2012) 4746-4757  33. Marwah, K., Wetzstein, G., Bando, Y., Raskar, R.: Compressive light field pho- tography using overcomplete dictionaries and optimized projections. ACM Trans- actions on Graphics (TOG) 32(4) (2013) 46  34. Tambe, S., Veeraraghavan, A., Agrawal, A.: Towards motion aware light field video for dynamic scenes. In: Proceedings of the IEEE International Conference on Computer Vision. (2013) 1009-1016  35. Yagi, Y., Takahashi, K., Fujii, T., Sonoda, T., Nagahara, H.: Pca-coded aperture for light field photography. In: IEEE International Conference on Image Processing (ICIP). (2017)   Learning to Capture Light Fields through a Coded Aperture Camera36. Srinivasan, P.P., Wang, T., Sreelal, A., Ramamoorthi, R., Ng, R.: Learning to In: IEEE International  synthesize a 4D RGBD light field from a single image. Conference on Computer Vision. (2017) 2262-2270  37. Yoon, Y., Jeon, H.G., Yoo, D., Lee, J.Y., Kweon, I.S.: Learning a deep convo- lutional network for light-field image super-resolution. 2015 IEEE International Conference on Computer Vision Workshop (ICCVW) (2015) 57-65  38. Donoho, D.L.: Compressed sensing.  IEEE Transactions on information theory  52(4) (2006) 1289-1306  39. Cand`es, E.J., Wakin, M.B.: An introduction to compressive sampling. IEEE signal  processing magazine 25(2) (2008) 21-30  40. Candes, E.J., Eldar, Y.C., Needell, D., Randall, P.: Compressed sensing with co- herent and redundant dictionaries. Applied and Computational Harmonic Analysis 31(1) (2011) 59-73  41. Hinton, G.E., Salakhutdinov, R.R.: Reducing the dimensionality of data with  neural networks. Science 313(5786) (July 2006) 504-507  42. Vincent, P., Larochelle, H., Bengio, Y., Manzagol, P.A.: Extracting and composing robust features with denoising autoencoders. In: Proceedings of the 25th Interna- tional Conference on Machine Learning. ICML ’08 (2008) 1096-1103  43. Tokui, S., Oono, K., Hido, S., Clayton, J.: Chainer: a next-generation open source framework for deep learning. In: Workshop on Machine Learning Systems (Learn- ingSys) in The Twenty-ninth Annual Conference on Neural Information Processing Systems (NIPS). (2015)  44. Chakrabarti, A.: Learning sensor multiplexing design through back-propagation. In: Proceedings of the 30th International Conference on Neural Information Pro- cessing Systems. (2016) 3089-3097  45. Shedligeri, P.A., Mohan, S., Mitra, K.: Data driven coded aperture design for depth In: 2017 IEEE International Conference on Image Processing (ICIP).  recovery. (2017) 56-60  46. Iliadis, M., Spinoulas, L., Katsaggelos, A.K.: Deep fully-connected networks for  video compressive sensing. arXiv, http://arxiv.org/abs/1603.04930 (2016)  47. Wang, T.C., Zhu, J.Y., Kalantari, N.K., Efros, A.A., Ramamoorthi, R.: Light field video capture using a learning-based hybrid imaging system. ACM Trans. Graph. 36(4) (2017) 133:1-133:13  48. Gupta, M., Jauhari, A., Kulkarni, K., Jayasuriya, S., Molnar, A., Turaga, P.: Com- pressive light field reconstructions using deep learning. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW). (2017) 1277- 1286  49. Sonoda, T., Nagahara, H., Taniguchi, R.: Motion-invariant coding using a pro- grammable aperture camera. IPSJ Transactions on Computer Vision and Appli- cations 6 (6 2014) 25-33  50. Kim, J., Kwon Lee, J., Mu Lee, K.: Accurate image super-resolution using very deep convolutional networks. In: IEEE Computer Society Conference on Computer Vision and Pattern Recognition. (2016) 1646-1654  51. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In: The Inter-  national Conference on Learning Representations (ICLR). (2015)  52. Keita Takahashi: Computational camera project http://www.fujii.nuee.nagoya-  u.ac.jp/%7Etakahasi/Research/CompCam/index.html.  53. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., In: Advances in Neural  Courville, A., Bengio, Y.: Generative adversarial nets. Information Processing Systems 27. (2014) 2672-2680"}