{"1": "1. https://en.wikipedia.org/wiki/Ordnance Survey National Grid (2017) 2. Bulat, A., Tzimiropoulos, G.: Human pose estimation via convolutional part heatmap regression. In: European Conference on Computer Vision. pp. 717-732. Springer (2016)  3. Chauve, A.L., Labatut, P., Pons, J.P.: Robust piecewise-planar 3d reconstruction and completion from large-scale unstructured point data. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 1261-1268. IEEE (2010)  4. Data.gov.uk:  http://environment.data.gov.uk/ds/survey/index.jsp#/survey  (2015)  5. Demir, I., Aliaga, D.G., Benes, B.: Procedural editing of 3d building point clouds.  In: International Conference on Computer Vision. pp. 2147-2155 (2015)  6. Demir, I., Aliaga, D.G., Benes, B.: Proceduralization for editing 3d architectural models. In: 3D Vision (3DV), 2016 Fourth International Conference on. pp. 194- 202. IEEE (2016)  7. Dick, A., Torr, P., Cipolla, R.: A bayesian estimation of building shape using mcmc.  In: European Conference on Computer Vision. pp. 574-575. Springer (2002)  8. Dylla, K., Frischer, B., M¨uller, P., Ulmer, A., Haegler, S.: Rome reborn 2.0: A case study of virtual city reconstruction using procedural modeling techniques. Computer Graphics World 16(6) (2008)  9. EsriCityEngine: http://www.esri.com/software/cityengine (2017)  10. Furukawa, Y., Curless, B., Seitz, S.M., Szeliski, R.: Manhattan-world stereo. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 1422-1429. IEEE (2009)  11. Garland, M., Heckbert, P.S.: Surface simplification using quadric error metrics. In: Proceedings of the 24th annual conference on Computer graphics and interactive techniques. pp. 209-216. ACM Press/Addison-Wesley Publishing Co. (1997) 12. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  arXiv preprint arXiv:1512.03385 (2015)  13. Henn, A., Grger, G., Stroh, V., Plmer, L.: Model driven reconstruction of roofs  from sparse lidar point clouds 76, 17-29 (02 2013)  14. Huang, H., Brenner, C., Sester, M.: A generative statistical approach to automatic 3d building roof reconstruction from laser scanning data. ISPRS Journal of Pho- togrammetry and Remote Sensing 79, 2943 (05 2013)  15. Ikehata, S., Yang, H., Furukawa, Y.: Structured indoor modeling. In: IEEE Inter-  national Conference on Computer Vision. pp. 1323-1331 (2015)  16. Jiang, H., Xiao, J.: A linear approach to matching cuboids in rgbd images. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 2171-2178 (2013)  17. Kazhdan, M., Hoppe, H.: Screened poisson surface reconstruction. ACM Transac-  tions on Graphics (TOG) 32(3), 29 (2013)  18. Kim, V.G., Li, W., Mitra, N.J., Chaudhuri, S., DiVerdi, S., Funkhouser, T.: Learn- ing part-based templates from large collections of 3d shapes. ACM Transactions on Graphics (TOG) 32(4), 70 (2013)  19. Li, Y., Wu, X., Chrysathou, Y., Sharf, A., Cohen-Or, D., Mitra, N.J.: Globfit: Con- sistently fitting primitives by discovering global relations. In: ACM Transactions on Graphics (TOG). vol. 30, p. 52. ACM (2011)  20. Lin, H., Gao, J., Zhou, Y., Lu, G., Ye, M., Zhang, C., Liu, L., Yang, R.: Seman- tic decomposition and reconstruction of residential scenes from lidar data. ACM Transactions on Graphics (TOG) 32(4), 66 (2013)   Neural Procedural Reconstruction for Residential BuildingsReferences  1. https://en.wikipedia.org/wiki/Ordnance Survey National Grid (2017) 2. Bulat, A., Tzimiropoulos, G.: Human pose estimation via convolutional part heatmap regression. In: European Conference on Computer Vision. pp. 717-732. Springer (2016)  3. Chauve, A.L., Labatut, P., Pons, J.P.: Robust piecewise-planar 3d reconstruction and completion from large-scale unstructured point data. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 1261-1268. IEEE (2010)  4. Data.gov.uk:  http://environment.data.gov.uk/ds/survey/index.jsp#/survey  (2015)  5. Demir, I., Aliaga, D.G., Benes, B.: Procedural editing of 3d building point clouds.  In: International Conference on Computer Vision. pp. 2147-2155 (2015)  6. Demir, I., Aliaga, D.G., Benes, B.: Proceduralization for editing 3d architectural models. In: 3D Vision (3DV), 2016 Fourth International Conference on. pp. 194- 202. IEEE (2016)  7. Dick, A., Torr, P., Cipolla, R.: A bayesian estimation of building shape using mcmc.  In: European Conference on Computer Vision. pp. 574-575. Springer (2002)  8. Dylla, K., Frischer, B., M¨uller, P., Ulmer, A., Haegler, S.: Rome reborn 2.0: A case study of virtual city reconstruction using procedural modeling techniques. Computer Graphics World 16(6) (2008)  9. EsriCityEngine: http://www.esri.com/software/cityengine (2017)  10. Furukawa, Y., Curless, B., Seitz, S.M., Szeliski, R.: Manhattan-world stereo. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 1422-1429. IEEE (2009)  11. Garland, M., Heckbert, P.S.: Surface simplification using quadric error metrics. In: Proceedings of the 24th annual conference on Computer graphics and interactive techniques. pp. 209-216. ACM Press/Addison-Wesley Publishing Co. (1997) 12. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  arXiv preprint arXiv:1512.03385 (2015)  13. Henn, A., Grger, G., Stroh, V., Plmer, L.: Model driven reconstruction of roofs  from sparse lidar point clouds 76, 17-29 (02 2013)  14. Huang, H., Brenner, C., Sester, M.: A generative statistical approach to automatic 3d building roof reconstruction from laser scanning data. ISPRS Journal of Pho- togrammetry and Remote Sensing 79, 2943 (05 2013)  15. Ikehata, S., Yang, H., Furukawa, Y.: Structured indoor modeling. In: IEEE Inter-  national Conference on Computer Vision. pp. 1323-1331 (2015)  16. Jiang, H., Xiao, J.: A linear approach to matching cuboids in rgbd images. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 2171-2178 (2013)  17. Kazhdan, M., Hoppe, H.: Screened poisson surface reconstruction. ACM Transac-  tions on Graphics (TOG) 32(3), 29 (2013)  18. Kim, V.G., Li, W., Mitra, N.J., Chaudhuri, S., DiVerdi, S., Funkhouser, T.: Learn- ing part-based templates from large collections of 3d shapes. ACM Transactions on Graphics (TOG) 32(4), 70 (2013)  19. Li, Y., Wu, X., Chrysathou, Y., Sharf, A., Cohen-Or, D., Mitra, N.J.: Globfit: Con- sistently fitting primitives by discovering global relations. In: ACM Transactions on Graphics (TOG). vol. 30, p. 52. ACM (2011)  20. Lin, H., Gao, J., Zhou, Y., Lu, G., Ye, M., Zhang, C., Liu, L., Yang, R.: Seman- tic decomposition and reconstruction of residential scenes from lidar data. ACM Transactions on Graphics (TOG) 32(4), 66 (2013)   16  Huayi Zeng, Jiaye Wu and Yasutaka Furukawa  21. Martinovic, A., Van Gool, L.: Bayesian grammar learning for inverse procedural modeling. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 201-208 (2013)  22. Martinovic, A., Van Gool, L.: Hierarchical co-segmentation of building facades. In: 3D Vision (3DV), 2014 2nd International Conference on. vol. 1, pp. 409-416. IEEE (2014)  23. Mathias, M., Martinovic, A., Weissenberg, J., Van Gool, L.: Procedural 3d build- ing reconstruction using shape grammars and detectors. In: 3D Imaging, Modeling, Processing, Visualization and Transmission (3DIMPVT), 2011 International Con- ference on. pp. 304-311. IEEE (2011)  24. Merrell, P., Schkufza, E., Koltun, V.: Computer-generated residential building lay-  outs. ACM Transactions on Graphics (TOG) 29(6), 181 (2010)  25. Mousavian, A., Anguelov, D., Flynn, J., Kosecka, J.: 3d bounding box estimation using deep learning and geometry. In: IEEE Conference on Computer Vision and Pattern Recognition (2017)  26. M¨uller, P., Wonka, P., Haegler, S., Ulmer, A., Van Gool, L.: Procedural modeling of buildings. In: Acm Transactions On Graphics (Tog). vol. 25, pp. 614-623. ACM (2006)  27. M¨uller, P., Zeng, G., Wonka, P., Van Gool, L.: Image-based procedural modeling  of facades. ACM Transactions on Graphics (TOG) 26(3), 85 (2007)  28. Nguatem, W., Mayer, H.: Modeling urban scenes from pointclouds. In: 2017 IEEE International Conference on Computer Vision (ICCV). pp. 3857-3866 (Oct 2017). https://doi.org/10.1109/ICCV.2017.414  29. Nishida, G., Bousseau, A., Aliaga, D.G.: Procedural modeling of a building from  a single image. Eurographics (2018)  30. Nishida, G., Garcia-Dorado, I., Aliaga, D.G., Benes, B., Bousseau, A.: Interactive sketching of urban procedural models. ACM Transactions on Graphics (TOG) 35(4), 130 (2016)  31. Quan, L., Tan, P., Zeng, G., Yuan, L., Wang, J., Kang, S.B.: Image-based plant modeling. In: ACM Transactions on Graphics (TOG). vol. 25, pp. 599-604. ACM (2006)  32. Ritchie, D., Thomas, A., Hanrahan, P., Goodman, N.: Neurally-guided procedu- ral models: Amortized inference for procedural graphics programs using neural networks. In: Advances In Neural Information Processing Systems. pp. 622-630 (2016)  33. Sinha, S., Steedly, D., Szeliski, R.: Piecewise planar stereo for image-based render-  ing. In: IEEE International Conference on Computer Vision (2009)  34. Talton, J.O., Lou, Y., Lesser, S., Duke, J., Mˇech, R., Koltun, V.: Metropolis pro- cedural modeling. ACM Transactions on Graphics (TOG) 30(2), 11 (2011) 35. Tan, P., Zeng, G., Wang, J., Kang, S.B., Quan, L.: Image-based tree modeling. In:  ACM Transactions on Graphics (TOG). vol. 26, p. 87. ACM (2007)  36. Toshev, A., Mordohai, P., Taskar, B.: Detecting and parsing architecture at city scale from range data. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 398-405. IEEE (2010)  37. Wang, H., Zhang, W., Chen, Y., Chen, M., Yan, K.: Semantic de- compound buildings with symmetric composition and reconstruction of imagery. Remote Sensing 7(10), 13945- roofs from lidar data and aerial 13974 (2015). https://doi.org/10.3390/rs71013945, http://www.mdpi.com/2072- 4292/7/10/13945  38. Xiao, J., Furukawa, Y.: Reconstructing the world’s museums. International journal  of computer vision 110(3), 243-258 (2014)   Neural Procedural Reconstruction for Residential Buildings39. Zebedin, L., Bauer, J., Karner, K., Bischof, H.: Fusion of feature-and area-based information for urban buildings modeling from aerial imagery. In: European Con- ference on Computer Vision. pp. 873-886. Springer (2008)  40. Zhou, Q.Y., Neumann, U.: 2.5D Dual Contouring: A Robust Approach to Creating Building Models from Aerial LiDAR Point Clouds, pp. 115-128. Springer Berlin Heidelberg, Berlin, Heidelberg (2010)  41. Zhou, Q.Y., Neumann, U.: 2.5 d building modeling by discovering global regu- larities. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 326-333. IEEE (2012)"}