{"1": "1. Glorot, X., Bordes, A., Bengio, Y.: Deep sparse rectifier neural networks.  In: Proceedings of the Fourteenth International Conference on Artificial Intelligence and Statistics, AISTATS 2011, Fort Lauderdale, USA, April 11-13, 2011. (2011) 315-323  2. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep convolutional neural networks. In: Advances in Neural Information Processing Systems 25, Lake Tahoe, Nevada, United States. (2012) 1106-1114  3. Sermanet, P., Eigen, D., Zhang, X., Mathieu, M., Fergus, R., LeCun, Y.: Overfeat: Integrated recognition, localization and detection using convolutional networks. In: International Conference on Learning Representations (ICLR). (2013)  4. Maas, A.L., Hannun, A.Y., Ng, A.Y.: Rectifier nonlinearities improve neural network  acoustic models. Proc. ICML 30 (2013) 1  5. Zeiler, M.D., Fergus, R.: Visualizing and understanding convolutional networks. In: Computer Vision - ECCV 2014 - 13th European Conference, Zurich, Switzerland, September 6-12, 2014, Proceedings, Part I. (2014) 818-833  6. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S.E., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A.: Going deeper with convolutions. In: IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2015, Boston, MA, USA, June 7-12, 2015. (2015) 1-9  7. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale image recognition. In: International Conference on Learning Representations (ICLR). (2015)  8. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Computer Vision and Pattern Recognition (CVPR), 2016 IEEE Conference on. (2016)  9. Xie, S., Girshick, R.B., Doll´ar, P., Tu, Z., He, K.: Aggregated residual transfor- mations for deep neural networks. In: IEEE Conference on Computer Vision and Pattern Recognition, CVPR. (2017)  10. Huang, G., Liu, Z., Weinberger, K.Q.: Densely connected convolutional networks. In: IEEE Conference on Computer Vision and Pattern Recognition, CVPR. (2017) 11. Chen, Y., Kalantidis, Y., Li, J., Yan, S., Feng, J.: Multi-fiber networks for video recognition. In: European Conference on Computer Vision (ECCV). (2018)  12. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks. In: Computer Vision - ECCV 2016 - 14th European Conference, Amsterdam, The Netherlands, October 11-14, 2016, Proceedings, Part IV. (2016) 630-645  13. Bergstra, J., Bengio, Y.: Random search for hyper-parameter optimization. Journal  of Machine Learning Research 13 (2012) 281-305  14. Snoek, J., Larochelle, H., Adams, R.P.: Practical bayesian optimization of machine learning algorithms. In: Advances in Neural Information Processing Systems 25, Lake Tahoe, Nevada, United States. (2012) 2960-2968  15. Snoek, J., Rippel, O., Swersky, K., Kiros, R., Satish, N., Sundaram, N., Patwary, M.M.A., Prabhat, Adams, R.P.: Scalable bayesian optimization using deep neural networks. In: Proceedings of the 32nd International Conference on Machine Learning, ICML 2015, Lille, France, 6-11 July 2015. (2015) 2171-2180  16. Pham, H., Guan, M.Y., Zoph, B., Le, Q.V., Dean, J.: Eﬃcient neural architecture  search via parameter sharing. arXiv preprint arXiv:1802.03268 (2018)  17. Such, F.P., Madhavan, V., Conti, E., Lehman, J., Stanley, K.O., Clune, J.: Deep neuroevolution: genetic algorithms are a competitive alternative for training deep neural networks for reinforcement learning. arXiv preprint arXiv:1712.06567 (2017)   MaskConnect: Connectivity Learning by Gradient DescentReferences  1. Glorot, X., Bordes, A., Bengio, Y.: Deep sparse rectifier neural networks.  In: Proceedings of the Fourteenth International Conference on Artificial Intelligence and Statistics, AISTATS 2011, Fort Lauderdale, USA, April 11-13, 2011. (2011) 315-323  2. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep convolutional neural networks. In: Advances in Neural Information Processing Systems 25, Lake Tahoe, Nevada, United States. (2012) 1106-1114  3. Sermanet, P., Eigen, D., Zhang, X., Mathieu, M., Fergus, R., LeCun, Y.: Overfeat: Integrated recognition, localization and detection using convolutional networks. In: International Conference on Learning Representations (ICLR). (2013)  4. Maas, A.L., Hannun, A.Y., Ng, A.Y.: Rectifier nonlinearities improve neural network  acoustic models. Proc. ICML 30 (2013) 1  5. Zeiler, M.D., Fergus, R.: Visualizing and understanding convolutional networks. In: Computer Vision - ECCV 2014 - 13th European Conference, Zurich, Switzerland, September 6-12, 2014, Proceedings, Part I. (2014) 818-833  6. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S.E., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A.: Going deeper with convolutions. In: IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2015, Boston, MA, USA, June 7-12, 2015. (2015) 1-9  7. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale image recognition. In: International Conference on Learning Representations (ICLR). (2015)  8. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Computer Vision and Pattern Recognition (CVPR), 2016 IEEE Conference on. (2016)  9. Xie, S., Girshick, R.B., Doll´ar, P., Tu, Z., He, K.: Aggregated residual transfor- mations for deep neural networks. In: IEEE Conference on Computer Vision and Pattern Recognition, CVPR. (2017)  10. Huang, G., Liu, Z., Weinberger, K.Q.: Densely connected convolutional networks. In: IEEE Conference on Computer Vision and Pattern Recognition, CVPR. (2017) 11. Chen, Y., Kalantidis, Y., Li, J., Yan, S., Feng, J.: Multi-fiber networks for video recognition. In: European Conference on Computer Vision (ECCV). (2018)  12. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks. In: Computer Vision - ECCV 2016 - 14th European Conference, Amsterdam, The Netherlands, October 11-14, 2016, Proceedings, Part IV. (2016) 630-645  13. Bergstra, J., Bengio, Y.: Random search for hyper-parameter optimization. Journal  of Machine Learning Research 13 (2012) 281-305  14. Snoek, J., Larochelle, H., Adams, R.P.: Practical bayesian optimization of machine learning algorithms. In: Advances in Neural Information Processing Systems 25, Lake Tahoe, Nevada, United States. (2012) 2960-2968  15. Snoek, J., Rippel, O., Swersky, K., Kiros, R., Satish, N., Sundaram, N., Patwary, M.M.A., Prabhat, Adams, R.P.: Scalable bayesian optimization using deep neural networks. In: Proceedings of the 32nd International Conference on Machine Learning, ICML 2015, Lille, France, 6-11 July 2015. (2015) 2171-2180  16. Pham, H., Guan, M.Y., Zoph, B., Le, Q.V., Dean, J.: Eﬃcient neural architecture  search via parameter sharing. arXiv preprint arXiv:1802.03268 (2018)  17. Such, F.P., Madhavan, V., Conti, E., Lehman, J., Stanley, K.O., Clune, J.: Deep neuroevolution: genetic algorithms are a competitive alternative for training deep neural networks for reinforcement learning. arXiv preprint arXiv:1712.06567 (2017)   16  Karim Ahmed, Lorenzo Torresani  18. Salimans, T., Ho, J., Chen, X., Sidor, S., Sutskever, I.: Evolution strategies as a scalable alternative to reinforcement learning. arXiv preprint arXiv:1703.03864 (2017)  19. Liu, H., Simonyan, K., Vinyals, O., Fernando, C., Kavukcuoglu, K.: Hierarchical representations for eﬃcient architecture search. arXiv preprint arXiv:1711.00436 (2017)  20. Xie, L., Yuille, A.L.: Genetic cnn. In: ICCV. (2017) 1388-1397 21. Wierstra, D., Gomez, F.J., Schmidhuber, J.: Modeling systems with internal state using evolino. In: Genetic and Evolutionary Computation Conference, GECCO 2005, Proceedings, Washington DC, USA, June 25-29, 2005. (2005) 1795-1802 22. Floreano, D., D¨urr, P., Mattiussi, C.: Neuroevolution: from architectures to learning.  Evolutionary Intelligence 1(1) (2008) 47-62  23. Real, E., Moore, S., Selle, A., Saxena, S., Suematsu, Y.L., Le, Q.V., Kurakin, A.:  Large-scale evolution of image classifiers. CoRR abs/1703.01041 (2017)  24. Fernando, C., Banarse, D., Blundell, C., Zwols, Y., Ha, D., Rusu, A.A., Pritzel, A., Wierstra, D.: Pathnet: Evolution channels gradient descent in super neural networks. CoRR abs/1701.08734 (2017)  25. Zoph, B., Le, Q.V.: Neural architecture search with reinforcement learning. In:  International Conference on Learning Representations (ICLR). (2017)  26. LeCun, Y., Denker, J.S., Solla, S.A.: Optimal brain damage. In: Advances in Neural Information Processing Systems 2, [NIPS Conference, Denver, Colorado, USA, November 27-30, 1989]. (1989) 598-605  27. Han, S., Mao, H., Dally, W.J.: Deep compression: Compressing deep neural network with pruning, trained quantization and huﬀman coding. In: International Conference on Learning Representations (ICLR). (2015)  28. Han, S., Pool, J., Tran, J., Dally, W.J.: Learning both weights and connections for eﬃcient neural network. In: Advances in Neural Information Processing Systems 28, Montreal, Quebec, Canada. (2015) 1135-1143  29. Guo, Y., Yao, A., Chen, Y.: Dynamic network surgery for eﬃcient dnns.  In: Advances in Neural Information Processing Systems 29: Annual Conference on Neural Information Processing Systems 2016, December 5-10, 2016, Barcelona, Spain. (2016) 1379-1387  30. Han, S., Pool, J., Narang, S., Mao, H., Tang, S., Elsen, E., Catanzaro, B., Tran, J., Dally, W.J.: DSD: regularizing deep neural networks with dense-sparse-dense training ﬂow. In: International Conference on Learning Representations (ICLR). (2016)  31. Gastaldi, X.: Shake-shake regularization. CoRR abs/1705.07485 (2017) 32. Adams, R.P., Wallach, H.M., Ghahramani, Z.: Learning the structure of deep sparse graphical models. In: Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics, AISTATS 2010, Chia Laguna Resort, Sardinia, Italy, May 13-15, 2010. (2010) 1-8  33. Saxena, S., Verbeek, J.: Convolutional neural fabrics. In: Advances in Neural Information Processing Systems 29: Annual Conference on Neural Information Processing Systems 2016, December 5-10, 2016, Barcelona, Spain. (2016) 4053-4061 34. Wu, Z., Nagarajan, T., Kumar, A., Rennie, S., Davis, L.S., Grauman, K., Feris, R.: Blockdrop: Dynamic inference paths in residual networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2018) 8817-8826 35. Bengio, Y., L´eonard, N., Courville, A.: Estimating or propagating gradients through stochastic neurons for conditional computation. arXiv preprint arXiv:1308.3432 (2013)   MaskConnect: Connectivity Learning by Gradient Descent36. Bengio, E., Bacon, P.L., Pineau, J., Precup, D.: Conditional computation in neural  networks for faster models. arXiv preprint arXiv:1511.06297 (2015)  37. Bengio, Y.: Deep learning of representations: Looking forward. In: International Conference on Statistical Language and Speech Processing, Springer (2013) 1-37 38. Shazeer, N., Mirhoseini, A., Maziarz, K., Davis, A., Le, Q., Hinton, G., Dean, J.: Outrageously large neural networks: The sparsely-gated mixture-of-experts layer. arXiv preprint arXiv:1701.06538 (2017)  39. Davis, A., Arel, I.: Low-rank approximations for conditional feedforward computa-  tion in deep neural networks. arXiv preprint arXiv:1312.4461 (2013)  40. Eigen, D., Ranzato, M., Sutskever, I.: Learning factored representations in a deep  mixture of experts. arXiv preprint arXiv:1312.4314 (2013) 41. Denoyer, L., Gallinari, P.: Deep sequential neural network.  arXiv preprint  arXiv:1410.0510 (2014)  42. Cho, K., Bengio, Y.: Exponentially increasing the capacity-to-computation ratio for conditional computation in deep learning. arXiv preprint arXiv:1406.7362 (2014) 43. Almahairi, A., Ballas, N., Cooijmans, T., Zheng, Y., Larochelle, H., Courville, A.: Dynamic capacity networks. In: International Conference on Machine Learning. (2016) 2549-2558  44. Courbariaux, M., Bengio, Y., David, J.: Binaryconnect: Training deep neural net- works with binary weights during propagations. In: Advances in Neural Information Processing Systems 28, Montreal, Quebec, Canada. (2015) 3123-3131  45. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  CoRR abs/1512.03385 (2015)  46. Krizhesvsky, A.: Learning multiple layers of features from tiny images (2009) Tech- nical Report https://www.cs.toronto.edu/~kriz/learning-features-2009-TR. pdf.  47. Vinyals, O., Blundell, C., Lillicrap, T., Kavukcuoglu, K., Wierstra, D.: Matching networks for one shot learning. In: Advances in Neural Information Processing Systems 29, Barcelona, Spain. (2016) 3630-3638  48. Deng, J., Dong, W., Socher, R., Li, L., Li, K., Li, F.: Imagenet: A large-scale hierarchical image database. In: 2009 IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR 2009), 20-25 June 2009, Miami, Florida, USA. (2009) 248-255"}