{"1": "1. Ichim, A.E., Bouaziz, S., Pauly, M.: Dynamic 3D avatar creation from hand-held  video input. ACM Transactions on Graphics (ToG) 34(4) (2015) 45  2. Antipov, G., Baccouche, M., Dugelay, J.L.: Face aging with conditional generative  adversarial networks. arXiv preprint arXiv:1702.01983 (2017)  3. Wang, W., Cui, Z., Yan, Y., Feng, J., Yan, S., Shu, X., Sebe, N.: Recurrent face In: The IEEE Conference on Computer Vision and Pattern Recognition  aging. (CVPR). (2016)  4. Ding, H., Sricharan, K., Chellappa, R.: Exprgan: Facial expression editing with controllable expression intensity. In: The Association for the Advance of Artiicial Intelligence (AAAI). (2018)  5. Zhu, Z., Luo, P., Wang, X., Tang, X.: Recover canonical-view faces in the wild with deep neural networks. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2014)  6. Zhang, Z., Peng, Y.: Eyeglasses removal from facial image based on mvlr. In: The  Era of Interactive Media. (2013)  7. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., In: Advances in Neural  Courville, A., Bengio, Y.: Generative adversarial nets. Information Processing Systems (NIPS). (2014)  8. Denton, E.L., Chintala, S., Fergus, R., et al.: Deep generative image models using a฀ laplacian pyramid of adversarial networks. In: Advances in Neural Information Processing Systems (NIPS). (2015)  9. Salimans, T., Goodfellow, I., Zaremba, W., Cheung, V., Radford, A., Chen, X.: Im- proved techniques for training gans. In: Advances in Neural Information Processing Systems (NIPS). (2016)  10. Berthelot, D., Schumm, T., Metz, L.: Began: Boundary equilibrium generative  adversarial networks. arXiv preprint arXiv:1703.10717 (2017)  11. Ledig, C., Theis, L., Huszár, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A., Tejani, A., Totz, J., Wang, Z., et al.: Photo-realistic single image super- resolution using a generative adversarial network. arXiv preprint arXiv:1609.04802 (2016)  12. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation using cycle-consistent adversarial networks. In: The IEEE International Conference on Computer Vision (ICCV). (2017)  13. Zhang, X., Yu, F.X., Chang, S.F., Wang, S.: Deep transfer network: Unsupervised  domain adaptation. CoRR, abs/1503.00591 (2015)  14. Mirza, M., Osindero, S.: Conditional generative adversarial nets. arXiv preprint  arXiv:1411.1784 (2014)  15. Perarnau, G., van de Weijer, J., Raducanu, B., Álvarez, J.M.: Invertible conditional  gans for image editing. arXiv preprint arXiv:1611.06355 (2016)  16. Choi, Y., Choi, M., Kim, M., Ha, J.W., Kim, S., Choo, J.: Stargan: Uniied gen- erative adversarial networks for multi-domain image-to-image translation. arXiv preprint arXiv:1711.09020 (2017)  17. Shen, W., Liu, R.: Learning residual images for face attribute manipulation. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017) arXiv preprint  18. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks.  arXiv:1709.01507 (2017)  19. Wang, F., Jiang, M., Qian, C., Yang, S., Li, C., Zhang, H., Wang, X., Tang, X.: Residual attention network for image classiication. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017)   SaGANReferences  1. Ichim, A.E., Bouaziz, S., Pauly, M.: Dynamic 3D avatar creation from hand-held  video input. ACM Transactions on Graphics (ToG) 34(4) (2015) 45  2. Antipov, G., Baccouche, M., Dugelay, J.L.: Face aging with conditional generative  adversarial networks. arXiv preprint arXiv:1702.01983 (2017)  3. Wang, W., Cui, Z., Yan, Y., Feng, J., Yan, S., Shu, X., Sebe, N.: Recurrent face In: The IEEE Conference on Computer Vision and Pattern Recognition  aging. (CVPR). (2016)  4. Ding, H., Sricharan, K., Chellappa, R.: Exprgan: Facial expression editing with controllable expression intensity. In: The Association for the Advance of Artiicial Intelligence (AAAI). (2018)  5. Zhu, Z., Luo, P., Wang, X., Tang, X.: Recover canonical-view faces in the wild with deep neural networks. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2014)  6. Zhang, Z., Peng, Y.: Eyeglasses removal from facial image based on mvlr. In: The  Era of Interactive Media. (2013)  7. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., In: Advances in Neural  Courville, A., Bengio, Y.: Generative adversarial nets. Information Processing Systems (NIPS). (2014)  8. Denton, E.L., Chintala, S., Fergus, R., et al.: Deep generative image models using a฀ laplacian pyramid of adversarial networks. In: Advances in Neural Information Processing Systems (NIPS). (2015)  9. Salimans, T., Goodfellow, I., Zaremba, W., Cheung, V., Radford, A., Chen, X.: Im- proved techniques for training gans. In: Advances in Neural Information Processing Systems (NIPS). (2016)  10. Berthelot, D., Schumm, T., Metz, L.: Began: Boundary equilibrium generative  adversarial networks. arXiv preprint arXiv:1703.10717 (2017)  11. Ledig, C., Theis, L., Huszár, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A., Tejani, A., Totz, J., Wang, Z., et al.: Photo-realistic single image super- resolution using a generative adversarial network. arXiv preprint arXiv:1609.04802 (2016)  12. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation using cycle-consistent adversarial networks. In: The IEEE International Conference on Computer Vision (ICCV). (2017)  13. Zhang, X., Yu, F.X., Chang, S.F., Wang, S.: Deep transfer network: Unsupervised  domain adaptation. CoRR, abs/1503.00591 (2015)  14. Mirza, M., Osindero, S.: Conditional generative adversarial nets. arXiv preprint  arXiv:1411.1784 (2014)  15. Perarnau, G., van de Weijer, J., Raducanu, B., Álvarez, J.M.: Invertible conditional  gans for image editing. arXiv preprint arXiv:1611.06355 (2016)  16. Choi, Y., Choi, M., Kim, M., Ha, J.W., Kim, S., Choo, J.: Stargan: Uniied gen- erative adversarial networks for multi-domain image-to-image translation. arXiv preprint arXiv:1711.09020 (2017)  17. Shen, W., Liu, R.: Learning residual images for face attribute manipulation. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017) arXiv preprint  18. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks.  arXiv:1709.01507 (2017)  19. Wang, F., Jiang, M., Qian, C., Yang, S., Li, C., Zhang, H., Wang, X., Tang, X.: Residual attention network for image classiication. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017)   16  G. Zhang, M. Kan, S. Shan, and X. Chen  20. Fu, J., Zheng, H., Mei, T.: Look closer to see better: Recurrent attention convolu- tional neural network for ine-grained image recognition. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017)  21. Huang, Q., Xia, C., Wu, C., Li, S., Wang, Y., Song, Y., Kuo, C.C.J.: Semantic seg- mentation with reverse attention. In: British Machine Vision Conference (BMVC). (2017)  22. Gulrajani, I., Ahmed, F., Arjovsky, M., Dumoulin, V., Courville, A.C.: Improved training of wasserstein gans. In: Advances in Neural Information Processing Sys- tems (NIPS). (2017)  23. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con- ditional adversarial networks. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017)  24. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  25. Liu, Z., Luo, P., Wang, X., Tang, X.: Deep learning face attributes in the wild. In:  The IEEE International Conference on Computer Vision (ICCV). (2015)  26. Huang, G.B., Ramesh, M., Berg, T., Learned-Miller, E.: Labeled faces in the wild: A database for studying face recognition in unconstrained environments. Technical report, Technical Report 07-49, University of Massachusetts, Amherst (2007) 27. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks.  In: The European Conference on Computer Vision (ECCV). (2016)"}