{"1": "1. Bilen, H., Pedersoli, M., Tuytelaars, T.: Weakly supervised object detection with  posterior regularization. In: BMVC. pp. 1-12 (2014)  2. Bilen, H., Pedersoli, M., Tuytelaars, T.: Weakly supervised object detection with  convex clustering. In: IEEE CVPR. pp. 1081-1089 (2015)  3. Bilen, H., Vedaldi, A.: Weakly supervised deep detection networks. In: IEEE  CVPR. pp. 2846-2854 (2016)  4. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. preprint arXiv:1412.7062 (2014)  5. Chen, X., Kundu, K., Zhu, Y., Berneshawi, A.G., Ma, H., Fidler, S., Urtasun, R.: 3d object proposals for accurate object class detection. In: NIPS. pp. 424-432 (2015)  6. Cheng, B., Wei, Y., Shi, H., Feris, R., Xiong, J., Huang, T.: Revisiting rcnn: On  awakening the classification power of faster rcnn. In: ECCV (2018)  7. Cinbis, R.G., Verbeek, J., Schmid, C.: Weakly supervised object localization with  multi-fold multiple instance learning. IEEE TPAMI 39(1), 189-203 (2017)  8. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: IEEE CVPR. pp. 248-255 (2009)  9. Deselaers, T., Alexe, B., Ferrari, V.: Weakly supervised localization and learning  with generic knowledge. IJCV 100(3), 275-293 (2012)  10. Diba, A., Sharma, V., Pazandeh, A., Pirsiavash, H., Van Gool, L.: Weakly super-  vised cascaded convolutional networks. In: IEEE CVPR (2017)  11. Everingham, M., Eslami, S.A., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual object classes challenge: A retrospective. IJCV 111(1), 98- 136 (2014)  12. Gidaris, S., Komodakis, N.: Object detection via a multi-region and semantic  segmentation-aware cnn model. In: IEEE ICCV. pp. 1134-1142 (2015)  13. Girshick, R.: Fast r-cnn. In: IEEE ICCV. pp. 1440-1448 (2015) 14. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: IEEE CVPR. pp. 580-587 (2014)  15. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional networks for visual recognition. In: European Conference on Computer Vision. pp. 346-361 (2014)  16. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM Multimedia. pp. 675-678 (2014)  17. Jie, Z., Wei, Y., Jin, X., Feng, J., Liu, W.: Deep self-taught learning for weakly  supervised object localization. In: IEEE CVPR (2017)  18. Kantorov, V., Oquab, M., Cho, M., Laptev, I.: Contextlocnet: Context-aware deep network models for weakly supervised localization. In: ECCV. pp. 350-365 (2016) 19. Kolesnikov, A., Lampert, C.H.: Seed, expand and constrain: Three principles for  weakly-supervised image segmentation. In: ECCV. pp. 695-711 (2016)  20. Lai, B., Gong, X.: Saliency guided end-to-end learning for weakly supervised object  detection. In: IJCAI (2017)  21. Li, D., Huang, J.B., Li, Y., Wang, S., Yang, M.H.: Weakly supervised object lo- calization with progressive domain adaptation. In: IEEE CVPR. pp. 3512-3520 (2016)   TS2CReferences  1. Bilen, H., Pedersoli, M., Tuytelaars, T.: Weakly supervised object detection with  posterior regularization. In: BMVC. pp. 1-12 (2014)  2. Bilen, H., Pedersoli, M., Tuytelaars, T.: Weakly supervised object detection with  convex clustering. In: IEEE CVPR. pp. 1081-1089 (2015)  3. Bilen, H., Vedaldi, A.: Weakly supervised deep detection networks. In: IEEE  CVPR. pp. 2846-2854 (2016)  4. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. preprint arXiv:1412.7062 (2014)  5. Chen, X., Kundu, K., Zhu, Y., Berneshawi, A.G., Ma, H., Fidler, S., Urtasun, R.: 3d object proposals for accurate object class detection. In: NIPS. pp. 424-432 (2015)  6. Cheng, B., Wei, Y., Shi, H., Feris, R., Xiong, J., Huang, T.: Revisiting rcnn: On  awakening the classification power of faster rcnn. In: ECCV (2018)  7. Cinbis, R.G., Verbeek, J., Schmid, C.: Weakly supervised object localization with  multi-fold multiple instance learning. IEEE TPAMI 39(1), 189-203 (2017)  8. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: IEEE CVPR. pp. 248-255 (2009)  9. Deselaers, T., Alexe, B., Ferrari, V.: Weakly supervised localization and learning  with generic knowledge. IJCV 100(3), 275-293 (2012)  10. Diba, A., Sharma, V., Pazandeh, A., Pirsiavash, H., Van Gool, L.: Weakly super-  vised cascaded convolutional networks. In: IEEE CVPR (2017)  11. Everingham, M., Eslami, S.A., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual object classes challenge: A retrospective. IJCV 111(1), 98- 136 (2014)  12. Gidaris, S., Komodakis, N.: Object detection via a multi-region and semantic  segmentation-aware cnn model. In: IEEE ICCV. pp. 1134-1142 (2015)  13. Girshick, R.: Fast r-cnn. In: IEEE ICCV. pp. 1440-1448 (2015) 14. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: IEEE CVPR. pp. 580-587 (2014)  15. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional networks for visual recognition. In: European Conference on Computer Vision. pp. 346-361 (2014)  16. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM Multimedia. pp. 675-678 (2014)  17. Jie, Z., Wei, Y., Jin, X., Feng, J., Liu, W.: Deep self-taught learning for weakly  supervised object localization. In: IEEE CVPR (2017)  18. Kantorov, V., Oquab, M., Cho, M., Laptev, I.: Contextlocnet: Context-aware deep network models for weakly supervised localization. In: ECCV. pp. 350-365 (2016) 19. Kolesnikov, A., Lampert, C.H.: Seed, expand and constrain: Three principles for  weakly-supervised image segmentation. In: ECCV. pp. 695-711 (2016)  20. Lai, B., Gong, X.: Saliency guided end-to-end learning for weakly supervised object  detection. In: IJCAI (2017)  21. Li, D., Huang, J.B., Li, Y., Wang, S., Yang, M.H.: Weakly supervised object lo- calization with progressive domain adaptation. In: IEEE CVPR. pp. 3512-3520 (2016)   16  Y. Wei et al  22. Li, J., Wei, Y., Liang, X., Dong, J., Xu, T., Feng, J., Yan, S.: Attentive contexts for object detection. IEEE Transactions on Multimedia 19(5), 944-954 (2017) 23. Liang, X., Liu, S., Wei, Y., Liu, L., Lin, L., Yan, S.: Towards computational baby learning: A weakly-supervised approach for object detection. In: IEEE ICCV. pp. 999-1007 (2015)  24. Lin, M., Chen, Q., Yan, S.: Network in network. ICLR (2013) 25. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  Single shot multibox detector. In: ECCV. pp. 21-37 (2016)  26. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  segmentation. In: IEEE CVPR (2015)  27. Oquab, M., Bottou, L., Laptev, I., Sivic, J.: Is object localization for free?-weakly- supervised learning with convolutional neural networks. In: IEEE CVPR. pp. 685- 694 (2015)  28. Redmon, J., Farhadi, A.: Yolo9000: better, faster, stronger. In: IEEE CVPR (2017) 29. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de-  tection with region proposal networks. In: NIPS. pp. 91-99 (2015)  30. Shen, Z., Liu, Z., Li, J., Jiang, Y.G., Chen, Y., Xue, X.: Dsod: Learning deeply  supervised object detectors from scratch. In: IEEE ICCV (2017)  31. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. International Conference on Learning Representations (2015)  32. Tang, P., Wang, X., Bai, X., Liu, W.: Multiple instance detection network with  online instance classifier refinement. In: IEEE CVPR (2017)  33. Teh, E.W., Rochan, M., Wang, Y.: Attention networks for weakly supervised object  localization. In: BMVC (2016)  34. Uijlings, J.R., van de Sande, K.E., Gevers, T., Smeulders, A.W.: Selective search  for object recognition. IJCV 104(2), 154-171 (2013)  35. Wang, C., Ren, W., Huang, K., Tan, T.: Weakly supervised object localization  with latent category learning. In: ECCV. pp. 431-445 (2014)  36. Wei, Y., Feng, J., Liang, X., Cheng, M.M., Zhao, Y., Yan, S.: Object region min- ing with adversarial erasing: A simple classification to semantic segmentation ap- proach. In: IEEE CVPR (2017)  37. Wei, Y., Liang, X., Chen, Y., Jie, Z., Xiao, Y., Zhao, Y., Yan, S.: Learning to  segment with image-level annotations. Pattern Recognition (2016)  38. Wei, Y., Liang, X., Chen, Y., Shen, X., Cheng, M.M., Feng, J., Zhao, Y., Yan, S.: Stc: A simple to complex framework for weakly-supervised semantic segmentation. IEEE TPAMI (2016)  39. Wei, Y., Xia, W., Lin, M., Huang, J., Ni, B., Dong, J., Zhao, Y., Yan, S.: Hcp: A ﬂexible cnn framework for multi-label image classification. IEEE TPAMI 38(9), 1901-1907 (2016)  40. Wei, Y., Xiao, H., Shi, H., Jie, Z., Feng, J., Huang, T.S.: Revisiting dilated convo- lution: A simple approach for weakly-and semi-supervised semantic segmentation. In: IEEE CVPR. pp. 7268-7277  41. Xiao, H., Feng, J., Wei, Y., Zhang, M., Yan, S.: Deep salient object detection with dense connections and distraction diagnosis. IEEE Transactions on Multimedia (2018)  42. Zhang, X., Wei, Y., Feng, J., Yang, Y., Huang, T.: Adversarial complementary  learning for weakly supervised object localization. In: IEEE CVPR (2018)  43. Zhang, X., Wei, Y., Kang, G., Yang, Y., Huang, T.: Self-produced guidance for  weakly-supervised object localization. In: ECCV (2018)  44. Zhao, F., Li, J., Zhao, J., Feng, J.: Weakly supervised phrase localization with multi-scale anchored transformer network. In: IEEE CVPR. pp. 5696-5705 (2018)   TS2C45. Zhou, B., Khosla, A., A., L., Oliva, A., Torralba, A.: Learning Deep Features for  Discriminative Localization. IEEE CVPR (2016)  46. Zhu, Y., Urtasun, R., Salakhutdinov, R., Fidler, S.: segdeepm: Exploiting segmen- tation and context in deep neural networks for object detection. In: IEEE CVPR. pp. 4703-4711 (2015)  47. Zitnick, C.L., Doll´ar, P.: Edge boxes: Locating object proposals from edges. In:  ECCV. pp. 391-405 (2014)"}