{"1": "1. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The  Pascal visual object classes (VOC) challenge. IJCV (2010)  2. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft COCO: Common objects in context. In: ECCV. (2014) 3. Mottaghi, R., Chen, X., Liu, X., Cho, N.G., Lee, S.W., Fidler, S., Urtasun, R., Yuille, A.: The role of context for object detection and semantic segmentation in the wild. In: CVPR. (2014)  4. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The Cityscapes dataset for semantic urban scene understanding. In: CVPR. (2016)  5. Chen, H., Qi, X., Yu, L., Dou, Q., Qin, J., Heng, P.A.: DCAN: Deep contour-aware networks for object instance segmentation from histology images. Medical Image Analysis (2017)  6. Yoon, Y., Jeon, H.G., Yoo, D., Lee, J.Y., Kweon, I.S.: Light-field image super- IEEE Signal Processing Letters  resolution using convolutional neural network. (2017)  7. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  8. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmen-  segmentation. In: CVPR. (2015)  tation. In: ICCV. (2015)  9. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: DeepLab: Semantic image segmentation with deep convolutional nets, atrous convolution, and fully connected CRFs. arXiv (2016)  10. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A large-scale  hierarchical image database. In: CVPR. (2009)  11. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Hypercolumns for object  segmentation and fine-grained localization. In: CVPR. (2015)  12. Zheng, S., Jayasumana, S., Romera-Paredes, B., Vineet, V., Su, Z., Du, D., Huang, C., Torr, P.H.: Conditional random fields as recurrent neural networks. In: ICCV. (2015)  13. Liu, Z., Li, X., Luo, P., Loy, C.C., Tang, X.: Semantic image segmentation via  deep parsing network. In: ICCV. (2015)  14. Papandreou, G., Chen, L.C., Murphy, K., Yuille, A.L.: Weakly-and semi- supervised learning of a DCNN for semantic image segmentation. arXiv preprint arXiv:1502.02734 (2015)  15. Lin, D., Dai, J., Jia, J., He, K., Sun, J.: ScribbleSup: Scribble-supervised convolu-  tional networks for semantic segmentation. In: CVPR. (2016)  16. Lin, G., Shen, C., van den Hengel, A., Reid, I.: Eﬃcient piecewise training of deep  structured models for semantic segmentation. In: CVPR. (2016)  17. Lin, G., Milan, A., Shen, C., Reid, I.: RefineNet: Multi-path refinement networks  with identity mappings for high-resolution semantic segmentation. arXiv (2016)  18. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. arXiv  (2016)  19. Peng, C., Zhang, X., Yu, G., Luo, G., Sun, J.: Large kernel matters-improve  semantic segmentation by global convolutional network. arXiv (2017)  20. Chen, L.C., Papandreou, G., Schroﬀ, F., Adam, H.: Rethinking atrous convolution  for semantic image segmentation. arXiv (2017)   Multi-Scale Context Intertwining for Semantic SegmentationReferences  1. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The  Pascal visual object classes (VOC) challenge. IJCV (2010)  2. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft COCO: Common objects in context. In: ECCV. (2014) 3. Mottaghi, R., Chen, X., Liu, X., Cho, N.G., Lee, S.W., Fidler, S., Urtasun, R., Yuille, A.: The role of context for object detection and semantic segmentation in the wild. In: CVPR. (2014)  4. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The Cityscapes dataset for semantic urban scene understanding. In: CVPR. (2016)  5. Chen, H., Qi, X., Yu, L., Dou, Q., Qin, J., Heng, P.A.: DCAN: Deep contour-aware networks for object instance segmentation from histology images. Medical Image Analysis (2017)  6. Yoon, Y., Jeon, H.G., Yoo, D., Lee, J.Y., Kweon, I.S.: Light-field image super- IEEE Signal Processing Letters  resolution using convolutional neural network. (2017)  7. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  8. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmen-  segmentation. In: CVPR. (2015)  tation. In: ICCV. (2015)  9. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: DeepLab: Semantic image segmentation with deep convolutional nets, atrous convolution, and fully connected CRFs. arXiv (2016)  10. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A large-scale  hierarchical image database. In: CVPR. (2009)  11. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Hypercolumns for object  segmentation and fine-grained localization. In: CVPR. (2015)  12. Zheng, S., Jayasumana, S., Romera-Paredes, B., Vineet, V., Su, Z., Du, D., Huang, C., Torr, P.H.: Conditional random fields as recurrent neural networks. In: ICCV. (2015)  13. Liu, Z., Li, X., Luo, P., Loy, C.C., Tang, X.: Semantic image segmentation via  deep parsing network. In: ICCV. (2015)  14. Papandreou, G., Chen, L.C., Murphy, K., Yuille, A.L.: Weakly-and semi- supervised learning of a DCNN for semantic image segmentation. arXiv preprint arXiv:1502.02734 (2015)  15. Lin, D., Dai, J., Jia, J., He, K., Sun, J.: ScribbleSup: Scribble-supervised convolu-  tional networks for semantic segmentation. In: CVPR. (2016)  16. Lin, G., Shen, C., van den Hengel, A., Reid, I.: Eﬃcient piecewise training of deep  structured models for semantic segmentation. In: CVPR. (2016)  17. Lin, G., Milan, A., Shen, C., Reid, I.: RefineNet: Multi-path refinement networks  with identity mappings for high-resolution semantic segmentation. arXiv (2016)  18. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. arXiv  (2016)  19. Peng, C., Zhang, X., Yu, G., Luo, G., Sun, J.: Large kernel matters-improve  semantic segmentation by global convolutional network. arXiv (2017)  20. Chen, L.C., Papandreou, G., Schroﬀ, F., Adam, H.: Rethinking atrous convolution  for semantic image segmentation. arXiv (2017)   16  D. Lin, Y. Ji, D. Lischinski, D. Cohen-Or, and H. Huang  21. Pohlen, T., Hermans, A., Mathias, M., Leibe, B.: Full-resolution residual networks  for semantic segmentation in street scenes. CVPR (2017)  22. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural Computation  (1997)  23. Silberman, N., Hoiem, D., Kohli, P., Fergus, R.: Indoor segmentation and support  inference from RGBD images. In: ECCV. (2012)  24. Song, S., Lichtenberg, S.P., Xiao, J.: SUN RGB-D: A RGB-D scene understanding  benchmark suite. In: CVPR. (2015)  25. Chen, L.C., Zhu, Y., Papandreou, G., Schroﬀ, F., Adam, H.: Encoder-decoder with atrous separable convolution for semantic image segmentation. arXiv preprint arXiv:1802.02611 (2018)  26. Hinton, G., Vinyals, O., Dean, J.: Distilling the knowledge in a neural network.  NIPS (2014)  (2017)  27. Chollet, F.: Xception: Deep learning with depthwise separable convolutions. CVPR  28. Sun, C., Shrivastava, A., Singh, S., Gupta, A.: Revisiting unreasonable eﬀectiveness  of data in deep learning era. In: ICCV. (2017)  29. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  ImageNet classification with deep  convolutional neural networks. In: NIPS. (2012)  30. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  CVPR (2016)  31. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature  pyramid networks for object detection. CVPR (2017)  32. Liang, X., Shen, X., Feng, J., Lin, L., Yan, S.: Semantic object parsing with graph  LSTM. In: ECCV. (2016)  33. Liang, X., Shen, X., Xiang, D., Feng, J., Lin, L., Yan, S.: Semantic object parsing  with local-global long short-term memory. In: CVPR. (2016) 3185-3193  34. Lazebnik, S., Schmid, C., Ponce, J.: Beyond bags of features: Spatial pyramid  matching for recognizing natural scene categories. In: CVPR. (2006)  35. Ronneberger, O., Fischer, P., Brox, T.: U-Net: convolutional networks for biomed-  ical image segmentation. In: MICCAI. (2015)  36. Gadde, R., Jampani, V., Kiefel, M., Kappler, D., Gehler, P.V.: Superpixel convo-  lutional networks using bilateral inceptions. In: ECCV. (2016)  37. Bell, S., Lawrence Zitnick, C., Bala, K., Girshick, R.: Inside-outside net: Detecting objects in context with skip pooling and recurrent neural networks. In: CVPR. (2016)  38. Zeng, X., Ouyang, W., Yan, J., Li, H., Xiao, T., Wang, K., Liu, Y., Zhou, Y., Yang,  B., Wang, Z., et al.: Crafting GBD-Net for object detection. PAMI (2017)  39. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM International Conference on Multimedia. (2014)  40. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  41. Doll´ar, P., Zitnick, C.L.: Structured forests for fast edge detection.  In: ICCV.  image recognition. arXiv (2014)  (2013)  42. Wang, P., Chen, P., Yuan, Y., Liu, D., Huang, Z., Hou, X., Cottrell, G.: Under- standing convolution for semantic segmentation. arXiv preprint arXiv:1702.08502 (2017)  43. Sun, H., Xie, D., Pu, S.: Mixed context networks for semantic segmentation. arXiv  preprint arXiv:1610.05854 (2016)   Multi-Scale Context Intertwining for Semantic Segmentation44. Wu, Z., Shen, C., Hengel, A.v.d.: Wider or deeper: Revisiting the ResNet model  for visual recognition. arXiv preprint arXiv:1611.10080 (2016)  45. Shen, F., Gan, R., Yan, S., Zeng, G.: Semantic segmentation via structured patch  prediction, context CRF and guidance CRF. In: CVPR. (2017)  46. Wang, G., Luo, P., Lin, L., Wang, X.: Learning object interactions and descriptions  for semantic image segmentation. In: CVPR. (2017)  47. Fu, J., Liu, J., Wang, Y., Lu, H.: Stacked deconvolutional network for semantic  segmentation. arXiv preprint arXiv:1708.04943 (2017)  48. Luo, P., Wang, G., Lin, L., Wang, X.: Deep dual learning for semantic image  segmentation. In: CVPR. (2017)  49. Dai, J., He, K., Sun, J.: BoxSup: Exploiting bounding boxes to supervise convo-  lutional networks for semantic segmentation. In: ICCV. (2015)  50. Eigen, D., Fergus, R.: Predicting depth, surface normals and semantic labels with  a common multi-scale convolutional architecture. In: ICCV. (2015)  51. Kendall, A., Badrinarayanan, V., Cipolla, R.: Bayesian segnet: Model uncertainty in deep convolutional encoder-decoder architectures for scene understanding. arXiv (2015)  52. He, Y., Chiu, W.C., Keuper, M., Fritz, M.: RGBD semantic segmentation using  spatio-temporal data-driven pooling. arXiv (2016)  53. Wu, Z., Shen, C., Hengel, A.v.d.: High-performance semantic segmentation using very deep fully convolutional networks. arXiv preprint arXiv:1604.04339 (2016) 54. Hazirbas, C., Ma, L., Domokos, C., Cremers, D.: FuseNet: Incorporating depth into semantic segmentation via fusion-based CNN architecture. In: ACCV. (2016) 55. Lin, D., Chen, G., Cohen-Or, D., Heng, P.A., Huang, H.: Cascaded feature network  for semantic segmentation of RGB-D images. In: ICCV. (2017)"}