{"1": "1. Poggi, M., Tosi, F., Mattoccia, S.: Quantitative evaluation of confidence measures in a machine learning world. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  2. Poggi, M., Mattoccia, S.: Learning from scratch a confidence measure. In: Pro-  ceedings of the 27th British Conference on Machine Vision, BMVC. (2016)  3. Seki, A., Pollefeys, M.: Patch based confidence prediction for dense disparity map.  In: British Machine Vision Conference (BMVC). (2016)  4. Poggi, M., Mattoccia, S.: Learning a general-purpose confidence measure based on o(1) features and a smarter aggregation strategy for semi global matching. In: Proceedings of the 4th International Conference on 3D Vision, 3DV. (2016)  5. Haeusler, R., Nair, R., Kondermann, D.: Ensemble learning for confidence measures  in stereo vision. In: CVPR. Proceedings. (2013) 305-312 1.  6. Fu, Z., Ardabilian, M.: Stereo matching confidence learning based on multi-modal convolution neural networks. In: Representation, analysis and recognition of shape and motion FroM Image data (RFMI). (2017)  7. Menze, M., Geiger, A.: Object scene ﬂow for autonomous vehicles. In: Conference  on Computer Vision and Pattern Recognition (CVPR). (2015)  8. Zbontar, J., LeCun, Y.: Stereo matching by training a convolutional neural network to compare image patches. Journal of Machine Learning Research 17(1-32) (2016) 2  9. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the kitti vision benchmark suite. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 3354-3361  10. Scharstein, D., Hirschmller, H., Kitajima, Y., Krathwohl, G., Nesic, N., Wang, X., Westling, P.: High-resolution stereo datasets with subpixel-accurate ground truth. In Jiang, X., Hornegger, J., Koch, R., eds.: GCPR. Volume 8753 of Lecture Notes in Computer Science., Springer (2014) 31-42  11. Zabih, R., Woodfill, J.: Non-parametric local transforms for computing visual correspondence. In: Proceedings of the Third European Conference on Computer Vision (Vol. II). ECCV ’94, Secaucus, NJ, USA, Springer-Verlag New York, Inc. (1994) 151-158  12. Hirschmuller, H.: Accurate and eﬃcient stereo processing by semi-global matching In: Computer Vision and Pattern Recognition, 2005. and mutual information. CVPR 2005. IEEE Computer Society Conference on. Volume 2., IEEE (2005) 807-814  13. Hu, X., Mordohai, P.: A quantitative evaluation of confidence measures for stereo vision. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) (2012) 2121-2133  14. Scharstein, D., Szeliski, R.: A taxonomy and evaluation of dense two-frame stereo correspondence algorithms. Int. J. Comput. Vision 47(1-3) (apr 2002) 7-42 15. Spyropoulos, A., Komodakis, N., Mordohai, P.: Learning to detect ground control points for improving the accuracy of stereo matching. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR), IEEE (2014) 1621-1628  16. Park, M.G., Yoon, K.J.: Leveraging stereo matching with learning-based confidence measures. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (June 2015)  17. Poggi, M., Mattoccia, S.: Learning to predict stereo reliability enforcing local In: The IEEE Conference on Computer Vision  consistency of confidence maps. and Pattern Recognition (CVPR). (July 2017)   Beyond local reasoning for stereo confidenceReferences  1. Poggi, M., Tosi, F., Mattoccia, S.: Quantitative evaluation of confidence measures in a machine learning world. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  2. Poggi, M., Mattoccia, S.: Learning from scratch a confidence measure. In: Pro-  ceedings of the 27th British Conference on Machine Vision, BMVC. (2016)  3. Seki, A., Pollefeys, M.: Patch based confidence prediction for dense disparity map.  In: British Machine Vision Conference (BMVC). (2016)  4. Poggi, M., Mattoccia, S.: Learning a general-purpose confidence measure based on o(1) features and a smarter aggregation strategy for semi global matching. In: Proceedings of the 4th International Conference on 3D Vision, 3DV. (2016)  5. Haeusler, R., Nair, R., Kondermann, D.: Ensemble learning for confidence measures  in stereo vision. In: CVPR. Proceedings. (2013) 305-312 1.  6. Fu, Z., Ardabilian, M.: Stereo matching confidence learning based on multi-modal convolution neural networks. In: Representation, analysis and recognition of shape and motion FroM Image data (RFMI). (2017)  7. Menze, M., Geiger, A.: Object scene ﬂow for autonomous vehicles. In: Conference  on Computer Vision and Pattern Recognition (CVPR). (2015)  8. Zbontar, J., LeCun, Y.: Stereo matching by training a convolutional neural network to compare image patches. Journal of Machine Learning Research 17(1-32) (2016) 2  9. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the kitti vision benchmark suite. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 3354-3361  10. Scharstein, D., Hirschmller, H., Kitajima, Y., Krathwohl, G., Nesic, N., Wang, X., Westling, P.: High-resolution stereo datasets with subpixel-accurate ground truth. In Jiang, X., Hornegger, J., Koch, R., eds.: GCPR. Volume 8753 of Lecture Notes in Computer Science., Springer (2014) 31-42  11. Zabih, R., Woodfill, J.: Non-parametric local transforms for computing visual correspondence. In: Proceedings of the Third European Conference on Computer Vision (Vol. II). ECCV ’94, Secaucus, NJ, USA, Springer-Verlag New York, Inc. (1994) 151-158  12. Hirschmuller, H.: Accurate and eﬃcient stereo processing by semi-global matching In: Computer Vision and Pattern Recognition, 2005. and mutual information. CVPR 2005. IEEE Computer Society Conference on. Volume 2., IEEE (2005) 807-814  13. Hu, X., Mordohai, P.: A quantitative evaluation of confidence measures for stereo vision. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) (2012) 2121-2133  14. Scharstein, D., Szeliski, R.: A taxonomy and evaluation of dense two-frame stereo correspondence algorithms. Int. J. Comput. Vision 47(1-3) (apr 2002) 7-42 15. Spyropoulos, A., Komodakis, N., Mordohai, P.: Learning to detect ground control points for improving the accuracy of stereo matching. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR), IEEE (2014) 1621-1628  16. Park, M.G., Yoon, K.J.: Leveraging stereo matching with learning-based confidence measures. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (June 2015)  17. Poggi, M., Mattoccia, S.: Learning to predict stereo reliability enforcing local In: The IEEE Conference on Computer Vision  consistency of confidence maps. and Pattern Recognition (CVPR). (July 2017)   16  F. Tosi, M. Poggi, A. Benincasa, S. Mattoccia  18. Poggi, M., Tosi, F., Mattoccia, S.: Even more confident predictions with deep machine-learning. In: 12th IEEE Embedded Vision Workshop (EVW2017) held in conjunction with IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017)  19. Kim, S., Min, D., Kim, S., Sohn, K.: Feature augmentation for learning confidence measure in stereo matching. IEEE Transactions on Image Processing 26(12) (2017) 6019-6033  20. Mostegel, C., Rumpler, M., Fraundorfer, F., Bischof, H.: Using self-contradiction to learn confidence measures in stereo vision. In: 2016 IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2016, Las Vegas, NV, USA, June 27-30, 2016. (2016) 4067-4076  21. Tosi, F., Poggi, M., Tonioni, A., Di Stefano, L., Mattoccia, S.: Learning confidence measures in the wild. In: 28th British Machine Vision Conference (BMVC 2017). (September 2017)  22. Poggi, M., Tosi, F., Mattoccia, S.: Eﬃcient confidence measures for embedded stereo. In: 19th International Conference on Image Analysis and Processing (ICIAP 2017). (September 2017)  23. Marin, G., Zanuttigh, P., Mattoccia, S.: Reliable fusion of tof and stereo depth driven by confidence measures. In: 14th European Conference on Computer Vision (ECCV 2016). (2016) 386-401  24. Poggi, M., Mattoccia, S.: Deep stereo fusion: combining multiple disparity hy- potheses with deep-learning. In: Proceedings of the 4th International Conference on 3D Vision, 3DV. (2016)  25. Shaked, A., Wolf, L.: Improved stereo matching with constant highway networks and reﬂective confidence learning. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017)  26. Tonioni, A., Poggi, M., Mattoccia, S., Di Stefano, L.: Unsupervised adaptation for deep stereo. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  27. Zbontar, J., LeCun, Y.: Computing the stereo matching cost with a convolutional neural network. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2015) 1592-1599  28. Mayer, N., Ilg, E., Hausser, P., Fischer, P., Cremers, D., Dosovitskiy, A., Brox, T.: A large dataset to train convolutional networks for disparity, optical ﬂow, and scene ﬂow estimation. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (June 2016)  29. Kendall, A., Martirosyan, H., Dasgupta, S., Henry, P., Kennedy, R., Bachrach, A., Bry, A.: End-to-end learning of geometry and context for deep stereo regression. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017) 30. Pang, J., Sun, W., Ren, J.S., Yang, C., Yan, Q.: Cascade residual learning: A two- stage convolutional neural network for stereo matching. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)"}