{"1": "1. Ninassi, A., Le Meur, O., Le Callet, P., Barba, D.: Considering temporal variations of spatial visual distortions in video quality assessment. IEEE Journal of Selected Topics in Signal Processing 3(2) (2009) 253-265  2. Bovik, A.C.: Automatic prediction of perceptual image and video quality. Pro-  ceedings of the IEEE 101(9) (2013) 2008-2024  3. Kim, J., Lee, S.: Deep learning of human visual sensitivity in image quality assess- ment framework. In: Proc. IEEE Conf. Comput. Vis. Pattern Recognit.(CVPR). (2017)  4. Suchow, J.W., Alvarez, G.A.: Motion silences awareness of visual change. Current  Biology 21(2) (2011) 140-143  5. Fenimore, C., Libert, J.M., Roitman, P.: Mosquito noise in mpeg-compressed video: test patterns and metrics. In: Proceedings-SPIE The International Society For Optical Enginnering, International Society for Optical Engineering; 1999 (2000) 604-612  6. Jacquin, A., Okada, H., Crouch, P.: Content-adaptive postfiltering for very low bit rate video. In: Data Compression Conference, 1997. DCC’97. Proceedings, IEEE (1997) 111-120  7. Saad, M.A., Bovik, A.C., Charrier, C.: Blind prediction of natural video quality.  IEEE Transactions on Image Processing 23(3) (2014) 1352-1365  8. Manasa, K., Channappayya, S.S.: An optical ﬂow-based full reference video quality assessment algorithm. IEEE Transactions on Image Processing 25(6) (2016) 2480- 2492  9. Kim, T., Lee, S., Bovik, A.C.: Transfer function model of physiological mechanisms underlying temporal visual discomfort experienced when viewing stereoscopic 3d images. IEEE Transactions on Image Processing 24(11) (2015) 4335-4347  10. Kim, J., Zeng, H., Ghadiyaram, D., Lee, S., Zhang, L., Bovik, A.C.: Deep con- volutional neural models for picture-quality prediction: Challenges and solutions to data-driven image quality assessment. IEEE Signal Processing Magazine 34(6) (2017) 130-141  11. Seshadrinathan, K., Soundararajan, R., Bovik, A.C., Cormack, L.K.: Study of subjective and objective quality assessment of video. IEEE Transactions on Image Processing 19(6) (2010) 1427-1441  12. Park, J., Seshadrinathan, K., Lee, S., Bovik, A.C.: Video quality pooling adaptive to perceptual distortion severity. IEEE Transactions on Image Processing 22(2) (2013) 610-620  13. Vinyals, O., Bengio, S., Kudlur, M.: Order matters: Sequence to sequence for sets.  arXiv preprint arXiv:1511.06391 (2015)  14. Yang, J., Ren, P., Zhang, D., Chen, D., Wen, F., Li, H., Hua, G., Yang, J., Li, H., Dai, Y., et al.: Neural aggregation network for video face recognition. In: Proc. IEEE Conf. Comput. Vis. Pattern Recognit.(CVPR). 2492-2495  15. Graves, A., Wayne, G., Danihelka, I.: Neural turing machines. arXiv preprint  16. Robson, J.: Spatial and temporal contrast-sensitivity functions of the visual system.  arXiv:1410.5401 (2014)  Josa 56(8) (1966) 1141-1142  17. Lee, S., Pattichis, M.S., Bovik, A.C.: Foveated video quality assessment. IEEE  Transactions on Multimedia 4(1) (2002) 129-132  18. Lee, S., Pattichis, M.S., Bovik, A.C.: Foveated video compression with optimal rate control. IEEE Transactions on Image Processing 10(7) (2001) 977-992   Deep Video Quality AssessorReferences  1. Ninassi, A., Le Meur, O., Le Callet, P., Barba, D.: Considering temporal variations of spatial visual distortions in video quality assessment. IEEE Journal of Selected Topics in Signal Processing 3(2) (2009) 253-265  2. Bovik, A.C.: Automatic prediction of perceptual image and video quality. Pro-  ceedings of the IEEE 101(9) (2013) 2008-2024  3. Kim, J., Lee, S.: Deep learning of human visual sensitivity in image quality assess- ment framework. In: Proc. IEEE Conf. Comput. Vis. Pattern Recognit.(CVPR). (2017)  4. Suchow, J.W., Alvarez, G.A.: Motion silences awareness of visual change. Current  Biology 21(2) (2011) 140-143  5. Fenimore, C., Libert, J.M., Roitman, P.: Mosquito noise in mpeg-compressed video: test patterns and metrics. In: Proceedings-SPIE The International Society For Optical Enginnering, International Society for Optical Engineering; 1999 (2000) 604-612  6. Jacquin, A., Okada, H., Crouch, P.: Content-adaptive postfiltering for very low bit rate video. In: Data Compression Conference, 1997. DCC’97. Proceedings, IEEE (1997) 111-120  7. Saad, M.A., Bovik, A.C., Charrier, C.: Blind prediction of natural video quality.  IEEE Transactions on Image Processing 23(3) (2014) 1352-1365  8. Manasa, K., Channappayya, S.S.: An optical ﬂow-based full reference video quality assessment algorithm. IEEE Transactions on Image Processing 25(6) (2016) 2480- 2492  9. Kim, T., Lee, S., Bovik, A.C.: Transfer function model of physiological mechanisms underlying temporal visual discomfort experienced when viewing stereoscopic 3d images. IEEE Transactions on Image Processing 24(11) (2015) 4335-4347  10. Kim, J., Zeng, H., Ghadiyaram, D., Lee, S., Zhang, L., Bovik, A.C.: Deep con- volutional neural models for picture-quality prediction: Challenges and solutions to data-driven image quality assessment. IEEE Signal Processing Magazine 34(6) (2017) 130-141  11. Seshadrinathan, K., Soundararajan, R., Bovik, A.C., Cormack, L.K.: Study of subjective and objective quality assessment of video. IEEE Transactions on Image Processing 19(6) (2010) 1427-1441  12. Park, J., Seshadrinathan, K., Lee, S., Bovik, A.C.: Video quality pooling adaptive to perceptual distortion severity. IEEE Transactions on Image Processing 22(2) (2013) 610-620  13. Vinyals, O., Bengio, S., Kudlur, M.: Order matters: Sequence to sequence for sets.  arXiv preprint arXiv:1511.06391 (2015)  14. Yang, J., Ren, P., Zhang, D., Chen, D., Wen, F., Li, H., Hua, G., Yang, J., Li, H., Dai, Y., et al.: Neural aggregation network for video face recognition. In: Proc. IEEE Conf. Comput. Vis. Pattern Recognit.(CVPR). 2492-2495  15. Graves, A., Wayne, G., Danihelka, I.: Neural turing machines. arXiv preprint  16. Robson, J.: Spatial and temporal contrast-sensitivity functions of the visual system.  arXiv:1410.5401 (2014)  Josa 56(8) (1966) 1141-1142  17. Lee, S., Pattichis, M.S., Bovik, A.C.: Foveated video quality assessment. IEEE  Transactions on Multimedia 4(1) (2002) 129-132  18. Lee, S., Pattichis, M.S., Bovik, A.C.: Foveated video compression with optimal rate control. IEEE Transactions on Image Processing 10(7) (2001) 977-992   16  W. Kim et al.  1458-1471  19. Legge, G.E., Foley, J.M.: Contrast masking in human vision. Josa 70(12) (1980)  20. Kim, H., Lee, S., Bovik, A.C.: Saliency prediction on stereoscopic videos. IEEE  Transactions on Image Processing 23(4) (2014) 1476-1490  21. Mittal, A., Saad, M.A., Bovik, A.C.: A completely blind video integrity oracle.  IEEE Transactions on Image Processing 25(1) (2016) 289-300  22. Le Callet, P., Viard-Gaudin, C., Barba, D.: A convolutional neural network ap- proach for objective video quality assessment. IEEE Transactions on Neural Net- works 17(5) (2006) 1316-1327  23. Kim, J., Nguyen, A.D., Lee, S.: Deep CNN-based blind image quality predictor. IEEE Transactions on neural networks and learning systems (99) (2018) 1-14 24. Chandler, D.M., Hemami, S.S.: Vsnr: A wavelet-based visual signal-to-noise ratio for natural images. IEEE Transactions on image processing 16(9) (2007) 2284-2298 25. Seshadrinathan, K., Bovik, A.C.: Motion tuned spatio-temporal quality assessment  of natural videos. IEEE Transactions on image processing 19(2) (2010) 335-350  26. Li, Y., Po, L.M., Cheung, C.H., Xu, X., Feng, L., Yuan, F., Cheung, K.W.: No- reference video quality assessment with 3d shearlet transform and convolutional neural networks. IEEE Transactions on Circuits and Systems for Video Technology 26(6) (2016) 1044-1057  27. Daly, S.J.: Visible diﬀerences predictor: an algorithm for the assessment of image In: Human Vision, Visual Processing, and Digital Display III. Volume  fidelity. 1666., International Society for Optics and Photonics (1992) 2-16  28. Kim, J., Lee, S.: Fully deep blind image quality predictor. IEEE Journal of selected  topics in signal processing 11(1) (2017) 206-220  29. Oh, H., Ahn, S., Kim, J., Lee, S.: Blind deep S3D image quality evaluation via local to global feature aggregation. IEEE Transactions on Image Processing 26(10) (2017) 4923-4936  30. Ye, P., Kumar, J., Kang, L., Doermann, D.: Unsupervised feature learning frame- work for no-reference image quality assessment. In: Proc. IEEE Conf. Comput. Vis. Pattern Recognit.(CVPR), IEEE (2012) 1098-1105  31. : Laboratory of computational perception & image quality, oklahoma state univer- sity, csiq video database. [online]. available: http://vision.okstate.edu/?loc=stmad 32. VQEG: Final report from the video quality experts group on the validation of  objective models of video quality assessment, phase ii  33. Wang, Z., Bovik, A.C., Sheikh, H.R., Simoncelli, E.P.: Image quality assessment: from error visibility to structural similarity. IEEE Transactions on image processing 13(4) (2004) 600-612  34. Sheikh, H.R., Bovik, A.C.: Image information and visual quality. IEEE Transac-  tions on image processing 15(2) (2006) 430-444  35. Vu, P.V., Vu, C.T., Chandler, D.M.: A spatiotemporal most-apparent-distortion model for video quality assessment. In: Image Processing (ICIP), 2011 18th IEEE International Conference on, IEEE (2011) 2505-2508  36. Vu, P.V., Chandler, D.M.: Vis3: an algorithm for video quality assessment via analysis of spatial and spatiotemporal slices. Journal of Electronic Imaging 23(1) (2014) 013016-013016"}