{"1": "1. Angelova, A., Krizhevsky, A., Vanhoucke, V., Ogale, A.S., Ferguson, D.: Real-time pedestrian detection with deep network cascades. In: BMVC. pp. 32.1-32.12 (2015) 2. Benenson, R., Mathias, M., Timofte, R., Gool, L.J.V.: Pedestrian detection at 100  frames per second. In: CVPR. pp. 2903-2910 (2012)  3. Benenson, R., Mathias, M., Tuytelaars, T., Gool, L.J.V.: Seeking the strongest  rigid detector. In: CVPR. pp. 3666-3673 (2013)  4. Brazil, G., Yin, X., Liu, X.: Illuminating pedestrians via simultaneous detection and segmentation. In: IEEE International Conference on Computer Vision, ICCV 2017, Venice, Italy, October 22-29, 2017. pp. 4960-4969 (2017)  5. Cai, Z., Fan, Q., Feris, R.S., Vasconcelos, N.: A unified multi-scale deep convolu- tional neural network for fast object detection. In: ECCV. pp. 354-370 (2016) 6. Cai, Z., Saberian, M.J., Vasconcelos, N.: Learning complexity-aware cascades for  deep pedestrian detection. In: ICCV. pp. 3361-3369 (2015)  7. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. pp. 3213-3223 (2016)  8. Costea, A.D., Nedevschi, S.: Word channel based multiscale pedestrian detection  without image resizing and using only one classifier. In: CVPR (2014)  9. Costea, A.D., Nedevschi, S.: Semantic channels for fast pedestrian detection. In:  CVPR. pp. 2360-2368 (2016)  10. Dai, J., Li, Y., He, K., Sun, J.: R-FCN: object detection via region-based fully  convolutional networks. In: NIPS. pp. 379-387 (2016)  11. Dalal, N., Triggs, B.: Histograms of oriented gradients for human detection. In:  CVPR. pp. 886-893 (2005)  12. Doll´ar, P., Appel, R., Belongie, S.J., Perona, P.: Fast feature pyramids for object  detection. TPAMI 36(8), 1532-1545 (2014)  13. Doll´ar, P., Tu, Z., Perona, P., Belongie, S.J.: Integral channel features. In: BMVC.  pp. 1-11 (2009)  14. Doll´ar, P., Wojek, C., Schiele, B., Perona, P.: Pedestrian detection: An evaluation  of the state of the art. TPAMI 34(4), 743-761 (2012)  15. Du, X., El-Khamy, M., Lee, J., Davis, L.S.: Fused DNN: A deep neural network  fusion approach to fast and robust pedestrian detection. In: WACV (2017)  16. Duan, G., Ai, H., Lao, S.: A structural filter approach to human detection. In:  ECCV. pp. 238-251 (2010)  17. Enzweiler, M., Eigenstetter, A., Schiele, B., Gavrila, D.M.: Multi-cue pedestrian classification with partial occlusion handling. In: CVPR. pp. 990-997 (2010) 18. Ess, A., Leibe, B., Gool, L.J.V.: Depth and appearance for mobile scene analysis.  In: ICCV. pp. 1-8 (2007)  19. Felzenszwalb, P.F., Girshick, R.B., McAllester, D.A., Ramanan, D.: Object detec-  tion with discriminatively trained part-based models. TPAMI 32(9) (2010)  20. Girshick, R.B.: Fast R-CNN. In: ICCV. pp. 1440-1448 (2015) 21. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward  neural networks. In: AISTATS. pp. 249-256 (2010)  22. Hosang, J.H., Omran, M., Benenson, R., Schiele, B.: Taking a deeper look at  pedestrians. In: CVPR. pp. 4073-4082 (2015)  23. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS. pp. 1106-1114 (2012)   Occlusion-aware R-CNN: Detecting Pedestrians in a CrowdReferences  1. Angelova, A., Krizhevsky, A., Vanhoucke, V., Ogale, A.S., Ferguson, D.: Real-time pedestrian detection with deep network cascades. In: BMVC. pp. 32.1-32.12 (2015) 2. Benenson, R., Mathias, M., Timofte, R., Gool, L.J.V.: Pedestrian detection at 100  frames per second. In: CVPR. pp. 2903-2910 (2012)  3. Benenson, R., Mathias, M., Tuytelaars, T., Gool, L.J.V.: Seeking the strongest  rigid detector. In: CVPR. pp. 3666-3673 (2013)  4. Brazil, G., Yin, X., Liu, X.: Illuminating pedestrians via simultaneous detection and segmentation. In: IEEE International Conference on Computer Vision, ICCV 2017, Venice, Italy, October 22-29, 2017. pp. 4960-4969 (2017)  5. Cai, Z., Fan, Q., Feris, R.S., Vasconcelos, N.: A unified multi-scale deep convolu- tional neural network for fast object detection. In: ECCV. pp. 354-370 (2016) 6. Cai, Z., Saberian, M.J., Vasconcelos, N.: Learning complexity-aware cascades for  deep pedestrian detection. In: ICCV. pp. 3361-3369 (2015)  7. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. pp. 3213-3223 (2016)  8. Costea, A.D., Nedevschi, S.: Word channel based multiscale pedestrian detection  without image resizing and using only one classifier. In: CVPR (2014)  9. Costea, A.D., Nedevschi, S.: Semantic channels for fast pedestrian detection. In:  CVPR. pp. 2360-2368 (2016)  10. Dai, J., Li, Y., He, K., Sun, J.: R-FCN: object detection via region-based fully  convolutional networks. In: NIPS. pp. 379-387 (2016)  11. Dalal, N., Triggs, B.: Histograms of oriented gradients for human detection. In:  CVPR. pp. 886-893 (2005)  12. Doll´ar, P., Appel, R., Belongie, S.J., Perona, P.: Fast feature pyramids for object  detection. TPAMI 36(8), 1532-1545 (2014)  13. Doll´ar, P., Tu, Z., Perona, P., Belongie, S.J.: Integral channel features. In: BMVC.  pp. 1-11 (2009)  14. Doll´ar, P., Wojek, C., Schiele, B., Perona, P.: Pedestrian detection: An evaluation  of the state of the art. TPAMI 34(4), 743-761 (2012)  15. Du, X., El-Khamy, M., Lee, J., Davis, L.S.: Fused DNN: A deep neural network  fusion approach to fast and robust pedestrian detection. In: WACV (2017)  16. Duan, G., Ai, H., Lao, S.: A structural filter approach to human detection. In:  ECCV. pp. 238-251 (2010)  17. Enzweiler, M., Eigenstetter, A., Schiele, B., Gavrila, D.M.: Multi-cue pedestrian classification with partial occlusion handling. In: CVPR. pp. 990-997 (2010) 18. Ess, A., Leibe, B., Gool, L.J.V.: Depth and appearance for mobile scene analysis.  In: ICCV. pp. 1-8 (2007)  19. Felzenszwalb, P.F., Girshick, R.B., McAllester, D.A., Ramanan, D.: Object detec-  tion with discriminatively trained part-based models. TPAMI 32(9) (2010)  20. Girshick, R.B.: Fast R-CNN. In: ICCV. pp. 1440-1448 (2015) 21. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward  neural networks. In: AISTATS. pp. 249-256 (2010)  22. Hosang, J.H., Omran, M., Benenson, R., Schiele, B.: Taking a deeper look at  pedestrians. In: CVPR. pp. 4073-4082 (2015)  23. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS. pp. 1106-1114 (2012)   16  S. Zhang, L. Wen, X. Bian, Z. Lei and S. Li  24. Leibe, B., Seemann, E., Schiele, B.: Pedestrian detection in crowded scenes. In:  CVPR. pp. 878-885 (2005)  25. Li, J., Liang, X., Shen, S., Xu, T., Yan, S.: Scale-aware fast R-CNN for pedestrian  detection. IEEE Transactions on Multimedia (2017)  26. Lim, J.J., Zitnick, C.L., Doll´ar, P.: Sketch tokens: A learned mid-level representa-  tion for contour and object detection. In: CVPR. pp. 3158-3165 (2013)  27. Lin, T., Doll´ar, P., Girshick, R.B., He, K., Hariharan, B., Belongie, S.J.: Feature  pyramid networks for object detection. In: CVPR (2017)  28. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S.E., Fu, C., Berg, A.C.:  SSD: single shot multibox detector. In: ECCV. pp. 21-37 (2016)  29. Luo, P., Tian, Y., Wang, X., Tang, X.: Switchable deep network for pedestrian  detection. In: CVPR. pp. 899-906 (2014)  30. Mao, J., Xiao, T., Jiang, Y., Cao, Z.: What can help pedestrian detection? In:  CVPR. pp. 6034-6043 (2017)  31. Mar´ın, J., V´azquez, D., L´opez, A.M., Amores, J., Leibe, B.: Random forests of  local experts for pedestrian detection. In: ICCV. pp. 2592-2599 (2013)  32. Mathias, M., Benenson, R., Timofte, R., Gool, L.J.V.: Handling occlusions with  franken-classifiers. In: ICCV. pp. 1505-1512 (2013)  33. Nam, W., Doll´ar, P., Han, J.H.: Local decorrelation for improved pedestrian de-  tection. In: NIPS. pp. 424-432 (2014)  34. Ohn-Bar, E., Trivedi, M.M.: To boost or not to boost? on the limits of boosted  trees for object detection. In: ICPR. pp. 3350-3355 (2016)  35. Ouyang, W., Wang, X.: A discriminative deep model for pedestrian detection with  occlusion handling. In: CVPR. pp. 3258-3265 (2012)  36. Ouyang, W., Wang, X.: Joint deep learning for pedestrian detection. In: ICCV.  pp. 2056-2063 (2013)  37. Ouyang, W., Wang, X.: Single-pedestrian detection aided by multi-pedestrian de-  tection. In: CVPR. pp. 3198-3205 (2013)  38. Ouyang, W., Zeng, X., Wang, X.: Modeling mutual visibility relationship in pedes-  trian detection. In: CVPR. pp. 3222-3229 (2013)  39. Paisitkriangkrai, S., Shen, C., van den Hengel, A.: Strengthening the eﬀectiveness  of pedestrian detection with spatially pooled features. In: ECCV (2014)  40. Papageorgiou, C., Poggio, T.A.: A trainable system for object detection. IJCV  38(1), 15-33 (2000)  41. Pepik, B., Stark, M., Gehler, P.V., Schiele, B.: Occlusion patterns for object class  detection. In: CVPR. pp. 3286-3293 (2013)  42. Redmon,  J., Farhadi, A.: YOLO9000: better,  faster,  stronger. CoRR  abs/1612.08242 (2016)  43. Ren, S., He, K., Girshick, R.B., Sun, J.: Faster R-CNN: towards real-time object  detection with region proposal networks. TPAMI 39(6), 1137-1149 (2017)  44. Sermanet, P., Kavukcuoglu, K., Chintala, S., LeCun, Y.: Pedestrian detection with unsupervised multi-stage feature learning. In: CVPR. pp. 3626-3633 (2013) 45. Shen, C., Wang, P., Paisitkriangkrai, S., van den Hengel, A.: Training eﬀective  node classifiers for cascade classification. IJCV 103(3), 326-347 (2013)  46. Shet, V.D., Neumann, J., Ramesh, V., Davis, L.S.: Bilattice-based logical reasoning  for human detection. In: CVPR (2007)  47. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. CoRR abs/1409.1556 (2014)  48. Tang, S., Andriluka, M., Schiele, B.: Detection and tracking of occluded people.  In: BMVC. pp. 1-11 (2012)   Occlusion-aware R-CNN: Detecting Pedestrians in a Crowd49. Tian, Y., Luo, P., Wang, X., Tang, X.: Deep learning strong parts for pedestrian  detection. In: ICCV. pp. 1904-1912 (2015)  50. Tian, Y., Luo, P., Wang, X., Tang, X.: Pedestrian detection aided by deep learning  semantic tasks. In: CVPR. pp. 5079-5087 (2015)  51. Toca, C., Ciuc, M., Patrascu, C.: Normalized autobinomial markov channels for  pedestrian detection. In: BMVC. pp. 175.1-175.13 (2015)  52. Uijlings, J.R.R., van de Sande, K.E.A., Gevers, T., Smeulders, A.W.M.: Selective  search for object recognition. IJCV 104(2), 154-171 (2013)  53. Viola, P.A., Jones, M.J.: Robust real-time face detection. IJCV 57(2) (2004) 54. Wang, X., Han, T.X., Yan, S.: An HOG-LBP human detector with partial occlusion  handling. In: ICCV. pp. 32-39 (2009)  55. Wang, X., Xiao, T., Jiang, Y., Shao, S., Sun, J., Shen, C.: Repulsion loss: Detecting  pedestrians in a crowd. CoRR abs/1711.07752 (2017)  56. Wu, B., Nevatia, R.: Detection of multiple, partially occluded humans in a single  image by bayesian combination of edgelet part detectors. In: ICCV (2005)  57. Xu, H., Lv, X., Wang, X., Ren, Z., Bodla, N., Chellappa, R.: Deep regionlets for  object detection. CoRR abs/1712.02408 (2017)  58. Yan, J., Lei, Z., Yi, D., Li, S.Z.: Multi-pedestrian detection in crowded scenes: A  global view. In: CVPR. pp. 3124-3129 (2012)  59. Yan, J., Zhang, X., Lei, Z., Liao, S., Li, S.Z.: Robust multi-resolution pedestrian  detection in traﬃc scenes. In: CVPR. pp. 3033-3040 (2013)  60. Yang, B., Yan, J., Lei, Z., Li, S.Z.: Convolutional channel features. In: ICCV (2015) 61. Yang, F., Choi, W., Lin, Y.: Exploit all the layers: Fast and accurate CNN object detector with scale dependent pooling and cascaded rejection classifiers. In: CVPR (2016)  62. Yang, Y., Wang, Z., Wu, F.: Exploring prior knowledge for pedestrian detection.  In: BMVC. pp. 176.1-176.12 (2015)  63. Zhang, L., Lin, L., Liang, X., He, K.: Is faster R-CNN doing well for pedestrian  detection? In: ECCV. pp. 443-457 (2016)  64. Zhang, S., Bauckhage, C., Cremers, A.B.: Informed haar-like features improve  pedestrian detection. In: CVPR. pp. 947-954 (2014)  65. Zhang, S., Benenson, R., Omran, M., Hosang, J.H., Schiele, B.: How far are we  from solving pedestrian detection? In: CVPR. pp. 1259-1267 (2016)  66. Zhang, S., Benenson, R., Schiele, B.: Filtered channel features for pedestrian de-  tection. In: CVPR. pp. 1751-1760 (2015)  67. Zhang, S., Benenson, R., Schiele, B.: Citypersons: A diverse dataset for pedestrian  detection. In: CVPR. pp. 4457-4465 (2017)  68. Zhang, S., Wen, L., Bian, X., Lei, Z., Li, S.Z.: Single-shot refinement neural network  for object detection. In: CVPR (2018)  69. Zhang, S., Zhu, X., Lei, Z., Shi, H., Wang, X., Li, S.Z.: Detecting face with densely  connected face proposal network. In: CCBR. pp. 3-12 (2017)  70. Zhang, S., Zhu, X., Lei, Z., Shi, H., Wang, X., Li, S.Z.: Faceboxes: A CPU real-time  face detector with high accuracy. In: IJCB (2017)  71. Zhang, S., Zhu, X., Lei, Z., Shi, H., Wang, X., Li, S.Z.: S3FD: Single shot scale-  invariant face detector. In: ICCV (2017)  72. Zhou, C., Yuan, J.: Learning to integrate occlusion-specific detectors for heavily  occluded pedestrian detection. In: ACCV. pp. 305-320 (2016)  73. Zhou, C., Yuan, J.: Multi-label learning of part detectors for heavily occluded  pedestrian detection. In: ICCV. pp. 3506-3515 (2017)  74. Zitnick, C.L., Doll´ar, P.: Edge boxes: Locating object proposals from edges. In:  ECCV. pp. 391-405 (2014)"}