{"1": "1. Thorpe, C., Hebert, M.H., Kanade, T., Shafer, S.A.: Vision and navigation for the carnegie- mellon navlab. IEEE Transactions on Pattern Analysis and Machine Intelligence 10(3) (1988) 360.8373  2. Pomerleau, D.A.: Alvinn: An autonomous land vehicle in a neural network. In: Advances in  neural information processing systems. (1989) 305-313  3. Dickmanns, E.D., Mysliwetz, B., Christians, T.: An integrated spatio-temporal approach to automatic visual guidance of autonomous vehicles. IEEE Transactions on Systems, Man, and Cybernetics 20(6) (1990) 1273-1284  4. Dickmanns, E.D., Graefe, V.: Dynamic monocular machine vision. Machine vision and  applications 1(4) (1988) 223-240  5. Bojarski, M., Del Testa, D., Dworakowski, D., Firner, B., Flepp, B., Goyal, P., Jackel, L.D., Monfort, M., Muller, U., Zhang, J., et al.: End to end learning for self-driving cars. arXiv preprint arXiv:1604.07316 (2016)  6. Xu, H., Gao, Y., Yu, F., Darrell, T.: End-to-end learning of driving models from large-scale video datasets. In: Proceedings of the IEEE conference on computer vision and pattern recog- nition. (2017) 2174-2182  7. Kim, J., Canny, J.: Interpretable learning for self-driving cars by visualizing causal attention.  In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  8. Chen, C., Seff, A., Kornhauser, A., Xiao, J.: Deepdriving: Learning affordance for direct perception in autonomous driving. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 2722-2730  9. Bojarski, M., Yeres, P., Choromanska, A., Choromanski, K., Firner, B., Jackel, L., Muller, U.: Explaining how a deep neural network trained with end-to-end learning steers a car. arXiv preprint arXiv:1704.07911 (2017)  10. Tishby, N., Zaslavsky, N.: Deep learning and the information bottleneck principle. In: Infor-  mation Theory Workshop (ITW), 2015 IEEE, IEEE (2015) 1-5  11. Shwartz-Ziv, R., Tishby, N.: Opening the black box of deep neural networks via information.  arXiv preprint arXiv:1703.00810 (2017)  12. Torralba, A., Efros, A.A.: Unbiased look at dataset bias. In: Computer Vision and Pattern  Recognition (CVPR), 2011 IEEE Conference on, IEEE (2011) 1521-1528  13. Janai, J., G¨uney, F., Behl, A., Geiger, A.: Computer vision for autonomous vehicles: Prob-  lems, datasets and state-of-the-art. arXiv preprint arXiv:1704.05519 (2017)  14.  :  Autonomous off-road vehicle control using end-to-end learning.  http://net-  scale.com/doc/net-scale-dave-report.pdf Accessed: 2017-10-20.  15. Huval, B., Wang, T., Tandon, S., Kiske, J., Song, W., Pazhayampallil, J., Andriluka, M., Rajpurkar, P., Migimatsu, T., Cheng-Yue, R., et al.: An empirical evaluation of deep learning on highway driving. arXiv preprint arXiv:1504.01716 (2015)  16. Bickel, S., Br¨uckner, M., Scheffer, T.: Discriminative learning for differing training and test distributions. In: Proceedings of the 24th international conference on Machine learning, ACM (2007) 81-88  17. Patel, V.M., Gopalan, R., Li, R., Chellappa, R.: Visual domain adaptation: A survey of recent  advances. IEEE signal processing magazine 32(3) (2015) 53-69  18. Tzeng, E., Hoffman, J., Saenko, K., Darrell, T.: Adversarial discriminative domain adapta- tion. In: Computer Vision and Pattern Recognition (CVPR), 2017 IEEE Conference on, IEEE (2017) 7167-7176  19. Ganin, Y., Lempitsky, V.: Unsupervised domain adaptation by backpropagation. In: Interna-  tional Conference on Machine Learning. (2015) 1180-1189   Domain Unification for End-to-End DrivingReferences  1. Thorpe, C., Hebert, M.H., Kanade, T., Shafer, S.A.: Vision and navigation for the carnegie- mellon navlab. IEEE Transactions on Pattern Analysis and Machine Intelligence 10(3) (1988) 360.8373  2. Pomerleau, D.A.: Alvinn: An autonomous land vehicle in a neural network. In: Advances in  neural information processing systems. (1989) 305-313  3. Dickmanns, E.D., Mysliwetz, B., Christians, T.: An integrated spatio-temporal approach to automatic visual guidance of autonomous vehicles. IEEE Transactions on Systems, Man, and Cybernetics 20(6) (1990) 1273-1284  4. Dickmanns, E.D., Graefe, V.: Dynamic monocular machine vision. Machine vision and  applications 1(4) (1988) 223-240  5. Bojarski, M., Del Testa, D., Dworakowski, D., Firner, B., Flepp, B., Goyal, P., Jackel, L.D., Monfort, M., Muller, U., Zhang, J., et al.: End to end learning for self-driving cars. arXiv preprint arXiv:1604.07316 (2016)  6. Xu, H., Gao, Y., Yu, F., Darrell, T.: End-to-end learning of driving models from large-scale video datasets. In: Proceedings of the IEEE conference on computer vision and pattern recog- nition. (2017) 2174-2182  7. Kim, J., Canny, J.: Interpretable learning for self-driving cars by visualizing causal attention.  In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  8. Chen, C., Seff, A., Kornhauser, A., Xiao, J.: Deepdriving: Learning affordance for direct perception in autonomous driving. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 2722-2730  9. Bojarski, M., Yeres, P., Choromanska, A., Choromanski, K., Firner, B., Jackel, L., Muller, U.: Explaining how a deep neural network trained with end-to-end learning steers a car. arXiv preprint arXiv:1704.07911 (2017)  10. Tishby, N., Zaslavsky, N.: Deep learning and the information bottleneck principle. In: Infor-  mation Theory Workshop (ITW), 2015 IEEE, IEEE (2015) 1-5  11. Shwartz-Ziv, R., Tishby, N.: Opening the black box of deep neural networks via information.  arXiv preprint arXiv:1703.00810 (2017)  12. Torralba, A., Efros, A.A.: Unbiased look at dataset bias. In: Computer Vision and Pattern  Recognition (CVPR), 2011 IEEE Conference on, IEEE (2011) 1521-1528  13. Janai, J., G¨uney, F., Behl, A., Geiger, A.: Computer vision for autonomous vehicles: Prob-  lems, datasets and state-of-the-art. arXiv preprint arXiv:1704.05519 (2017)  14.  :  Autonomous off-road vehicle control using end-to-end learning.  http://net-  scale.com/doc/net-scale-dave-report.pdf Accessed: 2017-10-20.  15. Huval, B., Wang, T., Tandon, S., Kiske, J., Song, W., Pazhayampallil, J., Andriluka, M., Rajpurkar, P., Migimatsu, T., Cheng-Yue, R., et al.: An empirical evaluation of deep learning on highway driving. arXiv preprint arXiv:1504.01716 (2015)  16. Bickel, S., Br¨uckner, M., Scheffer, T.: Discriminative learning for differing training and test distributions. In: Proceedings of the 24th international conference on Machine learning, ACM (2007) 81-88  17. Patel, V.M., Gopalan, R., Li, R., Chellappa, R.: Visual domain adaptation: A survey of recent  advances. IEEE signal processing magazine 32(3) (2015) 53-69  18. Tzeng, E., Hoffman, J., Saenko, K., Darrell, T.: Adversarial discriminative domain adapta- tion. In: Computer Vision and Pattern Recognition (CVPR), 2017 IEEE Conference on, IEEE (2017) 7167-7176  19. Ganin, Y., Lempitsky, V.: Unsupervised domain adaptation by backpropagation. In: Interna-  tional Conference on Machine Learning. (2015) 1180-1189   16  L. Yang, X. Liang, T. Wang and E. Xing  20. Tzeng, E., Hoffman, J., Darrell, T., Saenko, K.: Simultaneous deep transfer across domains and tasks. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 4068-4076  21. Liu, M.Y., Tuzel, O.: Coupled generative adversarial networks.  In: Advances in neural  information processing systems. (2016) 469-477  22. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation using cycle- consistent adversarial networks. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  23. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with conditional ad- versarial networks. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017)  24. Johnson, J., Alahi, A., Fei-Fei, L.: Perceptual losses for real-time style transfer and super-  resolution. In: European Conference on Computer Vision, Springer (2016) 694-711  25. Bousmalis, K., Silberman, N., Dohan, D., Erhan, D., Krishnan, D.: Unsupervised pixel- level domain adaptation with generative adversarial networks. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2017) 3722-3731  26. Shrivastava, A., Pfister, T., Tuzel, O., Susskind, J., Wang, W., Webb, R.: Learning from simulated and unsupervised images through adversarial training. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017)  27. Tobin, J., Fong, R., Ray, A., Schneider, J., Zaremba, W., Abbeel, P.: Domain randomiza- tion for transferring deep neural networks from simulation to the real world. arXiv preprint arXiv:1703.06907 (2017)  28. You, Y., Pan, X., Wang, Z., Lu, C.: Virtual to real reinforcement learning for autonomous  driving. arXiv preprint arXiv:1704.03952 (2017)  29. Mirza, M., Osindero, S.: arXiv:1411.1784 (2014)  Conditional generative adversarial nets.  arXiv preprint  30. Wymann, B., Espi´e, E., Guionneau, C., Dimitrakakis, C., Coulom, R., Sumner, A.: Torcs, the open racing car simulator. Software available at http://torcs. sourceforge. net (2000) 31. Dosovitskiy, A., Ros, G., Codevilla, F., Lopez, A., Koltun, V.: CARLA: An open urban driving simulator. In: Proceedings of the 1st Annual Conference on Robot Learning. (2017) 1-16  32. Codevilla, F., M¨uller, M., L´opez, A., Koltun, V., Dosovitskiy, A.: End-to-end driving via In: International Conference on Robotics and Automation  conditional imitation learning. (ICRA). (2018)  33. Santana, E., Hotz, G.: Learning a driving simulator. arXiv preprint arXiv:1608.01230 (2016) https://github.com/udacity/self-driving- 34.  : Udacity self-driving-car challenge dataset.  car/tree/master/datasets Accessed: 2017-10-20.  35. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., et al.: Tensorﬂow: Large-scale machine learning on heterogeneous distributed systems. arXiv preprint arXiv:1603.04467 (2016)  36. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In: International Confer-  ence on Learning Representations. (2015)  37. Mao, X., Li, Q., Xie, H., Lau, R.Y., Wang, Z.: Least squares generative adversarial networks.  In: Proceedings of the IEEE International Conference on Computer Vision. (2017)"}