{"1": "1. Bajaj, C., Gao, T., He, Z., Huang, Q., Liang, Z.: SMAC: simultaneous mapping and clustering using spectral decompositions. In: Proceedings of the 35th International Conference on Machine Learning, ICML 2018, Stockholmsm¨assan, Stockholm, Swe- den, July 10-15, 2018. pp. 334-343 (2018), http://proceedings.mlr.press/v80/ bajaj18a.html  2. Berg, A.C., Berg, T.L., Malik, J.: Shape matching and object recognition using low distortion correspondences. In: CVPR (1). pp. 26-33. IEEE Computer Society (2005)  3. Bregler, C., Hertzmann, A., Biermann, H.: Recovering non-rigid 3d shape from  image streams. In: CVPR. pp. 2690-2696. IEEE Computer Society (2000)  4. Carreira, J., Kar, A., Tulsiani, S., Malik, J.: Virtual view networks for object reconstruction. In: Computer Vision and Pattern Regognition (CVPR) (2015) 5. Chen, Y., Guibas, L.J., Huang, Q.: Near-optimal joint object matching via con- vex relaxation. In: Proceedings of the 31th International Conference on Machine Learning, ICML 2014, Beijing, China, 21-26 June 2014. pp. 100-108. Proceedings of Machine Learning Research, NY, USA (2014)  6. Cho, M., Lee, J., Lee, K.M.: Reweighted random walks for graph matching. In: ECCV (5). Lecture Notes in Computer Science, vol. 6315, pp. 492-505. Springer (2010)  7. Cosmo, L., Rodol`a, E., Albarelli, A., M´emoli, F., Cremers, D.: Consistent partial matching of shape collections via sparse modeling. Comput. Graph. Forum 36(1), 209-221 (2017)  8. Crandall, D., Owens, A., Snavely, N., Huttenlocher, D.: SfM with MRFs: Discrete- continuous optimization for large-scale structure from motion. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 35(12), 2841-2853 (Decem- ber 2013)  9. Dai, Y., Li, H., He, M.: A simple prior-free method for non-rigid structure-from- motion factorization. International Journal of Computer Vision 107(2), 101-122 (2014)  10. Daubechies, I., DeVore, R.A., Fornasier, M., G¨unt¨urk, C.S.: Iteratively re- weighted least squares minimization: Proof of faster than linear rate for sparse recovery. In: 42nd Annual Conference on Information Sciences and Sys- tems, CISS 2008, Princeton, NJ, USA, 19-21 March 2008. pp. 26-29 (2008). https://doi.org/10.1109/CISS.2008.4558489  11. Diaconis, P.: Group representations in probability and statistics. Institute of Math- ematical Statistics Lecture Notes—Monograph Series, 11, Institute of Mathemati- cal Statistics, Hayward, CA (1988)  12. Doll´ar, P., Zitnick, C.L.: Structured forests for fast edge detection. In: Pro- ceedings of the 2013 IEEE International Conference on Computer Vision. pp. 1841-1848. ICCV ’13, IEEE Computer Society, Washington, DC, USA (2013). https://doi.org/10.1109/ICCV.2013.231, http://dx.doi.org/10.1109/ ICCV.2013.231  13. Duchenne, O., Bach, F.R., Kweon, I., Ponce, J.: A tensor-based algorithm for high- order graph matching. IEEE Trans. Pattern Anal. Mach. Intell. 33(12), 2383-2395 (2011)  14. Dym, N., Maron, H., Lipman, Y.: Ds++: A ﬂexible, scalable and provably tight relaxation for matching problems. ACM Trans. Graph. 36(6), 184:1-184:14 (Nov 2017). https://doi.org/10.1145/3130800.3130826, http://doi.acm.org/10.1145/ 3130800.3130826   Joint Map and Symmetry SynchronizationReferences  1. Bajaj, C., Gao, T., He, Z., Huang, Q., Liang, Z.: SMAC: simultaneous mapping and clustering using spectral decompositions. In: Proceedings of the 35th International Conference on Machine Learning, ICML 2018, Stockholmsm¨assan, Stockholm, Swe- den, July 10-15, 2018. pp. 334-343 (2018), http://proceedings.mlr.press/v80/ bajaj18a.html  2. Berg, A.C., Berg, T.L., Malik, J.: Shape matching and object recognition using low distortion correspondences. In: CVPR (1). pp. 26-33. IEEE Computer Society (2005)  3. Bregler, C., Hertzmann, A., Biermann, H.: Recovering non-rigid 3d shape from  image streams. In: CVPR. pp. 2690-2696. IEEE Computer Society (2000)  4. Carreira, J., Kar, A., Tulsiani, S., Malik, J.: Virtual view networks for object reconstruction. In: Computer Vision and Pattern Regognition (CVPR) (2015) 5. Chen, Y., Guibas, L.J., Huang, Q.: Near-optimal joint object matching via con- vex relaxation. In: Proceedings of the 31th International Conference on Machine Learning, ICML 2014, Beijing, China, 21-26 June 2014. pp. 100-108. Proceedings of Machine Learning Research, NY, USA (2014)  6. Cho, M., Lee, J., Lee, K.M.: Reweighted random walks for graph matching. In: ECCV (5). Lecture Notes in Computer Science, vol. 6315, pp. 492-505. Springer (2010)  7. Cosmo, L., Rodol`a, E., Albarelli, A., M´emoli, F., Cremers, D.: Consistent partial matching of shape collections via sparse modeling. Comput. Graph. Forum 36(1), 209-221 (2017)  8. Crandall, D., Owens, A., Snavely, N., Huttenlocher, D.: SfM with MRFs: Discrete- continuous optimization for large-scale structure from motion. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 35(12), 2841-2853 (Decem- ber 2013)  9. Dai, Y., Li, H., He, M.: A simple prior-free method for non-rigid structure-from- motion factorization. International Journal of Computer Vision 107(2), 101-122 (2014)  10. Daubechies, I., DeVore, R.A., Fornasier, M., G¨unt¨urk, C.S.: Iteratively re- weighted least squares minimization: Proof of faster than linear rate for sparse recovery. In: 42nd Annual Conference on Information Sciences and Sys- tems, CISS 2008, Princeton, NJ, USA, 19-21 March 2008. pp. 26-29 (2008). https://doi.org/10.1109/CISS.2008.4558489  11. Diaconis, P.: Group representations in probability and statistics. Institute of Math- ematical Statistics Lecture Notes—Monograph Series, 11, Institute of Mathemati- cal Statistics, Hayward, CA (1988)  12. Doll´ar, P., Zitnick, C.L.: Structured forests for fast edge detection. In: Pro- ceedings of the 2013 IEEE International Conference on Computer Vision. pp. 1841-1848. ICCV ’13, IEEE Computer Society, Washington, DC, USA (2013). https://doi.org/10.1109/ICCV.2013.231, http://dx.doi.org/10.1109/ ICCV.2013.231  13. Duchenne, O., Bach, F.R., Kweon, I., Ponce, J.: A tensor-based algorithm for high- order graph matching. IEEE Trans. Pattern Anal. Mach. Intell. 33(12), 2383-2395 (2011)  14. Dym, N., Maron, H., Lipman, Y.: Ds++: A ﬂexible, scalable and provably tight relaxation for matching problems. ACM Trans. Graph. 36(6), 184:1-184:14 (Nov 2017). https://doi.org/10.1145/3130800.3130826, http://doi.acm.org/10.1145/ 3130800.3130826   16  Sun Y., Liang Z., Huang X., Huang Q.  15. Giorgi, D., Biasotti, S., Paraboschi, L.: Shape retrieval contest 2007: Watertight  models track (2007)  16. Huang, Q.X., Guibas, L.: Consistent shape maps via semidefinite programming.  Computer Graphics Forum 32(5), 177-186 (2013)  17. Huang, Q., Zhang, G., Gao, L., Hu, S., Butscher, A., Guibas, L.J.: An optimization approach for extracting and encoding consistent maps in a shape collection. ACM Trans. Graph. 31(6), 167:1-167:11 (2012)  18. Huang, Q., Chen, Y., Guibas, L.: Scalable semidefinite relaxation for maximum a posterior estimation. In: Proceedings of the 31st International Conference on Machine Learning, PMLR 32(2). pp. 64-72 (2014)  19. Huang, Q., Wang, F., Guibas, L.: Functional map networks for analyzing and exploring large shape collections. ACM Trans. Graph. 33(4), 36:1-36:11 (Jul 2014). https://doi.org/10.1145/2601097.2601111, http://doi.acm.org/10.1145/ 2601097.2601111  20. Huang, X., Liang, Z., Bajaj, C., Huang, Q.: Translation synchronization via trun-  cated least squares. In: NIPS (2017)  21. van Kaick, O., Zhang, H., Hamarneh, G., Cohen-Or, D.: A survey on shape corre-  spondence. Computer Graphics Forum 30(6), 1681-1707 (2011)  22. Kerber, J., Bokeloh, M., Wand, M., Seidel, H.P.: Scalable symmetry detection for  urban scenes. Computer Graphics Forum 32(1), 3-15 (2013)  23. Kezurer, I., Kovalsky, S.Z., Basri, R., Lipman, Y.: Tight relaxation of quadratic  matching. Comput. Graph. Forum 34(5), 115-128 (2015)  24. Kim, V.G., Li, W., Mitra, N.J., DiVerdi, S., Funkhouser, T.: Exploring collections of 3d models using fuzzy correspondences. ACM Trans. Graph. 31(4), 54:1-54:11 (Jul 2012). https://doi.org/10.1145/2185520.2185550  25. Kim, V.G., Lipman, Y., Chen, X., Funkhouser, T.A.: M¨obius transformations for global intrinsic symmetry analysis. Comput. Graph. Forum 29(5), 1689-1700 (2010)  26. Kim, V.G., Lipman, Y., Funkhouser, T.: Blended intrinsic maps. ACM Trans.  Graph. 30(4), 79:1-79:12 (Jul 2011)  27. Kumar, M.P., Kolmogorov, V., Torr, P.H.S.: An analysis of convex relaxations for MAP estimation of discrete mrfs. Journal of Machine Learning Research 10, 71-106 (2009). https://doi.org/10.1145/1577069.1577072, http://doi.acm.org/10.1145/ 1577069.1577072  28. Lasowski, R., Tevs, A., Seidel, H., Wand, M.: A probabilistic framework for partial intrinsic symmetries in geometric data. In: ICCV. pp. 963-970. IEEE Computer Society, Kyoto, Japan (2009)  29. Leonardos, S., Zhou, X., Daniilidis, K.: Distributed consistent data association via  permutation synchronization. In: ICRA. pp. 2645-2652. IEEE (2017)  Funkhouser, T.: M ¨Obius  30. Lipman, Y., spondence. https://doi.org/10.1145/1531326.1531378, 1531326.1531378  ACM Trans.  Graph.  28(3),  for  voting  corre- 2009). http://doi.acm.org/10.1145/  surface (Jul  72:1-72:12  31. Liu, C., Yuen, J., Torralba, A.: Nonparametric scene parsing via label transfer.  IEEE Trans. Pattern Anal. Mach. Intell. 33(12), 2368-2382 (2011)  32. Liu, C., Yuen, J., Torralba, A.: Sift ﬂow: Dense correspondence across scenes and its applications. IEEE Trans. Pattern Anal. Mach. Intell. 33(5), 978-994 (May 2011)  33. Liu, T., Kim, V.G., Funkhouser, T.A.: Finding surface correspondences using sym- metry axis curves. Comput. Graph. Forum 31(5), 1607-1616 (August 2012)   Joint Map and Symmetry Synchronization34. Lowe, D.G.: Distinctive Int.  Comput. points. https://doi.org/10.1023/B:VISI.0000029664.99615.94, 1023/B:VISI.0000029664.99615.94  Vision  60(2),  J.  image  features  from scale-invariant  key- 2004). https://doi.org/10.  (Nov  91-110  35. Markovsky, I.: Low Rank Approximation: Algorithms, Implementation, Applica-  tions. Springer Publishing Company, Incorporated (2011)  36. Mitra, N.J., Guibas, L.J., Pauly, M.: Partial and approximate symmetry detection  for 3d geometry. ACM Trans. Graph. 25(3), 560-568 (July 2006)  37. Nguyen, A., Ben-Chen, M., Welnicka, K., Ye, Y., Guibas, L.J.: An optimization approach to improving collections of shape maps. Comput. Graph. Forum 30(5), 1481-1491 (2011). https://doi.org/10.1111/j.1467-8659.2011.02022.x  38. Ovsjanikov, M., Ben-Chen, M., Solomon, J., Butscher, A., Guibas, L.J.: Functional maps: a ﬂexible representation of maps between shapes. ACM Trans. Graph. 31(4), 30:1-30:11 (2012). https://doi.org/10.1145/2185520.2185526  39. Ovsjanikov, M., M´erigot, Q., Patraucean, V., Guibas, L.J.: Shape match- spaces. Comput. Graph. Forum 32(5), 1-11 (2013).  ing via quotient https://doi.org/10.1111/cgf.12167  40. Ovsjanikov, M., Sun, J., Guibas, L.J.: Global intrinsic symmetries of shapes. Com-  put. Graph. Forum 27(5), 1341-1348 (2008)  41. Pachauri, D., Kondor, R., Sargur, G., Singh, V.: Permutation diﬀusion maps (pdm) with application to the image association problem in computer vision. In: Proceed- ings of the 27th International Conference on Neural Information Processing Sys- tems - Volume 1. pp. 541-549. NIPS’14, MIT Press, Cambridge, MA, USA (2014), http://dl.acm.org/citation.cfm?id=2968826.2968887  42. Pachauri, D., Kondor, R., Singh, V.: Solving the multi-way matching problem by permutation synchronization. In: Burges, C.J.C., Bottou, L., Welling, M., Ghahra- mani, Z., Weinberger, K.Q. (eds.) Advances in Neural Information Processing Sys- tems 26, pp. 1860-1868. Curran Associates, Inc. (2013)  43. Pachauri, D., Kondor, R., Singh, V.: Solving the multi-way matching problem by permutation synchronization. In: Proceedings of the 26th International Con- ference on Neural Information Processing Systems - Volume 2. pp. 1860-1868. NIPS’13, Curran Associates Inc., USA (2013), http://dl.acm.org/citation. cfm?id=2999792.2999820  44. Podolak, J., Shilane, P., Golovinskiy, A., Rusinkiewicz, S., Funkhouser, T.: A planar-reﬂective symmetry transform for 3d shapes. ACM Trans. Graph. 25(3), 549-559 (July 2006)  45. Raviv, D., Bronstein, A.M., Bronstein, M.M., Kimmel, R.: Full and partial symme- tries of non-rigid shapes. International Journal of Computer Vision 89(1), 18-39 (2010)  46. Raviv, D., Bronstein, M.M., Sapiro, G., Bronstein, A.M., Kimmel, R.: Diﬀusion  symmetries of non-rigid shapes. In: In Proc. 3DPVT (2010)  47. Rodol`a, E., Cosmo, L., Bronstein, M.M., Torsello, A., Cremers, D.: Partial func- tional correspondence. CoRR abs/1506.05274 (2015), http://arxiv.org/abs/ 1506.05274  48. Rubinstein, M., Joulin, A., Kopf, J., Liu, C.: Unsupervised joint object dis- covery and segmentation in internet images. In: CVPR. pp. 1939-1946. IEEE Computer Society (2013), http://dblp.uni-trier.de/db/conf/cvpr/cvpr2013. html#RubinsteinJKL13  49. Rubio, J.C., Serrat, J., L´opez, A.M., Paragios, N.: Unsupervised co-segmentation through region matching. In: CVPR. pp. 749-756. IEEE Computer Society (2012)   18  Sun Y., Liang Z., Huang X., Huang Q.  50. Russell, B., Torralba, A., Liu, C., Fergus, R., Freeman, W.T.: Object recognition by scene alignment. In: Platt, J.C., Koller, D., Singer, Y., Roweis, S.T. (eds.) Advances in Neural Information Processing Systems 20. pp. 1241-1248. Curran Associates, Inc. (2007)  51. Shen, Y., Huang, Q., Srebro, N., Sanghavi, S.: Normalized spectral map synchro- nization. In: NIPS. pp. 4925-4933. Curran Associates, Barcelona, Spain (2016) 52. Shi, Z., Alliez, P., Desbrun, M., Bao, H., Huang, J.: Symmetry and orbit detection  via lie-algebra voting. Comput. Graph. Forum 35(5), 217-227 (2016)  53. Singer, A., Wu, H.T.: Spectral convergence of the connection laplacian from ran- dom samples. Information and Inference: A Journal of the IMA 35(6), 58-123 (2017)  54. Snavely, N., Seitz, S.M., Szeliski, R.: Photo tourism: Exploring photo 2006). http://doi.acm.org/10.1145/  collections https://doi.org/10.1145/1141911.1141964, 1141911.1141964  3d. ACM Trans. Graph. 25(3),  835-846  (Jul  in  55. Tam, G.K.L., Martin, R.R., Rosin, P.L., Lai, Y.K.: Diﬀusion pruning for rapidly and robustly selecting global correspondences using local isometry. ACM Trans. Graph. 33(1), 4:1-4:17 (Feb 2014)  56. Taniai, T., Sinha, S.N., Sato, Y.: Joint recovery of dense correspondence and cosegmentation in two images. In: 2016 IEEE Conference on Computer Vi- sion and Pattern Recognition, CVPR 2016, Las Vegas, NV, USA, June 27- 30, 2016. pp. 4246-4255 (2016). https://doi.org/10.1109/CVPR.2016.460, https: //doi.org/10.1109/CVPR.2016.460  57. Tevs, A., Huang, Q., Wand, M., Seidel, H.P., Guibas, L.: Relating shapes via geo- metric symmetries and regularities. ACM Trans. Graph. 33(4), 119:1-119:12 (Jul 2014). https://doi.org/10.1145/2601097.2601220, http://doi.acm.org/10.1145/ 2601097.2601220  58. Vestner, M., Litman, R., Rodola, E., Bronstein, A., Cremers, D.: Product manifold filter: Non-rigid shape correspondence via kernel density estimation in the product space. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017)  59. Vicente, S., Carreira, J., Agapito, L., Batista, J.: Reconstructing PASCAL VOC.  In: CVPR. pp. 41-48. IEEE Computer Society (2014)  60. Wang, F., Huang, Q., Guibas, L.: Image co-segmentation via consistent functional maps. In: In Proceedings of the 14th International Conference on Computer Vision (ICCV) (2013)  61. Wang, F., Huang, Q., Guibas, L.J.: Image co-segmentation via consistent functional maps. In: IEEE International Conference on Computer Vision, ICCV 2013, Syd- ney, Australia, December 1-8, 2013. pp. 849-856. Computer Vision Foundation., Sydney, Australia (2013)  62. Wang, H., Huang, H.: Group Representation of Global Intrinsic Symmetries. Com-  puter Graphics Forum 36, 51-61 (October 2017)  63. Wang, H., Simari, P., Su, Z., Zhang, H.: Spectral global intrinsic symmetry in- variant functions. In: Proceedings of Graphics Interface 2014. pp. 209-215. GI ’14, Canadian Information Processing Society, Toronto, Ont., Canada, Canada (2014), http://dl.acm.org/citation.cfm?id=2619648.2619683  64. Xu, K., Zhang, H., Jiang, W., Dyer, R., Cheng, Z., Liu, L., Chen, B.: Multi-scale partial intrinsic symmetry detection. ACM Trans. Graph. 31(6), 181:1-181:11 (Nov 2012)   Joint Map and Symmetry Synchronization65. Xu, K., Zhang, H., Tagliasacchi, A., Liu, L., Li, G., Meng, M., Xiong, Y.: Partial intrinsic reﬂectional symmetry of 3d shapes. ACM Trans. Graph. 28(5), 138:1- 138:10 (Dec 2009)  66. Zhou, T., Lee, Y.J., Yu, S.X., Efros, A.A.: Flowweb: Joint image set alignment by weaving consistent, pixel-wise correspondences. In: IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2015, Boston, MA, USA, June 7-12, 2015. pp. 1191-1200 (2015)  67. Zhou, X., Zhu, M., Daniilidis, K.: Multi-image matching via fast alternating mini- mization. In: ICCV. pp. 4032-4040. IEEE Computer Society, Santiago, Chile (2015)"}