{"1": "1. Arandjelovi´c, R., Gronat, P., Torii, A., Pajdla, T., Sivic, J.: NetVLAD: CNN ar-  chitecture for weakly supervised place recognition. In: CVPR (2016)  2. Arsigny, V., Fillard, P., Pennec, X., Ayache, N.: Log-euclidean metrics for fast and simple calculus on diﬀusion tensors. Magnetic resonance in medicine 56(2), 411-421 (2006)  3. Bhatia, R.: Positive definite matrices. Princeton Univ Press (2007) 4. Bhatia, R., Davis, C.: A better bound on the variance. The American Mathematical  Monthly 107(4), 353-357 (2000)  5. Boughorbel, S., Tarel, J.P., Boujemaa, N.: Generalized Histogram Intersection Ker-  nel for Image Recognition. In: ICIP (2005)  6. Carreira, J., Caseiro, R., Batista, J., Sminchisescu, C.: Semantic Segmentation  with Second-Order Pooling. In: ECCV (2012)  7. Cherian, A., Sra, S., Banerjee, A., Papanikolopoulos, N.: Jensen-Bregman LogDet Divergence with Application to Eﬃcient Similarity Search for Covariance Matrices. TPAMI 35(9), 2161-2174 (2013)  8. Cimpoi, M., Maji, S., Kokkinos, I., Mohamed, S., Vedaldi, A.: Describing Textures  9. Cimpoi, M., Maji, S., Vedaldi, A.: Deep Filter Banks for Texture Recognition and  in the Wild. In: CVPR (2014)  Segmentation. In: CVPR (2015)  10. Dai, X., Yue-Hei Ng, J., Davis, L.S.: FASON: First and Second Order Information  Fusion Network for Texture Recognition. In: CVPR (2017)  11. Dryden, I.L., Koloydenko, A., Zhou, D.: Non-euclidean statistics for covariance matrices, with applications to diﬀusion tensor imaging. The Annals of Applied Statistics 3(3), 1102-1123 (2009)  12. Gao, Y., Beijbom, O., Zhang, N., Darrell, T.: Compact bilinear pooling. In: CVPR  (2016)  (2017)  (2009)  13. Genevay, A., Peyr´e, G., Cuturi, M.: Learning generative models with sinkhorn  divergences. arXiv preprint arXiv:1706.00292 (2017)  14. Gong, Y., Wang, L., Guo, R., Lazebnik, S.: Multi-scale Orderless Pooling of Deep  Convolutional Activation Features. In: ECCV (2014)  15. Guo, K., Ishwar, P., Konrad, J.: Action recognition from video using feature co-  variance matrices. Trans. Img. Proc. 22(6), 2479-2494 (2013)  16. He, K., Zhang, X., Ren, S., Sun, J.: Deep Residual Learning for Image Recognition.  In: CVPR (2016)  17. Huang, Z., Gool, L.V.: A Riemannian Network for SPD Matrix Learning. In: AAAI  18. Ionescu, C., Vantzos, O., Sminchisescu, C.: Matrix Backpropagation for Deep Net-  works with Structured Layers. In: ICCV (2015)  19. J´egou, H., Douze, M., Schmid, C.: On the Burstiness of Visual Elements. In: CVPR  20. J´egou, H., Douze, M., Schmid, C., P´erez, P.: Aggregating Local Descriptors into a  Compact Image Representation. In: CVPR (2010)  21. J´egou, H., Zisserman, A.: Triangulation embedding and democratic aggregation  22. Khan, S.H., Hayat, M., Porikli, F.: Scene Categorization with Spectral Features.  for image search. In: CVPR (2014)  In: ICCV (2017)  23. Knight, P.A.: The sinkhorn-knopp algorithm: Convergence and applications. SIAM  J. Matrix Anal. Appl. 30(1), 261-275 (Mar 2008)   Second-order Democratic AggregationReferences  1. Arandjelovi´c, R., Gronat, P., Torii, A., Pajdla, T., Sivic, J.: NetVLAD: CNN ar-  chitecture for weakly supervised place recognition. In: CVPR (2016)  2. Arsigny, V., Fillard, P., Pennec, X., Ayache, N.: Log-euclidean metrics for fast and simple calculus on diﬀusion tensors. Magnetic resonance in medicine 56(2), 411-421 (2006)  3. Bhatia, R.: Positive definite matrices. Princeton Univ Press (2007) 4. Bhatia, R., Davis, C.: A better bound on the variance. The American Mathematical  Monthly 107(4), 353-357 (2000)  5. Boughorbel, S., Tarel, J.P., Boujemaa, N.: Generalized Histogram Intersection Ker-  nel for Image Recognition. In: ICIP (2005)  6. Carreira, J., Caseiro, R., Batista, J., Sminchisescu, C.: Semantic Segmentation  with Second-Order Pooling. In: ECCV (2012)  7. Cherian, A., Sra, S., Banerjee, A., Papanikolopoulos, N.: Jensen-Bregman LogDet Divergence with Application to Eﬃcient Similarity Search for Covariance Matrices. TPAMI 35(9), 2161-2174 (2013)  8. Cimpoi, M., Maji, S., Kokkinos, I., Mohamed, S., Vedaldi, A.: Describing Textures  9. Cimpoi, M., Maji, S., Vedaldi, A.: Deep Filter Banks for Texture Recognition and  in the Wild. In: CVPR (2014)  Segmentation. In: CVPR (2015)  10. Dai, X., Yue-Hei Ng, J., Davis, L.S.: FASON: First and Second Order Information  Fusion Network for Texture Recognition. In: CVPR (2017)  11. Dryden, I.L., Koloydenko, A., Zhou, D.: Non-euclidean statistics for covariance matrices, with applications to diﬀusion tensor imaging. The Annals of Applied Statistics 3(3), 1102-1123 (2009)  12. Gao, Y., Beijbom, O., Zhang, N., Darrell, T.: Compact bilinear pooling. In: CVPR  (2016)  (2017)  (2009)  13. Genevay, A., Peyr´e, G., Cuturi, M.: Learning generative models with sinkhorn  divergences. arXiv preprint arXiv:1706.00292 (2017)  14. Gong, Y., Wang, L., Guo, R., Lazebnik, S.: Multi-scale Orderless Pooling of Deep  Convolutional Activation Features. In: ECCV (2014)  15. Guo, K., Ishwar, P., Konrad, J.: Action recognition from video using feature co-  variance matrices. Trans. Img. Proc. 22(6), 2479-2494 (2013)  16. He, K., Zhang, X., Ren, S., Sun, J.: Deep Residual Learning for Image Recognition.  In: CVPR (2016)  17. Huang, Z., Gool, L.V.: A Riemannian Network for SPD Matrix Learning. In: AAAI  18. Ionescu, C., Vantzos, O., Sminchisescu, C.: Matrix Backpropagation for Deep Net-  works with Structured Layers. In: ICCV (2015)  19. J´egou, H., Douze, M., Schmid, C.: On the Burstiness of Visual Elements. In: CVPR  20. J´egou, H., Douze, M., Schmid, C., P´erez, P.: Aggregating Local Descriptors into a  Compact Image Representation. In: CVPR (2010)  21. J´egou, H., Zisserman, A.: Triangulation embedding and democratic aggregation  22. Khan, S.H., Hayat, M., Porikli, F.: Scene Categorization with Spectral Features.  for image search. In: CVPR (2014)  In: ICCV (2017)  23. Knight, P.A.: The sinkhorn-knopp algorithm: Convergence and applications. SIAM  J. Matrix Anal. Appl. 30(1), 261-275 (Mar 2008)   16  Tsung-Yu Lin, Subhransu Maji and Piotr Koniusz  24. Koniusz, P., Yan, F., Gosselin, P., Mikolajczyk, K.: Higher-order Occurrence Pool- ing on Mid- and Low-level Features: Visual Concept Detection. Technical Report, HAL Id: hal-00922524 (2013)  25. Koniusz, P., Yan, F., Gosselin, P., Mikolajczyk, K.: Higher-order occurrence pool- ing for bags-of-words: Visual concept detection. PAMI 39(2), 313-326 (2017) 26. Koniusz, P., Cherian, A., Porikli, F.: Tensor representations via kernel linearization for action recognition from 3d skeletons. In: ECCV. pp. 37-53. Springer (2016) 27. Koniusz, P., Tas, Y., Zhang, H., Harandi, M., Porikli, F., Zhang, R.: Museum exhibit identification challenge for the supervised domain adaptation. In: ECCV (2018)  28. Koniusz, P., Zhang, H., Porikli, F.: A deeper look at power normalizations. In:  CVPR. pp. 5774-5783 (2018)  29. Krause, J., Stark, M., Deng, J., Fei-Fei, L.: 3D Object Representations for Fine- Grained Categorization. In: Workshop on 3D Representation and Recognition (3dRR) (2013)  30. Li, P., Wang, Q.: Local Log-Euclidean Covariance Matrix (L  ECM) for ImageRepresentation and Its Applications. In: ECCV (2012)  31. Li, P., Xie, J., Wang, Q., Zuo, W.: Is Second-order Information Helpful for Large-  scale Visual Recognition? In: ICCV (2017)  32. Lin, T.Y., RoyChowdhury, A., Maji, S.: Bilinear Convolutional Neural Networks  for Fine-Grained Visual Recognition. IEEE TPAMI 40(6) (2018)  33. Lin, T.Y., Maji, S.: Improved Bilinear Pooling with CNNs. In: BMVC (2017) 34. Lin, T.Y., RoyChowdhury, A., Maji, S.: Bilinear CNN Models for Fine-grained  35. Maji, S., Kannala, J., Rahtu, E., Blaschko, M., Vedaldi, A.: Fine-grained visual  Visual Recognition. In: ICCV (2015)  classification of aircraft (2013)  36. Mena, G., Belanger, D., Linderman, S., Snoek, J.: Learning latent permutations  with gumbel-sinkhorn networks. arXiv preprint arXiv:1802.08665 (2018)  37. Murray, N., J´egou, H., Perronnin, F., Zisserman, A.: Interferences in match kernels.  38. Negrel, R., Picard, D., Gosselin, P.H.: Compact Tensor Based Image Representa-  IEEE TPAMI 39(9), 1797-1810 (2017)  tion for Similarity Search. ICIP (2012)  39. Pennec, X., Fillard, P., Ayache, N.: A Riemannian Framework for Tensor Comput-  40. Perronnin, F., Dance, C.: Fisher Kernels on Visual Vocabularies for Image Cate-  ing. IJCV 66(1), 41-66 (2006)  gorization. In: CVPR (2007)  41. Perronnin, F., S´anchez, J., Mensink, T.: Improving the Fisher Kernel for Large-  Scale Image Classification. In: ECCV (2010)  42. Pham, N., Pagh, R.: Fast and scalable polynomial kernels via explicit feature maps.  43. Popoviciu, T.: Sur les ´equations alg´ebriques ayant toutes leurs racines r´eelles. Math-  In: KDD (2013)  ematica 9, 129-145 (1935)  44. Porikli, F., Tuzel, O.: Covariance Tracker. In: CVPR (2006) 45. Quattoni, A., Torralba, A.: Recognizing Indoor Scenes. In: CVPR (2009) 46. Romero, A., Ter´an, M.Y., Gouiﬀ`es, M., Lacassagne, L.: Enhanced local binary covariance matrices for texture analysis and object tracking. MIRAGE (2013) 47. S´anchez, J., Perronnin, F., Mensink, T., Verbeek, J.: Image classification with the  fisher vector: Theory and practice. IJCV 105(3), 222-245 (2013)  48. Sharan, L., Rosenholtz, R., H., A.E.: Material perceprion: What can you see in a  brief glance? Journal of Vision 9:784(8) (2009)   Second-order Democratic Aggregation49. Shih, Y.F., Yeh, Y.M., Lin, Y.Y., Weng, M.F., Lu, Y.C., Chuang, Y.Y.: Deep Co-occurrence Feature Learning for Visual Object Recognition. In: CVPR (2017) 50. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. In: ICLR (2015)  51. Song, Y., Zhang, F., Li, Q., Huang, H., O’Donnell, L.J., Cai, W.: Locally-  transferred fisher vectors for texture classification. In: ICCV (Oct 2017)  52. Tuzel, O., Porikli, F., Meer, P.: Region Covariance: A Fast Descriptor for Detection  and Classification. In: ECCV (2006)  53. Tuzel, O., Porikli, F., Meer, P.: Pedestrian Detection via Classification on Rieman-  nian Manifolds. IEEE TPAMI 30(10), 1713-1727 (2008)  54. Wang, L., Guo, S., Huang, W., Qiao, Y.: Places205-VGGnet models for scene  recognition. CoRR abs/1508.01667 (2015)  55. Wang, Z., Vemuri, B.C.: An aﬃne invariant tensor dissimilarity measure and its  applications to tensor-valued image segmentation. In: CVPR (2004)  56. Welinder, P., Branson, S., Mita, T., Wah, C., Schroﬀ, F., Belongie, S., Perona, P.: Caltech-UCSD Birds 200. Tech. Rep. CNS-TR-2010-001, California Institute of Technology (2010)  57. Yandex, A.B., Lempitsky, V.: Aggregating Local Deep Features for Image Re-  58. Yu, K.,  Salzmann, M.:  Second-order Convolutional Neural Networks.  59. Yu, K., Salzmann, M.: Statistically-motivated second-order pooling. In: ECCV  60. Zhang, Y., Ozay, M., Liu, X., Okatani, T.: Integrating deep features for material  trieval. In: ICCV (2015)  abs/1703.06817 (2017)  (2018)  recognition. In: ICPR (2016)"}