{"1": "1. Bartlett, P.L., Jordan, M.I., McAuliﬀe, J.D.: Convexity, classification, and risk bounds. Journal of the American Statistical Association 101(473), 138-156 (2006) 2. Bartlett, P.L., Mendelson, S.: Rademacher and gaussian complexities: Risk bounds and structural results. Journal of Machine Learning Research 3(Nov), 463-482 (2002)  3. Boucheron, S., Lugosi, G., Massart, P.: Concentration inequalities: A nonasymp-  totic theory of independence. Oxford university press (2013)  4. Cheng, J., Liu, T., Ramamohanarao, K., Tao, D.: Learning with bounded instance-  and label-dependent label noise. arXiv preprint arXiv:1709.03768 (2017)  5. Cour, T., Sapp, B., Taskar, B.: Learning from partial labels. Journal of Machine  Learning Research 12(May), 1501-1536 (2011)  6. Ehsan Abbasnejad, M., Dick, A., van den Hengel, A.: Infinite variational autoen-  coder for semi-supervised learning. In: CVPR (July 2017)  7. Gagniuc, P.A.: Markov Chains: From Theory to Implementation and Experimen-  tation. John Wiley & Sons (2017)  8. Gong, C., Zhang, H., Yang, J., Tao, D.: Learning with inadequate and incorrect  supervision. In: ICDM. pp. 889-894. IEEE (2017)  9. Haeusser, P., Mordvintsev, A., Cremers, D.: Learning by association: A versatile  semi-supervised training method for neural networks. In: CVPR (2017)  10. Han, B., Tsang, I.W., Chen, L., Celina, P.Y., Fung, S.F.: Progressive stochastic learning for noisy labels. IEEE Transactions on Neural Networks and Learning Systems (99), 1-13 (2018)  11. Han, B., Yao, Q., Yu, X., Niu, G., Xu, M., Hu, W., Tsang, I., Sugiyama, M.: Co- teaching: Robust training deep neural networks with extremely noisy labels. arXiv preprint arXiv:1804.06872 (2018)  12. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. pp. 770-778 (2016)  13. Ishida, T., Niu, G., Sugiyama, M.: Learning from complementary labels. In: NIPS  (2017)  (2009)  14. Krizhevsky, A., Hinton, G.: Learning multiple layers of features from tiny images  15. Law, M.T., Yu, Y., Urtasun, R., Zemel, R.S., Xing, E.P.: Eﬃcient multiple instance  metric learning using weakly supervised data. In: CVPR (July 2017)  16. LeCun, Y., Corinna, C., Christopher, B.J.: The MNIST database of handwritten  digits. http://yann.lecun.com/exdb/mnist/  17. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. Proceedings of the IEEE 86(11), 2278-2324 (1998)  18. Liu, T., Tao, D.: Classification with noisy labels by importance reweighting. IEEE Transactions on Pattern Analysis and Machine Intelligence 38(3), 447-461 (March 2016)  19. Misra, I., Lawrence Zitnick, C., Mitchell, M., Girshick, R.: Seeing through the Hu- man reporting bias: Visual classifiers from noisy Human-centric labels. In: CVPR. pp. 2930-2939 (2016)  20. Mohri, M., Rostamizadeh, A., Talwalkar, A.: Foundations of machine learning.  MIT press (2012)  21. Natarajan, N., Dhillon, I.S., Ravikumar, P.K., Tewari, A.: Learning with noisy  labels. In: NIPS. pp. 1196-1204 (2013)   Learning with Biased Complementary LabelsReferences  1. Bartlett, P.L., Jordan, M.I., McAuliﬀe, J.D.: Convexity, classification, and risk bounds. Journal of the American Statistical Association 101(473), 138-156 (2006) 2. Bartlett, P.L., Mendelson, S.: Rademacher and gaussian complexities: Risk bounds and structural results. Journal of Machine Learning Research 3(Nov), 463-482 (2002)  3. Boucheron, S., Lugosi, G., Massart, P.: Concentration inequalities: A nonasymp-  totic theory of independence. Oxford university press (2013)  4. Cheng, J., Liu, T., Ramamohanarao, K., Tao, D.: Learning with bounded instance-  and label-dependent label noise. arXiv preprint arXiv:1709.03768 (2017)  5. Cour, T., Sapp, B., Taskar, B.: Learning from partial labels. Journal of Machine  Learning Research 12(May), 1501-1536 (2011)  6. Ehsan Abbasnejad, M., Dick, A., van den Hengel, A.: Infinite variational autoen-  coder for semi-supervised learning. In: CVPR (July 2017)  7. Gagniuc, P.A.: Markov Chains: From Theory to Implementation and Experimen-  tation. John Wiley & Sons (2017)  8. Gong, C., Zhang, H., Yang, J., Tao, D.: Learning with inadequate and incorrect  supervision. In: ICDM. pp. 889-894. IEEE (2017)  9. Haeusser, P., Mordvintsev, A., Cremers, D.: Learning by association: A versatile  semi-supervised training method for neural networks. In: CVPR (2017)  10. Han, B., Tsang, I.W., Chen, L., Celina, P.Y., Fung, S.F.: Progressive stochastic learning for noisy labels. IEEE Transactions on Neural Networks and Learning Systems (99), 1-13 (2018)  11. Han, B., Yao, Q., Yu, X., Niu, G., Xu, M., Hu, W., Tsang, I., Sugiyama, M.: Co- teaching: Robust training deep neural networks with extremely noisy labels. arXiv preprint arXiv:1804.06872 (2018)  12. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. pp. 770-778 (2016)  13. Ishida, T., Niu, G., Sugiyama, M.: Learning from complementary labels. In: NIPS  (2017)  (2009)  14. Krizhevsky, A., Hinton, G.: Learning multiple layers of features from tiny images  15. Law, M.T., Yu, Y., Urtasun, R., Zemel, R.S., Xing, E.P.: Eﬃcient multiple instance  metric learning using weakly supervised data. In: CVPR (July 2017)  16. LeCun, Y., Corinna, C., Christopher, B.J.: The MNIST database of handwritten  digits. http://yann.lecun.com/exdb/mnist/  17. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. Proceedings of the IEEE 86(11), 2278-2324 (1998)  18. Liu, T., Tao, D.: Classification with noisy labels by importance reweighting. IEEE Transactions on Pattern Analysis and Machine Intelligence 38(3), 447-461 (March 2016)  19. Misra, I., Lawrence Zitnick, C., Mitchell, M., Girshick, R.: Seeing through the Hu- man reporting bias: Visual classifiers from noisy Human-centric labels. In: CVPR. pp. 2930-2939 (2016)  20. Mohri, M., Rostamizadeh, A., Talwalkar, A.: Foundations of machine learning.  MIT press (2012)  21. Natarajan, N., Dhillon, I.S., Ravikumar, P.K., Tewari, A.: Learning with noisy  labels. In: NIPS. pp. 1196-1204 (2013)   16  Xiyu Yu, Tongliang Liu, Mingming Gong, and Dacheng Tao  22. Patrini, G., Rozza, A., Menon, A., Nock, R., Qu, L.: Making neural networks robust  to label noise: A loss correction approach. In: CVPR (2017)  23. du Plessis, M.C., Niu, G., Sugiyama, M.: Analysis of learning from positive and  unlabeled data. In: NIPS. pp. 703-711 (2014)  24. Read, J., Pfahringer, B., Holmes, G., Frank, E.: Classifier chains for multi-label  classification. Machine learning 85(3), 333-359 (2011)  25. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., Berg, A.C., Fei-Fei, L.: ImageNet Large Scale Visual Recognition Challenge. International Journal of Computer Vision 115(3), 211-252 (2015). https://doi.org/10.1007/s11263-015-0816-y  26. Sukhbaatar, S., Bruna, J., Paluri, M., Bourdev, L., Fergus, R.: Training convolu-  tional networks with noisy labels. arXiv preprint arXiv:1406.2080 (2014)  27. Sutskever, I., Martens, J., Dahl, G., Hinton, G.: On the importance of initialization  and momentum in deep learning. In: ICML. pp. 1139-1147 (2013)  28. Vahdat, A.: Toward robustness against label noise in training deep discriminative  neural networks. In: NIPS. pp. 5596-5605 (2017)  29. Vapnik, V., Vashist, A.: A new learning paradigm: Learning using privileged in-  formation. Neural networks 22(5), 544-557 (2009)  30. Veit, A., Alldrin, N., Chechik, G., Krasin, I., Gupta, A., Belongie, S.: Learning  from noisy large-scale datasets with minimal supervision. In: CVPR (July 2017)  31. Wan, L., Zeiler, M., Zhang, S., Le Cun, Y., Fergus, R.: Regularization of neural  networks using dropconnect. In: ICML. pp. 1058-1066 (2013)  32. Wang, R., Liu, T., Tao, D.: Multiclass learning with partially corrupted labels. IEEE Transactions on Neural Networks and Learning Systems 29(6), 2568-2580 (2018)  33. Xing, E.P., Jordan, M.I., Russell, S.J., Ng, A.Y.: Distance metric learning with application to clustering with side-information. In: NIPS. pp. 521-528 (2003) 34. Yu, X., Liu, T., Gong, M., Batmanghelich, K., Tao, D.: An eﬃcient and provable approach for mixture proportion estimation using linear independence assumption. In: CVPR. pp. 4480-4489 (2018)  35. Yu, X., Liu, T., Gong, M., Zhang, K., Tao, D.: Transfer learning with label noise.  arXiv preprint arXiv:1707.09724 (2017)  36. Zhang, T.: Statistical analysis of some multi-category large margin classification  methods. Journal of Machine Learning Research 5(Oct), 1225-1251 (2004)  37. Zhu, X.: Semi-supervised learning literature survey (2005)"}