{"1": "1. Cai, Y., Guo, X.: Anisotropic superpixel generation based on Mahalanobis distance.  Computer Graphics Forum 35(7), 199-207 (2016)  2. Cai, Y., Guo, X., Liu, Y., Wang, W., Mao, W., Zhong, Z.: Surface approximation via asymptotic optimal geometric partition. IEEE Transactions on Visualization and Computer Graphics 23(12), 2613-2626 (2017)  3. Cao, C., Weng, Y., Lin, S., Zhou, K.: 3D shape regression for real-time facial  animation. ACM Transactions on Graphics 32(4), 41 (2013)  4. Chang, W., Zwicker, M.: Global registration of dynamic range scans for articulated model reconstruction. ACM Transactions on Graphics (TOG) 30(3), 26 (2011) 5. Dou, M., Khamis, S., Degtyarev, Y., Davidson, P., Fanello, S.R., Kowdle, A., Es- colano, S.O., Rhemann, C., Kim, D., Taylor, J., et al.: Fusion4D: Real-time perfor- mance capture of challenging scenes. ACM Transactions on Graphics 35(4), 114 (2016)  6. Guo, K., Xu, F., Wang, Y., Liu, Y., Dai, Q.: Robust non-rigid motion tracking and surface reconstruction using L0 regularization. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 3083-3091 (2015)  7. Guo, K., Xu, F., Wang, Y., Liu, Y., Dai, Q.: Robust non-rigid motion tracking and surface reconstruction using L0 regularization. IEEE Transactions on Visualization and Computer Graphics (2017)  8. Guo, K., Xu, F., Yu, T., Liu, X., Dai, Q., Liu, Y.: Real-time geometry, albedo, and motion reconstruction using a single RGB-D camera. ACM Transactions on Graphics 36(3), 32 (2017)  9. Horn, B.K.P.: Closed-form solution of absolute orientation using unit quaternions.  Journal of the Optical Society of America A 4(4), 629-642 (1987)  10. Innmann, M., Zollh¨ofer, M., Nießner, M., Theobalt, C., Stamminger, M.: Vol- umeDeform: Real-time volumetric non-rigid reconstruction. In: European Confer- ence on Computer Vision. pp. 362-379. Springer (2016)  11. James, D.L., Twigg, C.D.: Skinning mesh animations. ACM Transactions on  12. Le, B.H., Deng, Z.: Smooth skinning decomposition with rigid bones. ACM Trans-  13. Li, H., Adams, B., Guibas, L.J., Pauly, M.: Robust single-view geometry and mo-  Graphics 24(3), 399-407 (2005)  actions on Graphics 31(6), 199 (2012)  tion reconstruction 28(5), 175 (2009)  14. Li, H., Yu, J., Ye, Y., Bregler, C.: Realtime facial animation with on-the-ﬂy cor-  rectives. ACM Transactions on Graphics 32(4), 42-1 (2013)  15. Lorensen, W.E., Cline, H.E.: Marching cubes: A high resolution 3D surface con- struction algorithm. In: ACM siggraph computer graphics. vol. 21, pp. 163-169. ACM (1987)  16. Murray, R.M., Li, Z., Sastry, S.S.: A mathematical introduction to robotic manip-  ulation. CRC press (1994)  17. Newcombe, R.A., Fox, D., Seitz, S.M.: DynamicFusion: Reconstruction and track- ing of non-rigid scenes in real-time. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 343-352 (2015)  18. Newcombe, R.A., Izadi, S., Hilliges, O., Molyneaux, D., Kim, D., Davison, A.J., Kohi, P., Shotton, J., Hodges, S., Fitzgibbon, A.: KinectFusion: Real-time dense surface mapping and tracking. In: 10th IEEE international symposium on Mixed and Augmented Reality. pp. 127-136 (2011)   ArticulatedFusionReferences  1. Cai, Y., Guo, X.: Anisotropic superpixel generation based on Mahalanobis distance.  Computer Graphics Forum 35(7), 199-207 (2016)  2. Cai, Y., Guo, X., Liu, Y., Wang, W., Mao, W., Zhong, Z.: Surface approximation via asymptotic optimal geometric partition. IEEE Transactions on Visualization and Computer Graphics 23(12), 2613-2626 (2017)  3. Cao, C., Weng, Y., Lin, S., Zhou, K.: 3D shape regression for real-time facial  animation. ACM Transactions on Graphics 32(4), 41 (2013)  4. Chang, W., Zwicker, M.: Global registration of dynamic range scans for articulated model reconstruction. ACM Transactions on Graphics (TOG) 30(3), 26 (2011) 5. Dou, M., Khamis, S., Degtyarev, Y., Davidson, P., Fanello, S.R., Kowdle, A., Es- colano, S.O., Rhemann, C., Kim, D., Taylor, J., et al.: Fusion4D: Real-time perfor- mance capture of challenging scenes. ACM Transactions on Graphics 35(4), 114 (2016)  6. Guo, K., Xu, F., Wang, Y., Liu, Y., Dai, Q.: Robust non-rigid motion tracking and surface reconstruction using L0 regularization. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 3083-3091 (2015)  7. Guo, K., Xu, F., Wang, Y., Liu, Y., Dai, Q.: Robust non-rigid motion tracking and surface reconstruction using L0 regularization. IEEE Transactions on Visualization and Computer Graphics (2017)  8. Guo, K., Xu, F., Yu, T., Liu, X., Dai, Q., Liu, Y.: Real-time geometry, albedo, and motion reconstruction using a single RGB-D camera. ACM Transactions on Graphics 36(3), 32 (2017)  9. Horn, B.K.P.: Closed-form solution of absolute orientation using unit quaternions.  Journal of the Optical Society of America A 4(4), 629-642 (1987)  10. Innmann, M., Zollh¨ofer, M., Nießner, M., Theobalt, C., Stamminger, M.: Vol- umeDeform: Real-time volumetric non-rigid reconstruction. In: European Confer- ence on Computer Vision. pp. 362-379. Springer (2016)  11. James, D.L., Twigg, C.D.: Skinning mesh animations. ACM Transactions on  12. Le, B.H., Deng, Z.: Smooth skinning decomposition with rigid bones. ACM Trans-  13. Li, H., Adams, B., Guibas, L.J., Pauly, M.: Robust single-view geometry and mo-  Graphics 24(3), 399-407 (2005)  actions on Graphics 31(6), 199 (2012)  tion reconstruction 28(5), 175 (2009)  14. Li, H., Yu, J., Ye, Y., Bregler, C.: Realtime facial animation with on-the-ﬂy cor-  rectives. ACM Transactions on Graphics 32(4), 42-1 (2013)  15. Lorensen, W.E., Cline, H.E.: Marching cubes: A high resolution 3D surface con- struction algorithm. In: ACM siggraph computer graphics. vol. 21, pp. 163-169. ACM (1987)  16. Murray, R.M., Li, Z., Sastry, S.S.: A mathematical introduction to robotic manip-  ulation. CRC press (1994)  17. Newcombe, R.A., Fox, D., Seitz, S.M.: DynamicFusion: Reconstruction and track- ing of non-rigid scenes in real-time. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 343-352 (2015)  18. Newcombe, R.A., Izadi, S., Hilliges, O., Molyneaux, D., Kim, D., Davison, A.J., Kohi, P., Shotton, J., Hodges, S., Fitzgibbon, A.: KinectFusion: Real-time dense surface mapping and tracking. In: 10th IEEE international symposium on Mixed and Augmented Reality. pp. 127-136 (2011)   16  C. Li, Z. Zhao and X. Guo  19. Pekelny, Y., Gotsman, C.: Articulated object reconstruction and markerless motion capture from depth video. Computer Graphics Forum 27(2), 399-408 (2008) 20. Pons-Moll, G., Baak, A., Helten, T., M¨uller, M., Seidel, H.P., Rosenhahn, B.: Multisensor-fusion for 3D full-body human motion capture. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 663-670 (2010)  21. Slavcheva, M., Baust, M., Cremers, D., Ilic, S.: KillingFusion: Non-rigid 3D Re- construction without Correspondences. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  22. Slavcheva, M., Baust, M., Ilic, S.: SobolevFusion: 3D Reconstruction of Scenes Undergoing Free Non-rigid Motion. In: IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) (2018)  23. Sorkine, O.: Least-squares rigid motion using SVD. Technical notes (2017) 24. Tagliasacchi, A., Schr¨oder, M., Tkach, A., Bouaziz, S., Botsch, M., Pauly, M.: Robust articulated-ICP for real-time hand tracking. Computer Graphics Forum 34(5), 101-114 (2015)  25. Tkach, A., Pauly, M., Tagliasacchi, A.: Sphere-meshes for real-time hand modeling  and tracking. ACM Transaction on Graphics (2016)  26. Tzionas, D., Gall, J.: Reconstructing articulated rigged models from RGB- D videos. In: European Conference on Computer Vision Workshops 2016 (ECCVW’16) - Workshop on Recovering 6D Object Pose (R6D’16) (2016), http://files.is.tue.mpg.de/dtzionas/Skeleton-Reconstruction  27. Vlasic, D., Baran, I., Matusik, W., Popovi´c, J.: Articulated mesh animation from  multi-view silhouettes. ACM Transactions on Graphics 27(3), 97 (2008)  28. Wand, M., Adams, B., Ovsjanikov, M., Berner, A., Bokeloh, M., Jenke, P., Guibas, L., Seidel, H.P., Schilling, A.: Eﬃcient reconstruction of nonrigid shape and motion from real-time 3D scanner data. ACM Transactions on Graphics 28(2), 15 (2009) 29. Yu, T., Guo, K., Xu, F., Dong, Y., Su, Z., Zhao, J., Li, J., Dai, Q., Liu, Y.: Bodyfusion: Real-time capture of human motion and surface geometry using a single depth camera. In: The IEEE International Conference on Computer Vision (ICCV). IEEE (October 2017)  30. Yu, T., Zheng, Z., Guo, K., Zhao, J., Dai, Q., Li, H., Pons-Moll, G., Liu, Y.: Doublefusion: Real-time capture of human performances with inner body shapes from a single depth sensor. In: The IEEE International Conference on Computer Vision and Pattern Recognition(CVPR). IEEE (June 2018)  31. Zhang, H., Xu, F.: MixedFusion: Real-time reconstruction of an indoor scene with dynamic objects. IEEE Transactions on Visualization and Computer Graphics (2017)  32. Zollh¨ofer, M., Nießner, M., Izadi, S., Rehmann, C., Zach, C., Fisher, M., Wu, C., Fitzgibbon, A., Loop, C., Theobalt, C., et al.: Real-time non-rigid reconstruction using an RGB-D camera. ACM Transactions on Graphics 33(4), 156 (2014)"}