{"1": "1. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., Kudlur, M., Levenberg, J., Monga, R., Moore,   14  Park et al.  (a) Bicubic  (b) Enhance [40] (c) SRGAN [27]  (d) SRFeatIF  (e) GT  Fig. 6. Qualitative comparison of GAN-based SR methods with our results at scaling factor 4. Result images of the other methods are taken from their websites.  beneficial to other problems besides SR. Exploring other applications can be another interesting future work.  Acknowledgements We appreciate the constructive comments from the re- viewers. This work was supported by the Ministry of Science and ICT, Korea, through IITP grant (IITP-2015-0-00174), Giga Korea grant (GK18P0300), and NRF grant (NRF-2017M3C4A7066317). It was also supported by the DGIST Start-up Fund Program (2018010071).  References  1. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., Kudlur, M., Levenberg, J., Monga, R., Moore,   SRFeat: Single Image Super-Resolution with Feature DiscriminationS., Murray, D.G., Steiner, B., Tucker, P., Vasudevan, V., Warden, P., Wicke, M., Yu, Y., Zheng, X.: Tensorﬂow: A system for large-scale machine learning. In: Proc. OSDI (2016)  2. Agustsson, E., Timofte, R.: Ntire 2017 challenge on single image super-resolution:  Dataset and study. In: CVPR Workshops (2017)  3. Allebach, J., Wong, P.W.: Edge-directed interpolation. In: Proc. ICIP (1996) 4. Baker, S., Kanade, T.: Limits on super-resolution and how to break them. IEEE Transactions on Pattern Analysis and Machine Intelligence 24(9), 1167-1183 (2002)  5. Bevilacqua, M., Roumy, A., Guillemot, C., Alberi-Morel, M.L.: Low-complexity single-image super-resolution based on nonnegative neighbor embedding. In: Proc. BMVC (2012)  6. Bruna, J., Sprechmann, P., LeCun, Y.: Super-resolution with deep convolutional  suﬃcient statistics. Proc. ICLR (2016)  7. Chang, H., Yeung, D.Y., Xiong, Y.: Super-resolution through neighbor embedding.  In: Proc. CVPR (2004)  8. Dai, S., Han, M., Xu, W., Wu, Y., Gong, Y., Katsaggelos, A.K.: Softcuts: A soft edge smoothness prior for color image super-resolution. IEEE Transactions on Im- age Processing 18(5), 969-981 (2009)  9. Dong, C., Loy, C.C., He, K., Tang, X.: Image super-resolution using deep convolu- tional networks. IEEE Transactions on Pattern Analysis and Machine Intelligence 38(2), 295-307 (2016)  10. Dong, C., Loy, C.C., He, K., Tang, X.: Learning a deep convolutional network for  image super-resolution. In: Proc. ECCV (2014)  11. Duchon, C.E.: Lanczos filtering in one and two dimensions. Journal of Applied  Meteorology 18(8), 1016-1022 (1979)  12. Freeman, W.T., Pasztor, E.C., Carmichael, O.T.: Learning low-level vision. Inter-  national Journal of Computer Vision 40(1), 25-47 (2000)  13. Gatys, L.A., Ecker, A.S., Bethge, M.: Image style transfer using convolutional  neural networks. In: Proc. CVPR (2016)  14. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial nets. In: Proc. NIPS (2014) 15. Gu, S., Sang, N., Ma, F.: Fast image super resolution via local regression. In: Proc.  ICPR (2012)  16. Gu, S., Zuo, W., Xie, Q., Meng, D., Feng, X., Zhang, L.: Convolutional sparse  coding for image super-resolution. In: Proc. ICCV (2015)  17. Gupta, P., Srivastava, P., Bhardwaj, S., Bhateja, V.: A modified psnr metric based  on hvs for quality assessment of color images. In: Proc. ICCIA (2011)  18. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: Proc. CVPR (2016)  19. Iizuka, S., Simo-Serra, E., Ishikawa, H.: Globally and locally consistent image com-  pletion. ACM Transactions on Graphics 36(4), 107 (2017)  20. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with condi-  tional adversarial networks. In: Proc. CVPR (2017)  21. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: Proc. ACM MM (2014)  22. Johnson, J., Alahi, A., fei Li, F.: Perceptual losses for real-time style transfer and  super-resolution. In: Proc. ECCV (2016)  23. Karras, T., Aila, T., Laine, S., Lehtinen, J.: Progressive growing of gans for im-  proved quality, stability, and variation. In: Proc. ICLR (2018)   16  Park et al.  24. Kim, J., Lee, J.K., Lee, K.M.: Accurate image super-resolution using very deep  convolutional networks. In: Proc. CVPR (2016)  25. Kim, T., Cha, M., Kim, H., Lee, J., Kim, J.: Learning to discover cross-domain  relations with generative adversarial networks. In: Proc. ICML (2017)  26. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In: Proc. ICLR  27. Ledig, C., Theis, L., Huszar, F., Caballero, J., Aitken, A.P., Tejani, A., Totz, J., Wang, Z., Shi, W.: Photo-realistic single image super-resolution using a generative adversarial network. In: Proc. CVPR (2017)  28. Li, J., Liang, X., Wei, Y., Xu, T., Feng, J., Yan, S.: Perceptual generative adver-  sarial networks for small object detection. In: Proc. CVPR (2017)  29. Li, X., Orchard, M.T.: New edge-directed interpolation. IEEE Transactions on  Image Processing 10(10), 1521-1527 (2001)  30. Li, Y., Liu, S., Yang, J., Yang, M.H.: Generative face completion. In: Proc. CVPR  (2015)  (2017)  31. Lim, B., Son, S., Kim, H., Nah, S., Lee, K.M.: Enhanced deep residual networks  for single image super-resolution. In: CVPR Workshops (2017)  32. Lin, G., Milan, A., Shen, C., Reid, I.: Refinenet: Multi-path refinement networks  for high-resolution semantic segmentation. In: Proc. CVPR (2017)  33. Maas, A.L., Hannun, A.Y., Ng, A.Y.: Rectifier nonlinearities improve neural net-  work acoustic models. In: Proc. ICML (2013)  34. Martin, D., Fowlkes, C., Tal, D., Malik, J.: A database of human segmented natural images and its application to evaluating segmentation algorithms and measuring ecological statistics. In: Proc. ICCV (2001)  35. Park, S.J., Hong, K.S., Lee, S.: Rdfnet: Rgb-d multi-level residual feature fusion  for indoor semantic segmentation. In: Proc. ICCV (2017)  36. Perez-Pellitero, E., Salvador, J., Ruiz-Hidalgo, J., Rosenhahn, B.: Psyco: Manifold  span reduction for super resolution. In: Proc. CVPR (2016)  37. Radford, A., Metz, L., Chintala, S.: Unsupervised representation learning with  deep convolutional generative adversarial networks. In: Proc. ICLR (2016)  38. Romano, Y., Isidoro, J., Milanfar, P.: Raisr: Rapid and accurate image super res-  olution. IEEE Transactions on Computational Imaging 3, 110-125 (2017)  39. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., Berg, A.C., Fei-Fei, L.: Imagenet large scale visual recognition challenge. International Journal of Computer Vision 115(3), 211-252 (2015)  40. Sajjadi, M., Sch¨olkopf, B., Hirsch, M.: Enhancenet: Single image super-resolution  through automated texture synthesis. In: Proc. ICCV (2017)  41. Shi, W., Caballero, J., Huszar, F., Totz, J., Aitken, A.P., Bishop, R., Rueckert, D., Wang, Z.: Real-time single image and video super-resolution using an eﬃcient sub-pixel convolutional neural network. In: Proc. CVPR (2016)  42. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. In: Proc. ICLR (2015)  43. Sun, J., Sun, J., Xu, Z., Shum, H.Y.: Gradient profile prior and its applications in image super-resolution and enhancement. IEEE Transactions on Image Processing 20(6), 1529-1542 (2011)  44. Tai, Y., Yang, J., Liu, X.: Image super-resolution via deep recursive residual net-  work. In: Proc. CVPR (2017)  45. Timofte, R., De, V., Gool, L.V.: Anchored neighborhood regression for fast  example-based super-resolution. In: Proc. ICCV (2013)   SRFeat: Single Image Super-Resolution with Feature Discrimination46. Timofte, R., De, V., Gool, L.V.: A+: Adjusted anchored neighborhood regression  for fast super-resolution. In: Proc. ACCV (2014)  47. Tong, T., Li, G., Liu, X., Gao, Q.: Image super-resolution using dense skip con-  nections. In: Proc. ICCV (2017)  48. Wang, Z., Bovik, A.C., Sheikh, H.R., Simoncelli, E.P.: Image quality assessment: From error visibility to structural similarity. IEEE Transactions on Image Process- ing 13(4), 600-612 (2004)  49. Wang, Z., Simoncelli, E.P., Bovik, A.C.: Multiscale structural similarity for image  quality assessment. In: Proc. ACSSC (2003)  50. Yang, C.Y., Yang, M.H.: Fast direct super-resolution by simple functions. In: Proc.  ICCV (2013)  51. Yang, J., Wang, Z., Lin, Z., Cohen, S., Huang, T.: Coupled dictionary training for image super-resolution. IEEE Transactions on Image Processing 21(8) (2012) 52. Yang, J., Wright, J., Huang, T.S., Ma, Y.: Image super-resolution via sparse rep- resentation. IEEE Transactions on Image Processing 19(11), 2861-2873 (2010) 53. Zeyde, R., Elad, M., Protter, M.: On single image scale-up using sparse-  representations. In: Proc. Curves and Surfaces (2012)  54. Zhang, K., Gao, X., Tao, D., Li, X.: Multi-scale dictionary for single image super-  resolution. In: Proc. CVPR (2012)  55. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation  using cycle-consistent adversarial networks. In: Proc. ICCV (2017)"}