{"1": "1. Badrinarayanan, V., Kendall, A., Cipolla, R.: Segnet: A deep convolutional encoder-decoder architecture for image segmentation. IEEE transactions on pat- tern analysis and machine intelligence 39(12), 2481-2495 (2017)  2. Chen, W., Fu, Z., Yang, D., Deng, J.: Single-image depth perception in the wild.  In: Advances in Neural Information Processing Systems. pp. 730-738 (2016)  3. Chen, Z., Badrinarayanan, V., Lee, C.Y., Rabinovich, A.: Gradnorm: Gradient nor- malization for adaptive loss balancing in deep multitask networks. arXiv preprint arXiv:1711.02257 (2017)  4. Eigen, D., Fergus, R.: Predicting depth, surface normals and semantic labels with a common multi-scale convolutional architecture. In: Proceedings of the IEEE In- ternational Conference on Computer Vision. pp. 2650-2658 (2015)  5. Garg, R., BG, V.K., Carneiro, G., Reid, I.: Unsupervised cnn for single view depth estimation: Geometry to the rescue. In: European Conference on Computer Vision. pp. 740-756. Springer (2016)  6. Han, S., Mao, H., Dally, W.J.: Deep compression: Compressing deep neural net- works with pruning, trained quantization and huﬀman coding. arXiv preprint arXiv:1510.00149 (2015)  7. Hermans, A., Floros, G., Leibe, B.: Dense 3d semantic mapping of indoor scenes from rgb-d images. In: Robotics and Automation (ICRA), 2014 IEEE International Conference on. pp. 2631-2638. IEEE (2014)  8. Horaud, R., Hansard, M., Evangelidis, G., M´enier, C.: An overview of depth cam- eras and range scanners based on time-of-ﬂight technologies. Machine Vision and Applications 27(7), 1005-1020 (2016)  9. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected convolutional networks. In: Proceedings of the IEEE conference on computer vision and pattern recognition. vol. 1, p. 3 (2017)  10. Hui, T.W., Loy, C.C., Tang, X.: Depth map super-resolution by deep multi-scale guidance. In: European Conference on Computer Vision. pp. 353-369. Springer (2016)  11. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International conference on machine learning. pp. 448-456 (2015)  12. Kendall, A., Gal, Y., Cipolla, R.: Multi-task learning using uncertainty to weigh losses for scene geometry and semantics. arXiv preprint arXiv:1705.07115 (2017) 13. Kerl, C., Sturm, J., Cremers, D.: Dense visual slam for rgb-d cameras. In: Intelligent Robots and Systems (IROS), 2013 IEEE/RSJ International Conference on. pp. 2100-2106. IEEE (2013)  14. Khoshelham, K., Elberink, S.O.: Accuracy and resolution of kinect depth data for  indoor mapping applications. Sensors 12(2), 1437-1454 (2012)  15. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  16. Kuznietsov, Y., St¨uckler, J., Leibe, B.: Semi-supervised deep learning for monoc- ular depth map prediction. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 6647-6655 (2017)  17. Laina, I., Rupprecht, C., Belagiannis, V., Tombari, F., Navab, N.: Deeper depth prediction with fully convolutional residual networks. In: 3D Vision (3DV), 2016 Fourth International Conference on. pp. 239-248. IEEE (2016)   Estimating Depth from RGB and Sparse SensingReferences  1. Badrinarayanan, V., Kendall, A., Cipolla, R.: Segnet: A deep convolutional encoder-decoder architecture for image segmentation. IEEE transactions on pat- tern analysis and machine intelligence 39(12), 2481-2495 (2017)  2. Chen, W., Fu, Z., Yang, D., Deng, J.: Single-image depth perception in the wild.  In: Advances in Neural Information Processing Systems. pp. 730-738 (2016)  3. Chen, Z., Badrinarayanan, V., Lee, C.Y., Rabinovich, A.: Gradnorm: Gradient nor- malization for adaptive loss balancing in deep multitask networks. arXiv preprint arXiv:1711.02257 (2017)  4. Eigen, D., Fergus, R.: Predicting depth, surface normals and semantic labels with a common multi-scale convolutional architecture. In: Proceedings of the IEEE In- ternational Conference on Computer Vision. pp. 2650-2658 (2015)  5. Garg, R., BG, V.K., Carneiro, G., Reid, I.: Unsupervised cnn for single view depth estimation: Geometry to the rescue. In: European Conference on Computer Vision. pp. 740-756. Springer (2016)  6. Han, S., Mao, H., Dally, W.J.: Deep compression: Compressing deep neural net- works with pruning, trained quantization and huﬀman coding. arXiv preprint arXiv:1510.00149 (2015)  7. Hermans, A., Floros, G., Leibe, B.: Dense 3d semantic mapping of indoor scenes from rgb-d images. In: Robotics and Automation (ICRA), 2014 IEEE International Conference on. pp. 2631-2638. IEEE (2014)  8. Horaud, R., Hansard, M., Evangelidis, G., M´enier, C.: An overview of depth cam- eras and range scanners based on time-of-ﬂight technologies. Machine Vision and Applications 27(7), 1005-1020 (2016)  9. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected convolutional networks. In: Proceedings of the IEEE conference on computer vision and pattern recognition. vol. 1, p. 3 (2017)  10. Hui, T.W., Loy, C.C., Tang, X.: Depth map super-resolution by deep multi-scale guidance. In: European Conference on Computer Vision. pp. 353-369. Springer (2016)  11. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International conference on machine learning. pp. 448-456 (2015)  12. Kendall, A., Gal, Y., Cipolla, R.: Multi-task learning using uncertainty to weigh losses for scene geometry and semantics. arXiv preprint arXiv:1705.07115 (2017) 13. Kerl, C., Sturm, J., Cremers, D.: Dense visual slam for rgb-d cameras. In: Intelligent Robots and Systems (IROS), 2013 IEEE/RSJ International Conference on. pp. 2100-2106. IEEE (2013)  14. Khoshelham, K., Elberink, S.O.: Accuracy and resolution of kinect depth data for  indoor mapping applications. Sensors 12(2), 1437-1454 (2012)  15. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  16. Kuznietsov, Y., St¨uckler, J., Leibe, B.: Semi-supervised deep learning for monoc- ular depth map prediction. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 6647-6655 (2017)  17. Laina, I., Rupprecht, C., Belagiannis, V., Tombari, F., Navab, N.: Deeper depth prediction with fully convolutional residual networks. In: 3D Vision (3DV), 2016 Fourth International Conference on. pp. 239-248. IEEE (2016)   16  Z. Chen, V. Badrinarayanan, G. Drozdov, and A. Rabinovich  18. Levin, A., Lischinski, D., Weiss, Y.: Colorization using optimization. In: ACM  Transactions on Graphics (ToG). vol. 23, pp. 689-694. ACM (2004)  19. Lin, D., Fidler, S., Urtasun, R.: Holistic scene understanding for 3d object detec- tion with rgbd cameras. In: Computer Vision (ICCV), 2013 IEEE International Conference on. pp. 1417-1424. IEEE (2013)  20. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 3431-3440 (2015)  21. Lowe, D.G.: Distinctive image features from scale-invariant keypoints. Interna-  tional journal of computer vision 60(2), 91-110 (2004)  22. Lu, J., Forsyth, D.A., et al.: Sparse depth super resolution. In: CVPR. vol. 6 (2015) 23. Ma, F., Karaman, S.: Sparse-to-dense: Depth prediction from sparse depth samples  and a single image. arXiv preprint arXiv:1709.07492 (2017)  24. Nathan Silberman, Derek Hoiem, P.K., Fergus, R.: Indoor segmentation and sup-  port inference from rgbd images. In: ECCV (2012)  25. Nguyen, C.V., Izadi, S., Lovell, D.: Modeling kinect sensor noise for improved 3d reconstruction and tracking. In: 3D Imaging, Modeling, Processing, Visualization and Transmission (3DIMPVT), 2012 Second International Conference on. pp. 524- 530. IEEE (2012)  26. Paszke, A., Chaurasia, A., Kim, S., Culurciello, E.: Enet: A deep neural network architecture for real-time semantic segmentation. arXiv preprint arXiv:1606.02147 (2016)  27. Rublee, E., Rabaud, V., Konolige, K., Bradski, G.: Orb: An eﬃcient alternative to sift or surf. In: Computer Vision (ICCV), 2011 IEEE international conference on. pp. 2564-2571. IEEE (2011)  28. Saxena, A., Chung, S.H., Ng, A.Y.: Learning depth from single monocular images. In: Advances in neural information processing systems. pp. 1161-1168 (2006) 29. Sinz, F.H., Candela, J.Q., Bakır, G.H., Rasmussen, C.E., Franz, M.O.: Learning depth from stereo. In: Joint Pattern Recognition Symposium. pp. 245-252. Springer (2004)  30. Song, S., Xiao, J.: Tracking revisited using rgbd camera: Unified benchmark and baselines. In: Computer Vision (ICCV), 2013 IEEE International Conference on. pp. 233-240. IEEE (2013)  31. Song, X., Dai, Y., Qin, X.: Deep depth super-resolution: Learning depth super- resolution using deep convolutional neural network. In: Asian Conference on Com- puter Vision. pp. 360-376. Springer (2016)  32. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A., et al.: Going deeper with convolutions. Cvpr (2015) 33. Teichman, A., Lussier, J.T., Thrun, S.: Learning to segment and track in rgbd. IEEE Transactions on Automation Science and Engineering 10(4), 841-852 (2013) 34. Teichmann, M., Weber, M., Zoellner, M., Cipolla, R., Urtasun, R.: Multi- net: Real-time joint semantic reasoning for autonomous driving. arXiv preprint arXiv:1612.07695 (2016)  35. Uhrig, J., Schneider, N., Schneider, L., Franke, U., Brox, T., Geiger, A.: Sparsity  invariant cnns. In: International Conference on 3D Vision (3DV) (2017)  36. Whelan, T., Kaess, M., Johannsson, H., Fallon, M., Leonard, J.J., McDonald, J.: Real-time large-scale dense rgb-d slam with volumetric fusion. The International Journal of Robotics Research 34(4-5), 598-626 (2015)  37. Xu, D., Ricci, E., Ouyang, W., Wang, X., Sebe, N.: Multi-scale continuous crfs as sequential deep networks for monocular depth estimation. In: Proceedings of CVPR (2017)"}