{"1": "1. Bas, A., Huber, P., Smith, W., Awais, M., Kittler, J.: 3D Morphable Models as  Spatial Transformer Networks. arXiv Preprint (2017)  2. Chen, W., Wang, H., Li, Y., Su, H., Wang, Z., Tu, C., Lischinski, D., Cohen-or, D., Chen, B.: Synthesizing Training Images for Boosting Human 3D Pose Estimation. In: 3DV (2016)  3. Chen, X., Duan, Y., Houthooft, R., Schulman, J., Sutskever, I., Abbeel, P.: In- fogan: Interpretable Representation Learning by Information Maximizing Genera- tive Adversarial Nets. In: Advances in Neural Information Processing Systems. pp. 2172-2180 (2016)  4. Cohen, T., Welling, M.: Transformation Properties of Learned Visual Representa-  tions. arXiv Preprint (2014)  5. Dosovitskiy, A., Springenberg, J., Brox, T.: Learning to Generate Chairs with Convolutional Neural Networks. In: Conference on Computer Vision and Pattern Recognition (2015)  6. Dosovitskiy, A., Springenberg, J., Tatarchenko, M., Brox, T.: Learning to Gener- ate Chairs, Tables and Cars with Convolutional Networks. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(4), 692-705 (2017)  7. Flynn, J., Neulander, I., Philbin, J., Snavely, N.: Deepstereo: Learning to Predict New Views from the World’s Imagery. In: Conference on Computer Vision and Pattern Recognition. pp. 5515-5524 (2016)  8. Gadelha, M., Maji, S., Wang, R.: 3d shape induction from 2d views of multiple  objects. arXiv preprint arXiv:1612.05872 (2016)  9. Grant, E., Kohli, P., van M. Gerven: Deep Disentangled Representations for Volu- metric Reconstruction. In: European Conference on Computer Vision. pp. 266-279 (2016)  10. He, K., Zhang, X., Ren, S., Sun, J.: Deep Residual Learning for Image Recognition.  In: CVPR. pp. 770-778 (2016)  11. Hinton, G., Krizhevsky, A., Wang, S.: Transforming Auto-Encoders. In: Interna-  tional Conference on Artificial Neural Networks. pp. 44-51 (2011)  12. Ionescu, C., Carreira, J., Sminchisescu, C.: Iterated Second-Order Label Sensitive Pooling for 3D Human Pose Estimation. In: Conference on Computer Vision and Pattern Recognition (2014)  13. Ionescu, C., Papava, I., Olaru, V., Sminchisescu, C.: Human3.6M: Large Scale Datasets and Predictive Methods for 3D Human Sensing in Natural Environments. IEEE Transactions on Pattern Analysis and Machine Intelligence (2014)  14. Joo, H., Liu, H., Tan, L., Gui, L., Nabbe, B., Matthews, I., Kanade, T., Nobuhara, S., Sheikh, Y.: Panoptic Studio: A Massively Multiview System for Social Motion Capture. In: International Conference on Computer Vision (2015)  15. Kar, A., H¨ane, C., Malik, J.: Learning a multi-view stereo machine. In: Advances  in Neural Information Processing Systems. pp. 364-375 (2017)  16. Kim, H., Zollh¨ofer, M., Tewari, A., Thies, J., Richardt, C., Theobalt, C.: In- versefacenet: Deep Single-Shot Inverse Face Rendering from a Single Image. arXiv Preprint (2017)  17. Kulkarni, T.D., Whitney, W., Kohli, P., Tenenbaum, J.B.: Deep Convolutional  Inverse Graphics Network. In: arXiv (2015)  18. Lassner, C., Pons-Moll, G., Gehler, P.: A Generative Model of People in Clothing.  arXiv Preprint (2017)   Unsupervised Geometry-Aware RepresentationReferences  1. Bas, A., Huber, P., Smith, W., Awais, M., Kittler, J.: 3D Morphable Models as  Spatial Transformer Networks. arXiv Preprint (2017)  2. Chen, W., Wang, H., Li, Y., Su, H., Wang, Z., Tu, C., Lischinski, D., Cohen-or, D., Chen, B.: Synthesizing Training Images for Boosting Human 3D Pose Estimation. In: 3DV (2016)  3. Chen, X., Duan, Y., Houthooft, R., Schulman, J., Sutskever, I., Abbeel, P.: In- fogan: Interpretable Representation Learning by Information Maximizing Genera- tive Adversarial Nets. In: Advances in Neural Information Processing Systems. pp. 2172-2180 (2016)  4. Cohen, T., Welling, M.: Transformation Properties of Learned Visual Representa-  tions. arXiv Preprint (2014)  5. Dosovitskiy, A., Springenberg, J., Brox, T.: Learning to Generate Chairs with Convolutional Neural Networks. In: Conference on Computer Vision and Pattern Recognition (2015)  6. Dosovitskiy, A., Springenberg, J., Tatarchenko, M., Brox, T.: Learning to Gener- ate Chairs, Tables and Cars with Convolutional Networks. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(4), 692-705 (2017)  7. Flynn, J., Neulander, I., Philbin, J., Snavely, N.: Deepstereo: Learning to Predict New Views from the World’s Imagery. In: Conference on Computer Vision and Pattern Recognition. pp. 5515-5524 (2016)  8. Gadelha, M., Maji, S., Wang, R.: 3d shape induction from 2d views of multiple  objects. arXiv preprint arXiv:1612.05872 (2016)  9. Grant, E., Kohli, P., van M. Gerven: Deep Disentangled Representations for Volu- metric Reconstruction. In: European Conference on Computer Vision. pp. 266-279 (2016)  10. He, K., Zhang, X., Ren, S., Sun, J.: Deep Residual Learning for Image Recognition.  In: CVPR. pp. 770-778 (2016)  11. Hinton, G., Krizhevsky, A., Wang, S.: Transforming Auto-Encoders. In: Interna-  tional Conference on Artificial Neural Networks. pp. 44-51 (2011)  12. Ionescu, C., Carreira, J., Sminchisescu, C.: Iterated Second-Order Label Sensitive Pooling for 3D Human Pose Estimation. In: Conference on Computer Vision and Pattern Recognition (2014)  13. Ionescu, C., Papava, I., Olaru, V., Sminchisescu, C.: Human3.6M: Large Scale Datasets and Predictive Methods for 3D Human Sensing in Natural Environments. IEEE Transactions on Pattern Analysis and Machine Intelligence (2014)  14. Joo, H., Liu, H., Tan, L., Gui, L., Nabbe, B., Matthews, I., Kanade, T., Nobuhara, S., Sheikh, Y.: Panoptic Studio: A Massively Multiview System for Social Motion Capture. In: International Conference on Computer Vision (2015)  15. Kar, A., H¨ane, C., Malik, J.: Learning a multi-view stereo machine. In: Advances  in Neural Information Processing Systems. pp. 364-375 (2017)  16. Kim, H., Zollh¨ofer, M., Tewari, A., Thies, J., Richardt, C., Theobalt, C.: In- versefacenet: Deep Single-Shot Inverse Face Rendering from a Single Image. arXiv Preprint (2017)  17. Kulkarni, T.D., Whitney, W., Kohli, P., Tenenbaum, J.B.: Deep Convolutional  Inverse Graphics Network. In: arXiv (2015)  18. Lassner, C., Pons-Moll, G., Gehler, P.: A Generative Model of People in Clothing.  arXiv Preprint (2017)   16  Helge Rhodin, Mathieu Salzmann, Pascal Fua  19. Ma, L., Jia, X., Sun, Q., Schiele, B., Tuytelaars, T., Gool, L.V.: Pose Guided Person Image Generation. In: Advances in Neural Information Processing Systems. pp. 405-415 (2017)  20. Martinez, J., Hossain, R., Romero, J., Little, J.: A Simple Yet Eﬀective Baseline for 3D Human Pose Estimation. In: International Conference on Computer Vision (2017)  21. Mehta, D., Rhodin, H., Casas, D., Fua, P., Sotnychenko, O., Xu, W., Theobalt, C.: Monocular 3D Human Pose Estimation in the Wild Using Improved CNN Supervision. In: International Conference on 3D Vision (2017)  22. Mehta, D., Sridhar, S., Sotnychenko, O., Rhodin, H., Shafiei, M., Seidel, H., Xu, W., Casas, D., Theobalt, C.: Vnect: Real-Time 3D Human Pose Estimation with a Single RGB Camera. In: ACM SIGGRAPH (2017)  23. Park, E., Yang, J., Yumer, E., Ceylan, D., Berg, A.: Transformation-Grounded Im- age Generation Network for Novel 3D View Synthesis. In: Conference on Computer Vision and Pattern Recognition. pp. 702-711 (2017)  24. Pavlakos, G., Zhou, X., Derpanis, K., Konstantinos, G., Daniilidis, K.: Coarse-To- Fine Volumetric Prediction for Single-Image 3D Human Pose. In: Conference on Computer Vision and Pattern Recognition (2017)  25. Pavlakos, G., Zhou, X., Konstantinos, K.D.G., Kostas, D.: Harvesting Multiple Views for Marker-Less 3D Human Pose Annotations. In: Conference on Computer Vision and Pattern Recognition (2017)  26. Peng, X., Feris, R.S., Wang, X., Metaxas, D.N.: A recurrent encoder-decoder net-  work for sequential face alignment. In: ECCV (2016)  27. Popa, A.I., Zanfir, M., Sminchisescu, C.: Deep Multitask Architecture for Inte- grated 2D and 3D Human Sensing. In: Conference on Computer Vision and Pattern Recognition (2017)  28. Reed, S., Zhang, Y., Zhang, Y., Lee, H.: Deep Visual Analogy-Making. In: Ad-  vances in Neural Information Processing Systems. pp. 1252-1260 (2015)  29. Rezende, D., Eslami, S., Mohamed, S., Battaglia, P., Jaderberg, M., Heess, N.: Unsupervised Learning of 3D Structure from Images. In: Advances in Neural In- formation Processing Systems. pp. 4996-5004 (2016)  30. Rhodin, H., Richardt, C., Casas, D., Insafutdinov, E., Shafiei, M., Seidel, H.P., B, S., Theobalt, C.: Egocap: Egocentric Marker-Less Motion Capture with Two Fisheye Cameras. ACM SIGGRAPH Asia 35(6) (2016)  31. Rhodin, H., Spoerri, J., Katircioglu, I., Constantin, V., Meyer, F., Moeller, E., Salzmann, M., Fua, P.: Learning Monocular 3D Human Pose Estimation from Multi-View Images. In: Conference on Computer Vision and Pattern Recognition (2018)  32. Rogez, G., Schmid, C.: Mocap Guided Data Augmentation for 3D Pose Estimation in the Wild. In: Advances in Neural Information Processing Systems (2016) 33. Rogez, G., Weinzaepfel, P., Schmid, C.: Lcr-Net: Localization-Classification- Regression for Human Pose. In: Conference on Computer Vision and Pattern Recognition (2017)  34. Ronneberger, O., Fischer, P., Brox, T.: U-Net: Convolutional Networks for Biomed- ical Image Segmentation. In: Conference on Medical Image Computing and Com- puter Assisted Intervention (2015)  35. Shu, Z., Yumer, E., Hadap, S., Sunkavalli, K., Shechtman, E., Samaras, D.: Neu- ral Face Editing with Intrinsic Image Disentangling. In: Conference on Computer Vision and Pattern Recognition (2017)  36. Tatarchenko, M., Dosovitskiy, A., Brox, T.: Single-view to multi-view: Reconstruct- ing unseen views with a convolutional network. CoRR abs/1511.06702 1, 2 (2015)   Unsupervised Geometry-Aware Representation37. Tatarchenko, M., Dosovitskiy, A., Brox, T.: Multi-view 3d models from single im- ages with a convolutional network. In: European Conference on Computer Vision. pp. 322-337. Springer (2016)  38. Tekin, B., M´arquez-neila, P., Salzmann, M., Fua, P.: Learning to Fuse 2D and 3D Image Cues for Monocular Body Pose Estimation. In: International Conference on Computer Vision (2017)  39. Tewari, A., Zollh¨ofer, M., Kim, H., Garrido, P., Bernard, F., P´erez, P., Theobalt, C.: Mofa: Model-based deep convolutional face autoencoder for unsupervised monoc- ular reconstruction. International Conference on Computer Vision (2017)  40. Thewlis, J., Bilen, H., Vedaldi, A.: Unsupervised learning of object frames by dense equivariant image labelling. In: Advances in Neural Information Processing Systems. pp. 844-855 (2017)  41. Thewlis, J., Bilen, H., Vedaldi, A.: Unsupervised learning of object landmarks by factorized spatial embeddings. In: International Conference on Computer Vision (2017)  42. Tome, D., Russell, C., Agapito, L.: Lifting from the Deep: Convolutional 3D Pose Estimation from a Single Image. In: arXiv preprint, arXiv:1701.00295 (2017) 43. Tran, L., Yin, X., Liu, X.: Disentangled representation learning gan for pose-  invariant face recognition. In: CVPR. vol. 3, p. 7 (2017)  44. Tulsiani, S., Efros, A., Malik, J.: Multi-View Consistency as Supervisory Signal for  Learning Shape and Pose Prediction. arXiv Preprint (2018)  45. Tulsiani, S., Zhou, T., Efros, A., Malik, J.: Multi-view supervision for single-view reconstruction via diﬀerentiable ray consistency. In: Conference on Computer Vi- sion and Pattern Recognition. vol. 1, p. 3 (2017)  46. Tung, H.Y., Harley, A., Seto, W., Fragkiadaki, K.: Adversarial inverse graphics networks: Learning 2d-to-3d lifting and image-to-image translation from unpaired supervision. In: The IEEE International Conference on Computer Vision (ICCV). vol. 2 (2017)  47. Tung, H.Y., Tung, H.W., Yumer, E., Fragkiadaki, K.: Self-supervised learning of motion capture. In: Advances in Neural Information Processing Systems. pp. 5242- 5252 (2017)  48. Varol, G., Romero, J., Martin, X., Mahmood, N., Black, M., Laptev, I., Schmid, C.: Learning from synthetic humans. In: Conference on Computer Vision and Pattern Recognition (2017)  49. Worrall, D., Garbin, S., Turmukhambetov, D., Brostow, G.: Interpretable transfor- mations with encoder-decoder networks. In: International Conference on Computer Vision. vol. 4 (2017)  50. Yan, X., Yang, J., Yumer, E., Guo, Y., Lee, H.: Perspective Transformer Nets: Learning Single-View 3D Object Reconstruction Without 3D Supervision. In: Ad- vances in Neural Information Processing Systems. pp. 1696-1704 (2016)  51. Yang, J., Reed, S., Yang, M.H., Lee, H.: Weakly-supervised disentangling with re- current transformations for 3d view synthesis. In: Advances in Neural Information Processing Systems. pp. 1099-1107 (2015)  52. Zhao, B., Wu, X., Cheng, Z.Q., Liu, H., Feng, J.: Multi-view image generation  from a single-view. arXiv preprint arXiv:1704.04886 (2017)  53. Zhou, T., Tulsiani, S., Sun, W., Malik, J., Efros, A.: View synthesis by appearance  ﬂow. In: European conference on computer vision. pp. 286-301. Springer (2016)  54. Zhou, X., Huang, Q., Sun, X., Xue, X., We, Y.: Weakly-Supervised Transfer for  3D Human Pose Estimation in the Wild. arXiv Preprint (2017)   18  Helge Rhodin, Mathieu Salzmann, Pascal Fua  55. Zhou, X., Karpur, A., Gan, C., Luo, L., Huang, Q.: Unsupervised domain adaptation for 3d keypoint prediction from a single depth scan. arXiv preprint arXiv:1712.05765 (2017)  56. Zhu, J.Y., Park, T., Isola, P., Efros, A.: Unpaired image-to-image translation using cycle-consistent adversarial networks. arXiv preprint arXiv:1703.10593 (2017)"}