{"1": "1. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  2. Dai, J., He, K., Li, Y., Ren, S., Sun, J.: Instance-sensitive fully convolutional networks. In: European Conference on Computer Vision. pp. 534-549. Springer (2016)  3. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully convolutional networks. In: Advances in neural information processing systems. pp. 379-387 (2016)  4. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. arXiv preprint arXiv:1703.06211 (2017)  5. De Brabandere, B., Jia, X., Tuytelaars, T., Van Gool, L.: Dynamic filter networks.  In: Neural Information Processing Systems (NIPS) (2016)  6. Dosovitskiy, A., Fischer, P., Ilg, E., H¨ausser, P., Hazırba¸s, C., Golkov, V., v.d. Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: IEEE International Conference on Computer Vision (ICCV) (2015), http://lmb.informatik.uni-freiburg.de//Publications/2015/DFIB15  7. Dosovitskiy, A., Fischer, P., Ilg, E., Hausser, P., Hazirbas, C., Golkov, V., van der Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: Proceedings of the IEEE International Conference on Computer Vi- sion. pp. 2758-2766 (2015)  8. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The pascal visual object classes (voc) challenge. International Journal of Computer Vision 88(2), 303-338 (Jun 2010)  9. Girshick, R.: Fast r-cnn. In: The IEEE International Conference on Computer  Vision (ICCV) (December 2015)  10. Harley, A.W., Derpanis, K.G., Kokkinos, I.: Segmentation-aware convolutional net-  works using local attention masks. arXiv preprint arXiv:1708.04607 (2017)  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2016)  12. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: Mobilenets: Eﬃcient convolutional neural networks for mobile vision applications. CoRR abs/1704.04861 (2017)  13. Ilg, E., Mayer, N., Saikia, T., Keuper, M., Dosovitskiy, A., Brox, T.: Flownet 2.0: Evolution of optical ﬂow estimation with deep networks. arXiv preprint arXiv:1612.01925 (2016)  14. Kim, J.H., Lee, S.W., Kwak, D., Heo, M.O., Kim, J., Ha, J.W., Zhang, B.T.: Multimodal residual learning for visual qa. In: Advances in Neural Information Processing Systems. pp. 361-369 (2016)  15. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Pereira, F., Burges, C.J.C., Bottou, L., Weinberger, K.Q. (eds.) Advances in Neural Information Processing Systems 25, pp. 1097- 1105. Curran Associates, Inc. (2012), http://papers.nips.cc/paper/4824-imagenet- classification-with-deep-convolutional-neural-networks.pdf  16. Li, Y., Qi, H., Dai, J., Ji, X., Wei, Y.: Fully convolutional instance-aware semantic  segmentation. arXiv preprint arXiv:1611.07709 (2016)   LS-DFNReferences  1. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  2. Dai, J., He, K., Li, Y., Ren, S., Sun, J.: Instance-sensitive fully convolutional networks. In: European Conference on Computer Vision. pp. 534-549. Springer (2016)  3. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully convolutional networks. In: Advances in neural information processing systems. pp. 379-387 (2016)  4. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. arXiv preprint arXiv:1703.06211 (2017)  5. De Brabandere, B., Jia, X., Tuytelaars, T., Van Gool, L.: Dynamic filter networks.  In: Neural Information Processing Systems (NIPS) (2016)  6. Dosovitskiy, A., Fischer, P., Ilg, E., H¨ausser, P., Hazırba¸s, C., Golkov, V., v.d. Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: IEEE International Conference on Computer Vision (ICCV) (2015), http://lmb.informatik.uni-freiburg.de//Publications/2015/DFIB15  7. Dosovitskiy, A., Fischer, P., Ilg, E., Hausser, P., Hazirbas, C., Golkov, V., van der Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: Proceedings of the IEEE International Conference on Computer Vi- sion. pp. 2758-2766 (2015)  8. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The pascal visual object classes (voc) challenge. International Journal of Computer Vision 88(2), 303-338 (Jun 2010)  9. Girshick, R.: Fast r-cnn. In: The IEEE International Conference on Computer  Vision (ICCV) (December 2015)  10. Harley, A.W., Derpanis, K.G., Kokkinos, I.: Segmentation-aware convolutional net-  works using local attention masks. arXiv preprint arXiv:1708.04607 (2017)  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2016)  12. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: Mobilenets: Eﬃcient convolutional neural networks for mobile vision applications. CoRR abs/1704.04861 (2017)  13. Ilg, E., Mayer, N., Saikia, T., Keuper, M., Dosovitskiy, A., Brox, T.: Flownet 2.0: Evolution of optical ﬂow estimation with deep networks. arXiv preprint arXiv:1612.01925 (2016)  14. Kim, J.H., Lee, S.W., Kwak, D., Heo, M.O., Kim, J., Ha, J.W., Zhang, B.T.: Multimodal residual learning for visual qa. In: Advances in Neural Information Processing Systems. pp. 361-369 (2016)  15. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Pereira, F., Burges, C.J.C., Bottou, L., Weinberger, K.Q. (eds.) Advances in Neural Information Processing Systems 25, pp. 1097- 1105. Curran Associates, Inc. (2012), http://papers.nips.cc/paper/4824-imagenet- classification-with-deep-convolutional-neural-networks.pdf  16. Li, Y., Qi, H., Dai, J., Ji, X., Wei, Y.: Fully convolutional instance-aware semantic  segmentation. arXiv preprint arXiv:1611.07709 (2016)   16  Wu et al  17. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature pyramid networks for object detection. arXiv preprint arXiv:1612.03144 (2016) 18. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic seg- mentation. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2015)  19. Long, M., Zhu, H., Wang, J., Jordan, M.I.: Unsupervised domain adaptation with residual transfer networks. In: Advances in Neural Information Processing Systems. pp. 136-144 (2016)  20. Luo, W., Li, Y., Urtasun, R., Zemel, R.S.: Understanding the eﬀective receptive  field in deep convolutional neural networks. In: NIPS (2016)  21. Ranjan, A., Black, M.J.: Optical ﬂow estimation using a spatial pyramid network.  arXiv preprint arXiv:1611.00850 (2016)  22. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object detec- tion with region proposal networks. In: Advances in neural information processing systems. pp. 91-99 (2015)  23. Revaud, J., Weinzaepfel, P., Harchaoui, Z., Schmid, C.: Epicﬂow: Edge-preserving interpolation of correspondences for optical ﬂow. In: Proceedings of the IEEE Con- ference on Computer Vision and Pattern Recognition. pp. 1164-1172 (2015) 24. Sharma, S., Kiros, R., Salakhutdinov, R.: Action recognition using visual attention.  arXiv preprint arXiv:1511.04119 (2015)  25. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)  26. Srivastava, N., Mansimov, E., Salakhudinov, R.: Unsupervised learning of video representations using lstms. In: International Conference on Machine Learning. pp. 843-852 (2015)  27. Sun, D., Yang, X., Liu, M.Y., Kautz, J.: Pwc-net: Cnns for optical ﬂow using pyramid, warping, and cost volume. arXiv preprint arXiv:1709.02371 (2017) 28. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A.: Going deeper with convolutions. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 1-9 (2015) 29. Wang, F., Jiang, M., Qian, C., Yang, S., Li, C., Zhang, H., Wang, X., Tang, X.: Residual attention network for image classification. arXiv preprint arXiv:1704.06904 (2017)  30. Weinzaepfel, P., Revaud, J., Harchaoui, Z., Schmid, C.: Deepﬂow: Large displace- ment optical ﬂow with deep matching. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 1385-1392 (2013)  31. Wu, J., Wang, G., Yang, W., Ji, X.: Action recognition with joint attention on  multi-level deep features. arXiv preprint arXiv:1607.02556 (2016)  32. Xu, K., Ba, J., Kiros, R., Cho, K., Courville, A., Salakhudinov, R., Zemel, R., Bengio, Y.: Show, attend and tell: Neural image caption generation with visual attention. In: International Conference on Machine Learning. pp. 2048-2057 (2015) 33. Zhu, Y., Zhao, C., Wang, J., Zhao, X., Wu, Y., Lu, H.: Couplenet: Coupling global  structure with local parts for object detection"}