{"1": "1. Kingma, D.P., Welling, M.: Auto-encoding variational bayes. ICLR (2014) 1, 3 2. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS. (2014) 1, 3, 6 3. Srivastava, N., Mansimov, E., Salakhudinov, R.: Unsupervised learning of video  representations using lstms. In: ICML. (2015) 1, 4  4. Finn, C., Goodfellow, I., Levine, S.: Unsupervised learning for physical interaction  through video prediction. In: NIPS. (2016) 1, 4  5. Mathieu, M., Couprie, C., LeCun, Y.: Deep multi-scale video prediction beyond  mean square error. ICLR (2016) 1, 4  6. Oh, J., Guo, X., Lee, H., Lewis, R.L., Singh, S.: Action-conditional video prediction  using deep networks in atari games. In: NIPS. (2015) 1, 4  7. Denton, E.L., et al.: Unsupervised learning of disentangled representations from  8. Vondrick, C., Pirsiavash, H., Torralba, A.: Generating videos with scene dynamics.  video. In: NIPS. (2017) 2  In: NIPS. (2016) 2, 4, 11, 12  9. Saito, M., Matsumoto, E., Saito, S.: Temporal generative adversarial nets with  singular value clipping. In: ICCV. (2017) 2  10. Tulyakov, S., Liu, M.Y., Yang, X., Kautz, J.: Mocogan: Decomposing motion and content for video generation. arXiv preprint arXiv:1707.04993 (2017) 2, 4, 11, 12 11. Hodgins, J.K., O’Brien, J.F., Tumblin, J.: Perception of human motion with diﬀer- ent geometric models. IEEE Transactions on Visualization and Computer Graphics (1998) 2, 4  12. Yan, S., Xiong, Y., Lin, D.: Spatial temporal graph convolutional networks for  skeleton-based action recognition. AAAI (2018) 2, 4  13. Du, Y., Wang, W., Wang, L.: Hierarchical recurrent neural network for skeleton  based action recognition. In: CVPR. (2015) 2, 4  14. Vemulapalli, R., Arrate, F., Chellappa, R.: Human action recognition by repre-  senting 3d skeletons as points in a lie group. In: CVPR. (2014) 2, 4  15. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR. (2017) 2, 5, 9, 10  16. Radford, A., Metz, L., Chintala, S.: Unsupervised representation learning with  deep convolutional generative adversarial networks. ICLR (2015) 3  17. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein gan.  arXiv preprint  arXiv:1701.07875 (2017) 3  18. Gulrajani, I., Ahmed, F., Arjovsky, M., Dumoulin, V., Courville, A.C.: Improved  training of wasserstein gans. In: NIPS. (2017) 3  19. Mirza, M., Osindero, S.: Conditional generative adversarial nets. arXiv preprint  arXiv:1411.1784 (2014) 3  20. Ma, L., Jia, X., Sun, Q., Schiele, B., Tuytelaars, T., Van Gool, L.: Pose guided  person image generation. In: NIPS. (2017) 3, 7  21. Zhang, H., Xu, T., Li, H., Zhang, S., Huang, X., Wang, X., Metaxas, D.: Stack- gan: Text to photo-realistic image synthesis with stacked generative adversarial networks. In: ICCV. (2017) 3  22. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation  using cycle-consistent adversarial networks. ICCV (2017) 3  23. Yi, Z., Zhang, H., Tan, P., Gong, M.: Dualgan: Unsupervised dual learning for  image-to-image translation. ICCV (2017) 3   Pose Guided Human Video GenerationReferences  1. Kingma, D.P., Welling, M.: Auto-encoding variational bayes. ICLR (2014) 1, 3 2. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS. (2014) 1, 3, 6 3. Srivastava, N., Mansimov, E., Salakhudinov, R.: Unsupervised learning of video  representations using lstms. In: ICML. (2015) 1, 4  4. Finn, C., Goodfellow, I., Levine, S.: Unsupervised learning for physical interaction  through video prediction. In: NIPS. (2016) 1, 4  5. Mathieu, M., Couprie, C., LeCun, Y.: Deep multi-scale video prediction beyond  mean square error. ICLR (2016) 1, 4  6. Oh, J., Guo, X., Lee, H., Lewis, R.L., Singh, S.: Action-conditional video prediction  using deep networks in atari games. In: NIPS. (2015) 1, 4  7. Denton, E.L., et al.: Unsupervised learning of disentangled representations from  8. Vondrick, C., Pirsiavash, H., Torralba, A.: Generating videos with scene dynamics.  video. In: NIPS. (2017) 2  In: NIPS. (2016) 2, 4, 11, 12  9. Saito, M., Matsumoto, E., Saito, S.: Temporal generative adversarial nets with  singular value clipping. In: ICCV. (2017) 2  10. Tulyakov, S., Liu, M.Y., Yang, X., Kautz, J.: Mocogan: Decomposing motion and content for video generation. arXiv preprint arXiv:1707.04993 (2017) 2, 4, 11, 12 11. Hodgins, J.K., O’Brien, J.F., Tumblin, J.: Perception of human motion with diﬀer- ent geometric models. IEEE Transactions on Visualization and Computer Graphics (1998) 2, 4  12. Yan, S., Xiong, Y., Lin, D.: Spatial temporal graph convolutional networks for  skeleton-based action recognition. AAAI (2018) 2, 4  13. Du, Y., Wang, W., Wang, L.: Hierarchical recurrent neural network for skeleton  based action recognition. In: CVPR. (2015) 2, 4  14. Vemulapalli, R., Arrate, F., Chellappa, R.: Human action recognition by repre-  senting 3d skeletons as points in a lie group. In: CVPR. (2014) 2, 4  15. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR. (2017) 2, 5, 9, 10  16. Radford, A., Metz, L., Chintala, S.: Unsupervised representation learning with  deep convolutional generative adversarial networks. ICLR (2015) 3  17. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein gan.  arXiv preprint  arXiv:1701.07875 (2017) 3  18. Gulrajani, I., Ahmed, F., Arjovsky, M., Dumoulin, V., Courville, A.C.: Improved  training of wasserstein gans. In: NIPS. (2017) 3  19. Mirza, M., Osindero, S.: Conditional generative adversarial nets. arXiv preprint  arXiv:1411.1784 (2014) 3  20. Ma, L., Jia, X., Sun, Q., Schiele, B., Tuytelaars, T., Van Gool, L.: Pose guided  person image generation. In: NIPS. (2017) 3, 7  21. Zhang, H., Xu, T., Li, H., Zhang, S., Huang, X., Wang, X., Metaxas, D.: Stack- gan: Text to photo-realistic image synthesis with stacked generative adversarial networks. In: ICCV. (2017) 3  22. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation  using cycle-consistent adversarial networks. ICCV (2017) 3  23. Yi, Z., Zhang, H., Tan, P., Gong, M.: Dualgan: Unsupervised dual learning for  image-to-image translation. ICCV (2017) 3   16  C. Yang, Z. Wang, X. Zhu, C. Huang, J. Shi, D. Lin et al.  24. Kim, T., Cha, M., Kim, H., Lee, J., Kim, J.: Learning to discover cross-domain relations with generative adversarial networks. arXiv preprint arXiv:1703.05192 (2017) 3  25. Choi, Y., Choi, M., Kim, M., Ha, J.W., Kim, S., Choo, J.: Stargan: Unified gen- erative adversarial networks for multi-domain image-to-image translation. CVPR (2018) 3  26. Liang, X., Lee, L., Dai, W., Xing, E.P.: Dual motion gan for future-ﬂow embedded  video prediction. ICCV (2017) 4  27. Fragkiadaki, K., Levine, S., Felsen, P., Malik, J.: Recurrent network models for  human dynamics. In: ICCV, IEEE (2015) 4  28. Zhou, Y., Berg, T.L.: Learning temporal transformations from time-lapse videos.  29. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural computation  In: ECCV, Springer (2016) 4  (1997) 5  30. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con-  ditional adversarial networks. CVPR (2017) 5, 9  31. Nair, V., Hinton, G.E.: Rectified linear units improve restricted boltzmann ma-  chines. In: ICML. (2010) 9  32. TDmitry Ulyanov, Andrea Vedaldi, V.L.:  Instance normalization: The missing  ingredient for fast stylization. arXiv preprint arXiv:1607.08022 (2016) 9  33. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. (2016) 934. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. ICLR (2014)  35. Soomro, K., Zamir, A.R., Shah, M.: Ucf101: A dataset of 101 human actions classes  from videos in the wild. arXiv preprint arXiv:1212.0402 (2012) 9  36. Blank, M., Gorelick, L., Shechtman, E., Irani, M., Basri, R.: Actions as space-time  shapes. In: ICCV, IEEE (2005) 9  37. Lucey, P., Cohn, J.F., Kanade, T., Saragih, J., Ambadar, Z., Matthews, I.: The ex- tended cohn-kanade dataset (ck+): A complete dataset for action unit and emotion- specified expression. In: Computer Vision and Pattern Recognition Workshops (CVPRW), 2010 IEEE Computer Society Conference on, IEEE (2010) 10  38. Salimans, T., Goodfellow, I., Zaremba, W., Cheung, V., Radford, A., Chen, X.:  Improved techniques for training gans. In: NIPS. (2016) 11  39. Wang, Z., Bovik, A.C., Sheikh, H.R., Simoncelli, E.P.: Image quality assessment:  from error visibility to structural similarity. IEEE TIP (2004) 14  40. Zhang, R., Isola, P., Efros, A.A., Shechtman, E., Wang, O.: The unreasonable  eﬀectiveness of deep features as a perceptual metric. CVPR (2018) 14"}