{"1": "1. Bogo, F., Kanazawa, A., Lassner, C., Gehler, P., Romero, J., Black, M.J.: Keep it smpl: Automatic estimation of 3d human pose and shape from a single image. In: European Conference on Computer Vision. pp. 561-578. Springer (2016)  2. Chen, C.H., Ramanan, D.: 3d human pose estimation= 2d pose estimation+  matching. In: CVPR. vol. 2, p. 6 (2017)  3. C¸ i¸cek, ¨O., Abdulkadir, A., Lienkamp, S.S., Brox, T., Ronneberger, O.: 3d u-net: learning dense volumetric segmentation from sparse annotation. In: International Conference on Medical Image Computing and Computer-Assisted Intervention. pp. 424-432. Springer (2016)  4. Dibra, E., Wolf, T., Oztireli, C., Gross, M.: How to refine 3d hand pose estimation from unlabelled depth data? In: 3D Vision (3DV), 2017 International Conference on. pp. 135-144. IEEE (2017)  5. Ge, L., Cai, Y., Weng, J., Yuan, J.: Hand pointnet: 3d hand pose estimation us- ing point sets. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 8417-8426 (2018)  6. Ge, L., Liang, H., Yuan, J., Thalmann, D.: Robust 3d hand pose estimation in single depth images: from single-view cnn to multi-view cnns. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 3593-3601 (2016)  7. Ge, L., Liang, H., Yuan, J., Thalmann, D.: 3d convolutional neural networks for eﬃcient and robust hand pose estimation from single depth images. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. vol. 1, p. 5 (2017)  8. Ge, L., Ren, Z., Yuan, J.: Point-to-point regression pointnet for 3d hand pose  estimation. In: Proc. European Conf. Comput. Vis. (2018)  9. Girshick, R.: Fast r-cnn. In: Computer Vision (ICCV), 2015 IEEE International  Conference on. pp. 1440-1448. IEEE (2015)  10. Gu, J., Wang, Z., Kuen, J., Ma, L., Shahroudy, A., Shuai, B., Liu, T., Wang, X., Wang, G., Cai, J., et al.: Recent advances in convolutional neural networks. Pattern Recognition (2017)  11. Hinton, G.E., Srivastava, N., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.R.: Improving neural networks by preventing co-adaptation of feature detectors. arXiv preprint arXiv:1207.0580 (2012)  12. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International conference on machine learning. pp. 448-456 (2015)  13. Keskin, C., Kıra¸c, F., Kara, Y.E., Akarun, L.: Hand pose estimation and hand shape classification using multi-layered randomized decision forests. In: European Conference on Computer Vision. pp. 852-863. Springer (2012)  14. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  15. Liang, H., Yuan, J., Thalman, D.: Egocentric hand pose estimation and distance recovery in a single rgb image. In: Multimedia and Expo (ICME), 2015 IEEE International Conference on. pp. 1-6. IEEE (2015)  16. Liang, H., Yuan, J., Thalmann, D., Zhang, Z.: Model-based hand pose estima- tion via spatial-temporal hand parsing and 3d fingertip localization. The Visual Computer 29(6-8), 837-848 (2013)   Weakly-supervised 3D Hand Pose Estimation from Monocular RGB ImagesReferences  1. Bogo, F., Kanazawa, A., Lassner, C., Gehler, P., Romero, J., Black, M.J.: Keep it smpl: Automatic estimation of 3d human pose and shape from a single image. In: European Conference on Computer Vision. pp. 561-578. Springer (2016)  2. Chen, C.H., Ramanan, D.: 3d human pose estimation= 2d pose estimation+  matching. In: CVPR. vol. 2, p. 6 (2017)  3. C¸ i¸cek, ¨O., Abdulkadir, A., Lienkamp, S.S., Brox, T., Ronneberger, O.: 3d u-net: learning dense volumetric segmentation from sparse annotation. In: International Conference on Medical Image Computing and Computer-Assisted Intervention. pp. 424-432. Springer (2016)  4. Dibra, E., Wolf, T., Oztireli, C., Gross, M.: How to refine 3d hand pose estimation from unlabelled depth data? In: 3D Vision (3DV), 2017 International Conference on. pp. 135-144. IEEE (2017)  5. Ge, L., Cai, Y., Weng, J., Yuan, J.: Hand pointnet: 3d hand pose estimation us- ing point sets. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 8417-8426 (2018)  6. Ge, L., Liang, H., Yuan, J., Thalmann, D.: Robust 3d hand pose estimation in single depth images: from single-view cnn to multi-view cnns. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 3593-3601 (2016)  7. Ge, L., Liang, H., Yuan, J., Thalmann, D.: 3d convolutional neural networks for eﬃcient and robust hand pose estimation from single depth images. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. vol. 1, p. 5 (2017)  8. Ge, L., Ren, Z., Yuan, J.: Point-to-point regression pointnet for 3d hand pose  estimation. In: Proc. European Conf. Comput. Vis. (2018)  9. Girshick, R.: Fast r-cnn. In: Computer Vision (ICCV), 2015 IEEE International  Conference on. pp. 1440-1448. IEEE (2015)  10. Gu, J., Wang, Z., Kuen, J., Ma, L., Shahroudy, A., Shuai, B., Liu, T., Wang, X., Wang, G., Cai, J., et al.: Recent advances in convolutional neural networks. Pattern Recognition (2017)  11. Hinton, G.E., Srivastava, N., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.R.: Improving neural networks by preventing co-adaptation of feature detectors. arXiv preprint arXiv:1207.0580 (2012)  12. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International conference on machine learning. pp. 448-456 (2015)  13. Keskin, C., Kıra¸c, F., Kara, Y.E., Akarun, L.: Hand pose estimation and hand shape classification using multi-layered randomized decision forests. In: European Conference on Computer Vision. pp. 852-863. Springer (2012)  14. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  15. Liang, H., Yuan, J., Thalman, D.: Egocentric hand pose estimation and distance recovery in a single rgb image. In: Multimedia and Expo (ICME), 2015 IEEE International Conference on. pp. 1-6. IEEE (2015)  16. Liang, H., Yuan, J., Thalmann, D., Zhang, Z.: Model-based hand pose estima- tion via spatial-temporal hand parsing and 3d fingertip localization. The Visual Computer 29(6-8), 837-848 (2013)   16  Yujun Cai, Liuhao Ge, Jianfei Cai, Junsong Yuan  17. Lu, S., Metaxas, D., Samaras, D., Oliensis, J.: Using multiple cues for hand tracking and model refinement. In: Computer Vision and Pattern Recognition, 2003. Pro- ceedings. 2003 IEEE Computer Society Conference on. vol. 2, pp. II-443. IEEE (2003)  18. Mueller, F., Bernard, F., Sotnychenko, O., Mehta, D., Sridhar, S., Casas, D., Theobalt, C.: Ganerated hands for real-time 3d hand tracking from monocular rgb. In: Proceedings of Computer Vision and Pattern Recognition (CVPR) (June 2018), https://handtracker.mpi-inf.mpg.de/projects/GANeratedHands/  19. Oberweger, M., Wohlhart, P., Lepetit, V.: Training a feedback loop for hand pose estimation. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 3316-3324 (2015)  20. Oikonomidis, I., Kyriazis, N., Argyros, A.A.: Eﬃcient model-based 3d tracking of  hand articulations using kinect. In: BmVC. vol. 1, p. 3 (2011)  21. Oikonomidis, I., Kyriazis, N., Argyros, A.A.: Full dof tracking of a hand interacting with an object by modeling occlusions and physical constraints. In: Computer Vi- sion (ICCV), 2011 IEEE International Conference on. pp. 2088-2095. IEEE (2011) 22. Panteleris, P., Oikonomidis, I., Argyros, A.: Using a single rgb frame for real time 3d hand pose estimation in the wild. In: Applications of Computer Vision (WACV), 2018 IEEE Winter Conference on. pp. 436-445. IEEE (2018)  23. Rehg, J.M., Kanade, T.: Digiteyes: Vision-based hand tracking for human- computer interaction. In: Motion of Non-Rigid and Articulated Objects, 1994., Proceedings of the 1994 IEEE Workshop on. pp. 16-22. IEEE (1994)  24. Ren, Z., Yuan, J., Meng, J., Zhang, Z.: Robust part-based hand gesture recognition  using kinect sensor. IEEE Trasactions on Multimedia 15 (2016)  25. Sharp, T., Keskin, C., Robertson, D., Taylor, J., Shotton, J., Kim, D., Rhemann, C., Leichter, I., Vinnikov, A., Wei, Y., et al.: Accurate, robust, and ﬂexible real-time hand tracking. In: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. pp. 3633-3642. ACM (2015)  26. Shotton, J., Girshick, R., Fitzgibbon, A., Sharp, T., Cook, M., Finocchio, M., Moore, R., Kohli, P., Criminisi, A., Kipman, A., et al.: Eﬃcient human pose es- timation from single depth images. IEEE Transactions on Pattern Analysis and Machine Intelligence 35(12), 2821-2840 (2013)  27. Spurr, A., Song, J., Park, S., Hilliges, O.: Cross-modal deep variational hand pose estimation. In: Proceedings of the IEEE Conference on Computer Vision and Pat- tern Recognition. pp. 89-98 (2018)  28. Stenger, B., Thayananthan, A., Torr, P.H., Cipolla, R.: Model-based hand tracking using a hierarchical bayesian filter. IEEE transactions on pattern analysis and machine intelligence 28(9), 1372-1384 (2006)  29. Sun, X., Xiao, B., Liang, S., Wei, Y.: Integral human pose regression. arXiv preprint  arXiv:1711.08229 (2017)  30. Tang, D., Taylor, J., Kohli, P., Keskin, C., Kim, T.K., Shotton, J.: Opening the black box: Hierarchical sampling optimization for estimating human hand pose. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 3325-3333 (2015)  31. Taylor, J., Bordeaux, L., Cashman, T., Corish, B., Keskin, C., Sharp, T., Soto, E., Sweeney, D., Valentin, J., Luﬀ, B., et al.: Eﬃcient and precise interactive hand tracking through joint, continuous optimization of pose and correspondences. ACM Transactions on Graphics (TOG) 35(4), 143 (2016)  32. Tome, D., Russell, C., Agapito, L.: Lifting from the deep: Convolutional 3d pose estimation from a single image. CVPR 2017 Proceedings pp. 2500-2509 (2017)   Weakly-supervised 3D Hand Pose Estimation from Monocular RGB Images33. Tzeng, E., Hoﬀman, J., Darrell, T., Saenko, K.: Simultaneous deep transfer across domains and tasks. In: Computer Vision (ICCV), 2015 IEEE International Con- ference on. pp. 4068-4076. IEEE (2015)  34. Tzionas, D., Ballan, L., Srikantha, A., Aponte, P., Pollefeys, M., Gall, J.: Cap- turing hands in action using discriminative salient points and physics simulation. International Journal of Computer Vision 118(2), 172-193 (2016)  35. Wang, R., Paris, S., Popovi´c, J.: 6d hands: markerless hand-tracking for computer aided design. In: Proceedings of the 24th annual ACM symposium on User interface software and technology. pp. 549-558. ACM (2011)  36. Wei, S.E., Ramakrishna, V., Kanade, T., Sheikh, Y.: Convolutional pose machines. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recog- nition. pp. 4724-4732 (2016)  37. Wu, J., Xue, T., Lim, J.J., Tian, Y., Tenenbaum, J.B., Torralba, A., Freeman, W.T.: Single image 3d interpreter network. In: European Conference on Computer Vision. pp. 365-382. Springer (2016)  38. Wu, Y., Huang, T.S.: Capturing articulated human hand motion: A divide-and- conquer approach. In: Computer Vision, 1999. The Proceedings of the Seventh IEEE International Conference on. vol. 1, pp. 606-611. IEEE (1999)  39. Wu, Y., Huang, T.S.: View-independent recognition of hand postures. In: cvpr.  p. 2088. IEEE (2000)  40. Xu, C., Cheng, L.: Eﬃcient hand pose estimation from a single depth image. In: Computer Vision (ICCV), 2013 IEEE International Conference on. pp. 3456-3462. IEEE (2013)  41. Yang, Y., Ramanan, D.: Articulated pose estimation with ﬂexible mixtures-of- parts. In: Computer Vision and Pattern Recognition (CVPR), 2011 IEEE Confer- ence on. pp. 1385-1392. IEEE (2011)  42. Yasin, H., Iqbal, U., Kruger, B., Weber, A., Gall, J.: A dual-source approach for 3d pose estimation from a single image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 4948-4956 (2016)  43. Zhang, J., Jiao, J., Chen, M., Qu, L., Xu, X., Yang, Q.: 3d hand pose tracking and  estimation using stereo matching. arXiv preprint arXiv:1610.07214 (2016)  44. Zhou, X., Huang, Q., Sun, X., Xue, X., Wei, Y.: Towards 3d human pose estimation in the wild: a weakly-supervised approach. In: IEEE International Conference on Computer Vision (2017)  45. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation using cycle-consistent adversarial networks. In: Computer Vision (ICCV), 2017 IEEE International Conference on. pp. 2242-2251. IEEE (2017)  46. Zimmermann, C., Brox, T.: Learning to estimate 3d hand pose from single rgb  images. In: International Conference on Computer Vision (2017)"}