{"1": "1. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: Towards real-time object  detection with region proposal networks. In: NIPS. (2015) 1, 4  2. Gao, J., Yang, Z., Chen, K., Sun, C., Nevatia, R.: TURN TAP: Temporal unit regression network for temporal action proposals. In: ICCV. (2017) 1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 12, 13  3. Shou, Z., Wang, D., Chang, S.F.: Temporal action localization in untrimmed videos  via multi-stage cnns. In: CVPR. (2016) 1, 2, 3, 4, 8, 12  4. Zhao, Y., Xiong, Y., Wang, L., Wu, Z., Tang, X., Lin, D.: Temporal action detection  with structured segment networks. In: ICCV. (2017) 2, 4, 5, 6, 9, 12  5. Roerdink, J.B., Meijster, A.: The watershed transform: Definitions, algorithms and  parallelization strategies. Fundamenta informaticae (2000) 2, 6  6. Gao, J., Yang, Z., Nevatia, R.: Cascaded boundary regression for temporal action  detection. In: BMVC. (2017) 3, 4  7. Gao, J., Ge, R., Chen, K., Nevatia, R.: Motion-appearance co-memory networks  for video question answering. In: CVPR. (2018) 3  8. Caba Heilbron, F., Carlos Niebles, J., Ghanem, B.: Fast temporal activity proposals for eﬃcient detection of human actions in untrimmed videos. In: CVPR. (2016) 4, 12  9. Laptev, I.: On space-time interest points. IJCV (2005) 4  10. Tran, D., Bourdev, L., Fergus, R., Torresani, L., Paluri, M.: Learning spatiotem-  poral features with 3d convolutional networks. In: ICCV. (2015) 4  11. Escorcia, V., Heilbron, F.C., Niebles, J.C., Ghanem, B.: Daps: Deep action pro-  posals for action understanding. In: ECCV. (2016) 4, 12  12. Buch, S., Escorcia, V., Shen, C., Ghanem, B., Carlos Niebles, J.: Sst: Single-stream  temporal action proposals. In: CVPR. (2017) 4  13. Serena, Y., Olga, R., Greg, M., Li, F.F.: End-to-end learning of action detection  from frame glimpses in videos. In: CVPR. (2016) 4  14. Sun, C., Shetty, S., Sukthankar, R., Nevatia, R.: Temporal localization of fine- In: ACM MM.  grained actions in videos by domain transfer from web images. (2015) 4  15. Yuan, J., Ni, B., Yang, X., Kassim, A.A.: Temporal action localization with pyra-  mid of score distribution features. In: CVPR. (2016) 4  16. Lin, T., Zhao, X., Shou, Z.: Single shot temporal action detection. In: MM, ACM  (2017) 4  17. Xu, H., Das, A., Saenko, K.: R-C3D: Region convolutional 3d network for temporal  18. Yuan, Z., Stroud, J.C., Lu, T., Deng, J.: Temporal action localization by structured  activity detection. In: ICCV. (2017) 4  maximal sums. In: CVPR. (2017) 4  19. Shou, Z., Chan, J., Zareian, A., Miyazawa, K., Chang, S.F.: CDC: Convolutional- de-convolutional networks for precise temporal action localization in untrimmed videos. In: CVPR. (2017) 4  20. Dai, X., Singh, B., Zhang, G., Davis, L.S., Qiu Chen, Y.: Temporal context network  for activity localization in videos. In: ICCV. (2017) 4  21. Gao, J., Sun, C., Yang, Z., Nevatia, R.: Tall: Temporal activity localization via  22. De Geest, R., Gavves, E., Ghodrati, A., Li, Z., Snoek, C., Tuytelaars, T.: Online  language query. In: ICCV. (2017) 4  action detection. In: ECCV. (2016) 4   CTAP: Complementary Temporal Action Proposal GenerationReferences  1. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: Towards real-time object  detection with region proposal networks. In: NIPS. (2015) 1, 4  2. Gao, J., Yang, Z., Chen, K., Sun, C., Nevatia, R.: TURN TAP: Temporal unit regression network for temporal action proposals. In: ICCV. (2017) 1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 12, 13  3. Shou, Z., Wang, D., Chang, S.F.: Temporal action localization in untrimmed videos  via multi-stage cnns. In: CVPR. (2016) 1, 2, 3, 4, 8, 12  4. Zhao, Y., Xiong, Y., Wang, L., Wu, Z., Tang, X., Lin, D.: Temporal action detection  with structured segment networks. In: ICCV. (2017) 2, 4, 5, 6, 9, 12  5. Roerdink, J.B., Meijster, A.: The watershed transform: Definitions, algorithms and  parallelization strategies. Fundamenta informaticae (2000) 2, 6  6. Gao, J., Yang, Z., Nevatia, R.: Cascaded boundary regression for temporal action  detection. In: BMVC. (2017) 3, 4  7. Gao, J., Ge, R., Chen, K., Nevatia, R.: Motion-appearance co-memory networks  for video question answering. In: CVPR. (2018) 3  8. Caba Heilbron, F., Carlos Niebles, J., Ghanem, B.: Fast temporal activity proposals for eﬃcient detection of human actions in untrimmed videos. In: CVPR. (2016) 4, 12  9. Laptev, I.: On space-time interest points. IJCV (2005) 4  10. Tran, D., Bourdev, L., Fergus, R., Torresani, L., Paluri, M.: Learning spatiotem-  poral features with 3d convolutional networks. In: ICCV. (2015) 4  11. Escorcia, V., Heilbron, F.C., Niebles, J.C., Ghanem, B.: Daps: Deep action pro-  posals for action understanding. In: ECCV. (2016) 4, 12  12. Buch, S., Escorcia, V., Shen, C., Ghanem, B., Carlos Niebles, J.: Sst: Single-stream  temporal action proposals. In: CVPR. (2017) 4  13. Serena, Y., Olga, R., Greg, M., Li, F.F.: End-to-end learning of action detection  from frame glimpses in videos. In: CVPR. (2016) 4  14. Sun, C., Shetty, S., Sukthankar, R., Nevatia, R.: Temporal localization of fine- In: ACM MM.  grained actions in videos by domain transfer from web images. (2015) 4  15. Yuan, J., Ni, B., Yang, X., Kassim, A.A.: Temporal action localization with pyra-  mid of score distribution features. In: CVPR. (2016) 4  16. Lin, T., Zhao, X., Shou, Z.: Single shot temporal action detection. In: MM, ACM  (2017) 4  17. Xu, H., Das, A., Saenko, K.: R-C3D: Region convolutional 3d network for temporal  18. Yuan, Z., Stroud, J.C., Lu, T., Deng, J.: Temporal action localization by structured  activity detection. In: ICCV. (2017) 4  maximal sums. In: CVPR. (2017) 4  19. Shou, Z., Chan, J., Zareian, A., Miyazawa, K., Chang, S.F.: CDC: Convolutional- de-convolutional networks for precise temporal action localization in untrimmed videos. In: CVPR. (2017) 4  20. Dai, X., Singh, B., Zhang, G., Davis, L.S., Qiu Chen, Y.: Temporal context network  for activity localization in videos. In: ICCV. (2017) 4  21. Gao, J., Sun, C., Yang, Z., Nevatia, R.: Tall: Temporal activity localization via  22. De Geest, R., Gavves, E., Ghodrati, A., Li, Z., Snoek, C., Tuytelaars, T.: Online  language query. In: ICCV. (2017) 4  action detection. In: ECCV. (2016) 4   16  Jiyang Gao  , Kan Chen  , Ram Nevatia  ⋆  ⋆  23. Gao, J., Yang, Z., Nevatia, R.: Red: Reinforced encoder-decoder networks for  action anticipation. In: BMVC. (2017) 4  24. Shou, Z., Pan, J., Chan, J., Miyazawa, K., Mansour, H., Vetro, A., Giro-i Nieto, X., Chang, S.F.: Online action detection in untrimmed, streaming videos-modeling and evaluation. CoRR (2018) 4  25. Simonyan, K., Zisserman, A.: Two-stream convolutional networks for action recog-  nition in videos. In: NIPS. (2014) 5  26. Xiong, Y., Wang, L., Wang, Z., Zhang, B., Song, H., Li, W., Lin, D., Qiao, Y., Van Gool, L., Tang, X.: CUHK & ETHZ & SIAT submission to activitynet chal- lenge 2016. CoRR (2016) 5, 8  27. Jiang, Y.G., Liu, J., Roshan Zamir, A., Toderici, G., Laptev, I., Shah, M., Suk- thankar, R.: THUMOS challenge: Action recognition with a large number of classes. In: CVPR Workshop. (2015) 8  28. Caba Heilbron, F., Escorcia, V., Ghanem, B., Carlos Niebles, J.: Activitynet: A large-scale video benchmark for human activity understanding. In: CVPR. (2015) 8  29. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. (2016) 8  30. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. In: ICML. (2015) 9  31. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In: ICLR. (2015)32. Yao, T., Li, Y., Qiu, Z., Long, F., Pan, Y., Li, D., Mei, T.: MSR asia msm at activitynet challenge 2017: Trimmed action recognition, temporal action proposals and dense-captioning events in videos. In: CVPR Workshop. (2017) 12, 14  33. Lin, T., Zhao, X., Shou, Z.: Temporal convolution based action proposal: Submis-  sion to activitynet 2017. ICCV Workshop (2017) 12, 14  34. Xiong, Y., Zhao, Y., Wang, L., Lin, D., Tang, X.: A pursuit of temporal accuracy  in general activity detection. CoRR (2017) 14"}