{"1": "1. Agarwala, A., Dontcheva, M., Agrawala, M., Drucker, S., Colburn, A., Curless, B., Salesin, D., Cohen, M.: Interactive digital photomontage. In: ACM Transactions on Graphics. vol. 23, pp. 294-302. ACM (2004)  2. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein generative adversarial networks. In: Proceedings of the 34th International Conference on Machine Learning. vol. 70, pp. 214-223 (2017)  3. Bae, S., Durand, F.: Defocus magnification. In: Computer Graphics Forum. vol. 26,  pp. 571-579 (2007)  4. Bailey, S.W., Echevarria, J.I., Bodenheimer, B., Gutierrez, D.: Fast depth from  defocus from focal stacks. The Visual Computer 31(12), 1697-1708 (2015)  5. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: 2009 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 248-255 (2009)  6. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial nets. In: Advances in neural information processing systems (NIPS). pp. 2672-2680 (2014)  7. Gulrajani, I., Ahmed, F., Arjovsky, M., Dumoulin, V., Courville, A.C.: Improved training of wasserstein gans. In: Advances in Neural Information Processing Sys- tems (NIPS). pp. 5767-5777 (2017)  8. Hach, T., Steurer, J., Amruth, A., Pappenheim, A.: Cinematic bokeh rendering for real scenes. In: Proceedings of the 12th European Conference on Visual Media Production. pp. 1:1-1:10. CVMP ’15 (2015)  9. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: 2016 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 770-778 (2016)  10. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con- ditional adversarial networks. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 5967-5976 (2017)  11. Jacobs, D.E., Baek, J., Levoy, M.: Focal stack compositing for depth of field control.  Stanford Computer Graphics Laboratory Technical Report 1 (2012)  12. Johnson, J., Alahi, A., Fei-Fei, L., Li, C., Li, Y.W., fei Li, F.: Perceptual losses for real-time style transfer and super-resolution. In: European Conference on Com- puter Vision (ECCV) (2016)  13. Kalantari, N.K., Wang, T.C., Ramamoorthi, R.: Learning-based view synthesis for light field cameras. ACM Transactions on Graphics 35(6), 193:1-193:10 (Nov 2016) 14. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. CoRR  abs/1412.6980 (2014)  15. Kupyn, O., Budzan, V., Mykhailych, M., Mishkin, D., Matas, J.: Deblurgan: Blind motion deblurring using conditional adversarial networks. In: 2018 IEEE Confer- ence on Computer Vision and Pattern Recognition (CVPR). pp. 8183-8192 (2018) 16. Li, C., Wand, M.: Precomputed real-time texture synthesis with markovian gener- ative adversarial networks. In: European Conference on Computer Vision (ECCV). pp. 702-716 (2016)  17. Li, N., Ye, J., Ji, Y., Ling, H., Yu, J.: Saliency detection on light field. In: IEEE  Conference on Computer Vision and Pattern Recognition (June 2014)  18. Magic lantern. http://magiclantern.fm/ 19. M¨oller, M., Benning, M., Sch¨onlieb, C.B., Cremers, D.: Variational depth from focus reconstruction. IEEE Transactions on Image Processing 24, 5369-5378 (2015)   RefocusGAN: Single Image Scene RefocusingReferences  1. Agarwala, A., Dontcheva, M., Agrawala, M., Drucker, S., Colburn, A., Curless, B., Salesin, D., Cohen, M.: Interactive digital photomontage. In: ACM Transactions on Graphics. vol. 23, pp. 294-302. ACM (2004)  2. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein generative adversarial networks. In: Proceedings of the 34th International Conference on Machine Learning. vol. 70, pp. 214-223 (2017)  3. Bae, S., Durand, F.: Defocus magnification. In: Computer Graphics Forum. vol. 26,  pp. 571-579 (2007)  4. Bailey, S.W., Echevarria, J.I., Bodenheimer, B., Gutierrez, D.: Fast depth from  defocus from focal stacks. The Visual Computer 31(12), 1697-1708 (2015)  5. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: 2009 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 248-255 (2009)  6. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial nets. In: Advances in neural information processing systems (NIPS). pp. 2672-2680 (2014)  7. Gulrajani, I., Ahmed, F., Arjovsky, M., Dumoulin, V., Courville, A.C.: Improved training of wasserstein gans. In: Advances in Neural Information Processing Sys- tems (NIPS). pp. 5767-5777 (2017)  8. Hach, T., Steurer, J., Amruth, A., Pappenheim, A.: Cinematic bokeh rendering for real scenes. In: Proceedings of the 12th European Conference on Visual Media Production. pp. 1:1-1:10. CVMP ’15 (2015)  9. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: 2016 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 770-778 (2016)  10. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con- ditional adversarial networks. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 5967-5976 (2017)  11. Jacobs, D.E., Baek, J., Levoy, M.: Focal stack compositing for depth of field control.  Stanford Computer Graphics Laboratory Technical Report 1 (2012)  12. Johnson, J., Alahi, A., Fei-Fei, L., Li, C., Li, Y.W., fei Li, F.: Perceptual losses for real-time style transfer and super-resolution. In: European Conference on Com- puter Vision (ECCV) (2016)  13. Kalantari, N.K., Wang, T.C., Ramamoorthi, R.: Learning-based view synthesis for light field cameras. ACM Transactions on Graphics 35(6), 193:1-193:10 (Nov 2016) 14. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. CoRR  abs/1412.6980 (2014)  15. Kupyn, O., Budzan, V., Mykhailych, M., Mishkin, D., Matas, J.: Deblurgan: Blind motion deblurring using conditional adversarial networks. In: 2018 IEEE Confer- ence on Computer Vision and Pattern Recognition (CVPR). pp. 8183-8192 (2018) 16. Li, C., Wand, M.: Precomputed real-time texture synthesis with markovian gener- ative adversarial networks. In: European Conference on Computer Vision (ECCV). pp. 702-716 (2016)  17. Li, N., Ye, J., Ji, Y., Ling, H., Yu, J.: Saliency detection on light field. In: IEEE  Conference on Computer Vision and Pattern Recognition (June 2014)  18. Magic lantern. http://magiclantern.fm/ 19. M¨oller, M., Benning, M., Sch¨onlieb, C.B., Cremers, D.: Variational depth from focus reconstruction. IEEE Transactions on Image Processing 24, 5369-5378 (2015)   16  P. Sakurikar, I. Mehta, V. N. Balasubramanian, P. J. Narayanan  20. Nagahara, H., Kuthirummal, S., Zhou, C., Nayar, S.K.: Flexible depth of field photography. In: European Conference on Computer Vision (ECCV) (2008) 21. Nah, S., Kim, T.H., Lee, K.M.: Deep multi-scale convolutional neural network for dynamic scene deblurring. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 257-265 (2017)  22. Nair, V., Hinton, G.E.: Rectified linear units improve restricted boltzmann ma- chines. In: Proceedings of the 27th International Conference on Machine Learning. pp. 807-814. ICML (2010)  23. Nayar, S.K., Nakagawa, Y.: Shape from focus. Trans. on Pattern Analysis and  Machine Intelligence (PAMI) 16(8), 824-831 (1994)  24. Ng, R., Levoy, M., Br´edif, M., Duval, G., Horowitz, M., Hanrahan, P., et al.: Light field photography with a hand-held plenoptic camera. Computer Science Technical Report CSTR 2(11), 1-11 (2005)  25. Nimisha, T.M., Singh, A.K., Rajagopalan, A.N.: Blur-invariant deep learning for blind-deblurring. In: IEEE International Conference on Computer Vision (ICCV). pp. 4762-4770 (2017)  26. Sakurikar, P., Narayanan, P.J.: Composite focus measure for high quality depth maps. In: IEEE International Conference on Computer Vision (ICCV). pp. 1623- 1631 (2017)  27. Schuler, C.J., Hirsch, M., Harmeling, S., Schlkopf, B.: Learning to deblur. Trans. on Pattern Analysis and Machine Intelligence (PAMI) 38(7), 1439-1451 (2016) 28. Srinivasan, P.P., Garg, R., Wadhwa, N., Ng, R., Barron, J.T.: Aperture supervision for monocular depth estimation. In: 2018 IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2018)  29. Srinivasan, P.P., Wang, T., Sreelal, A., Ramamoorthi, R., Ng, R.: Learning to synthesize a 4d RGBD light field from a single image. In: IEEE International Conference on Computer Vision, (ICCV). pp. 2262-2270 (2017)  30. Srivastava, N., Hinton, G., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.: Dropout: A simple way to prevent neural networks from overfitting. Journal of Machine Learning Research 15(1), 1929-1958 (2014) 31. Stanford light-field archive. http://lightfield.stanford.edu/ 32. Su, S., Delbracio, M., Wang, J., Sapiro, G., Heidrich, W., Wang, O.: Deep video deblurring for hand-held cameras. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 237-246 (2017)  33. Suwajanakorn, S., Hernandez, C., Seitz, S.M.: Depth from focus with your mobile phone. In: IEEE Conference on Computer Vision and Pattern Recognition (2015) 34. Ulyanov, D., Vedaldi, A., Lempitsky, V.S.: Instance normalization: The missing  ingredient for fast stylization. CoRR abs/1607.08022 (2016)  35. Wang, T.C., Zhu, J.Y., Kalantari, N.K., Efros, A.A., Ramamoorthi, R.: Light field video capture using a learning-based hybrid imaging system. ACM Transactions on Graphics (Proceedings of SIGGRAPH 2017) 36(4) (2017)  36. Xu, B., Wang, N., Chen, T., Li, M.: Empirical evaluation of rectified activations  in convolutional network. CoRR abs/1505.00853 (2015)  37. Xu, L., Ren, J.S.J., Liu, C., Jia, J.: Deep convolutional neural network for image deconvolution. In: Proceedings of the 27th International Conference on Neural Information Processing Systems - Volume 1. pp. 1790-1798. NIPS’14 (2014) 38. Zhang, W., Cham, W.K.: Single-image refocusing and defocusing. IEEE Transac-  tions on Image Processing 21(2), 873-882 (2012)  39. Zhou, C., Miau, D., Nayar, S.K.: Focal sweep camera for space-time refocusing. Technical Report, Department of Computer Science, Columbia University CUCS- 021-12 (2012)"}