{"1": "1. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Semantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. In: International Conference on Learning Representations (2016)  2. Chen, L.C., Yang, Y., Wang, J., Xu, W., Yuille, A.L.: Attention to scale: Scale- aware semantic image segmentation. In: Computer Vision and Pattern Recognition (2016)  3. Chen, Y., Li, J., Xiao, H., Jin, X., Yan, S., Feng, J.: Dual path networks. In:  Advances in Neural Information Processing Systems (2017)  4. Deng, J., Dong, W., Socher, R., Li, L., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: Computer Vision and Pattern Recognition (2009) 5. Donahue, J., Jia, Y., Vinyals, O., Hoﬀman, J., Zhang, N., Tzeng, E., Darrell, T.: Decaf: A deep convolutional activation feature for generic visual recognition. In: International Conference on Machine Learning (2014)  6. Gastaldi, X.: Shake-shake regularization. arXiv preprint arXiv:1705.07485 (2017) 7. Girshick, R.: Fast r-cnn. In: Computer Vision and Pattern Recognition (2015) 8. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accu- rate object detection and semantic segmentation. In: Computer Vision and Pattern Recognition (2014)  9. Han, D., Kim, J., Kim, J.: Deep pyramidal residual networks. In: Computer Vision  and Pattern Recognition (2017)  10. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolu- tional networks for visual recognition. In: European Conference on Computer Vi- sion (2014)  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: Computer Vision and Pattern Recognition (2016)  12. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks.  In: European Conference on Computer Vision (2016)  13. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks. arXiv preprint  arXiv:1709.01507 (2017)  14. Huang, G., Li, Y., Pleiss, G., Liu, Z., Hopcroft, J.E., Weinberger, K.Q.: Snap- shot ensembles: Train 1, get m for free. In: International Conference on Learning Representations (2017)  15. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected convolutional networks. In: Computer Vision and Pattern Recognition (2017) 16. Huang, G., Sun, Y., Liu, Z., Sedra, D., Weinberger, K.Q.: Deep networks with  stochastic depth. In: European Conference on Computer Vision (2016)  17. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International Conference on Machine Learning (2015)  18. Krizhevsky, A., Hinton, G.: Learning multiple layers of features from tiny images  (2009)  19. Krizhevsky, A., Sutskever, I., Hinton, G.: Imagenet classification with deep convo- lutional neural networks. In: Advances in Neural Information Processing Systems (2012)  20. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. Proceedings of the IEEE 86(11), 2278-2324 (1998)   Multi-Scale Spatially-Asymmetric Recalibration for Image ClassificationReferences  1. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Semantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. In: International Conference on Learning Representations (2016)  2. Chen, L.C., Yang, Y., Wang, J., Xu, W., Yuille, A.L.: Attention to scale: Scale- aware semantic image segmentation. In: Computer Vision and Pattern Recognition (2016)  3. Chen, Y., Li, J., Xiao, H., Jin, X., Yan, S., Feng, J.: Dual path networks. In:  Advances in Neural Information Processing Systems (2017)  4. Deng, J., Dong, W., Socher, R., Li, L., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: Computer Vision and Pattern Recognition (2009) 5. Donahue, J., Jia, Y., Vinyals, O., Hoﬀman, J., Zhang, N., Tzeng, E., Darrell, T.: Decaf: A deep convolutional activation feature for generic visual recognition. In: International Conference on Machine Learning (2014)  6. Gastaldi, X.: Shake-shake regularization. arXiv preprint arXiv:1705.07485 (2017) 7. Girshick, R.: Fast r-cnn. In: Computer Vision and Pattern Recognition (2015) 8. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accu- rate object detection and semantic segmentation. In: Computer Vision and Pattern Recognition (2014)  9. Han, D., Kim, J., Kim, J.: Deep pyramidal residual networks. In: Computer Vision  and Pattern Recognition (2017)  10. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolu- tional networks for visual recognition. In: European Conference on Computer Vi- sion (2014)  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: Computer Vision and Pattern Recognition (2016)  12. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks.  In: European Conference on Computer Vision (2016)  13. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks. arXiv preprint  arXiv:1709.01507 (2017)  14. Huang, G., Li, Y., Pleiss, G., Liu, Z., Hopcroft, J.E., Weinberger, K.Q.: Snap- shot ensembles: Train 1, get m for free. In: International Conference on Learning Representations (2017)  15. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected convolutional networks. In: Computer Vision and Pattern Recognition (2017) 16. Huang, G., Sun, Y., Liu, Z., Sedra, D., Weinberger, K.Q.: Deep networks with  stochastic depth. In: European Conference on Computer Vision (2016)  17. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International Conference on Machine Learning (2015)  18. Krizhevsky, A., Hinton, G.: Learning multiple layers of features from tiny images  (2009)  19. Krizhevsky, A., Sutskever, I., Hinton, G.: Imagenet classification with deep convo- lutional neural networks. In: Advances in Neural Information Processing Systems (2012)  20. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. Proceedings of the IEEE 86(11), 2278-2324 (1998)   16  Wang et al.  21. Lee, C., Xie, S., Gallagher, P., Zhang, Z., Tu, Z.: Deeply-supervised nets. In: Ar-  tificial Intelligence and Statistics (2015)  22. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Dollar, P., Zitnick, C.: Microsoft coco: Common objects in context. In: European conference on computer vision (2014)  23. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  segmentation. In: Computer Vision and Pattern Recognition (2015)  24. Nair, V., Hinton, G.E.: Rectified linear units improve restricted boltzmann ma-  chines. In: International Conference on Machine Learning (2010)  25. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti-  mation. In: European Conference on Computer Vision (2016)  26. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmen-  tation. In: International Conference on Computer Vision (2015)  27. Razavian, A.S., Azizpour, H., Sullivan, J., Carlsson, S.: Cnn features oﬀ-the-shelf: an astounding baseline for recognition. In: Computer Vision and Pattern Recogni- tion (2014)  28. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object detec- tion with region proposal networks. In: Advances in Neural Information Processing Systems (2015)  29. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recog- nition challenge. International Journal of Computer Vision 115(3), 211-252 (2015) 30. Simonyan, K., Vedaldi, A., Zisserman, A.: Deep inside convolutional net- works: Visualising image classification models and saliency maps. arXiv preprint arXiv:1312.6034 (2013)  31. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale im- age recognition. In: International Conference on Learning Representations (2015) 32. Srivastava, N., Hinton, G.E., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.: Dropout: A simple way to prevent neural networks from overfitting. Journal of Machine Learning Research 15(1), 1929-1958 (2014)  33. Srivastava, R.K., Greﬀ, K., Schmidhuber, J.: Highway networks. arXiv preprint  arXiv:1505.00387 (2015)  34. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Van- houcke, V., Rabinovich, A., et al.: Going deeper with convolutions. In: Computer Vision and Pattern Recognition (2015)  35. Toshev, A., Szegedy, C.: Deeppose: Human pose estimation via deep neural net-  works. In: Computer Vision and Pattern Recognition (2014)  36. Wang, Y., Xie, L., Liu, C., Qiao, S., Zhang, Y., Zhang, W., Tian, Q., Yuille, A.: Sort: Second-order response transform for visual recognition. In: International Conference on Computer Vision (2017)  37. Xie, L., Tian, Q., Flynn, J., Wang, J., Yuille, A.: Geometric neural phrase pool- ing: Modeling the spatial co-occurrence of neurons. In: European Conference on Computer Vision (2016)  38. Xie, L., Yuille, A.: Genetic cnn. In: International Conference on Computer Vision  (2017)  39. Xie, L., Zheng, L., Wang, J., Yuille, A., Tian, Q.: Interactive: Inter-layer activeness  propagation. In: Computer Vision and Pattern Recognition (2016)  40. Xie, S., Girshick, R., Dollar, P., Tu, Z., He, K.: Aggregated residual transformations for deep neural networks. In: Computer Vision and Pattern Recognition (2017) 41. Xie, S., Tu, Z.: Holistically-nested edge detection. In: International Conference on  Computer Vision (2015)   Multi-Scale Spatially-Asymmetric Recalibration for Image Classification42. Zagoruyko, S., Komodakis, N.: Wide  residual networks. arXiv preprint  arXiv:1605.07146 (2016)  43. Zeiler, M.D., Fergus, R.: Visualizing and understanding convolutional networks.  In: European Conference on Computer Vision (2014)  44. Zhang, H., Cisse, M., Dauphin, Y.N., Lopez-Paz, D.: mixup: Beyond empirical risk  minimization. arXiv preprint arXiv:1710.09412 (2017)  45. Zhang, N., Donahue, J., Girshick, R., Darrell, T.: Part-based r-cnns for fine-grained  category detection. In: European Conference on Computer Vision (2014)  46. Zhang, T., Qi, G.J., Xiao, B., Wang, J.: Interleaved group convolutions. In: Com-  puter Vision and Pattern Recognition (2017)  47. Zoph, B., Le, Q.V.: Neural architecture search with reinforcement learning. In:  International Conference on Learning Representations (2017)"}