{"1": "In: CVPR. (2016)  1. Yang, S., Luo, P., Loy, C.C., Tang, X.: Wider face: A face detection benchmark.  2. Ledig, C., Theis, L., Husz´ar, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A., Tejani, A., Totz, J., Wang, Z., et al.: Photo-realistic single image super- resolution using a generative adversarial network. In: CVPR. (2017)  3. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation  using cycle-consistent adversarial networks. In: ICCV. (2017)  4. Timofte, R., Agustsson, E., Van Gool, L., Yang, M.H., Zhang, L., Lim, B., Son, S., Kim, H., Nah, S., Lee, K.M., et al.: Ntire 2017 challenge on single image super-resolution: Methods and results. In: CVPR-W. (2017)  5. Shocher, A., Cohen, N., Irani, M.: ” zero-shot” super-resolution using deep internal  learning. arXiv (2017)  6. Dong, C., Loy, C.C., He, K., Tang, X.: Image super-resolution using deep convo-  lutional networks. IEEE TPAMI (2016)  7. Kim, J., Kwon Lee, J., Mu Lee, K.: Accurate image super-resolution using very  deep convolutional networks. In: CVPR. (2016)  8. Johnson, J., Alahi, A., Fei-Fei, L.: Perceptual losses for real-time style transfer  and super-resolution. In: ECCV. (2016)  9. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv (2014)  10. Lai, W.S., Huang, J.B., Ahuja, N., Yang, M.H.: Deep laplacian pyramid networks  for fast and accurate super-resolution. In: CVPR. (2017)  Image super-resolution via deep recursive residual  11. Tai, Y., Yang, J., Liu, X.: network. In: CVPR. (2017)  nections. In: ICCV. (2017)  12. Tong, T., Li, G., Liu, X., Gao, Q.: Image super-resolution using dense skip con-  13. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS. (2014) 2672-2680 14. Lim, B., Son, S., Kim, H., Nah, S., Lee, K.M.: Enhanced deep residual networks  for single image super-resolution. In: CVPR-W. (2017)  15. Sajjadi, M.S., Scholkopf, B., Hirsch, M.: Enhancenet: Single image super-resolution  through automated texture synthesis. In: ICCV. (2017)  16. Dahl, R., Norouzi, M., Shlens, J.: Pixel recursive super resolution.  In: ICCV.  (2017)  arXiv (2016)  17. Oord, A.v.d., Kalchbrenner, N., Kavukcuoglu, K.: Pixel recurrent neural networks.  18. Yu, X., Porikli, F.: Hallucinating very low-resolution unaligned and noisy face  images by transformative discriminative autoencoders. In: CVPR. (2017)  19. Cao, Q., Lin, L., Shi, Y., Liang, X., Li, G.: Attention-aware face hallucination via  deep reinforcement learning. In: CVPR. (2017)  20. Huang, H., He, R., Sun, Z., Tan, T.: Wavelet-srnet: A wavelet-based cnn for multi-  scale face super resolution. In: ICCV. (2017)  21. Zhu, S., Liu, S., Loy, C.C., Tang, X.: Deep cascaded bi-network for face hallucina-  22. Yu, X., Porikli, F.: Ultra-resolving face images by discriminative generative net-  tion. In: ECCV. (2016)  works. In: ECCV. (2016)  23. Yang, C.Y., Liu, S., Yang, M.H.: Structured face hallucination. In: CVPR. (2013)   Learning image super-resolution via learning image degradationReferences  In: CVPR. (2016)  1. Yang, S., Luo, P., Loy, C.C., Tang, X.: Wider face: A face detection benchmark.  2. Ledig, C., Theis, L., Husz´ar, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A., Tejani, A., Totz, J., Wang, Z., et al.: Photo-realistic single image super- resolution using a generative adversarial network. In: CVPR. (2017)  3. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation  using cycle-consistent adversarial networks. In: ICCV. (2017)  4. Timofte, R., Agustsson, E., Van Gool, L., Yang, M.H., Zhang, L., Lim, B., Son, S., Kim, H., Nah, S., Lee, K.M., et al.: Ntire 2017 challenge on single image super-resolution: Methods and results. In: CVPR-W. (2017)  5. Shocher, A., Cohen, N., Irani, M.: ” zero-shot” super-resolution using deep internal  learning. arXiv (2017)  6. Dong, C., Loy, C.C., He, K., Tang, X.: Image super-resolution using deep convo-  lutional networks. IEEE TPAMI (2016)  7. Kim, J., Kwon Lee, J., Mu Lee, K.: Accurate image super-resolution using very  deep convolutional networks. In: CVPR. (2016)  8. Johnson, J., Alahi, A., Fei-Fei, L.: Perceptual losses for real-time style transfer  and super-resolution. In: ECCV. (2016)  9. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv (2014)  10. Lai, W.S., Huang, J.B., Ahuja, N., Yang, M.H.: Deep laplacian pyramid networks  for fast and accurate super-resolution. In: CVPR. (2017)  Image super-resolution via deep recursive residual  11. Tai, Y., Yang, J., Liu, X.: network. In: CVPR. (2017)  nections. In: ICCV. (2017)  12. Tong, T., Li, G., Liu, X., Gao, Q.: Image super-resolution using dense skip con-  13. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS. (2014) 2672-2680 14. Lim, B., Son, S., Kim, H., Nah, S., Lee, K.M.: Enhanced deep residual networks  for single image super-resolution. In: CVPR-W. (2017)  15. Sajjadi, M.S., Scholkopf, B., Hirsch, M.: Enhancenet: Single image super-resolution  through automated texture synthesis. In: ICCV. (2017)  16. Dahl, R., Norouzi, M., Shlens, J.: Pixel recursive super resolution.  In: ICCV.  (2017)  arXiv (2016)  17. Oord, A.v.d., Kalchbrenner, N., Kavukcuoglu, K.: Pixel recurrent neural networks.  18. Yu, X., Porikli, F.: Hallucinating very low-resolution unaligned and noisy face  images by transformative discriminative autoencoders. In: CVPR. (2017)  19. Cao, Q., Lin, L., Shi, Y., Liang, X., Li, G.: Attention-aware face hallucination via  deep reinforcement learning. In: CVPR. (2017)  20. Huang, H., He, R., Sun, Z., Tan, T.: Wavelet-srnet: A wavelet-based cnn for multi-  scale face super resolution. In: ICCV. (2017)  21. Zhu, S., Liu, S., Loy, C.C., Tang, X.: Deep cascaded bi-network for face hallucina-  22. Yu, X., Porikli, F.: Ultra-resolving face images by discriminative generative net-  tion. In: ECCV. (2016)  works. In: ECCV. (2016)  23. Yang, C.Y., Liu, S., Yang, M.H.: Structured face hallucination. In: CVPR. (2013)   16  Adrian Bulat*, Jing Yang*, Georgios Tzimiropoulos  24. Liu, Z., Luo, P., Wang, X., Tang, X.: Deep learning face attributes in the wild. In:  25. Le, V., Brandt, J., Lin, Z., Bourdev, L., Huang, T.S.: Interactive facial feature  ICCV. (2015)  localization. In: ECCV. (2012)  26. Huang, G.B., Ramesh, M., Berg, T., Learned-Miller, E.: Labeled faces in the wild: A database for studying face recognition in unconstrained environments. Technical Report 07-49, University of Massachusetts, Amherst (October 2007)  27. Jesorsky, O., Kirchberg, K.J., Frischholz, R.W.: Robust face detection using the hausdorﬀ distance. In: International Conference on Audio-and Video-Based Bio- metric Person Authentication, Springer (2001) 90-95  28. Bulat, A., Tzimiropoulos, G.: Super-fan: Integrated facial landmark localization and super-resolution of real-world low resolution faces in arbitrary poses with gans. arXiv (2017)  29. K¨ostinger, M., Wohlhart, P., Roth, P.M., Bischof, H.: Annotated facial landmarks in the wild: A large-scale, real-world database for facial landmark localization. In: ICCV-W. (2011)  30. Bulat, A., Tzimiropoulos, G.: How far are we from solving the 2d & 3d face alignment problem?(and a dataset of 230,000 3d facial landmarks). ICCV (2017) 31. Cao, Q., Shen, L., Xie, W., Parkhi, O.M., Zisserman, A.: Vggface2: A dataset for  recognising faces across pose and age. In: FG. (2018)  32. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  33. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks.  In: CVPR. (2016)  In: ECCV. (2016)  34. Mirza, M., Osindero, S.: Conditional generative adversarial nets. arXiv (2014) 35. Gulrajani, I., Ahmed, F., Arjovsky, M., Dumoulin, V., Courville, A.: Improved  training of wasserstein gans. arXiv (2017)  36. Miyato, T., Kataoka, T., Koyama, M., Yoshida, Y.: Spectral normalization for  generative adversarial networks. arXiv (2018)  37. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein gan. arXiv (2017) 38. Zhang, S., Zhu, X., Lei, Z., Shi, H., Wang, X., Li, S.Z.: Sˆ 3fd: Single shot scale-  invariant face detector. In: ICCV. (2017)  39. Paszke, A., Gross, S., Chintal, S.: Pytorch. http://github.com/pytorch/pytorch 40. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv (2014) 41. Heusel, M., Ramsauer, H., Unterthiner, T., Nessler, B., Hochreiter, S.: Gans trained by a two time-scale update rule converge to a local nash equilibrium. In: NIPS. (2017)  42. Chen, Y., Tai, Y., Liu, X., Shen, C., Yang, J.: Fsrnet: End-to-end learning face  super-resolution with facial priors. In: CVPR. (2018)  43. Nah, S., Kim, T.H., Lee, K.M.: Deep multi-scale convolutional neural network for  dynamic scene deblurring. In: CVPR. (2017)"}