{"1": "1. Ahonen, T., Hadid, A., Pietikäinen, M.: Face recognition with local binary patterns.  In: European Conference on Computer Vision (ECCV). pp. 469-481 (2004)  4 [26] reported best result using multi-scale training for 1.5× longer iterations, we only compare the results without scale jitter during training. In addition, we only compare the results in [18] using ResNet-101 backbone for fair comparison.   14  H. Xu, X. Lv, X. Wang, Z. Ren, N. Bodla and R. Chellappa  over [37, 8, 28] (+3.7% and +8.5%). Moreover, it can be seen that the proposed method outperforms D-F-RCNN/D-R-FCN [9] by a wide margin(∼4%). This observation further supports that our deep regionlet learning module could be treated as a generalization of Deformable RoI Pooling in [9, 32]. It is also noted that although most recent state-of-the-art object detectors such as Mask R- CNN [18] utilize multi-task training with segmentation labels, we still outperform Mask R-CNN [18] by 1.1%. In addition, the focal loss in [26], which overcomes the obstacle caused by the imbalance of positive/nagetive samples, is complimentary to our method. We believe it can be integrated into our method to further boost performance. In summary, compared with Mask R-CNN [18] and RetinaNet4 [26], our method achieves competitive performance over state-of-the-art on MS COCO when using ResNet-101 as a backbone network.  5 Conclusion  In this paper, we present a novel deep regionlet-based approach for object detection. The proposed RSN can select non-rectangular regions within the detection bounding box, and hence an object with rigid shape and deformable parts can be better modeled. We also design the deep regionlet learning module so that both the selected regions and the regionlets can be learned simultaneously. Moreover, the proposed system can be trained in a fully end-to-end manner without additional eﬀorts. Finally, we extensively evaluate our approach on two detection benchmarks and experimental results show competitive performance over state-of-the-art.  6 Acknowledgement  This research is based upon work supported by the Intelligence Advanced Research Projects Activity (IARPA) via Department of Interior/Interior Business Center (DOI/IBC) contract number D17PC00345. The U.S. Government is authorized to reproduce and distribute reprints for Governmental purposes not withstanding any copyright annotation theron. Disclaimer: The views and conclusions contained herein are those of the authors and should not be interpreted as necessarily representing the oﬃcial policies or endorsements, either expressed or implied of IARPA, DOI/IBC or the U.S. Government.  We thank the reviewers for their valuable comments and suggestions.  References  1. Ahonen, T., Hadid, A., Pietikäinen, M.: Face recognition with local binary patterns.  In: European Conference on Computer Vision (ECCV). pp. 469-481 (2004)  4 [26] reported best result using multi-scale training for 1.5× longer iterations, we only compare the results without scale jitter during training. In addition, we only compare the results in [18] using ResNet-101 backbone for fair comparison.   Deep Regionlets for Object Detection2. Bansal, A., Sikka, K., Sharma, G., Chellappa, R., Divakaran, A.: Zero-shot object  detection. CoRR abs/1804.04340 (2018)  3. Bell, S., Zitnick, C.L., Bala, K., Girshick, R.B.: Inside-Outside Net: Detecting objects in context with skip pooling and recurrent neural networks. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2874-2883 (2016)  4. Bodla, N., Singh, B., Chellappa, R., Davis, L.S.: Soft-NMS - improving object detection with one line of code. In: IEEE International Conference on Computer Vision (ICCV). pp. 5562-5570 (2017)  5. Bodla, N., Zheng, J., Xu, H., Chen, J., Castillo, C.D., Chellappa, R.: Deep het- erogeneous feature fusion for template-based face recognition. In: IEEE Winter Conference on Applications of Computer Vision (WACV). pp. 586-595 (2017) 6. Cai, Z., Vasconcelos, N.: Cascade r-cnn: Delving into high quality object detection. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2018)  7. Cheng, B., Wei, Y., Shi, H., Feris, R.S., Xiong, J., Huang, T.S.: Revisiting RCNN: on awakening the classification power of faster RCNN. CoRR abs/1803.06799 (2018)  8. Dai, J., Li, Y., He, K., Sun, J.: R-FCN: object detection via region-based fully convolutional networks. In: Advances in Neural Information Processing Systems (NIPS). pp. 379-387 (2016)  9. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convolu- tional networks. In: IEEE International Conference on Computer Vision (ICCV). pp. 764-773 (2017)  10. Dalal, N., Triggs, B.: Histograms of oriented gradients for human detection. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 886-893 (2005)  11. Everingham, M., Gool, L.J.V., Williams, C.K.I., Winn, J.M., Zisserman, A.: The pascal visual object classes (VOC) challenge. International Journal of Computer Vision 88(2), 303-338 (2010)  12. Felzenszwalb, P.F., Girshick, R.B., McAllester, D.A.: Cascade object detection with deformable part models. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2241-2248 (2010)  13. Felzenszwalb, P.F., Girshick, R.B., McAllester, D.A., Ramanan, D.: Object detection with discriminatively trained part-based models. IEEE Transactions on Pattern Analysis and Machine Intelligence 32(9), 1627-1645 (2010)  14. Fu, C., Liu, W., Ranga, A., Tyagi, A., Berg, A.C.: DSSD : Deconvolutional single  shot detector. CoRR abs/1701.06659 (2017)  15. Gidaris, S., Komodakis, N.: LocNet: Improving localization accuracy for object detection. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 789-798 (2016)  16. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accurate object detection and semantic segmentation. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2014)  17. Girshick, R.B.: Fast R-CNN. In: IEEE International Conference on Computer  Vision (ICCV). pp. 1440-1448 (2015)  18. He, K., Gkioxari, G., Dollár, P., Girshick, R.B.: Mask R-CNN. In: IEEE International  Conference on Computer Vision (ICCV). pp. 2980-2988 (2017)  19. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional networks for visual recognition. In: European Conference on Computer Vision (ECCV). pp. 346-361 (2014)   16  H. Xu, X. Lv, X. Wang, Z. Ren, N. Bodla and R. Chellappa  20. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 770-778 (2016)  21. Hu, H., Gu, J., Zhang, Z., Dai, J., Wei, Y.: Relation networks for object detection. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2018)  22. Huang, J., Rathod, V., Sun, C., Zhu, M., Korattikara, A., Fathi, A., Fischer, I., Wojna, Z., Song, Y., Guadarrama, S., Murphy, K.: Speed/accuracy trade-oﬀs for modern convolutional object detectors. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3296-3297 (2017)  23. Jaderberg, M., Simonyan, K., Zisserman, A., Kavukcuoglu, K.: Spatial transformer networks. In: Advances in Neural Information Processing Systems (NIPS). pp. 2017-2025 (2015)  24. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep convolutional neural networks. In: Advances in Neural Information Processing Systems (NIPS), pp. 1097-1105 (2012)  25. Lin, T., Dollár, P., Girshick, R.B., He, K., Hariharan, B., Belongie, S.J.: Feature pyramid networks for object detection. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 936-944 (2017)  26. Lin, T., Goyal, P., Girshick, R.B., He, K., Dollár, P.: Focal loss for dense object detection. In: IEEE International Conference on Computer Vision (ICCV). pp. 2999-3007 (2017)  27. Lin, T., Maire, M., Belongie, S.J., Hays, J., Perona, P., Ramanan, D., Dollár, P., Zitnick, C.L.: Microsoft COCO: common objects in context. In: European Conference on Computer Vision (ECCV). pp. 740-755 (2014)  28. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S.E., Fu, C., Berg, A.C.: SSD: single shot multibox detector. In: European Conference on Computer Vision (ECCV). pp. 21-37 (2016)  29. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3431-3440 (2015)  30. Lowe, D.G.: Object recognition from local scale-invariant features. In: IEEE Inter-  national Conference on Computer Vision (ICCV). pp. 1150-1157 (1999)  31. Mallat, S.: A Wavelet Tour of Signal Processing, 2nd Edition. Academic Press  (1999)  32. Mordan, T., Thome, N., Cord, M., Henaﬀ, G.: Deformable part-based fully convo- lutional network for object detection. In: Proceedings of the British Machine Vision Conference (BMVC) (2017)  33. Ouyang, W., Zeng, X., Wang, X., Qiu, S., Luo, P., Tian, Y., Li, H., Yang, S., Wang, Z., Li, H., Wang, K., Yan, J., Loy, C.C., Tang, X.: DeepID-Net: Object detection with deformable part based convolutional neural networks. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(7), 1320-1334 (2017)  34. Ranjan, R., Bansal, A., Xu, H., Sankaranarayanan, S., Chen, J., Castillo, C.D., Chellappa, R.: Crystal loss and quality pooling for unconstrained face verification and recognition. CoRR abs/1804.01159 (2018)  35. Redmon, J., Divvala, S.K., Girshick, R.B., Farhadi, A.: You only look once: Unified, real-time object detection. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 779-788 (2016)  36. Redmon, J., Farhadi, A.: YOLO9000: better, faster, stronger. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 6517-6525 (2017)   Deep Regionlets for Object Detection37. Ren, S., He, K., Girshick, R.B., Sun, J.: Faster R-CNN: towards real-time object detection with region proposal networks. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(6), 1137-1149 (2017)  38. Sermanet, P., Eigen, D., Zhang, X., Mathieu, M., Fergus, R., Lecun, Y.: Overfeat: Integrated recognition, localization and detection using convolutional networks. In: International Conference on Learning Representations (ICLR) (2014)  39. Shrivastava, A., Gupta, A., Girshick, R.B.: Training region-based object detectors with online hard example mining. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 761-769 (2016)  40. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. CoRR abs/1409.1556 (2014)  41. Singh, B., Davis, L.S.: An analysis of scale invariance in object detection - SNIP. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2018)  42. Viola, P.A., Jones, M.J.: Rapid object detection using a boosted cascade of simple features. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 511-518 (2001)  43. Wang, H., Wang, Q., Gao, M., Li, P., Zuo, W.: Multi-scale location-aware kernel representation for object detection. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2018)  44. Wang, X., Yang, M., Zhu, S., Lin, Y.: Regionlets for generic object detection. IEEE Transactions on Pattern Analysis and Machine Intelligence 37(10), 2071-2084 (2015)  45. Wang, X., Yang, M., Zhu, S., Lin, Y.: Regionlets for generic object detection. In: IEEE International Conference on Computer Vision (ICCV). pp. 17-24 (2013) 46. Wu, Z., Bodla, N., Singh, B., Najibi, M., Chellappa, R., Davis, L.S.: Soft sampling  for robust object detection. CoRR abs/1806.06986 (2018)  47. Xu, H., Zheng, J., Alavi, A., Chellappa, R.: Cross-domain visual recognition via  domain adaptive dictionary learning. CoRR abs/1804.04687 (2018)  48. Zhang, S., Wen, L., Bian, X., Lei, Z., Li, S.Z.: Single-shot refinement neural network for object detection. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2018)  49. Zhang, S., Zhu, X., Lei, Z., Shi, H., Wang, X., Li, S.Z.: Sˆ3fd: Single shot scale- invariant face detector. In: IEEE International Conference on Computer Vision (ICCV). pp. 192-201 (2017)  50. Zhang, Z., Qiao, S., Xie, C., Shen, W., Wang, B., Yuille, A.L.: Single-shot object detection with enriched semantics. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2018)  51. Zhao, X., Liang, S., Wei, Y.: Pseudo mask augmented object detection. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2018) 52. Zhou, P., Ni, B., Geng, C., Hu, J., Xu, Y.: Scale-transferrable object detection. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2018)"}