{"1": "1. Al-Halah, Z., Stiefelhagen, R.: Automatic discovery, association estimation and learning of semantic attributes for a thousand categories. arXiv preprint arXiv:1704.03607 (2017)  2. Bilen, H., Pedersoli, M., Tuytelaars, T.: Weakly supervised object detection with  posterior regularization. In: Proceedings BMVC 2014. pp. 1-12 (2014)  3. Bilen, H., Pedersoli, M., Tuytelaars, T.: Weakly supervised object detection with convex clustering. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1081-1089 (2015)  4. Bilen, H., Vedaldi, A.: Weakly supervised deep detection networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2846- 2854 (2016)  5. Bousmalis, K., Silberman, N., Dohan, D., Erhan, D., Krishnan, D.: Unsupervised pixel-level domain adaptation with generative adversarial networks. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). vol. 1, p. 7 (2017)  6. Chen, X., Gupta, A.: Webly supervised learning of convolutional networks. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 1431- 1439 (2015)  7. Chen, X., Shrivastava, A., Gupta, A.: Neil: Extracting visual knowledge from web data. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 1409-1416 (2013)  8. Cinbis, R.G., Verbeek, J., Schmid, C.: Weakly supervised object localization with multi-fold multiple instance learning. IEEE transactions on pattern analysis and machine intelligence 39(1), 189-203 (2017)  9. Divvala, S.K., Farhadi, A., Guestrin, C.: Learning everything about anything: Webly-supervised visual concept learning. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3270-3277 (2014)  10. Ferrari, V., Zisserman, A.: Learning visual attributes. In: Advances in Neural In-  formation Processing Systems. pp. 433-440 (2008)  11. Fu, Z., Xiang, T., Kodirov, E., Gong, S.: Zero-shot object recognition by semantic manifold distance. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2635-2644 (2015)  12. Ganin, Y., Lempitsky, V.: Unsupervised domain adaptation by backpropagation.  In: International Conference on Machine Learning. pp. 1180-1189 (2015)  13. Girshick, R.: Fast r-cnn. In: Proceedings of the IEEE international conference on  computer vision. pp. 1440-1448 (2015)  14. Jie, Z., Wei, Y., Jin, X., Feng, J., Liu, W.: Deep self-taught learning for weakly  supervised object localization. arXiv preprint arXiv:1704.05188 (2017)  15. Kantorov, V., Oquab, M., Cho, M., Laptev, I.: Contextlocnet: Context-aware deep network models for weakly supervised localization. In: European Conference on Computer Vision. pp. 350-365. Springer (2016)  16. Kumar Singh, K., Xiao, F., Jae Lee, Y.: Track and transfer: Watching videos to simulate strong human supervision for weakly-supervised object detection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3548-3556 (2016)  17. Lampert, C.H., Nickisch, H., Harmeling, S.: Learning to detect unseen object classes by between-class attribute transfer. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on. pp. 951-958. IEEE (2009)   Zero-Annotation Object Detection with Web Knowledge TransferReferences  1. Al-Halah, Z., Stiefelhagen, R.: Automatic discovery, association estimation and learning of semantic attributes for a thousand categories. arXiv preprint arXiv:1704.03607 (2017)  2. Bilen, H., Pedersoli, M., Tuytelaars, T.: Weakly supervised object detection with  posterior regularization. In: Proceedings BMVC 2014. pp. 1-12 (2014)  3. Bilen, H., Pedersoli, M., Tuytelaars, T.: Weakly supervised object detection with convex clustering. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1081-1089 (2015)  4. Bilen, H., Vedaldi, A.: Weakly supervised deep detection networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2846- 2854 (2016)  5. Bousmalis, K., Silberman, N., Dohan, D., Erhan, D., Krishnan, D.: Unsupervised pixel-level domain adaptation with generative adversarial networks. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). vol. 1, p. 7 (2017)  6. Chen, X., Gupta, A.: Webly supervised learning of convolutional networks. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 1431- 1439 (2015)  7. Chen, X., Shrivastava, A., Gupta, A.: Neil: Extracting visual knowledge from web data. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 1409-1416 (2013)  8. Cinbis, R.G., Verbeek, J., Schmid, C.: Weakly supervised object localization with multi-fold multiple instance learning. IEEE transactions on pattern analysis and machine intelligence 39(1), 189-203 (2017)  9. Divvala, S.K., Farhadi, A., Guestrin, C.: Learning everything about anything: Webly-supervised visual concept learning. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3270-3277 (2014)  10. Ferrari, V., Zisserman, A.: Learning visual attributes. In: Advances in Neural In-  formation Processing Systems. pp. 433-440 (2008)  11. Fu, Z., Xiang, T., Kodirov, E., Gong, S.: Zero-shot object recognition by semantic manifold distance. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2635-2644 (2015)  12. Ganin, Y., Lempitsky, V.: Unsupervised domain adaptation by backpropagation.  In: International Conference on Machine Learning. pp. 1180-1189 (2015)  13. Girshick, R.: Fast r-cnn. In: Proceedings of the IEEE international conference on  computer vision. pp. 1440-1448 (2015)  14. Jie, Z., Wei, Y., Jin, X., Feng, J., Liu, W.: Deep self-taught learning for weakly  supervised object localization. arXiv preprint arXiv:1704.05188 (2017)  15. Kantorov, V., Oquab, M., Cho, M., Laptev, I.: Contextlocnet: Context-aware deep network models for weakly supervised localization. In: European Conference on Computer Vision. pp. 350-365. Springer (2016)  16. Kumar Singh, K., Xiao, F., Jae Lee, Y.: Track and transfer: Watching videos to simulate strong human supervision for weakly-supervised object detection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3548-3556 (2016)  17. Lampert, C.H., Nickisch, H., Harmeling, S.: Learning to detect unseen object classes by between-class attribute transfer. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on. pp. 951-958. IEEE (2009)   16  Q. Tao, H. Yang and J. Cai  18. Lampert, C.H., Nickisch, H., Harmeling, S.: Attribute-based classification for zero- shot visual object categorization. IEEE Transactions on Pattern Analysis and Ma- chine Intelligence 36(3), 453-465 (2014)  19. Li, L.J., Fei-Fei, L.: Optimol: automatic online picture collection via incremental model learning. International journal of computer vision 88(2), 147-168 (2010) 20. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature  pyramid networks for object detection  21. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd: Single shot multibox detector. In: European conference on computer vision. pp. 21-37. Springer (2016)  22. Long, M., Zhu, H., Wang, J., Jordan, M.I.: Deep transfer learning with joint adap-  tation networks. arXiv preprint arXiv:1605.06636 (2016)  23. Maaten, L.v.d., Hinton, G.: Visualizing data using t-sne. Journal of Machine Learn-  ing Research 9(Nov), 2579-2605 (2008)  24. Pennington, J., Socher, R., Manning, C.: Glove: Global vectors for word repre- sentation. In: Proceedings of the 2014 conference on empirical methods in natural language processing (EMNLP). pp. 1532-1543 (2014)  25. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object detec- tion with region proposal networks. In: Advances in neural information processing systems. pp. 91-99 (2015)  26. Sultani, W., Shah, M.: What if we do not have multiple videos of the same ac- tion?video action localization using web images. In: Computer Vision and Pattern Recognition (CVPR), 2016 IEEE Conference on. pp. 1077-1085. IEEE (2016) 27. Tang, P., Wang, X., Bai, X., Liu, W.: Multiple instance detection network with  online instance classifier refinement. In: CVPR (2017)  28. Tao, Q., Yang, H., Cai, J.: Exploiting web images for weakly supervised object  detection. arXiv preprint arXiv:1707.08721 (2017)  29. Tzeng, E., Hoﬀman, J., Darrell, T., Saenko, K.: Simultaneous deep transfer across domains and tasks. In: Proceedings of the IEEE International Conference on Com- puter Vision. pp. 4068-4076 (2015)  30. Tzeng, E., Hoﬀman, J., Saenko, K., Darrell, T.: Adversarial discriminative domain adaptation. In: Computer Vision and Pattern Recognition (CVPR). vol. 1, p. 4 (2017)  31. Uijlings, J.R., Van De Sande, K.E., Gevers, T., Smeulders, A.W.: Selective search for object recognition. International journal of computer vision 104(2), 154-171 (2013)  32. Wang, G., Luo, P., Lin, L., Wang, X.: Learning object interactions and descrip- tions for semantic image segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5859-5867 (2017)  33. Wei, Y., Liang, X., Chen, Y., Shen, X., Cheng, M.M., Feng, J., Zhao, Y., Yan, S.: Stc: A simple to complex framework for weakly-supervised semantic segmentation. IEEE transactions on pattern analysis and machine intelligence 39(11), 2314-2320 (2017)  34. Xia, Y., Cao, X., Wen, F., Sun, J.: Well begun is half done: Generating high-quality seeds for automatic image dataset construction from web. In: European Conference on Computer Vision. pp. 387-400. Springer (2014)  35. Xu, Z., Huang, S., Zhang, Y., Tao, D.: Augmenting strong supervision using web data for fine-grained categorization. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 2524-2532 (2015)  36. Yang, X., Zhang, H., Cai, J.: Shuﬄe-then-assemble: Learning object-agnostic visual  relationship features. In: ECCV (2018)"}