{"1": "1. Simo-Serra, E., Iizuka, S., Sasaki, K., Ishikawa, H.: Learning to simplify: Fully convolutional networks for rough sketch cleanup. ACM Transactions on Graphics 35(4) (2016) 121:1-121:11  2. Wu, Z., Song, S., Khosla, A., Yu, F., Zhang, L., Tang, X., Xiao, J.: 3d shapenets: A deep representation for volumetric shapes. In: 2015 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2015) 1912-1920  3. Riegler, G., Ulusoy, A.O., Geiger, A.: Octnet: Learning deep 3d representations at high resolutions. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 6620-6629  4. Wang, P.S., Liu, Y., Guo, Y.X., Sun, C.Y., Tong, X.: O-cnn: Octree-based con- volutional neural networks for 3d shape analysis. ACM Transactions on Graphics 36(4) (2017) 72:1-72:11  5. Tatarchenko, M., Dosovitskiy, A., Brox, T.:  Octree generating networks: CoRR  Eﬃcient convolutional architectures for high-resolution 3d outputs. abs/1703.09438 (2017)  6. Hunter, G.M., Steiglitz, K.: Operations on images using quad trees. IEEE Trans-  actions on Pattern Analysis and Machine Intelligence 1(2) (1979) 145-153  7. Jackins, C.L., Tanimoto, S.L.: Oct-trees and their use in representing three- dimensional objects. Computer Graphics and Image Processing 14(3) (1980) 249 - 270  8. Gervautz, M., Purgathofer, W.: A simple method for color quantization: Octree quantization. In Magnenat-Thalmann, N., Thalmann, D., eds.: New Trends in Computer Graphics, Berlin, Heidelberg, Springer Berlin Heidelberg (1988) 219- 231  9. Sullivan, G.J., Baker, R.L.: Eﬃcient quadtree coding of images and video. IEEE  Transactions on Image Processing 3(3) (1994) 327-331  10. Agarwala, A.: Eﬃcient gradient-domain compositing using quadtrees. ACM Trans-  11. Gargantini, I.: An eﬀective way to represent quadtrees. Communications of the  actions on Graphics 26(3) (2007)  ACM 25(12) (1982) 905-910  abs/1409.6070 (2014)  12. Graham, B.:  Spatially-sparse  convolutional neural networks.  CoRR  13. Graham, B.: Sparse 3d convolutional neural networks. In Xianghua Xie, M.W.J., Tam, G.K.L., eds.: Proceedings of the British Machine Vision Conference (BMVC), BMVA Press (2015) 150.1-150.9  14. Graham, B., van der Maaten, L.: Submanifold sparse convolutional networks.  CoRR abs/1706.01307 (2017)  15. Riegler, G., Ulusoy, A.O., Geiger, A.: Octnet: Learning deep 3d representations at high resolutions. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 6620-6629  16. Chellapilla, K., Puri, S., Simard, P.: High Performance Convolutional Neural Net- works for Document Processing. In Lorette, G., ed.: Proceedings - Tenth Interna- tional Workshop on Frontiers in Handwriting Recognition, Universit´e de Rennes 1, Suvisoft (2006)  17. Springenberg, J.T., Dosovitskiy, A., Brox, T., Riedmiller, M.A.: Striving for sim-  plicity: The all convolutional net. CoRR abs/1412.6806 (2014)  18. Zeiler, M.D., Fergus, R.: Visualizing and understanding convolutional networks. In Fleet, D., Pajdla, T., Schiele, B., Tuytelaars, T., eds.: Computer Vision - ECCV 2014, Cham, Springer International Publishing (2014) 818-833   Quadtree Convolutional Neural NetworksReferences  1. Simo-Serra, E., Iizuka, S., Sasaki, K., Ishikawa, H.: Learning to simplify: Fully convolutional networks for rough sketch cleanup. ACM Transactions on Graphics 35(4) (2016) 121:1-121:11  2. Wu, Z., Song, S., Khosla, A., Yu, F., Zhang, L., Tang, X., Xiao, J.: 3d shapenets: A deep representation for volumetric shapes. In: 2015 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2015) 1912-1920  3. Riegler, G., Ulusoy, A.O., Geiger, A.: Octnet: Learning deep 3d representations at high resolutions. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 6620-6629  4. Wang, P.S., Liu, Y., Guo, Y.X., Sun, C.Y., Tong, X.: O-cnn: Octree-based con- volutional neural networks for 3d shape analysis. ACM Transactions on Graphics 36(4) (2017) 72:1-72:11  5. Tatarchenko, M., Dosovitskiy, A., Brox, T.:  Octree generating networks: CoRR  Eﬃcient convolutional architectures for high-resolution 3d outputs. abs/1703.09438 (2017)  6. Hunter, G.M., Steiglitz, K.: Operations on images using quad trees. IEEE Trans-  actions on Pattern Analysis and Machine Intelligence 1(2) (1979) 145-153  7. Jackins, C.L., Tanimoto, S.L.: Oct-trees and their use in representing three- dimensional objects. Computer Graphics and Image Processing 14(3) (1980) 249 - 270  8. Gervautz, M., Purgathofer, W.: A simple method for color quantization: Octree quantization. In Magnenat-Thalmann, N., Thalmann, D., eds.: New Trends in Computer Graphics, Berlin, Heidelberg, Springer Berlin Heidelberg (1988) 219- 231  9. Sullivan, G.J., Baker, R.L.: Eﬃcient quadtree coding of images and video. IEEE  Transactions on Image Processing 3(3) (1994) 327-331  10. Agarwala, A.: Eﬃcient gradient-domain compositing using quadtrees. ACM Trans-  11. Gargantini, I.: An eﬀective way to represent quadtrees. Communications of the  actions on Graphics 26(3) (2007)  ACM 25(12) (1982) 905-910  abs/1409.6070 (2014)  12. Graham, B.:  Spatially-sparse  convolutional neural networks.  CoRR  13. Graham, B.: Sparse 3d convolutional neural networks. In Xianghua Xie, M.W.J., Tam, G.K.L., eds.: Proceedings of the British Machine Vision Conference (BMVC), BMVA Press (2015) 150.1-150.9  14. Graham, B., van der Maaten, L.: Submanifold sparse convolutional networks.  CoRR abs/1706.01307 (2017)  15. Riegler, G., Ulusoy, A.O., Geiger, A.: Octnet: Learning deep 3d representations at high resolutions. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 6620-6629  16. Chellapilla, K., Puri, S., Simard, P.: High Performance Convolutional Neural Net- works for Document Processing. In Lorette, G., ed.: Proceedings - Tenth Interna- tional Workshop on Frontiers in Handwriting Recognition, Universit´e de Rennes 1, Suvisoft (2006)  17. Springenberg, J.T., Dosovitskiy, A., Brox, T., Riedmiller, M.A.: Striving for sim-  plicity: The all convolutional net. CoRR abs/1412.6806 (2014)  18. Zeiler, M.D., Fergus, R.: Visualizing and understanding convolutional networks. In Fleet, D., Pajdla, T., Schiele, B., Tuytelaars, T., eds.: Computer Vision - ECCV 2014, Cham, Springer International Publishing (2014) 818-833   16  Pradeep Kumar Jayaraman, Jianhan Mei, Jianfei Cai and Jianmin Zheng  19. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomed- ical image segmentation. In Navab, N., Hornegger, J., Wells, W.M., Frangi, A.F., eds.: Medical Image Computing and Computer-Assisted Intervention - MICCAI 2015, Cham, Springer International Publishing (2015) 234-241  20. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. arXiv preprint arXiv:1408.5093 (2014)  21. Nair, V., Hinton, G.E.: Rectified linear units improve restricted boltzmann ma- chines. In: Proceedings of the 27th International Conference on International Con- ference on Machine Learning. ICML’10, USA, Omnipress (2010) 807-814  22. Srivastava, N., Hinton, G., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.: Dropout: A simple way to prevent neural networks from overfitting. Journal of Machine Learning Research 15 (2014) 1929-1958  23. Cohen, G., Afshar, S., Tapson, J., van Schaik, A.: EMNIST: an extension of MNIST  to handwritten letters. CoRR abs/1702.05373 (2017)  24. Liu, C.L., Yin, F., Wang, D.H., Wang, Q.F.: Online and oﬄine handwritten chinese character recognition: Benchmarking on new databases. Pattern Recognition 46(1) (2013) 155 - 162  25. Eitz, M., Hays, J., Alexa, M.: How do humans sketch objects? ACM Transactions  26. Zeiler, M.D.:  ADADELTA: an adaptive learning rate method.  CoRR  on Graphics 31(4) (2012) 44:1-44:10  abs/1212.5701 (2012)  27. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward neural networks. In: Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics. Volume 9 of Proceedings of Machine Learning Research., PMLR (2010) 249-256  28. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recogni- tion. In: 2016 Proceedings of IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2016) 770-778  29. Ha, D., Eck, D.:  A neural representation of sketch drawings.  CoRR  abs/1704.03477 (2017)  30. Simo-Serra, E., Iizuka, S., Ishikawa, H.: Mastering sketching: Adversarial augmen-  tation for structured prediction. CoRR abs/1703.08966 (2017)"}