{"1": "(2013) 1777-1784  1. Papazoglou, A., Ferrari, V.: Fast object segmentation in unconstrained video.  In: ICCV.  2. Faktor, A., Irani, M.: Video segmentation by non-local consensus voting. In: BMVC. (2014) 3. Zhang, D., Javed, O., Shah, M.: Video object segmentation through spatially accurate and  temporally dense extraction of primary object regions. In: CVPR. (2013) 628-635  4. Jang, W.D., Lee, C., Kim, C.S.: Primary object segmentation in videos via alternate convex  optimization of foreground and background distributions. In: CVPR. (2016) 696-704  5. Koh, Y.J., Jang, W.D., Kim, C.S.: POD: discovering primary objects in videos based on evolutionary refinement of object recurrence, background, and primary object models. In: CVPR. (2016) 1068-1076  6. Koh, Y.J., Kim, C.S.: Unsupervised primary object discovery in videos based on evolutionary primary object modeling with reliable object proposals. IEEE Trans. Image Process. 26(11) (2017) 5203-5216  7. Kim, W., Jung, C., Kim, C.: Spatiotemporal saliency detection and its applications in static and dynamic scenes. IEEE Trans. Circuits Syst. Video Technol. 21(4) (2011) 446-456 8. Kim, H., Kim, Y., Sim, J.Y., Kim, C.S.: Spatiotemporal saliency detection for video se- quences based on random walk with restart. IEEE Trans. Image Process. 24(8) (2015) 2552- 2564  9. Chen, C., Li, S., Wang, Y., Qin, H., Hao, A.: Video saliency detection via spatial-temporal fusion and low-rank coherency diffusion. IEEE Trans. Image Process. 26(7) (2017) 3156- 3170  10. Wang, W., Shen, J., Shao, L.: Video salient object detection via fully convolutional networks.  IEEE Trans. Image Process. 27(1) (2018) 38-49  11. Li, Y., Qi, H., Dai, J., Ji, X., Wei, Y.: Fully convolutional instance-aware semantic segmen-  12. Arnab, A., Torr, P.H.: Pixelwise instance segmentation with a dynamically instantiated net-  tation. In: CVPR. (2017) 2359-2367  work. In: CVPR. (2017) 44-450  13. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: ICCV. (2017) 2980-2988 14. Li, G., Xie, Y., Lin, L., Yu, Y.: Instance-level salient object segmentation. In: CVPR. (2017)  15. Jain, S.D., Xiong, B., Grauman, K.: FusionSeg: Learning to combine motion and appearance for fully automatic segmentation of generic objects in videos. In: CVPR. (2017) 3664-3673 In: CVPR.  16. Tokmakov, P., Alahari, K., Schmid, C.: Learning motion patterns in videos.  2386-2395  (2017) 3386-3394  17. Yang, J., Zhao, G., Yuan, J., Shen, X., Lin, Z., Price, B., Brandt, J.: Discovering primary objects in videos by saliency fusion and iterative appearance estimation. IEEE Trans. Circuits Syst. Video Technol. 26(6) (2016) 1070-1083  18. Chartrand, G., Zhang, P.: Chromatic Graph Theory. CRC press (2008) 19. Perazzi, F., Pont-Tuset, J., McWilliams, B., Van Gool, L., Gross, M., Sorkine-Hornung, A.: A benchmark dataset and evaluation methodology for video object segmentation. In: CVPR. (2016) 724-732  20. Ochs, P., Malik, J., Brox, T.: Segmentation of moving objects by long term video analysis.  IEEE Trans. Pattern Anal. Mach. Intell. 36(6) (2014) 1187-1200  21. Lee, Y.J., Kim, J., Grauman, K.: Key-segments for video object segmentation. In: ICCV.  (2011) 1995-2002  22. Ma, T., Latecki, L.J.: Maximum weight cliques with mutex constraints for video object  segmentation. In: CVPR. (2012) 670-677   Sequential clique optimization for video object segmentationReferences  (2013) 1777-1784  1. Papazoglou, A., Ferrari, V.: Fast object segmentation in unconstrained video.  In: ICCV.  2. Faktor, A., Irani, M.: Video segmentation by non-local consensus voting. In: BMVC. (2014) 3. Zhang, D., Javed, O., Shah, M.: Video object segmentation through spatially accurate and  temporally dense extraction of primary object regions. In: CVPR. (2013) 628-635  4. Jang, W.D., Lee, C., Kim, C.S.: Primary object segmentation in videos via alternate convex  optimization of foreground and background distributions. In: CVPR. (2016) 696-704  5. Koh, Y.J., Jang, W.D., Kim, C.S.: POD: discovering primary objects in videos based on evolutionary refinement of object recurrence, background, and primary object models. In: CVPR. (2016) 1068-1076  6. Koh, Y.J., Kim, C.S.: Unsupervised primary object discovery in videos based on evolutionary primary object modeling with reliable object proposals. IEEE Trans. Image Process. 26(11) (2017) 5203-5216  7. Kim, W., Jung, C., Kim, C.: Spatiotemporal saliency detection and its applications in static and dynamic scenes. IEEE Trans. Circuits Syst. Video Technol. 21(4) (2011) 446-456 8. Kim, H., Kim, Y., Sim, J.Y., Kim, C.S.: Spatiotemporal saliency detection for video se- quences based on random walk with restart. IEEE Trans. Image Process. 24(8) (2015) 2552- 2564  9. Chen, C., Li, S., Wang, Y., Qin, H., Hao, A.: Video saliency detection via spatial-temporal fusion and low-rank coherency diffusion. IEEE Trans. Image Process. 26(7) (2017) 3156- 3170  10. Wang, W., Shen, J., Shao, L.: Video salient object detection via fully convolutional networks.  IEEE Trans. Image Process. 27(1) (2018) 38-49  11. Li, Y., Qi, H., Dai, J., Ji, X., Wei, Y.: Fully convolutional instance-aware semantic segmen-  12. Arnab, A., Torr, P.H.: Pixelwise instance segmentation with a dynamically instantiated net-  tation. In: CVPR. (2017) 2359-2367  work. In: CVPR. (2017) 44-450  13. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: ICCV. (2017) 2980-2988 14. Li, G., Xie, Y., Lin, L., Yu, Y.: Instance-level salient object segmentation. In: CVPR. (2017)  15. Jain, S.D., Xiong, B., Grauman, K.: FusionSeg: Learning to combine motion and appearance for fully automatic segmentation of generic objects in videos. In: CVPR. (2017) 3664-3673 In: CVPR.  16. Tokmakov, P., Alahari, K., Schmid, C.: Learning motion patterns in videos.  2386-2395  (2017) 3386-3394  17. Yang, J., Zhao, G., Yuan, J., Shen, X., Lin, Z., Price, B., Brandt, J.: Discovering primary objects in videos by saliency fusion and iterative appearance estimation. IEEE Trans. Circuits Syst. Video Technol. 26(6) (2016) 1070-1083  18. Chartrand, G., Zhang, P.: Chromatic Graph Theory. CRC press (2008) 19. Perazzi, F., Pont-Tuset, J., McWilliams, B., Van Gool, L., Gross, M., Sorkine-Hornung, A.: A benchmark dataset and evaluation methodology for video object segmentation. In: CVPR. (2016) 724-732  20. Ochs, P., Malik, J., Brox, T.: Segmentation of moving objects by long term video analysis.  IEEE Trans. Pattern Anal. Mach. Intell. 36(6) (2014) 1187-1200  21. Lee, Y.J., Kim, J., Grauman, K.: Key-segments for video object segmentation. In: ICCV.  (2011) 1995-2002  22. Ma, T., Latecki, L.J.: Maximum weight cliques with mutex constraints for video object  segmentation. In: CVPR. (2012) 670-677   16  Y. J. Koh, Y.-Y. Lee, and C.-S. Kim  23. Koh, Y.J., Kim, C.S.: Primary object segmentation in videos based on region augmentation  and reduction. In: CVPR. (2017) 3442-3450  24. Wang, W., Shen, J., Porikli, F.: Saliency-aware geodesic video object segmentation.  In:  CVPR. (2015) 3395-3402  25. Yang, J., Price, B., Shen, X., Lin, Z., Yuan, J.: Fast appearance modeling for automatic primary video object segmentation. IEEE Trans. Image Process. 25(2) (2016) 503-515 26. Shi, J., Malik, J.: Motion segmentation and tracking using normalized cuts. In: ICCV. (1998)  27. Brox, T., Malik, J.: Object segmentation by long term analysis of point trajectories.  In:  28. Ochs, P., Brox, T.: Object segmentation in video: A hierarchical variational approach for  turning point trajectories into dense regions. In: ICCV. (2011) 1583-1590  29. Ochs, P., Brox, T.: Higher order motion models and spectral clustering. In: CVPR. (2012)  1154-1160  ECCV. (2010) 282-295  614-621  30. Fragkiadaki, K., Zhang, G., Shi, J.: Video segmentation by tracing discontinuities in a tra-  jectory embedding. In: CVPR. (2012) 1846-1853  31. Tokmakov, P., Alahari, K., Schmid, C.: Learning video object segmentation with visual  memory. In: ICCV. (2017) 4491-4500  32. Cheng, J., Tsai, Y.H., Wang, S., Yang, M.H.: Segﬂow: Joint learning for video object seg-  mentation and optical ﬂow. In: ICCV. (2017) 686-695  33. Caelles, S., Maninis, K.K., Pont-Tuset, J., Leal-Taixe, L., Cremers, D., Van Gool, L.: One-  shot video object segmentation. In: CVPR. (2017) 221-230  34. Perazzi, F., Khoreva, A., Benenson, R., Schiele, B., Sorkine-Hornung, A.: Learning video  object segmentation from static images. In: CVPR. (2017) 2663-2672  35. Jang, W.D., Kim, C.S.: Online video object segmentation via convolutional trident network.  In: CVPR. (2017) 5849-5858  36. Yan, Q., Xu, L., Shi, J., Jia, J.: Hierarchical saliency detection. In: CVPR. (2013) 1155-1162 37. Goferman, S., Zelnik-Manor, L., Tal, A.: Context-aware saliency detection. IEEE Trans.  Pattern Anal. Mach. Intell. 34(10) (2012) 1915-1926  38. Cheng, M.M., Mitra, N.J., Huang, X., Torr, P.H., Hu, S.M.: Global contrast based salient  region detection. IEEE Trans. Pattern Anal. Mach. Intell. 37(3) (2015) 569-582  39. Perazzi, F., Kr¨ahenb¨uhl, P., Pritch, Y., Hornung, A.: Saliency filters: Contrast based filtering  for salient region detection. In: CVPR. (2012) 733-740  40. Wei, Y., Wen, F., Zhu, W., Sun, J.: Geodesic saliency using background priors. ECCV (2012)  41. Zhu, W., Liang, S., Wei, Y., Sun, J.: Saliency optimization from robust background detection.  29-42  In: CVPR. (2014) 2814-2821  42. Yang, C., Zhang, L., Lu, H., Ruan, X., Yang, M.H.: Saliency detection via graph-based  manifold ranking. In: CVPR. (2013) 3166-3173  43. Li, G., Yu, Y.: Deep contrast learning for salient object detection. In: CVPR. (2016) 478-487 44. Luo, Z., Mishra, A., Achkar, A., Eichel, J., Li, S., Jodoin, P.M.: Non-local deep features for  salient object detection. In: CVPR. (2017) 6609-6617  45. Hu, P., Shuai, B., Liu, J., Wang, G.: Deep level sets for salient object detection. In: CVPR.  (2017) 2300-2309  46. Fang, Y., Wang, Z., Lin, W., Fang, Z.: Video saliency incorporating spatiotemporal cues and  uncertainty weighting. IEEE Trans. Image Process. 23(9) (2014) 3910-3921  47. Liu, Z., Zhang, X., Luo, S., Le Meur, O.: Superpixel-based spatiotemporal saliency detection.  IEEE Trans. Circuits Syst. Video Technol. 24(9) (2014) 1522-1540  48. Wang, W., Shen, J., Shao, L.: Consistent video saliency using local gradient ﬂow optimiza-  tion and global refinement. IEEE Trans. Image Process. 24(11) (2015) 4185-4196   Sequential clique optimization for video object segmentation49. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: Towards real-time object detection  with region proposal networks. In: Adv. Neural Inf. Process. Syst. (2015) 91-99  50. Achanta, R., Shaji, A., Smith, K., Lucchi, A., Fua, P., Susstrunk, S.: SLIC superpixels com- pared to state-of-the-art superpixel methods. IEEE Trans. Pattern Anal. Mach. Intell. 34(11) (2012) 2274-2282  51. Pan, J.Y., Yang, H.J., Faloutsos, C., Duygulu, P.: Automatic multimedia cross-modal corre-  lation discovery. In: Proc. ACM SIGKDD. (2004) 653-658  52. Fei-Fei, L., Perona, P.: A Bayesian hierarchical model for learning natural scene categories.  In: CVPR. (2005) 524-531  53. Galasso, F., Nagaraja, N.S., Cardenas, T.J., Brox, T., Schiele, B.: A unified video segmenta-  tion benchmark: Annotation, metrics and analysis. In: ICCV. (2013) 3527-3534  54. Feremans, C., Labb´e, M., Laporte, G.: Generalized network design problems. European  Journal of Operational Research 148(1) (2003) 1-13  55. Zamir, A.R., Dehghan, A., Shah, M.: GMCP-Tracker: Global multi-object tracking using  generalized minimum clique graphs. In: ECCV. (2012) 343-356  56. Althaus, E., Kohlbacher, O., Lenhof, H.P., M¨uller, P.: A combinatorial approach to protein  docking with ﬂexible side chains. Journal of Computational Biology 9(4) (2002) 597-612  57. Dehghan, A., Modiri Assari, S., Shah, M.: GMMCP Tracker: Globally optimal generalized maximum multi clique problem for multiple object tracking. In: CVPR. (2015) 4091-4099 58. Kuhn, H.W.: The Hungarian method for the assignment problem. Nav. Res. Logist. Quart.  59. Rother, C., Kolmogorov, V., Blake, A.: Grabcut: Interactive foreground extraction using  iterated graph cuts. In: ACM Trans. Graphics. Volume 23. (2004) 309-314  60. Chinneck, J.W.: Practical Optimization: A Gentle Introduction. Systems and Computer  2(1-2) (1955) 83-97  Engineering (2006)  61. Taylor, B., Karasev, V., Soattoc, S.: Causal video object segmentation from persistence of  62. Voigtlaender, P., Leibe, B.: Online adaptation of convolutional neural networks for video  occlusions. In: CVPR. (2015) 4268-4276  object segmentation. In: BMVC. (2017)  63. Li, G., Yu, Y.: Visual saliency based on multiscale deep features. In: CVPR. (2015) 5455-64. Jiang, B., Zhang, L., Lu, H., Yang, C., Yang, M.H.: Saliency detection via absorbing Markov  chain. In: ICCV. (2013) 1665-1672  65. Zhou, F., Kang, S.B., Cohen, M.F.: Time-mapping using space-time saliency. In: CVPR.  66. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale image recog-  (2014) 3358-3365  nition. In: ICLR. (2015)"}