{"1": "1. Bartlett, M.S., Littlewort, G., Frank, M.G., Lainscsek, C., Fasel, I.R., Movellan, J.R.: Automatic recognition of facial actions in spontaneous expressions. Journal of Multimedia 1(6), 22-35 (2006)  2. Cao, C., Weng, Y., Lin, S., Zhou, K.: 3d shape regression for real-time facial  animation. ACM Transactions on Graphics (TOG) 32(4), 41 (2013)  3. Cheng, Y.T., Tzeng, V., Liang, Y., Wang, C.C., Chen, B.Y., Chuang, Y.Y., Ouhy-  oung, M.: 3d-model-based face replacement in video. ACM (2009)  4. Dale, K., Sunkavalli, K., Johnson, M.K., Vlasic, D., Matusik, W., Pfister, H.: Video face replacement. ACM Transactions on Graphics (TOG) 30(6), 1-10 (2011) 5. Deng, J., Trigeorgis, G., Zhou, Y., Zafeiriou, S.: Joint multi-view face alignment  6. Dong, X., Yan, Y., Ouyang, W., Yang, Y.: Style aggregated network for facial  7. Ekman, P., Friesen, W., Hager, J.: Facial Action Coding System (FACS): Manual.  in the wild arXiv:1708.06023 (2017)  landmark detection. In: CVPR (2018)  A Human Face (2002)  8. Garrido, P., Valgaerts, L., Rehmsen, O., Thormahlen, T., Perez, P., Theobalt, C.:  Automatic face reenactment. In: CVPR (2014)  9. Garrido, P., Valgaerts, L., Sarmadi, H., Steiner, I., Varanasi, K., Perez, P., Theobalt, C.: Vdub: Modifying face video of actors for plausible visual alignment to a dubbed audio track. In: Computer Graphics Forum. vol. 34, pp. 193-204. Wiley Online Library (2015)  10. Goodfellow, I.J., Pougetabadie, J., Mirza, M., Xu, B., Wardefarley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial networks. NIPS 3, 2672-2680 (2014)  11. G¨uler, R.A., Neverova, N., Kokkinos, I.: Densepose: Dense human pose estimation  in the wild. In: CVPR (2018)  12. G¨uler, R.A., Trigeorgis, G., Antonakos, E., Snape, P., Zafeiriou, S., Kokkinos, I.: Densereg: Fully convolutional dense shape regression in-the-wild. In: CVPR (2017) 13. Henriques, J.F., Caseiro, R., Martins, P., Batista, J.: High-speed tracking with kernelized correlation filters. IEEE Transactions on Pattern Analysis and Machine Intelligence(TPAMI) 37(3), 583-596 (2015)  14. Herbrich, R., Minka, T., Graepel, T.: Trueskilltm: A bayesian skill rating system.  15. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with condi-  tional adversarial networks. CVPR (2017)  16. Jin, X., Qi, Y., Wu, S.: Cyclegan face-oﬀ arXiv:1712.03451 (2017) 17. Kapoor, A., Picard, R.W.: Multimodal aﬀect recognition in learning environments.  In: NIPS (2006)  In: MM (2005)  18. Kim, H., Garrido, P., Tewari, A., Xu, W., Thies, J., Nießner, M., P´erez, P., Richardt, C., Zollh¨ofer, M., Theobalt, C.: Deep video portraits. In: SIGGRAPH (2018)  19. Kumar, A., Chellappa, R.: Disentangling 3d pose in a dendritic cnn for uncon-  strained 2d face alignment. In: CVPR (2018)  20. Le, V., Brandt, J., Lin, Z., Bourdev, L.D., Huang, T.S.: Interactive facial feature  localization. In: ECCV (2012)  21. Ledig, C., Theis, L., Huszar, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A.P., Tejani, A., Totz, J., Wang, Z., Shi, W.: Photo-realistic single image super- resolution using a generative adversarial network. In: CVPR (2017)   ReenactGAN: Learning to Reenact Faces via Boundary TransferReferences  1. Bartlett, M.S., Littlewort, G., Frank, M.G., Lainscsek, C., Fasel, I.R., Movellan, J.R.: Automatic recognition of facial actions in spontaneous expressions. Journal of Multimedia 1(6), 22-35 (2006)  2. Cao, C., Weng, Y., Lin, S., Zhou, K.: 3d shape regression for real-time facial  animation. ACM Transactions on Graphics (TOG) 32(4), 41 (2013)  3. Cheng, Y.T., Tzeng, V., Liang, Y., Wang, C.C., Chen, B.Y., Chuang, Y.Y., Ouhy-  oung, M.: 3d-model-based face replacement in video. ACM (2009)  4. Dale, K., Sunkavalli, K., Johnson, M.K., Vlasic, D., Matusik, W., Pfister, H.: Video face replacement. ACM Transactions on Graphics (TOG) 30(6), 1-10 (2011) 5. Deng, J., Trigeorgis, G., Zhou, Y., Zafeiriou, S.: Joint multi-view face alignment  6. Dong, X., Yan, Y., Ouyang, W., Yang, Y.: Style aggregated network for facial  7. Ekman, P., Friesen, W., Hager, J.: Facial Action Coding System (FACS): Manual.  in the wild arXiv:1708.06023 (2017)  landmark detection. In: CVPR (2018)  A Human Face (2002)  8. Garrido, P., Valgaerts, L., Rehmsen, O., Thormahlen, T., Perez, P., Theobalt, C.:  Automatic face reenactment. In: CVPR (2014)  9. Garrido, P., Valgaerts, L., Sarmadi, H., Steiner, I., Varanasi, K., Perez, P., Theobalt, C.: Vdub: Modifying face video of actors for plausible visual alignment to a dubbed audio track. In: Computer Graphics Forum. vol. 34, pp. 193-204. Wiley Online Library (2015)  10. Goodfellow, I.J., Pougetabadie, J., Mirza, M., Xu, B., Wardefarley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial networks. NIPS 3, 2672-2680 (2014)  11. G¨uler, R.A., Neverova, N., Kokkinos, I.: Densepose: Dense human pose estimation  in the wild. In: CVPR (2018)  12. G¨uler, R.A., Trigeorgis, G., Antonakos, E., Snape, P., Zafeiriou, S., Kokkinos, I.: Densereg: Fully convolutional dense shape regression in-the-wild. In: CVPR (2017) 13. Henriques, J.F., Caseiro, R., Martins, P., Batista, J.: High-speed tracking with kernelized correlation filters. IEEE Transactions on Pattern Analysis and Machine Intelligence(TPAMI) 37(3), 583-596 (2015)  14. Herbrich, R., Minka, T., Graepel, T.: Trueskilltm: A bayesian skill rating system.  15. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with condi-  tional adversarial networks. CVPR (2017)  16. Jin, X., Qi, Y., Wu, S.: Cyclegan face-oﬀ arXiv:1712.03451 (2017) 17. Kapoor, A., Picard, R.W.: Multimodal aﬀect recognition in learning environments.  In: NIPS (2006)  In: MM (2005)  18. Kim, H., Garrido, P., Tewari, A., Xu, W., Thies, J., Nießner, M., P´erez, P., Richardt, C., Zollh¨ofer, M., Theobalt, C.: Deep video portraits. In: SIGGRAPH (2018)  19. Kumar, A., Chellappa, R.: Disentangling 3d pose in a dendritic cnn for uncon-  strained 2d face alignment. In: CVPR (2018)  20. Le, V., Brandt, J., Lin, Z., Bourdev, L.D., Huang, T.S.: Interactive facial feature  localization. In: ECCV (2012)  21. Ledig, C., Theis, L., Huszar, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A.P., Tejani, A., Totz, J., Wang, Z., Shi, W.: Photo-realistic single image super- resolution using a generative adversarial network. In: CVPR (2017)   16  Wayne Wu et al.  22. Li, K., Xu, F., Wang, J., Dai, Q., Liu, Y.: A data-driven approach for facial ex-  pression synthesis in video. In: CVPR (2012)  23. Lin, K.Y., Wang, G.: Hallucinated-iqa: No-reference image quality assessment via  adversarial learning. In: CVPR (2018)  24. Lin, K.Y., Wang, G.: Self-supervised deep multiple choice learning network for  blind image quality assessment. In: BMVC (2018)  25. Mahoor, M.H., Cadavid, S., Messinger, D.S., Cohn, J.F.: A framework for auto- mated measurement of the intensity of non-posed facial action units. In: CVPR (2009)  26. Mavadati, S.M., Mahoor, M.H., Bartlett, K., Trinh, P., Cohn, J.F.: DISFA: A spon- taneous facial action intensity database. IEEE Transactions on Aﬀective Comput- ing(TAC) 4(2), 151-160 (2013)  27. Mueller, F., Bernard, F., Sotnychenko, O., Mehta, D., Sridhar, S., Casas, D., Theobalt, C.: Ganerated hands for real-time 3d hand tracking from monocular RGB. In: CVPR (2018)  28. Nguyen, A., Yosinski, J., Bengio, Y., Dosovitskiy, A., Clune, J.: Plug & play generative networks: Conditional iterative generation of images in latent space arXiv:1612.00005 (2016)  29. Ren, S., He, K., Girshick, R.B., Sun, J.: Faster R-CNN: towards real-time object  detection with region proposal networks. In: NIPS (2015)  30. Sajjadi, M.S.M., Scholkopf, B., Hirsch, M.: Enhancenet: Single image super-  resolution through automated texture synthesis. In: ICCV (2017)  31. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. vol. abs/1409.1556 (2014)  32. Suwajanakorn, S., Seitz, S.M., Kemelmacher-Shlizerman, I.: What makes tom  hanks look like tom hanks. In: ICCV (2015)  33. Taigman, Y., Yang, M., Ranzato, M., Wolf, L.: Deepface: Closing the gap to human-  level performance in face verification. In: CVPR (2014)  34. Thies, J., Zollh¨ofer, M., Nießner, M., Valgaerts, L., Stamminger, M., Theobalt, C.: Real-time expression transfer for facial reenactment. ACM Transactions on Graphics (TOG) 34(6), 183-1 (2015)  35. Thies, J., Zollh¨ofer, M., Stamminger, M., Theobalt, C., Nießner, M.: Face2face:  Real-time face capture and reenactment of rgb videos. In: CVPR (2016)  36. Thies, J., Zollh¨ofer, M., Stamminger, M., Theobalt, C., Nießner, M.: Facevr: in virtual reality. CoRR  Real-time facial reenactment and eye gaze control abs/1610.03151 (2016)  37. Tong, Y., Liao, W., Ji, Q.: Facial action unit recognition by exploiting their dy- namic and semantic relationships. IEEE Transactions on Pattern Analysis and Machine Intelligence(TPAMI) 29(10), 1683-1699 (2007)  38. Tran, D.L., Walecki, R., Rudovic, O., Eleftheriadis, S., Schuller, B.W., Pantic, M.: Deepcoder: Semi-parametric variational autoencoders for automatic facial action coding. In: ICCV (2017)  39. Trigeorgis, G., Snape, P., Nicolaou, M.A., Antonakos, E., Zafeiriou, S.: Mnemonic descent method: A recurrent process applied for end-to-end face alignment. In: CVPR (2016)  40. Upchurch, P., Gardner, J., Bala, K., Pless, R., Snavely, N., Weinberger, K.Q.: Deep  feature interpolation for image content changes. arXiv:1611.05507 (2016)  41. Vlasic, D., Brand, M., Pfister, H., Popovi´c, J.: Face transfer with multilinear mod-  els. ACM Transactions on Graphics (TOG) 24(3), 426-433 (2005)  42. Walecki, R., Rudovic, O., Pavlovic, V., Pantic, M.: Copula ordinal regression for  joint estimation of facial action unit intensity. In: CVPR (2016)   ReenactGAN: Learning to Reenact Faces via Boundary Transfer43. Walecki, R., Rudovic, O., Pavlovic, V., Schuller, B.W., Pantic, M.: Deep structured  learning for facial action unit intensity estimation. In: CVPR (2017)  44. Wang, C., Shi, F., Xia, S., Chai, J.: Realtime 3d eye gaze animation using a single  rgb camera. ACM Transactions on Graphics (TOG) 35(4), 118 (2016)  45. Wang, T., Liu, M., Zhu, J., Tao, A., Kautz, J., Catanzaro, B.: High-resolution im- age synthesis and semantic manipulation with conditional gans. In: CVPR (2018) 46. Wang, Z., Bovik, A.C., Sheikh, H.R., Simoncelli, E.P.: Image quality assessment: from error visibility to structural similarity. IEEE Transactions on Image Process- ing (TIP) 13(4), 600-612 (2004)  47. Wei, T.: Cyclegan face-oﬀ. https://www.youtube.com/watch?v=Fea4kZq0oFQ  (2017)  48. Wu, C., Bradley, D., Garrido, P., Zollh¨ofer, M., Theobalt, C., Gross, M., Beeler, T.: Model-Based Teeth Reconstruction. ACM Transactions on Graphics (TOG) 35(6) (2016)  49. Wu, S., Wang, S., Pan, B., Ji, Q.: Deep facial action unit recognition from partially  labeled data. In: ICCV (2017)  50. Wu, W., Qian, C., Yang, S., Wang, Q., Cai, Y., Zhou, Q.: Look at boundary: A  boundary-aware face alignment algorithm. In: CVPR (2018)  51. Wu, W., Yang, S.: Leveraging intra and inter-dataset variations for robust face  alignment. In: CVPR Workshop (2017)  52. Xiao, S., Feng, J., Xing, J., Lai, H., Yan, S., Kassim, A.A.: Robust facial landmark  detection via recurrent attentive-refinement networks. In: ECCV (2016)  53. Xu, R., Zhou, Z., Zhang, W., Yu, Y.: Face transfer with generative adversarial  network arXiv:1710.06090 (2017)  54. Zhang, H., Xu, T., Li, H., Zhang, S., Huang, X., Wang, X., Metaxas, D.: Stack- gan: Text to photo-realistic image synthesis with stacked generative adversarial networks. In: ICCV (2017)  55. Zhang, Y., Liu, L., Li, C., Loy, C.C.: Quantifying facial age by posterior of age  56. Zhao, K., Chu, W., Zhang, H.: Deep region and multi-label learning for facial action  comparisons. In: BMVC (2017)  unit detection. In: CVPR (2016)  57. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation  using cycle-consistent adversarial networkss. In: ICCV (2017)  58. Zhu, J., Zhang, R., Pathak, D., Darrell, T., Efros, A.A., Wang, O., Shechtman, E.:  Toward multimodal image-to-image translation. In: NIPS (2017)  59. Zhu, S., Fidler, S., Urtasun, R., Lin, D., Loy, C.C.: Be your own Prada: Fashion  synthesis with structural coherence. In: ICCV (2017)  60. Zhu, S., Li, C., Change Loy, C., Tang, X.: Face alignment by coarse-to-fine shape  searching. In: CVPR (2015)  61. Zhu, S., Li, C., Loy, C.C., Tang, X.: Unconstrained face alignment via cascaded  compositional learning. In: CVPR (2016)"}