{"1": "1. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein GAN. arXiv preprint  arXiv:1701.07875 (2017)  2. Baltruˇsaitis, T., Mahmoud, M., Robinson, P.: Cross-dataset learning and person-  specific normalisation for automatic action unit detection. In: FG (2015)  3. Benitez-Quiroz, C.F., Srinivasan, R., Martinez, A.M., et al.: Emotionet: An accu- rate, real-time algorithm for the automatic annotation of a million facial expres- sions in the wild. In: CVPR (2016)  4. Choi, Y., Choi, M., Kim, M., Ha, J.W., Kim, S., Choo, J.: Stargan: Unified gen- erative adversarial networks for multi-domain image-to-image translation. CVPR (2018)  5. Du, S., Tao, Y., Martinez, A.M.: Compound facial expressions of emotion. Pro-  ceedings of the National Academy of Sciences p. 201322355 (2014)  6. Ekman, P., Friesen, W.: Facial action coding system: A technique for the measure-  ment of facial movement. Consulting Psychologists Press (1978)  7. Fischler, M.A., Elschlager, R.A.: The representation and matching of pictorial  structures. IEEE Transactions on Computers 22(1), 67-92 (1973)  8. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S.,  Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  9. Gulrajani, I., Ahmed, F., Arjovsky, M., Dumoulin, V., Courville, A.C.: Improved  training of wasserstein GANs. In: NIPS (2017)  10. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with condi-  tional adversarial networks. In: CVPR (2017)  11. Johnson, J., Alahi, A., Fei-Fei, L.: Perceptual losses for real-time style transfer and  super-resolution. In: ECCV (2016)  12. Karras, T., Aila, T., Laine, S., Lehtinen, J.: Progressive growing of GANs for  improved quality, stability, and variation. In: ICLR (2018)  13. Kim, T., Cha, M., Kim, H., Lee, J., Kim, J.: Learning to discover cross-domain  relations with generative adversarial networks. In: ICML (2017)  14. Kingma, D., Ba, J.: ADAM: A method for stochastic optimization. In: ICLR (2015) 15. Kingma, D.P., Welling, M.: Auto-encoding variational bayes. In: ICLR (2014) 16. Langner, O., Dotsch, R., Bijlstra, G., Wigboldus, D.H., Hawk, S.T., Van Knip- penberg, A.: Presentation and validation of the radboud faces database. Cognition and emotion 24(8), 1377-1388 (2010)  17. Larsen, A.B.L., Sønderby, S.K., Larochelle, H., Winther, O.: Autoencoding beyond  pixels using a learned similarity metric. In: ICML (2016)  18. Ledig, C., Theis, L., Husz´ar, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A., Tejani, A., Totz, J., Wang, Z., et al.: Photo-realistic single image super- resolution using a generative adversarial network. In: CVPR (2017)  19. Li, C., Wand, M.: Precomputed real-time texture synthesis with markovian gener-  ative adversarial networks. In: ECCV (2016)  20. Li, M., Zuo, W., Zhang, D.: Deep identity-aware transfer of facial attributes. arXiv  21. Liu, M.Y., Breuel, T., Kautz, J.: Unsupervised image-to-image translation net-  22. Mathieu, M., Couprie, C., LeCun, Y.: Deep multi-scale video prediction beyond  preprint arXiv:1610.05586 (2016)  works. In: NIPS (2017)  mean square error. In: ICLR (2016)  arXiv:1411.1784 (2014)  23. Mirza, M., Osindero, S.: Conditional generative adversarial nets. arXiv preprint   GANimation: Anatomically-aware Facial Animation from a Single ImageReferences  1. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein GAN. arXiv preprint  arXiv:1701.07875 (2017)  2. Baltruˇsaitis, T., Mahmoud, M., Robinson, P.: Cross-dataset learning and person-  specific normalisation for automatic action unit detection. In: FG (2015)  3. Benitez-Quiroz, C.F., Srinivasan, R., Martinez, A.M., et al.: Emotionet: An accu- rate, real-time algorithm for the automatic annotation of a million facial expres- sions in the wild. In: CVPR (2016)  4. Choi, Y., Choi, M., Kim, M., Ha, J.W., Kim, S., Choo, J.: Stargan: Unified gen- erative adversarial networks for multi-domain image-to-image translation. CVPR (2018)  5. Du, S., Tao, Y., Martinez, A.M.: Compound facial expressions of emotion. Pro-  ceedings of the National Academy of Sciences p. 201322355 (2014)  6. Ekman, P., Friesen, W.: Facial action coding system: A technique for the measure-  ment of facial movement. Consulting Psychologists Press (1978)  7. Fischler, M.A., Elschlager, R.A.: The representation and matching of pictorial  structures. IEEE Transactions on Computers 22(1), 67-92 (1973)  8. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S.,  Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  9. Gulrajani, I., Ahmed, F., Arjovsky, M., Dumoulin, V., Courville, A.C.: Improved  training of wasserstein GANs. In: NIPS (2017)  10. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with condi-  tional adversarial networks. In: CVPR (2017)  11. Johnson, J., Alahi, A., Fei-Fei, L.: Perceptual losses for real-time style transfer and  super-resolution. In: ECCV (2016)  12. Karras, T., Aila, T., Laine, S., Lehtinen, J.: Progressive growing of GANs for  improved quality, stability, and variation. In: ICLR (2018)  13. Kim, T., Cha, M., Kim, H., Lee, J., Kim, J.: Learning to discover cross-domain  relations with generative adversarial networks. In: ICML (2017)  14. Kingma, D., Ba, J.: ADAM: A method for stochastic optimization. In: ICLR (2015) 15. Kingma, D.P., Welling, M.: Auto-encoding variational bayes. In: ICLR (2014) 16. Langner, O., Dotsch, R., Bijlstra, G., Wigboldus, D.H., Hawk, S.T., Van Knip- penberg, A.: Presentation and validation of the radboud faces database. Cognition and emotion 24(8), 1377-1388 (2010)  17. Larsen, A.B.L., Sønderby, S.K., Larochelle, H., Winther, O.: Autoencoding beyond  pixels using a learned similarity metric. In: ICML (2016)  18. Ledig, C., Theis, L., Husz´ar, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A., Tejani, A., Totz, J., Wang, Z., et al.: Photo-realistic single image super- resolution using a generative adversarial network. In: CVPR (2017)  19. Li, C., Wand, M.: Precomputed real-time texture synthesis with markovian gener-  ative adversarial networks. In: ECCV (2016)  20. Li, M., Zuo, W., Zhang, D.: Deep identity-aware transfer of facial attributes. arXiv  21. Liu, M.Y., Breuel, T., Kautz, J.: Unsupervised image-to-image translation net-  22. Mathieu, M., Couprie, C., LeCun, Y.: Deep multi-scale video prediction beyond  preprint arXiv:1610.05586 (2016)  works. In: NIPS (2017)  mean square error. In: ICLR (2016)  arXiv:1411.1784 (2014)  23. Mirza, M., Osindero, S.: Conditional generative adversarial nets. arXiv preprint   16  Pumarola et al.  24. Odena, A., Olah, C., Shlens, J.: Conditional image synthesis with auxiliary classifier  GANs. In: ICML (2017)  25. Pathak, D., Krahenbuhl, P., Donahue, J., Darrell, T., Efros, A.A.: Context en-  coders: Feature learning by inpainting. In: CVPR (2016)  26. Perarnau, G., van de Weijer, J., Raducanu, B., ´Alvarez, J.M.: Invertible conditional  GANs for image editing. arXiv preprint arXiv:1611.06355 (2016)  27. Pumarola, A., Agudo, A., Sanfeliu, A., Moreno-Noguer, F.: Unsupervised person  image synthesis in arbitrary poses. In: CVPR (2018)  28. Radford, A., Metz, L., Chintala, S.: Unpaired image-to-image translation using  cycle-consistent adversarial networks. In: ICLR (2016)  29. Reed, S., Akata, Z., Yan, X., Logeswaran, L., Schiele, B., Lee., H.: Generative  adversarial text to image synthesis. In: ICML (2016)  30. Scherer, K.R.: Emotion as a process: Function, origin and regulation. Social Science  31. Shen, W., Liu, R.: Learning residual images for face attribute manipulation. In:  Information 21, 555-570 (1982)  CVPR (2017)  32. Shrivastava, A., Pfister, T., Tuzel, O., Susskind, J., Wang, W., Webb, R.: Learning from simulated and unsupervised images through adversarial training. In: CVPR (2017)  33. Wang, X., Gupta, A.: Generative image modeling using style and structure adver-  sarial networks. In: ECCV (2016)  34. Wang, Z., Liu, D., Yang, J., Han, W., Huang, T.: Deep networks for image super-  resolution with sparse prior. In: ICCV (2015)  35. Yu, H., Garrod, O.G., Schyns, P.G.: Perception-driven facial expression synthesis.  Computers & Graphics 36(3) (2012)  36. Zafeiriou, S., Trigeorgis, G., Chrysos, G., Deng, J., Shen, J.: The menpo facial landmark localisation challenge: A step towards the solution. In: CVPRW (2017) 37. Zhang, H., Xu, T., Li, H., Zhang, S., Huang, X., Wang, X., Metaxas, D.: Stack- gan: Text to photo-realistic image synthesis with stacked generative adversarial networks. In: ICCV (2017)  38. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation  using cycle-consistent adversarial networks. In: ICCV (2017)  39. Zhu, S., Fidler, S., Urtasun, R., Lin, D., Loy, C.C.: Be your own prada: Fashion  synthesis with structural coherence. In: ICCV (2017)"}