{"1": "1. Agarwal, S., Mierle, K., Others: Ceres solver. http://ceres-solver.org 2. Alismail, H., Browning, B., Lucey, S.: Photometric Bundle Adjustment for Vision-  Based SLAM. In: Asian Conference on Computer Vision (ACCV) (2016)  3. Atanasov, N., Zhu, M., Daniilidis, K., Pappas, G.J.: Semantic Localization Via the  Matrix Permanent. In: Robotics: Science and Systems (RSS) (2014)  4. Bao, S.Y., Savarese, S.: Semantic structure from motion. In: IEEE Conference on  Computer Vision and Pattern Recognition (CVPR) (2011)  5. Bowman, S.L., Atanasov, N., Daniilidis, K., Pappas, G.J.: Probabilistic data as- sociation for semantic SLAM. In: IEEE International Conference on Robotics and Automation (ICRA) (2017)  6. Cherabier, I., Sch¨onberger, J.L., Oswald, M., Pollefeys, M., Geiger, A.: Learning Priors for Semantic 3D Reconstruction. In: European Conference on Computer Vision (ECCV) (2018)  7. Civera, J., G´alvez-L´opez, D., Riazuelo, L., Tard´os, J.D., Montiel, J.: Towards se- mantic SLAM using a monocular camera. In: IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) (2011)  8. Cohen, A., Sattler, T., Pollefeys, M.: Merging the Unmatchable: Stitching Visually Disconnected SfM Models. In: IEEE International Conference on Computer Vision (ICCV) (2015)  9. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The Cityscapes Dataset for Semantic Urban Scene Understanding. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  10. Davison, A.J., Reid, I.D., Molton, N.D., Stasse, O.: MonoSLAM: Real-time single camera SLAM. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 29(6), 1052-1067 (2007)  11. Dong, J., Fei, X., Soatto, S.: Visual Inertial Semantic Scene Representation for 3D Object Detection. IEEE Conference on Computer Vision and Pattern Recognition (CVPR (2017)  12. Engel, J., Koltun, V., Cremers, D.: Direct Sparse Odometry. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 40(3), 611-625 (2018) 13. Engel, J., Sch¨ops, T., Cremers, D.: LSD-SLAM: Large-scale direct monocular  SLAM. In: European Conference on Computer Vision (ECCV) (2014)  14. Forster, C., Zhang, Z., Gassner, M., Werlberger, M., Scaramuzza, D.: SVO: Semidi- rect Visual Odometry for Monocular and Multicamera Systems. IEEE Transactions on Robotics (T-RO) 33(2), 249-265 (2017)  15. G´alvez-L´opez, D., Salas, M., Tard´os, J.D., Montiel, J.: Real-time monocular object  slam. Robotics and Autonomous Systems 75, 435-449 (2016)  16. Gay, P., Rubino, C., Bansal, V., Del Bue, A.: Probabilistic Structure From Motion With Objects (PSfMO). In: IEEE International Conference on Computer Vision (ICCV) (2017)  17. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for Autonomous Driving? The KITTI Vision Benchmark Suite. In: Conference on Computer Vision and Pattern Recognition (CVPR) (2012)  18. H¨ane, C., Zach, C., Cohen, A., Pollefeys, M.: Dense Semantic 3D Reconstruction. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 39(9), 1730-1743 (2017)   VSO: Visual Semantic OdometryReferences  1. Agarwal, S., Mierle, K., Others: Ceres solver. http://ceres-solver.org 2. Alismail, H., Browning, B., Lucey, S.: Photometric Bundle Adjustment for Vision-  Based SLAM. In: Asian Conference on Computer Vision (ACCV) (2016)  3. Atanasov, N., Zhu, M., Daniilidis, K., Pappas, G.J.: Semantic Localization Via the  Matrix Permanent. In: Robotics: Science and Systems (RSS) (2014)  4. Bao, S.Y., Savarese, S.: Semantic structure from motion. In: IEEE Conference on  Computer Vision and Pattern Recognition (CVPR) (2011)  5. Bowman, S.L., Atanasov, N., Daniilidis, K., Pappas, G.J.: Probabilistic data as- sociation for semantic SLAM. In: IEEE International Conference on Robotics and Automation (ICRA) (2017)  6. Cherabier, I., Sch¨onberger, J.L., Oswald, M., Pollefeys, M., Geiger, A.: Learning Priors for Semantic 3D Reconstruction. In: European Conference on Computer Vision (ECCV) (2018)  7. Civera, J., G´alvez-L´opez, D., Riazuelo, L., Tard´os, J.D., Montiel, J.: Towards se- mantic SLAM using a monocular camera. In: IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) (2011)  8. Cohen, A., Sattler, T., Pollefeys, M.: Merging the Unmatchable: Stitching Visually Disconnected SfM Models. In: IEEE International Conference on Computer Vision (ICCV) (2015)  9. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The Cityscapes Dataset for Semantic Urban Scene Understanding. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  10. Davison, A.J., Reid, I.D., Molton, N.D., Stasse, O.: MonoSLAM: Real-time single camera SLAM. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 29(6), 1052-1067 (2007)  11. Dong, J., Fei, X., Soatto, S.: Visual Inertial Semantic Scene Representation for 3D Object Detection. IEEE Conference on Computer Vision and Pattern Recognition (CVPR (2017)  12. Engel, J., Koltun, V., Cremers, D.: Direct Sparse Odometry. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 40(3), 611-625 (2018) 13. Engel, J., Sch¨ops, T., Cremers, D.: LSD-SLAM: Large-scale direct monocular  SLAM. In: European Conference on Computer Vision (ECCV) (2014)  14. Forster, C., Zhang, Z., Gassner, M., Werlberger, M., Scaramuzza, D.: SVO: Semidi- rect Visual Odometry for Monocular and Multicamera Systems. IEEE Transactions on Robotics (T-RO) 33(2), 249-265 (2017)  15. G´alvez-L´opez, D., Salas, M., Tard´os, J.D., Montiel, J.: Real-time monocular object  slam. Robotics and Autonomous Systems 75, 435-449 (2016)  16. Gay, P., Rubino, C., Bansal, V., Del Bue, A.: Probabilistic Structure From Motion With Objects (PSfMO). In: IEEE International Conference on Computer Vision (ICCV) (2017)  17. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for Autonomous Driving? The KITTI Vision Benchmark Suite. In: Conference on Computer Vision and Pattern Recognition (CVPR) (2012)  18. H¨ane, C., Zach, C., Cohen, A., Pollefeys, M.: Dense Semantic 3D Reconstruction. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 39(9), 1730-1743 (2017)   16  K.-N. Lianos, J.L. Sch¨onberger, M. Pollefeys, and T. Sattler  19. Henry, P., Krainin, M., Herbst, E., Ren, X., Fox, D.: RGB-D mapping: Using Kinect-style depth cameras for dense 3D modeling of indoor environments. Inter- national Journal of Robotics Research (IJRR) 31(5), 647-663 (2012)  20. Jin, H., Favaro, P., Soatto, S.: Real-time 3D motion and structure of point features: a front-end system for vision-based control and interaction. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2000)  21. Klein, G., Murray, D.: Parallel tracking and mapping for small AR workspaces. In: IEEE and ACM International Symposium on Mixed and Augmented Reality (ISMAR) (2007)  22. Kottas, D.G., Roumeliotis, S.I.: Eﬃcient and consistent vision-aided inertial navi- gation using line observations. In: IEEE International Conference on Robotics and Automation (ICRA) (2013)  23. K¨ummerle, R., Grisetti, G., Strasdat, H., Konolige, K., Burgard, W.: G2o: A Gen- eral Framework for Graph Optimization. In: IEEE International Conference on Robotics and Automation (ICRA) (2011)  24. Kundu, A., Li, Y., Dellaert, F., Li, F., Rehg, J.M.: Joint semantic segmentation and 3d reconstruction from monocular video. In: European Conference on Computer Vision (ECCV) (2014)  25. Leibe, B., Cornelis, N., Cornelis, K., Van Gool, L.: Dynamic 3d scene analysis from a moving vehicle. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2007)  26. Leutenegger, S., Lynen, S., Bosse, M., Siegwart, R., Furgale, P.: Keyframe-based visual-inertial odometry using nonlinear optimization. International Journal of Robotics Research (IJRR) 34(3), 314-334 (2015)  27. Levenberg, K.: A method for the solution of certain non-linear problems in least  squares. Quarterly of Applied Mathematics 2(2), 164-168 (1944)  28. Ma, L., Kerl, C., St¨uckler, J., Cremers, D.: CPA-SLAM: Consistent Plane-Model Alignment for Direct RGB-D SLAM. In: IEEE International Conference on Robotics and Automation (ICRA) (2016)  29. Marquardt, D.W.: An algorithm for least-squares estimation of nonlinear parame- ters. Journal of the Society for Industrial and Applied Mathematics 11(2), 431-441 (1963)  30. Middelberg, S., Sattler, T., Untzelmann, O., Kobbelt, L.: Scalable 6-DOF Local- ization on Mobile Devices. In: European Conference on Computer Vision (ECCV) (2014)  31. Mikolajczyk, K., Schmid, C.: A performance evaluation of local descriptors. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 27(10), 1615- 1630 (2005)  32. Mikolajczyk, K., Tuytelaars, T., Schmid, C., Zisserman, A., Matas, J., Schaﬀal- itzky, F., Kadir, T., Van Gool, L.: A comparison of aﬃne region detectors. Inter- national Journal of Computer Vision (IJCV) 65(1), 43-72 (2005)  33. Mourikis, A.I., Trawny, N., Roumeliotis, S.I., Johnson, A.E., Ansar, A., Matthies, L.: Vision-Aided Inertial Navigation for Spacecraft Entry, Descent, and Landing. IEEE Transactions on Robotics (T-RO) 25(2), 264-280 (2009)  34. Mur-Artal, R., Montiel, J.M.M., Tardos, J.D.: ORB-SLAM: a Versatile and Ac- curate Monocular SLAM System. IEEE Transactions on Robotics (T-RO) 31(5), 1147-1163 (2015)  35. Mur-Artal, R., Tard´os, J.D.: ORB-SLAM2: an Open-Source SLAM System for Monocular, Stereo and RGB-D Cameras. IEEE Transactions on Robotics (T-RO) 33(5), 1255-1262 (2017)   VSO: Visual Semantic Odometry36. Newcombe, R.A., Lovegrove, S.J., Davison, A.J.: DTAM: Dense tracking and map- ping in real-time. In: IEEE International Conference on Computer Vision (ICCV). pp. 2320-2327 (2011)  37. Park, S., Sch¨ops, T., Pollefeys, M.: Illumination change robustness in direct visual SLAM. In: IEEE International Conference on Robotics and Automation (ICRA) (2017)  38. Pillai, S., Leonard, J.: Monocular SLAM Supported Object Recognition. In:  Robotics: Science and Systems (RSS) (2015)  39. Pronobis, A.: Semantic Mapping with Mobile Robots. Ph.D. thesis, KTH Royal  Institute of Technology, Stockholm, Sweden (2011)  40. Reid, I.: Towards semantic visual SLAM. In: International Conference on Control  Automation Robotics & Vision (ICARCV) (2014)  41. Richter, S.R., Hayder, Z., Koltun, V.: Playing for Benchmarks. In: IEEE Interna-  tional Conference on Computer Vision (ICCV) (2017)  42. Rusu, R.B., Marton, Z.C., Blodow, N., Dolha, M., Beetz, M.: Towards 3D point cloud based object maps for household environments. Robotics and Autonomous Systems 56(11), 927-941 (2008)  43. Salas-Moreno, R.F., Newcombe, R.A., Strasdat, H., Kelly, P.H., Davison, A.J.: Slam++: Simultaneous localisation and mapping at the level of objects. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2013)  44. Savinov, N., H¨ane, C., Ladick´y, L., Pollefeys, M.: Semantic 3D Reconstruction with Continuous Regularization and Ray Potentials Using a Visibility Consistency Constraint. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  45. Sch¨onberger, J.L., Pollefeys, M., Geiger, A., Sattler, T.: Semantic Visual Localiza- tion. In: Conference on Computer Vision and Pattern Recognition (CVPR) (2018) 46. Strasdat, H., Montiel, J.M.M., Davison, A.J.: Visual slam: Why filter? Image Vision  Computing 30(2), 65-77 (2012)  47. St¨uckler, J., Waldvogel, B., Schulz, H., Behnke, S.: Dense real-time mapping of object-class semantics from RGB-D video. Journal of Real-Time Image Processing 10(4), 599-609 (2015)  48. St¨uhmer, J., Gumhold, S., Cremers, D.: Real-time dense geometry from a handheld  camera. In: Joint Pattern Recognition Symposium (2010)  49. Sturm, J., Engelhard, N., Endres, F., Burgard, W., Cremers, D.: A Benchmark for the Evaluation of RGB-D SLAM Systems. In: IEEE/RSJ International Conference on Intelligent Robot Systems (IROS) (2012)  50. Taneja, A., Ballan, L., Pollefeys, M.: Registration of Spherical Panoramic Images with Cadastral 3D Models. In: International Conference on 3D Imaging, Modeling, Processing, Visualization Transmission (3DIMPVT) (2012)  51. Toft, C., Olsson, C., Kahl, F.: Long-Term 3D Localization and Pose from Seman- tic Labellings. In: IEEE International Conference on Computer Vision (ICCV) Workshops (2017)  52. Vineet, V., Miksik, O., Lidegaard, M., Nießner, M., Golodetz, S., Prisacariu, V.A., K¨ahler, O., Murray, D.W., Izadi, S., P´erez, P., Torr, P.H.S.: Incremental dense semantic stereo fusion for large-scale semantic scene reconstruction. In: IEEE In- ternational Conference on Robotics and Automation (ICRA) (2015)  53. Wang, R., Schw¨orer, M., Cremers, D.: Stereo DSO: Large-Scale Direct Sparse Vi- sual Odometry with Stereo Cameras. In: IEEE International Conference on Com- puter Vision (ICCV) (2017)  54. Yu, F., Koltun, V.: Multi-Scale Context Aggregation by Dilated Convolutions. In:  International Conference on Learning Representations (ICLR) (2016)"}