{"1": "1. Aloimonos, J.: Shape from texture. Biological cybernetics 58(5), 345-360 (1988) 2. Biederman, I.: Recognition-by-components: a theory of human image understand-  ing. Psychological review 94(2), 115 (1987)  3. Borgefors, G.: Distance transformations in digital images. Computer vision, graph-  ics, and image processing 34(3), 344-371 (1986)  4. Braunstein, M.L., Liter, J.C., Tittle, J.S.: Recovering three-dimensional shape from perspective translations and orthographic rotations. Journal of Experimental Psy- chology: Human Perception and Performance 19(3), 598 (1993)  5. Choy, C.B., Xu, D., Gwak, J., Chen, K., Savarese, S.: 3d-r2n2: A unified approach for single and multi-view 3d object reconstruction. In: European Conference on Computer Vision. pp. 628-644. Springer (2016)  6. Dame, A., Prisacariu, V.A., Ren, C.Y., Reid, I.: Dense reconstruction using 3d object shape priors. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1288-1295. IEEE (2013)  7. Fan, H., Su, H., Guibas, L.: A point set generation network for 3d object reconstruc- tion from a single image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. vol. 2, p. 6 (2017)  8. Garg, R., BG, V.K., Carneiro, G., Reid, I.: Unsupervised cnn for single view depth estimation: Geometry to the rescue. In: European Conference on Computer Vision. pp. 740-756. Springer (2016)  9. Girdhar, R., Fouhey, D.F., Rodriguez, M., Gupta, A.: Learning a predictable and generative vector representation for objects. In: European Conference on Computer Vision. pp. 484-499. Springer (2016)  10. Godard, C., Mac Aodha, O., Brostow, G.J.: Unsupervised monocular depth es- timation with left-right consistency. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. vol. 2, p. 7 (2017)  11. H¨ane, C., Tulsiani, S., Malik, J.: Hierarchical surface prediction for 3d object re- construction. In: 3D Vision (3DV), 2017 International Conference on. pp. 412-420. IEEE (2017)  12. Huang, Q., Wang, H., Koltun, V.: Single-view reconstruction via joint analysis of image and shape collections. ACM Transactions on Graphics (TOG) 34(4), 87 (2015)  13. Hming, Klaus, P.G.: The structure-from-motion reconstruction pipeline a sur- vey with focus on short image sequences. Kybernetika 46(5), 926-937 (2010), http://eudml.org/doc/197165  14. Jaderberg, M., Simonyan, K., Zisserman, A., et al.: Spatial transformer networks. In: Advances in neural information processing systems. pp. 2017-2025 (2015) 15. Johnston, A., Garg, R., Carneiro, G., Reid, I., van den Hengel, A.: Scaling cnns for high resolution volumetric reconstruction from a single image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 939-948 (2017)  16. Kar, A., Tulsiani, S., Carreira, J., Malik, J.: Category-specific object reconstruction from a single image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1966-1974 (2015)  17. Kong, C., Lin, C.H., Lucey, S.: Using locally corresponding cad models for dense 3d reconstructions from a single image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. vol. 2 (2017)   Deformation Vector Fields for Object ReconstructionReferences  1. Aloimonos, J.: Shape from texture. Biological cybernetics 58(5), 345-360 (1988) 2. Biederman, I.: Recognition-by-components: a theory of human image understand-  ing. Psychological review 94(2), 115 (1987)  3. Borgefors, G.: Distance transformations in digital images. Computer vision, graph-  ics, and image processing 34(3), 344-371 (1986)  4. Braunstein, M.L., Liter, J.C., Tittle, J.S.: Recovering three-dimensional shape from perspective translations and orthographic rotations. Journal of Experimental Psy- chology: Human Perception and Performance 19(3), 598 (1993)  5. Choy, C.B., Xu, D., Gwak, J., Chen, K., Savarese, S.: 3d-r2n2: A unified approach for single and multi-view 3d object reconstruction. In: European Conference on Computer Vision. pp. 628-644. Springer (2016)  6. Dame, A., Prisacariu, V.A., Ren, C.Y., Reid, I.: Dense reconstruction using 3d object shape priors. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1288-1295. IEEE (2013)  7. Fan, H., Su, H., Guibas, L.: A point set generation network for 3d object reconstruc- tion from a single image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. vol. 2, p. 6 (2017)  8. Garg, R., BG, V.K., Carneiro, G., Reid, I.: Unsupervised cnn for single view depth estimation: Geometry to the rescue. In: European Conference on Computer Vision. pp. 740-756. Springer (2016)  9. Girdhar, R., Fouhey, D.F., Rodriguez, M., Gupta, A.: Learning a predictable and generative vector representation for objects. In: European Conference on Computer Vision. pp. 484-499. Springer (2016)  10. Godard, C., Mac Aodha, O., Brostow, G.J.: Unsupervised monocular depth es- timation with left-right consistency. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. vol. 2, p. 7 (2017)  11. H¨ane, C., Tulsiani, S., Malik, J.: Hierarchical surface prediction for 3d object re- construction. In: 3D Vision (3DV), 2017 International Conference on. pp. 412-420. IEEE (2017)  12. Huang, Q., Wang, H., Koltun, V.: Single-view reconstruction via joint analysis of image and shape collections. ACM Transactions on Graphics (TOG) 34(4), 87 (2015)  13. Hming, Klaus, P.G.: The structure-from-motion reconstruction pipeline a sur- vey with focus on short image sequences. Kybernetika 46(5), 926-937 (2010), http://eudml.org/doc/197165  14. Jaderberg, M., Simonyan, K., Zisserman, A., et al.: Spatial transformer networks. In: Advances in neural information processing systems. pp. 2017-2025 (2015) 15. Johnston, A., Garg, R., Carneiro, G., Reid, I., van den Hengel, A.: Scaling cnns for high resolution volumetric reconstruction from a single image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 939-948 (2017)  16. Kar, A., Tulsiani, S., Carreira, J., Malik, J.: Category-specific object reconstruction from a single image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1966-1974 (2015)  17. Kong, C., Lin, C.H., Lucey, S.: Using locally corresponding cad models for dense 3d reconstructions from a single image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. vol. 2 (2017)   16  K. Li, T. Pham, H. Zhan, I. Reid  18. Kurenkov, A., Ji, J., Garg, A., Mehta, V., Gwak, J., Choy, C., Savarese, S.: De- formnet: Free-form deformation network for 3d shape reconstruction from a single image. arXiv preprint arXiv:1708.04672 (2017)  19. Kutulakos, K.N.: Shape from the light field boundary. In: Computer Vision and Pattern Recognition, 1997. Proceedings., 1997 IEEE Computer Society Conference on. pp. 53-59. IEEE (1997)  20. Kutulakos, K.N., Seitz, S.M.: A theory of shape by space carving. International  journal of computer vision 38(3), 199-218 (2000)  21. Lin, C.H., Kong, C., Lucey, S.: Learning eﬃcient point cloud generation for dense 3d object reconstruction. In: AAAI Conference on Artificial Intelligence (AAAI) (2018)  22. Liu, F., Shen, C., Lin, G.: Deep convolutional neural fields for depth estimation from a single image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5162-5170 (2015)  23. Liu, M., Salzmann, M., He, X.: Discrete-continuous depth estimation from a single image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 716-723. IEEE (2014)  24. Martin, W.N., Aggarwal, J.K.: Volumetric descriptions of objects from multiple views. IEEE transactions on pattern analysis and machine intelligence (2), 150- 158 (1983)  25. Newcombe, R.A., Lovegrove, S.J., Davison, A.J.: Dtam: Dense tracking and map- ping in real-time. In: Computer Vision (ICCV), 2011 IEEE International Confer- ence on. pp. 2320-2327. IEEE (2011)  26. Prados, E., Faugeras, O.: Shape from shading. In: Handbook of mathematical  models in computer vision, pp. 375-388. Springer (2006)  27. Roberts, L.G.: Machine perception of three-dimensional solids. Ph.D. thesis, Mas-  sachusetts Institute of Technology (1963)  28. Saxena, A., Sun, M., Ng, A.Y.: Make3d: Depth perception from a single still image.  In: AAAI. pp. 1571-1576 (2008)  29. Sinha, A., Unmesh, A., Huang, Q., Ramani, K.: Surfnet: Generating 3d shape surfaces using deep residual networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (2017)  30. Su, H., Qi, C.R., Li, Y., Guibas, L.J.: Render for cnn: Viewpoint estimation in images using cnns trained with rendered 3d model views. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 2686-2694 (2015) 31. Sun, et al : Pix3d: Dataset and methods for single-image 3d shape modeling. In:  CVPR (2018)  32. Tatarchenko, M., Dosovitskiy, A., Brox, T.: Octree generating networks: Eﬃ- cient convolutional architectures for high-resolution 3d outputs. In: IEEE Interna- tional Conference on Computer Vision (ICCV) (2017), http://lmb.informatik.uni- freiburg.de/Publications/2017/TDB17b  33. Tatarchenko, M., Dosovitskiy, A., Brox, T.: Multi-view 3d models from single im- ages with a convolutional network. In: European Conference on Computer Vision. pp. 322-337. Springer (2016)  34. Tulsiani, S., Zhou, T., Efros, A.A., Malik, J.: Multi-view supervision for single- view reconstruction via diﬀerentiable ray consistency. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. vol. 1, p. 3 (2017) 35. Wu, J., Wang, Y., Xue, T., Sun, X., Freeman, B., Tenenbaum, J.: Marrnet: 3d shape reconstruction via 2.5 d sketches. In: Advances in neural information processing systems. pp. 540-550 (2017)   Deformation Vector Fields for Object Reconstruction36. Wu, J., Zhang, C., Xue, T., Freeman, B., Tenenbaum, J.: Learning a probabilistic latent space of object shapes via 3d generative-adversarial modeling. In: Advances in Neural Information Processing Systems. pp. 82-90 (2016)  37. Yan, X., Yang, J., Yumer, E., Guo, Y., Lee, H.: Perspective transformer nets: Learning single-view 3d object reconstruction without 3d supervision. In: Advances in Neural Information Processing Systems. pp. 1696-1704 (2016)  38. Zhan, H., Garg, R., Weerasekera, C.S., Li, K., Agarwal, H., Reid, I.: Unsupervised learning of monocular depth estimation and visual odometry with deep feature reconstruction. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 340-349 (2018)"}