{"1": "1. Ankerst, M., Breunig, M.M., Kriegel, H.P., Sander, J.: Optics: ordering points to identify the  clustering structure. In: ACM Sigmod record. vol. 28, pp. 49-60. ACM (1999) 7  2. Bearman, A., Russakovsky, O., Ferrari, V., Fei-Fei, L.: Whats the point: Semantic segmen-  tation with point supervision. In: ECCV. pp. 549-565 (2016) 2, 4, 13  3. Bliek1´u, C., Bonami, P., Lodi, A.: Solving mixed-integer quadratic programming problems with ibm-cplex: a progress report. In: Proceedings of the twenty-sixth RAMP symposium. pp. 16-17 (2014) 3, 9, 14   14  Ruochen Fan, Qibin Hou and Ming-Ming Cheng  compares our results to those from state-of-the-art fully supervised methods. Using only original RGB images with keywords, our method achieves results within 36.9% of the best fully supervised method.  5.4 Efficiency Analysis  We use IBM-CPLEX [3] to solve the MIQP in graph partitioning process. Because our academic version CPLEX restricts the maximum number of variables to be optimized, we use batches of 400 salient instances in implementation. To assign tags for 18878 salient instances extracted from VOC dataset, ⌈18878/400⌉ = 48 batches are processed sequentially, which takes 226M memory and 22.14s on an i7 4770HQ CPU.  6 Conclusions  We have proposed a novel weakly supervised segmentation framework, focusing on generating accurate proxy-ground-truth based on salient instances extracted from the training images and tags assigned to them. In this paper, we introduce salient instances to weakly supervised segmentation, significantly simplifying the object discrimina- tion operation in existing work and enabling our framework to conduct instance-level segmentation. We regard the tag-assignment task as a network partitioning problem which can be solved by a standard approach. In order to improve the accuracy of tag- assignment, both the information from individual salient instances, and from the rela- tionships between all objects in the whole dataset are taken into consideration. Experi- ments show that our method achieves new state-of-the art results on the PASCAL VOC 2012 semantic segmentation benchmark and demonstrated for the first time weakly su- pervised results on the MS COCO instance-level segmentation task using only keyword annotations.  Acknowledgments  This research was supported by the Natural Science Foundation of China (Project Num- ber 61521002, 61620106008, 61572264) and the Joint NSFC-ISF Research Program (project number 61561146393), the national youth talent support program, Tianjin Nat- ural Science Foundation for Distinguished Young Scholars (NO. 17JCJQJC43700), Huawei Innovation Research Program.  References  1. Ankerst, M., Breunig, M.M., Kriegel, H.P., Sander, J.: Optics: ordering points to identify the  clustering structure. In: ACM Sigmod record. vol. 28, pp. 49-60. ACM (1999) 7  2. Bearman, A., Russakovsky, O., Ferrari, V., Fei-Fei, L.: Whats the point: Semantic segmen-  tation with point supervision. In: ECCV. pp. 549-565 (2016) 2, 4, 13  3. Bliek1´u, C., Bonami, P., Lodi, A.: Solving mixed-integer quadratic programming problems with ibm-cplex: a progress report. In: Proceedings of the twenty-sixth RAMP symposium. pp. 16-17 (2014) 3, 9, 14   Associating Inter-Image Salient Instances4. Chaudhry, A., Dokania, P.K., Torr, P.H.: Discovering class-specific pixels for weakly-  supervised semantic segmentation. BMVC (2017) 2, 4, 6, 10, 13  5. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Semantic im- age segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. IEEE TPAMI (2017) 1, 3, 4, 5  6. Cheng, M., Mitra, N.J., Huang, X., Torr, P.H., Hu, S.: Global contrast based salient region  detection. IEEE TPAMI (2015) 4  7. Dai, J., He, K., Sun, J.: Instance-aware semantic segmentation via multi-task network cas- cades. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3150-3158 (2016) 13  8. Dempster, A.P., Laird, N.M., Rubin, D.B.: Maximum likelihood from incomplete data via the em algorithm. Journal of the royal statistical society. Series B (methodological) pp. 1-38 (1977) 4  9. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hier- archical image database. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on. pp. 248-255. IEEE (2009) 7  10. Ester, M., Kriegel, H.P., Sander, J., Xu, X., et al.: A density-based algorithm for discovering  clusters in large spatial databases with noise. In: Kdd. vol. 96, pp. 226-231 (1996) 7  11. Everingham, M., Eslami, S.A., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The  pascal visual object classes challenge: A retrospective. IJCV (2015) 1, 4, 10, 12  12. Fan, R., Hou, Q., Cheng, M.M., Mu, T.J., Hu, S.M.: s4: Single stage salient-instance seg-  mentation. arXiv preprint arXiv:1711.07618 (2017) 2, 5  13. Hariharan, B., Arbel´aez, P., Bourdev, L., Maji, S., Malik, J.: Semantic contours from inverse  detectors. In: ICCV (2011) 10  14. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: Computer Vision (ICCV), 2017  IEEE International Conference on. pp. 2980-2988. IEEE (2017) 3, 5, 13  15. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Pro- ceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016) 6  16. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: CVPR  (2016) 7  17. Hong, S., Yeo, D., Kwak, S., Lee, H., Han, B.: Weakly supervised semantic segmentation  using web-crawled videos. In: CVPR (2017) 4  18. Hou, Q., Cheng, M.M., Hu, X., Borji, A., Tu, Z., Torr, P.: Deeply supervised salient object  detection with short connections. In: CVPR (2017) 4  19. Hou, Q., Dokania, P.K., Massiceti, D., Wei, Y., Cheng, M.M., Torr, P.: Bottom-up top-down  cues for weakly-supervised semantic segmentation. EMMCVPR (2017) 2, 3, 4, 10, 12, 13  20. Hou, Q., Dokania, P.K., Massiceti, D., Wei, Y., Cheng, M.M., Torr, P.: Bottom-up top-down cues for weakly-supervised semantic segmentation. arXiv preprint arXiv:1612.02101 (2016) 2  21. Jiang, H., Wang, J., Yuan, Z., Wu, Y., Zheng, N., Li, S.: Salient object detection: A discrim- inative regional feature integration approach. In: Computer Vision and Pattern Recognition (CVPR), 2013 IEEE Conference on. pp. 2083-2090. IEEE (2013) 4  22. Jin, B., Ortiz Segovia, M.V., Susstrunk, S.: Webly supervised semantic segmentation. In:  CVPR. pp. 3626-3635 (2017) 2, 3, 4, 13  23. Kolesnikov, A., Lampert, C.H.: Seed, expand and constrain: Three principles for weakly-  supervised image segmentation. In: ECCV (2016) 2, 4, 10, 13  24. Li, G., Xie, Y., Lin, L., Yu, Y.: Instance-level salient object segmentation. In: 2017 IEEE Con- ference on Computer Vision and Pattern Recognition (CVPR). pp. 247-256. IEEE (2017) 2   16  Ruochen Fan, Qibin Hou and Ming-Ming Cheng  25. Li, Y., Qi, H., Dai, J., Ji, X., Wei, Y.: Fully convolutional instance-aware semantic segmenta- tion. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). pp. 2359-2367 (2017) 13  26. Lin, D., Dai, J., Jia, J., He, K., Sun, J.: Scribblesup: Scribble-supervised convolutional net-  works for semantic segmentation. In: CVPR (2016) 2, 4, 13  27. Lin, G., Milan, A., Shen, C., Reid, I.: Refinenet: Multi-path refinement networks with iden-  tity mappings for high-resolution semantic segmentation. In: CVPR (2017) 1, 4  28. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick,  C.L.: Microsoft coco: Common objects in context. In: ECCV (2014) 1  29. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation.  In: CVPR (2015) 1, 4  30. MacQueen, J., et al.: Some methods for classification and analysis of multivariate observa- tions. In: Proceedings of the fifth Berkeley symposium on mathematical statistics and prob- ability. vol. 1, pp. 281-297. Oakland, CA, USA (1967) 7  31. Oh, S.J., Benenson, R., Khoreva, A., Akata, Z., Fritz, M., Schiele, B.: Exploiting saliency  for object segmentation from image level labels. In: CVPR (2017) 4, 13  32. Papandreou, G., Chen, L.C., Murphy, K., Yuille, A.L.: Weakly-and semi-supervised learning  of a dcnn for semantic image segmentation. arXiv preprint arXiv:1502.02734 (2015) 4, 13  33. Pathak, D., Krahenbuhl, P., Darrell, T.: Constrained convolutional neural networks for  weakly supervised segmentation. In: ICCV (2015) 4, 13  34. Pinheiro, P.O., Collobert, R.: From image-level to pixel-level labeling with convolutional  networks. In: CVPR (2015) 4, 13  35. Pont-Tuset, J., Arbelaez, P., Barron, J.T., Marques, F., Malik, J.: Multiscale combinatorial grouping for image segmentation and object proposal generation. IEEE TPAMI (2017) 4 36. Qi, X., Liu, Z., Shi, J., Zhao, H., Jia, J.: Augmented feedback in semantic segmentation under  image level supervision. In: ECCV (2016) 2, 4, 13  37. Rokach, L., Maimon, O.: Clustering methods. In: Data mining and knowledge discovery  handbook, pp. 321-352. Springer (2005) 7  38. Roy, A., Todorovic, S.: Combining bottom-up, top-down, and smoothness cues for weakly  supervised image segmentation. In: CVPR (2017) 4, 13  39. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recognition challenge. IJCV (2015) 10  40. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale image recog-  nition. In: ICLR (2015) 6  41. Vezhnevets, A., Ferrari, V., Buhmann, J.M.: Weakly supervised structured output learning  for semantic segmentation. In: CVPR. pp. 845-852. IEEE (2012) 4  42. Wei, Y., Feng, J., Liang, X., Cheng, M.M., Zhao, Y., Yan, S.: Object region mining with adversarial erasing: A simple classification to semantic segmentation approach. In: CVPR (2017) 2, 3, 4, 10, 13  43. Wei, Y., Liang, X., Chen, Y., Shen, X., Cheng, M.M., Feng, J., Zhao, Y., Yan, S.: Stc: A simple to complex framework for weakly-supervised semantic segmentation. IEEE TPAMI (2016) 2, 4, 13  44. Wen, Y., Zhang, K., Li, Z., Qiao, Y.: A discriminative feature learning approach for deep face recognition. In: European Conference on Computer Vision. pp. 499-515. Springer (2016) 7, 10  45. Zhang, J., Lin, Z., Brandt, J., Shen, X., Sclaroff, S.: Top-down neural attention by excitation  46. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In: CVPR (2017)  backprop. In: ECCV (2016) 4  1, 4   Associating Inter-Image Salient Instances47. Zheng, S., Jayasumana, S., Romera-Paredes, B., Vineet, V., Su, Z., Du, D., Huang, C., Torr,  P.H.: Conditional random fields as recurrent neural networks. In: ICCV (2015) 1, 4  48. Zhou, B., Khosla, A., Lapedriza, A., Oliva, A., Torralba, A.: Learning deep features for  discriminative localization. In: CVPR (2016) 4, 5"}