{"1": "1. Anguelov, D., Srinivasan, P., Koller, D., Thrun, S., Rodgers, J., Davis, J.: Scape: Shape completion and animation of people. ACM Trans. Graph. 24(3), 408-416 (Jul 2005)  2. Baak, A., Helten, T., M¨uller, M., Pons-Moll, G., Rosenhahn, B., Seidel, H.P.: Analyzing and evaluating markerless motion tracking using inertial sensors. In: European Conference on Computer Vision (ECCV Workshops) (Sep 2010)  3. Bogo, F., Kanazawa, A., Lassner, C., Gehler, P., Romero, J., Black, M.J.: Keep it SMPL: Automatic estimation of 3D human pose and shape from a single image. In: Computer Vision - ECCV 2016. Lecture Notes in Computer Science, Springer International Publishing (Oct 2016)  4. Bradley, D., Popa, T., Sheﬀer, A., Heidrich, W., Boubekeur, T.: Markerless garment  capture. In: ACM TOG. vol. 27, p. 99. ACM (2008)  5. Brox, T., Rosenhahn, B., Gall, J., Cremers, D.: Combined region and motion-based 3d tracking of rigid and articulated objects. IEEE TPAMI 32(3), 402-415 (2010) 6. Dou, M., Davidson, P., Fanello, S.R., Khamis, S., Kowdle, A., Rhemann, C., Tankovich, V., Izadi, S.: Motion2fusion: Real-time volumetric performance cap- ture. ACM Trans. Graph. 36(6), 246:1-246:16 (Nov 2017)  7. Dou, M., Khamis, S., Degtyarev, Y., Davidson, P., Fanello, S.R., Kowdle, A., Es- colano, S.O., Rhemann, C., Kim, D., Taylor, J., et al.: Fusion4d: real-time perfor- mance capture of challenging scenes. ACM TOG 35(4), 114 (2016)  8. Gall, J., Stoll, C., De Aguiar, E., Theobalt, C., Rosenhahn, B., Seidel, H.P.: Motion capture using joint skeleton tracking and surface estimation. In: CVPR. pp. 1746- 1753. IEEE (2009)  9. Guo, K., Xu, F., Wang, Y., Liu, Y., Dai, Q.: Robust non-rigid motion tracking and surface reconstruction using l0 regularization. In: ICCV. pp. 3083-3091 (2015) 10. Guo, K., Xu, F., Yu, T., Liu, X., Dai, Q., Liu, Y.: Real-time geometry, albedo and motion reconstruction using a single rgbd camera. ACM Transactions on Graphics (TOG) (2017)  11. Helten, T., Muller, M., Seidel, H.P., Theobalt, C.: Real-time body tracking with one depth camera and inertial sensors. In: The IEEE International Conference on Computer Vision (ICCV) (December 2013)  12. Innmann, M., Zollh¨ofer, M., Nießner, M., Theobalt, C., Stamminger, M.: Vol- umedeform: Real-time volumetric non-rigid reconstruction. In: ECCV (2016) 13. Joo, H., Simon, T., Sheikh, Y.: Total capture: A 3d deformation model for tracking  faces, hands, and bodies. In: CVPR. IEEE (2018)  14. Leroy, V., Franco, J.S., Boyer, E.: Multi-view dynamic shape refinement using local  temporal integration. In: ICCV. IEEE (2017)  15. Li, H., Adams, B., Guibas, L.J., Pauly, M.: Robust single-view geometry and mo-  tion reconstruction. In: ACM TOG. vol. 28, p. 175. ACM (2009)  16. Liao, M., Zhang, Q., Wang, H., Yang, R., Gong, M.: Modeling deformable objects  from a single depth camera. In: ICCV (2009)  17. Liu, Y., Gall, J., Stoll, C., Dai, Q., Seidel, H., Theobalt, C.: Markerless motion capture of multiple characters using multiview image segmentation. IEEE Trans. Pattern Anal. Mach. Intell. 35(11), 2720-2735 (2013)  18. Loper, M., Mahmood, N., Romero, J., Pons-Moll, G., Black, M.J.: SMPL: A skinned multi-person linear model. ACM Trans. Graphics (Proc. SIGGRAPH Asia) 34(6), 248:1-248:16 (Oct 2015)   HybridFusionReferences  1. Anguelov, D., Srinivasan, P., Koller, D., Thrun, S., Rodgers, J., Davis, J.: Scape: Shape completion and animation of people. ACM Trans. Graph. 24(3), 408-416 (Jul 2005)  2. Baak, A., Helten, T., M¨uller, M., Pons-Moll, G., Rosenhahn, B., Seidel, H.P.: Analyzing and evaluating markerless motion tracking using inertial sensors. In: European Conference on Computer Vision (ECCV Workshops) (Sep 2010)  3. Bogo, F., Kanazawa, A., Lassner, C., Gehler, P., Romero, J., Black, M.J.: Keep it SMPL: Automatic estimation of 3D human pose and shape from a single image. In: Computer Vision - ECCV 2016. Lecture Notes in Computer Science, Springer International Publishing (Oct 2016)  4. Bradley, D., Popa, T., Sheﬀer, A., Heidrich, W., Boubekeur, T.: Markerless garment  capture. In: ACM TOG. vol. 27, p. 99. ACM (2008)  5. Brox, T., Rosenhahn, B., Gall, J., Cremers, D.: Combined region and motion-based 3d tracking of rigid and articulated objects. IEEE TPAMI 32(3), 402-415 (2010) 6. Dou, M., Davidson, P., Fanello, S.R., Khamis, S., Kowdle, A., Rhemann, C., Tankovich, V., Izadi, S.: Motion2fusion: Real-time volumetric performance cap- ture. ACM Trans. Graph. 36(6), 246:1-246:16 (Nov 2017)  7. Dou, M., Khamis, S., Degtyarev, Y., Davidson, P., Fanello, S.R., Kowdle, A., Es- colano, S.O., Rhemann, C., Kim, D., Taylor, J., et al.: Fusion4d: real-time perfor- mance capture of challenging scenes. ACM TOG 35(4), 114 (2016)  8. Gall, J., Stoll, C., De Aguiar, E., Theobalt, C., Rosenhahn, B., Seidel, H.P.: Motion capture using joint skeleton tracking and surface estimation. In: CVPR. pp. 1746- 1753. IEEE (2009)  9. Guo, K., Xu, F., Wang, Y., Liu, Y., Dai, Q.: Robust non-rigid motion tracking and surface reconstruction using l0 regularization. In: ICCV. pp. 3083-3091 (2015) 10. Guo, K., Xu, F., Yu, T., Liu, X., Dai, Q., Liu, Y.: Real-time geometry, albedo and motion reconstruction using a single rgbd camera. ACM Transactions on Graphics (TOG) (2017)  11. Helten, T., Muller, M., Seidel, H.P., Theobalt, C.: Real-time body tracking with one depth camera and inertial sensors. In: The IEEE International Conference on Computer Vision (ICCV) (December 2013)  12. Innmann, M., Zollh¨ofer, M., Nießner, M., Theobalt, C., Stamminger, M.: Vol- umedeform: Real-time volumetric non-rigid reconstruction. In: ECCV (2016) 13. Joo, H., Simon, T., Sheikh, Y.: Total capture: A 3d deformation model for tracking  faces, hands, and bodies. In: CVPR. IEEE (2018)  14. Leroy, V., Franco, J.S., Boyer, E.: Multi-view dynamic shape refinement using local  temporal integration. In: ICCV. IEEE (2017)  15. Li, H., Adams, B., Guibas, L.J., Pauly, M.: Robust single-view geometry and mo-  tion reconstruction. In: ACM TOG. vol. 28, p. 175. ACM (2009)  16. Liao, M., Zhang, Q., Wang, H., Yang, R., Gong, M.: Modeling deformable objects  from a single depth camera. In: ICCV (2009)  17. Liu, Y., Gall, J., Stoll, C., Dai, Q., Seidel, H., Theobalt, C.: Markerless motion capture of multiple characters using multiview image segmentation. IEEE Trans. Pattern Anal. Mach. Intell. 35(11), 2720-2735 (2013)  18. Loper, M., Mahmood, N., Romero, J., Pons-Moll, G., Black, M.J.: SMPL: A skinned multi-person linear model. ACM Trans. Graphics (Proc. SIGGRAPH Asia) 34(6), 248:1-248:16 (Oct 2015)   16  Z. Zheng et al.  19. Lorensen, W.E., Cline, H.E.: Marching cubes: A high resolution 3d surface con- struction algorithm. In: Proceedings of the 14th Annual Conference on Computer Graphics and Interactive Techniques. pp. 163-169. SIGGRAPH ’87, ACM, New York, NY, USA (1987)  20. Malleson, C., Volino, M., Gilbert, A., Trumble, M., Collomosse, J., Hilton, A.: Real- time full-body motion capture from video and imus. In: 2017 Fifth International Conference on 3D Vision (3DV) (2017)  21. von Marcard, T., Henschel, R., Black, M., Rosenhahn, B., Pons-Moll, G.: Recov- ering accurate 3d human pose in the wild using imus and a moving camera. In: European Conference on Computer Vision (sep 2018)  22. von Marcard, T., Pons-Moll, G., Rosenhahn, B.: Human pose estimation from video and imus. Transactions on Pattern Analysis and Machine Intelligence PAMI (Jan 2016)  23. Mitra, N.J., Fl¨ory, S., Ovsjanikov, M., Gelfand, N., Guibas, L.J., Pottmann, H.:  Dynamic geometry registration. In: SGP. pp. 173-182 (2007)  24. Mustafa, A., Kim, H., Guillemaut, J., Hilton, A.: General dynamic scene recon- struction from multiple view video. In: 2015 IEEE International Conference on Computer Vision, ICCV 2015, Santiago, Chile, December 7-13, 2015. pp. 900-908 (2015)  25. Newcombe, R.A., Fox, D., Seitz, S.M.: Dynamicfusion: Reconstruction and tracking  of non-rigid scenes in real-time. In: CVPR (June 2015)  26. Newcombe, R.A., Fox, D., Seitz, S.M.: Dynamicfusion: Reconstruction and tracking of non-rigid scenes in real-time. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2015)  27. Pekelny, Y., Gotsman, C.: Articulated object reconstruction and markerless motion capture from depth video. In: CGF. vol. 27, pp. 399-408. Wiley Online Library (2008)  28. Pons-Moll, G., Baak, A., Gall, J., Leal-Taixe, L., Mueller, M., Seidel, H.P., Rosen- hahn, B.: Outdoor human motion capture using inverse kinematics and von mises- fisher sampling. In: IEEE International Conference on Computer Vision (ICCV). pp. 1243-1250 (nov 2011)  29. Pons-Moll, G., Baak, A., Helten, T., M¨uller, M., Seidel, H.P., Rosenhahn, B.: Multisensor-fusion for 3d full-body human motion capture. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (jun 2010)  30. Pons-Moll, G., Pujades, S., Hu, S., Black, M.: ClothCap: Seamless 4D clothing cap- ture and retargeting. ACM Transactions on Graphics, (Proc. SIGGRAPH) 36(4) (2017), two first authors contributed equally  31. Pons-Moll, G., Romero, J., Mahmood, N., Black, M.J.: Dyna: A model of dynamic human shape in motion. ACM Transactions on Graphics, (Proc. SIGGRAPH) 34(4), 120:1-120:14 (Aug 2015)  32. Slavcheva, M., Baust, M., Cremers, D., Ilic, S.: KillingFusion: Non-rigid 3D Re- construction without Correspondences. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  33. Slavcheva, M., Baust, M., Ilic, S.: SobolevFusion: 3D Reconstruction of Scenes Undergoing Free Non-rigid Motion. In: IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) (2018)  34. Slyper, R., Hodgins, J.: Action Capture with Accelerometers. In: Gross, M., James, D. (eds.) Eurographics/SIGGRAPH Symposium on Computer Animation. The Eurographics Association (2008)  35. Sumner, R.W., Schmid, J., Pauly, M.: Embedded deformation for shape manipu- lation. In: SIGGRAPH. SIGGRAPH ’07, ACM, New York, NY, USA (2007)   HybridFusion36. S¨ußmuth, J., Winter, M., Greiner, G.: Reconstructing animated meshes from time- varying point clouds. In: CGF. vol. 27, pp. 1469-1476. Blackwell Publishing Ltd (2008)  37. Tautges, J., Zinke, A., Kr¨uger, B., Baumann, J., Weber, A., Helten, T., M¨uller, M., Seidel, H.P., Eberhardt, B.: Motion reconstruction using sparse accelerometer data. ACM Trans. Graph. 30(3), 18:1-18:12 (May 2011)  38. Tevs, A., Berner, A., Wand, M., Ihrke, I., Bokeloh, M., Kerber, J., Seidel, H.P.: Animation cartography-intrinsic reconstruction of shape and motion. ACM TOG 31(2), 12 (2012)  39. Tkach, A., Tagliasacchi, A., Remelli, E., Pauly, M., Fitzgibbon, A.: Online gener- ative model personalization for hand tracking. ACM Trans. Graph. 36(6), 243:1- 243:11 (Nov 2017)  40. Vlasic, D., Adelsberger, R., Vannucci, G., Barnwell, J., Gross, M., Matusik, W., Popovi, J.: Practical motion capture in everyday surroundings. In: in Proc. SIG- GRAPH 2007, ACM (2007)  41. Vlasic, D., Baran, I., Matusik, W., Popovi´c, J.: Articulated mesh animation from  multi-view silhouettes. In: ACM TOG. vol. 27, p. 97. ACM (2008)  42. von Marcard, T., Rosenhahn, B., Black, M., Pons-Moll, G.: Sparse inertial poser: Automatic 3d human pose estimation from sparse imus. Computer Graphics Forum 36(2), Proceedings of the 38th Annual Conference of the European Association for Computer Graphics (Eurographics) pp. 349-360 (2017)  43. Xu, W., Chatterjee, A., Zoll¨ofer, M., Rhodin, H., Mehta, D., Seidel, H.P., Theobalt, C.: MonoPerfCap: Human Performance Capture from Monocular Video. ACM TOG (2017)  44. Ye, G., Liu, Y., Hasler, N., Ji, X., Dai, Q., Theobalt, C.: Performance capture of  interacting characters with handheld kinects. In: ECCV (2012)  45. Yu, T., Guo, K., Xu, F., Dong, Y., Su, Z., Zhao, J., Li, J., Dai, Q., Liu, Y.: Bodyfusion: Real-time capture of human motion and surface geometry using a single depth camera. In: The IEEE International Conference on Computer Vision (ICCV). ACM (October 2017)  46. Yu, T., Zheng, Z., Guo, K., Zhao, J., Dai, Q., Li, H., Pons-Moll, G., Liu, Y.: Dou- blefusion: Real-time capture of human performance with inner body shape from a depth sensor. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2018)  47. Zollh¨ofer, M., Nießner, M., Izadi, S., Rehmann, C., Zach, C., Fisher, M., Wu, C., Fitzgibbon, A., Loop, C., Theobalt, C., et al.: Real-time non-rigid reconstruction using an rgb-d camera. ACM TOG 33(4), 156 (2014)  48. Zou, D., Tan, P.: Coslam: Collaborative visual slam in dynamic environments. IEEE Transactions on Pattern Analysis and Machine Intelligence 35(2), 354-366 (Feb 2013)"}