{"1": "1. Tian, Z., Huang, W., He, T., He, P., Qiao, Y.: Detecting text in natural image with connectionist text proposal network. In: European Conference on Computer Vision, Springer (2016) 56-72  2. Zhang, Z., Zhang, C., Shen, W., Yao, C., Liu, W., Bai, X.: Multi-oriented text de- tection with fully convolutional networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 4159-4167  3. Yin, X.C., Pei, W.Y., Zhang, J., Hao, H.W.: Multi-orientation scene text detection IEEE transactions on pattern analysis and machine  with adaptive clustering. intelligence 37(9) (2015) 1930-1937  4. Jaderberg, M., Simonyan, K., Vedaldi, A., Zisserman, A.: Reading text in the wild International Journal of Computer Vision  with convolutional neural networks. 116(1) (2016) 1-20  5. He, T., Huang, W., Qiao, Y., Yao, J.: Text-attentional convolutional neural network for scene text detection. IEEE transactions on image processing 25(6) (2016) 2529- 2541  6. He, P., Huang, W., Qiao, Y., Loy, C.C., Tang, X.: Reading scene text in deep  convolutional sequences. In: AAAI. (2016) 3501-3508  7. Busta, M., Neumann, L., Matas, J.: Fastext: Eﬃcient unconstrained scene text In: Proceedings of the IEEE International Conference on Computer  detector. Vision. (2015) 1206-1214  8. Gupta, A., Vedaldi, A., Zisserman, A.: Synthetic data for text localisation in natural images. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 2315-2324  9. Chen, X., Yuille, A.L.: Detecting and reading text in natural scenes. In: Computer Vision and Pattern Recognition, 2004. CVPR 2004. Proceedings of the 2004 IEEE Computer Society Conference on. Volume 2., IEEE (2004) II-II  10. Zhong, Z., Jin, L., Zhang, S., Feng, Z.: Deeptext: A unified framework for text proposal generation and text detection in natural images. arXiv preprint arXiv:1605.07314 (2016)  11. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object detection with region proposal networks. IEEE transactions on pattern analysis and machine intelligence 39(6) (2017) 1137-1149  12. Epshtein, B., Ofek, E., Wexler, Y.: Detecting text in natural scenes with stroke In: Computer Vision and Pattern Recognition (CVPR), 2010  width transform. IEEE Conference on, IEEE (2010) 2963-2970  13. He, W., Zhang, X.Y., Yin, F., Liu, C.L.: Deep direct regression for multi-oriented  scene text detection. arXiv preprint arXiv:1703.08289 (2017)  14. Xiong, B., Grauman, K.: Text detection in stores using a repetition prior. In: Ap- plications of Computer Vision (WACV), 2016 IEEE Winter Conference on, IEEE (2016) 1-9  15. Rong, X., Yi, C., Tian, Y.: Unambiguous text localization and retrieval for clut- tered scenes. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 5494-5502  16. Uijlings, J.R., Van De Sande, K.E., Gevers, T., Smeulders, A.W.: Selective search International journal of computer vision 104(2) (2013)  for object recognition. 154-171  17. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2014) 580-587   Using Object Information for Spotting TextReferences  1. Tian, Z., Huang, W., He, T., He, P., Qiao, Y.: Detecting text in natural image with connectionist text proposal network. In: European Conference on Computer Vision, Springer (2016) 56-72  2. Zhang, Z., Zhang, C., Shen, W., Yao, C., Liu, W., Bai, X.: Multi-oriented text de- tection with fully convolutional networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 4159-4167  3. Yin, X.C., Pei, W.Y., Zhang, J., Hao, H.W.: Multi-orientation scene text detection IEEE transactions on pattern analysis and machine  with adaptive clustering. intelligence 37(9) (2015) 1930-1937  4. Jaderberg, M., Simonyan, K., Vedaldi, A., Zisserman, A.: Reading text in the wild International Journal of Computer Vision  with convolutional neural networks. 116(1) (2016) 1-20  5. He, T., Huang, W., Qiao, Y., Yao, J.: Text-attentional convolutional neural network for scene text detection. IEEE transactions on image processing 25(6) (2016) 2529- 2541  6. He, P., Huang, W., Qiao, Y., Loy, C.C., Tang, X.: Reading scene text in deep  convolutional sequences. In: AAAI. (2016) 3501-3508  7. Busta, M., Neumann, L., Matas, J.: Fastext: Eﬃcient unconstrained scene text In: Proceedings of the IEEE International Conference on Computer  detector. Vision. (2015) 1206-1214  8. Gupta, A., Vedaldi, A., Zisserman, A.: Synthetic data for text localisation in natural images. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 2315-2324  9. Chen, X., Yuille, A.L.: Detecting and reading text in natural scenes. In: Computer Vision and Pattern Recognition, 2004. CVPR 2004. Proceedings of the 2004 IEEE Computer Society Conference on. Volume 2., IEEE (2004) II-II  10. Zhong, Z., Jin, L., Zhang, S., Feng, Z.: Deeptext: A unified framework for text proposal generation and text detection in natural images. arXiv preprint arXiv:1605.07314 (2016)  11. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object detection with region proposal networks. IEEE transactions on pattern analysis and machine intelligence 39(6) (2017) 1137-1149  12. Epshtein, B., Ofek, E., Wexler, Y.: Detecting text in natural scenes with stroke In: Computer Vision and Pattern Recognition (CVPR), 2010  width transform. IEEE Conference on, IEEE (2010) 2963-2970  13. He, W., Zhang, X.Y., Yin, F., Liu, C.L.: Deep direct regression for multi-oriented  scene text detection. arXiv preprint arXiv:1703.08289 (2017)  14. Xiong, B., Grauman, K.: Text detection in stores using a repetition prior. In: Ap- plications of Computer Vision (WACV), 2016 IEEE Winter Conference on, IEEE (2016) 1-9  15. Rong, X., Yi, C., Tian, Y.: Unambiguous text localization and retrieval for clut- tered scenes. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 5494-5502  16. Uijlings, J.R., Van De Sande, K.E., Gevers, T., Smeulders, A.W.: Selective search International journal of computer vision 104(2) (2013)  for object recognition. 154-171  17. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2014) 580-587   16  S. Prasad and A. W. K. Kong  18. Girshick, R.: Fast r-cnn. In: Proceedings of the IEEE international conference on  computer vision. (2015) 1440-1448  19. Chen, H., Tsai, S.S., Schroth, G., Chen, D.M., Grzeszczuk, R., Girod, B.: Robust text detection in natural images with edge-enhanced maximally stable extremal regions. In: Image Processing (ICIP), 2011 18th IEEE International Conference on, IEEE (2011) 2609-2612  20. Huang, W., Lin, Z., Yang, J., Wang, J.: Text localization in natural images using stroke feature transform and text covariance descriptors. In: Proceedings of the IEEE International Conference on Computer Vision. (2013) 1241-1248  21. Huang, W., Qiao, Y., Tang, X.: Robust scene text detection with convolution neural network induced mser trees. In: European Conference on Computer Vision, Springer (2014) 497-511  22. Yi, C., Tian, Y.: Text extraction from scene images by character appearance and structure modeling. Computer Vision and Image Understanding 117(2) (2013) 182-194  23. Yi, C., Tian, Y.: Text string detection from natural scenes by structure-based IEEE Transactions on Image Processing 20(9) (2011)  partition and grouping. 2594-2605  24. Neumann, L., Matas, J.: Real-time scene text localization and recognition. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 3538-3545  25. Minetto, R., Thome, N., Cord, M., Leite, N.J., Stolfi, J.: Snoopertext: A text detection system for automatic indexing of urban scenes. Computer Vision and Image Understanding 122 (2014) 92-104  26. Wang, K., Babenko, B., Belongie, S.: End-to-end scene text recognition. In: Com- puter Vision (ICCV), 2011 IEEE International Conference on, IEEE (2011) 1457- 1464  27. Anthimopoulos, M., Gatos, B., Pratikakis, I.: Detection of artificial and scene text in images and video frames. Pattern Analysis and Applications 16(3) (2013) 431-446  28. Posner, I., Corke, P., Newman, P.: Using text-spotting to query the world. In: Intelligent Robots and Systems (IROS), 2010 IEEE/RSJ International Conference on, IEEE (2010) 3181-3186  29. Wang, T., Wu, D.J., Coates, A., Ng, A.Y.: End-to-end text recognition with convo- lutional neural networks. In: Pattern Recognition (ICPR), 2012 21st International Conference on, IEEE (2012) 3304-3308  30. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd: Single shot multibox detector. In: European conference on computer vision, Springer (2016) 21-37  31. Liao, M., Shi, B., Bai, X., Wang, X., Liu, W.: Textboxes: A fast text detector with  a single deep neural network. In: AAAI. (2017) 4161-4167  32. Gidaris, S., Komodakis, N.: Object detection via a multi-region and semantic segmentation-aware cnn model. In: Proceedings of the IEEE International Confer- ence on Computer Vision. (2015) 1134-1142  33. Van de Sande, K.E., Uijlings, J.R., Gevers, T., Smeulders, A.W.: Segmentation as selective search for object recognition. In: Computer Vision (ICCV), 2011 IEEE International Conference on, IEEE (2011) 1879-1886  34. Arbel´aez, P., Pont-Tuset, J., Barron, J.T., Marques, F., Malik, J.: Multiscale In: Proceedings of the IEEE conference on computer  combinatorial grouping. vision and pattern recognition. (2014) 328-335   Using Object Information for Spotting Text35. Zitnick, C.L., Doll´ar, P.: Edge boxes: Locating object proposals from edges. In:  European Conference on Computer Vision, Springer (2014) 391-405  36. Liao, M., Shi, B., Bai, X.: Textboxes++: A single-shot oriented scene text detector.  arXiv preprint arXiv:1801.02765 (2018)  37. Zhou, X., Yao, C., Wen, H., Wang, Y., Zhou, S., He, W., Liang, J.: East: an eﬃcient and accurate scene text detector. arXiv preprint arXiv:1704.03155 (2017) 38. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)  39. Park, E., Han, X., Berg, T.L., Berg, A.C.: Combining multiple sources of knowledge in deep cnns for action recognition. In: Applications of Computer Vision (WACV), 2016 IEEE Winter Conference on, IEEE (2016) 1-8  40. Yang, J., Liu, Q., Zhang, K.: Stacked hourglass network for robust facial landmark localisation. In: Computer Vision and Pattern Recognition Workshops (CVPRW), 2017 IEEE Conference on, IEEE (2017) 2025-2033  41. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti-  mation. In: European Conference on Computer Vision, Springer (2016) 483-499  42. Ma, J., Shao, W., Ye, H., Wang, L., Wang, H., Zheng, Y., Xue, X.: Arbitrary-oriented scene text detection via rotation proposals. arXiv preprint arXiv:1703.01086 (2017)  43. Veit, A., Matera, T., Neumann, L., Matas, J., Belongie, S.: Coco-text: Dataset and benchmark for text detection and recognition in natural images. arXiv preprint arXiv:1601.07140 (2016)  44. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision, Springer (2014) 740-755  45. Larsson, F., Felsberg, M., et al.: Using fourier descriptors and spatial models for  traﬃc sign recognition. In: SCIA. Volume 11., Springer (2011) 238-249  46. Lyu, P., Yao, C., Wu, W., Yan, S., Bai, X.: Multi-oriented scene text detection via corner localization and region segmentation. arXiv preprint arXiv:1802.08948 (2018)  47. Kang, L., Li, Y., Doermann, D.: Orientation robust text line detection in natural images. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2014) 4034-4041  48. Yao, C., Bai, X., Liu, W., Ma, Y., Tu, Z.: Detecting texts of arbitrary orientations in natural images. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 1083-1090  49. Yin, X.C., Yin, X., Huang, K., Hao, H.W.: Robust text detection in natural scene IEEE transactions on pattern analysis and machine intelligence 36(5)  images. (2014) 970-983  50. Yao, C., Bai, X., Sang, N., Zhou, X., Zhou, S., Cao, Z.: Scene text detection via  holistic, multi-channel prediction. arXiv preprint arXiv:1606.09002 (2016)  51. Shi, B., Bai, X., Belongie, S.: Detecting oriented text in natural images by linking  segments. arXiv preprint arXiv:1703.06520 (2017)  52. Mao, J., Li, H., Zhou, W., Yan, S., Tian, Q.: Scale based region growing for scene text detection. In: Proceedings of the 21st ACM international conference on Multimedia, ACM (2013) 1007-1016  53. Zhang, Z., Shen, W., Yao, C., Bai, X.: Symmetry-based text line detection in natural scenes. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 2558-2567  54. Buˇsta, M., Neumann, L., Matas, J.: Deep textspotter: An end-to-end trainable  scene text localization and recognition framework. (2017)   18  S. Prasad and A. W. K. Kong  55. He, P., Huang, W., He, T., Zhu, Q., Qiao, Y., Li, X.: Single shot text detector with regional attention. In: The IEEE International Conference on Computer Vision (ICCV). (2017)"}