{"1": "1. Activitynet challenge 2016. http://activity-net.org/challenges/2016/ (2016) 2. Aggarwal, J.K., Ryoo, M.S.: Human activity analysis: A review. In: ACM Com-  puting Surveys (2011)  3. Asadi-Aghbolaghi, M., Clap´es, A., Bellantonio, M., Escalante, H.J., Ponce-L´opez, V., Bar´o, X., Guyon, I., Kasaei, S., Escalera, S.: A survey on deep learning based approaches for action and gesture recognition in image sequences. In: FG (2017) 4. Bearman, A., Russakovsky, O., Ferrari, V., Fei-Fei, L.: Whats the point: Semantic  segmentation with point supervision. In: ECCV (2016)  5. Bilen, H., Vedaldi, A.: Weakly supervised deep detection networks. In: CVPR  (2016)  6. Buch, S., Escorcia, V., Ghanem, B., Fei-Fei, L., Niebles, J.C.: End-to-end, single-  stream temporal action detection in untrimmed videos. In: BMVC (2017)  7. Buch, S., Escorcia, V., Shen, C., Ghanem, B., Niebles, J.C.: Sst: Single-stream  temporal action proposals. In: CVPR (2017)  8. Carreira, J., Zisserman, A.: Quo vadis, action recognition? a new model and the  kinetics dataset. In: CVPR (2017)  9. Chen, Y., Jin, X., Feng, J., Yan, S.: Training group orthogonal neural networks  with privileged information. In: IJCAI (2017)  10. Chen, Y., Jin, X., Kang, B., Feng, J., Yan, S.: Sharing residual units through  collective tensor factorization in deep neural networks. In: IJCAI (2018)  11. Chen, Y., Kalantidis, Y., Li, J., Yan, S., Feng, J.: Multi-fiber networks for video  12. Chen, Y., Li, J., Xiao, H., Jin, X., Yan, S., Feng, J.: Dual path networks. In: NIPS  recognition. In: ECCV (2018)  (2017)  13. Cheng, G., Wan, Y., Saudagar, A.N., Namuduri, K., Buckles, B.P.: Advances in human action recognition: A survey (2015), http://arxiv.org/abs/1501.05964 14. Dai, X., Singh, B., Zhang, G., Davis, L.S., Chen, Y.Q.: Temporal context network  for activity localization in videos. In: ICCV (2017)  15. Dave, A., Russakovsky, O., Ramanan, D.: Predictive-corrective networks for action  detection. In: CVPR (2017)  16. Dietterich, T.G., Lathrop, R.H., Lozano-P´erez, T.: Solving the multiple instance  problem with axis-parallel rectangles (1997)  17. Donahue, J., Hendricks, L.A., Guadarrama, S., Rohrbach, M., Venugopalan, S., Saenko, K., Darrell, T.: Long-term recurrent convolutional networks for visual recognition and description. In: CVPR (2015)  18. Durand, T., Mordan, T., Thome, N., Cord, M.: Wildcat: Weakly supervised learn- ing of deep convnets for image classification, pointwise localization and segmenta- tion. In: CVPR (2017)  19. Escorcia, V., Heilbron, F.C., Niebles, J.C., Ghanem, B.: Daps: Deep action pro-  posals for action understanding. In: ECCV (2016)  20. Gao, J., Chen, K., Nevatia, R.: Ctap: Complementary temporal action proposal  21. Gao, J., Yang, Z., Nevatia, R.: Cascaded boundary regression for temporal action  generation. ECCV (2018)  detection. In: BMVC (2017)  22. Gao, J., Yang, Z., Sun, C., Chen, K., Nevatia, R.: Turn tap: Temporal unit regres-  sion network for temporal action proposals. In: ICCV (2017)  23. Girshick, R.: Fast r-cnn. In: ICCV (2015)   AutoLoc: Weakly-supervised Temporal Action LocalizationReferences  1. Activitynet challenge 2016. http://activity-net.org/challenges/2016/ (2016) 2. Aggarwal, J.K., Ryoo, M.S.: Human activity analysis: A review. In: ACM Com-  puting Surveys (2011)  3. Asadi-Aghbolaghi, M., Clap´es, A., Bellantonio, M., Escalante, H.J., Ponce-L´opez, V., Bar´o, X., Guyon, I., Kasaei, S., Escalera, S.: A survey on deep learning based approaches for action and gesture recognition in image sequences. In: FG (2017) 4. Bearman, A., Russakovsky, O., Ferrari, V., Fei-Fei, L.: Whats the point: Semantic  segmentation with point supervision. In: ECCV (2016)  5. Bilen, H., Vedaldi, A.: Weakly supervised deep detection networks. In: CVPR  (2016)  6. Buch, S., Escorcia, V., Ghanem, B., Fei-Fei, L., Niebles, J.C.: End-to-end, single-  stream temporal action detection in untrimmed videos. In: BMVC (2017)  7. Buch, S., Escorcia, V., Shen, C., Ghanem, B., Niebles, J.C.: Sst: Single-stream  temporal action proposals. In: CVPR (2017)  8. Carreira, J., Zisserman, A.: Quo vadis, action recognition? a new model and the  kinetics dataset. In: CVPR (2017)  9. Chen, Y., Jin, X., Feng, J., Yan, S.: Training group orthogonal neural networks  with privileged information. In: IJCAI (2017)  10. Chen, Y., Jin, X., Kang, B., Feng, J., Yan, S.: Sharing residual units through  collective tensor factorization in deep neural networks. In: IJCAI (2018)  11. Chen, Y., Kalantidis, Y., Li, J., Yan, S., Feng, J.: Multi-fiber networks for video  12. Chen, Y., Li, J., Xiao, H., Jin, X., Yan, S., Feng, J.: Dual path networks. In: NIPS  recognition. In: ECCV (2018)  (2017)  13. Cheng, G., Wan, Y., Saudagar, A.N., Namuduri, K., Buckles, B.P.: Advances in human action recognition: A survey (2015), http://arxiv.org/abs/1501.05964 14. Dai, X., Singh, B., Zhang, G., Davis, L.S., Chen, Y.Q.: Temporal context network  for activity localization in videos. In: ICCV (2017)  15. Dave, A., Russakovsky, O., Ramanan, D.: Predictive-corrective networks for action  detection. In: CVPR (2017)  16. Dietterich, T.G., Lathrop, R.H., Lozano-P´erez, T.: Solving the multiple instance  problem with axis-parallel rectangles (1997)  17. Donahue, J., Hendricks, L.A., Guadarrama, S., Rohrbach, M., Venugopalan, S., Saenko, K., Darrell, T.: Long-term recurrent convolutional networks for visual recognition and description. In: CVPR (2015)  18. Durand, T., Mordan, T., Thome, N., Cord, M.: Wildcat: Weakly supervised learn- ing of deep convnets for image classification, pointwise localization and segmenta- tion. In: CVPR (2017)  19. Escorcia, V., Heilbron, F.C., Niebles, J.C., Ghanem, B.: Daps: Deep action pro-  posals for action understanding. In: ECCV (2016)  20. Gao, J., Chen, K., Nevatia, R.: Ctap: Complementary temporal action proposal  21. Gao, J., Yang, Z., Nevatia, R.: Cascaded boundary regression for temporal action  generation. ECCV (2018)  detection. In: BMVC (2017)  22. Gao, J., Yang, Z., Sun, C., Chen, K., Nevatia, R.: Turn tap: Temporal unit regres-  sion network for temporal action proposals. In: ICCV (2017)  23. Girshick, R.: Fast r-cnn. In: ICCV (2015)   16  Z. Shou, H. Gao, L. Zhang, K. Miyazawa, S.-F. Chang  24. Gorban, A., Idrees, H., Jiang, Y.G., Zamir, A.R., Laptev, I., Shah, M., Suk- thankar, R.: THUMOS challenge: Action recognition with a large number of classes. http://www.thumos.info/ (2015)  25. Gudi, A., van Rosmalen, N., Loog, M., van Gemert, J.: Object-extent pooling for  weakly supervised single-shot localization. In: BMVC (2017)  26. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional  networks for visual recognition. In: TPMAI (2015)  27. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  28. Heilbron, F.C., Escorcia, V., Ghanem, B., Niebles, J.C.: Activitynet: A large-scale  video benchmark for human activity understanding. In: CVPR (2015)  29. Heilbron, F.C., Barrios, W., Escorcia, V., Ghanem, B.: Scc: Semantic context cas-  cade for eﬃcient action detection. In: CVPR (2017)  30. Heilbron, F.C., Niebles, J.C., Ghanem, B.: Fast temporal activity proposals for eﬃcient detection of human actions in untrimmed videos. In: CVPR (2016) 31. Hong, S., Yeo, D., Kwak, S., Lee, H., Han, B.: Weakly supervised semantic seg-  mentation using web-crawled videos. In: CVPR (2017)  32. Huang, D.A., Fei-Fei, L., Niebles, J.C.: Connectionist temporal modeling for weakly  supervised action labeling. In: ECCV (2016)  33. Huang, G., Liu, Z., Van Der Maaten, L., Weinberger, K.Q.: Densely connected  convolutional networks. In: CVPR (2017)  34. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. In: ICML (2015)  35. Ji, S., Xu, W., Yang, M., Yu, K.: 3d convolutional neural networks for human  action recognition. In: TPMAI (2013)  36. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM MM (2014)  37. Jiang, Y.G., Liu, J., Zamir, A.R., Toderici, G., Laptev, I., Shah, M., Sukthankar, R.: THUMOS challenge: Action recognition with a large number of classes. http://crcv.ucf.edu/THUMOS14/ (2014)  38. Jie, Z., Wei, Y., Jin, X., Feng, J., Liu, W.: Deep self-taught learning for weakly  supervised object localization. In: CVPR (2017)  39. Kang, S.M., Wildes, R.P.: Review of action recognition and detection methods.  arXiv preprint arXiv:1610.06906 (2016)  40. Kantorov, V., Oquab, M., Cho, M., Laptev, I.: Contextlocnet: Context-aware deep  network models for weakly supervised localization. In: ECCV (2016)  41. Karaman, S., Seidenari, L., Bimbo, A.D.: Fast saliency based pooling of fisher  encoded dense trajectories. In: ECCV THUMOS Workshop (2014)  42. Khoreva, A., Benenson, R., Hosang, J., Hein, M., Schiele, B.: Simple does it:  Weakly supervised instance and semantic segmentation. In: CVPR (2017)  43. Kim, D., Yoo, D., Kweon, I.S., et al.: Two-phase learning for weakly supervised  object localization. In: ICCV (2017)  44. Lin, T., Zhao, X., Shou, Z.: Single shot temporal action detection. In: ACM MM  (2017)  45. Lindeberg, T.: Feature detection with automatic scale selection. IJCV (1998) 46. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  Single shot multibox detector. In: ECCV (2016)  47. Mettes, P., van Gemert, J.C., Snoek, C.G.: Spot on: Action localization from  pointly-supervised proposals. In: ECCV (2016)   AutoLoc: Weakly-supervised Temporal Action Localization48. Oneata, D., Verbeek, J., Schmid, C.: The lear submission at thumos 2014. In:  ECCV THUMOS Workshop (2014)  49. Papandreou, G., Chen, L.C., Murphy, K.P., Yuille, A.L.: Weakly-and semi- supervised learning of a deep convolutional network for semantic image segmenta- tion. In: CVPR (2015)  50. Poppe, R.: A survey on vision-based human action recognition. In: Image and  vision computing (2010)  51. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified,  real-time object detection. In: CVPR (2016)  52. Redmon, J., Farhadi, A.: Yolo9000: better, faster, stronger. In: CVPR (2017) 53. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de-  tection with region proposal networks. In: NIPS (2015)  54. Richard, A., Gall, J.: Temporal action detection using a statistical language model.  In: CVPR (2016)  55. Richard, A., Kuehne, H., Gall, J.: Weakly supervised action learning with rnn  based fine-to-coarse modeling. In: CVPR (2017)  56. Shen, Z., Li, J., Su, Z., Li, M., Chen, Y., Jiang, Y.G., Xue, X.: Weakly supervised  dense video captioning. In: CVPR (2017)  57. Shi, M., Caesar, H., Ferrari, V.: Weakly supervised object localization using things  and stuﬀ transfer. In: ICCV (2017)  58. Shou, Z., Chan, J., Zareian, A., Miyazawa, K., Chang, S.F.: Cdc: Convolutional- de-convolutional networks for precise temporal action localization in untrimmed videos. In: CVPR (2017)  59. Shou, Z., Gao, H., Zhang, L., Miyazawa, K., Chang, S.F.: Autoloc: Weakly-  supervised temporal action localization. arXiv preprint arXiv:1807.08333 (2018)  60. Shou, Z., Wang, D., Chang, S.F.: Temporal action localization in untrimmed videos  via multi-stage cnns. In: CVPR (2016)  61. Sigurdsson, G.A., Divvala, S., Farhadi, A., Gupta, A.: Asynchronous temporal  fields for action recognition. In: CVPR (2017)  62. Sigurdsson, G.A., Russakovsky, O., Farhadi, A., Laptev, I., Gupta, A.: Much ado  about time: Exhaustive annotation of temporal data. In: HCOMP (2016)  63. Sigurdsson, G.A., Varol, G., Wang, X., Farhadi, A., Laptev, I., Gupta, A.: Hol- lywood in homes: Crowdsourcing data collection for activity understanding. In: ECCV (2016)  64. Simonyan, K., Zisserman, A.: Two-stream convolutional networks for action recog-  nition in videos. In: NIPS (2014)  65. Singh, K.K., Lee, Y.J.: Hide-and-seek: Forcing a network to be meticulous for  weakly-supervised object and action localization. In: ICCV (2017)  66. Sun, C., Paluri, M., Collobert, R., Nevatia, R., Bourdev, L.: Pronet: Learning to propose object-specific boxes for cascaded neural networks. In: CVPR (2016) 67. Sun, C., Shetty, S., Sukthankar, R., Nevatia, R.: Temporal localization of fine- grained actions in videos by domain transfer from web images. In: ACM MM (2015)  68. Tang, P., Wang, X., Bai, X., Liu, W.: Multiple instance detection network with  online instance classifier refinement. In: CVPR (2017)  69. Tran, D., Bourdev, L., Fergus, R., Torresani, L., Paluri, M.: Learning spatiotem-  poral features with 3d convolutional networks. In: ICCV (2015)  70. Tran, D., Ray, J., Shou, Z., Chang, S.F., Paluri, M.: Convnet architecture search for spatiotemporal feature learning. arXiv preprint arXiv:1708.05038 (2017) 71. Wang, L., Qiao, Y., Tang, X.: Action recognition and detection by combining  motion and appearance features. In: ECCV THUMOS Workshop (2014)   18  Z. Shou, H. Gao, L. Zhang, K. Miyazawa, S.-F. Chang  72. Wang, L., Xiong, Y., Wang, Z., Qiao, Y., Lin, D., Tang, X., Gool, L.V.: Temporal segment networks: Towards good practices for deep action recognition. In: ECCV (2016)  73. Wang, L., Xiong, Y., Lin, D., Van Gool, L.: Untrimmednets for weakly supervised  action recognition and detection. In: CVPR (2017)  74. Weinland, D., Ronfard, R., Boyer, E.: A survey of vision-based methods for ac- tion representation, segmentation and recognition. In: Computer Vision and Image Understanding (2011)  75. Xu, H., Das, A., Saenko, K.: R-c3d: Region convolutional 3d network for temporal  activity detection. In: ICCV (2017)  76. Yeung, S., Russakovsky, O., Mori, G., Fei-Fei, L.: End-to-end learning of action  detection from frame glimpses in videos. In: CVPR (2016)  77. Yuan, J., Ni, B., Yang, X., Kassim, A.: Temporal action localization with pyramid  of score distribution features. In: CVPR (2016)  78. Yuan, Z., Stroud, J.C., Lu, T., Deng, J.: Temporal action localization by structured  maximal sums. In: CVPR (2017)  79. Zhang, H., Kyaw, Z., Yu, J., Chang, S.F.: Ppr-fcn: weakly supervised visual relation  detection via parallel pairwise r-fcn. In: ICCV (2017)  80. Zhang, J., Lin, Z., Brandt, J., Shen, X., Sclaroﬀ, S.: Top-down neural attention by  excitation backprop. In: ECCV (2016)  81. Zhao, H., Yan, Z., Wang, H., Torresani, L., Torralba, A.: Slac: A sparsely labeled dataset for action classification and localization. arXiv preprint arXiv:1712.09374 (2017)  82. Zhao, Y., Xiong, Y., Wang, L., Wu, Z., Tang, X., Lin, D.: Temporal action detection  with structured segment networks. In: ICCV (2017)  83. Zhou, B., Khosla, A., Lapedriza, A., Oliva, A., Torralba, A.: Learning deep features  for discriminative localization. In: CVPR (2016)  84. Zhu, Y., Zhou, Y., Ye, Q., Qiu, Q., Jiao, J.: Soft proposal networks for weakly  supervised object localization. In: ICCV (2017)"}