{"1": "1. Sivic, J., Zisserman, A.: Video google: A text retrieval approach to object matching in videos. In: 9th IEEE International Conference on Computer Vision (ICCV 2003). (2003) 1470-1477  2. Wang, J., Yang, J., Yu, K., Lv, F., Huang, T.S., Gong, Y.: Locality-constrained linear coding for image classification. In: The Twenty-Third IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2010. (2010) 3360-3367  3. Jegou, H., Douze, M., Schmid, C., P´erez, P.: Aggregating local descriptors into a compact image representation. In: The Twenty-Third IEEE Conference on Com- puter Vision and Pattern Recognition, CVPR 2010. (2010) 3304-3311  4. S´anchez, J., Perronnin, F., Mensink, T., Verbeek, J.J.: Image classification with the fisher vector: Theory and practice. International Journal of Computer Vision 105(3) (2013) 222-245  5. Jayasumana, S., Hartley, R.I., Salzmann, M., Li, H., Harandi, M.T.: Kernel meth- ods on the riemannian manifold of symmetric positive definite matrices. In: 2013 IEEE Conference on Computer Vision and Pattern Recognition. (2013) 73-80 6. Wang, R., Guo, H., Davis, L.S., Dai, Q.: Covariance discriminative learning: A  natural and eﬃcient approach to image set classification. [7] 2496-2503  7. 2012 IEEE Conference on Computer Vision and Pattern Recognition, Providence,  RI, USA, June 16-21, 2012, IEEE Computer Society (2012)  8. Fleet, D.J., Pajdla, T., Schiele, B., Tuytelaars, T., eds.: Computer Vision - ECCV 2014 - 13th European Conference, Zurich, Switzerland, September 6-12, 2014, Pro- ceedings, Part II. Volume 8690 of Lecture Notes in Computer Science., Springer (2014)  9. Bach, F.R., Blei, D.M., eds.: Proceedings of the 32nd International Conference on Machine Learning, ICML 2015, Lille, France, 6-11 July 2015. Volume 37 of JMLR Workshop and Conference Proceedings., JMLR.org (2015)  10. Li, P., Xie, J., Wang, Q., Zuo, W.: Is second-order information helpful for large- scale visual recognition? In: IEEE International Conference on Computer Vision, ICCV 2017, Venice, Italy, October 22-29, 2017. (2017) 2089-2097  11. Kong, S., Fowlkes, C.C.: Low-rank bilinear pooling for fine-grained classification.  12. Lin, T.Y., Maji, S.: Improved Bilinear Pooling with CNNs. In: British Machine  CoRR abs/1611.05109 (2016)  Vision Conference (BMVC). (2017)  13. Lin, T.Y., RoyChowdhury, A., Maji, S.: Bilinear cnns for fine-grained visual recog- In: Transactions of Pattern Analysis and Machine Intelligence (PAMI).  14. Gao, Y., Beijbom, O., Zhang, N., Darrell, T.: Compact bilinear pooling. CoRR  nition. (2017)  abs/1511.06062 (2015)  15. Harandi, M.T., Salzmann, M., Porikli, F.M.: Bregman divergences for infinite dimensional covariance matrices. In: 2014 IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2014. (2014) 1003-1010  16. Wang, L., Zhang, J., Zhou, L., Tang, C., Li, W.: Beyond covariance: Feature repre- sentation with nonlinear kernel matrices. In: 2015 IEEE International Conference on Computer Vision, ICCV 2015. (2015) 4570-4578  17. Cui, Y., Zhou, F., Wang, J., Liu, X., Lin, Y., Belongie, S.: Kernel pooling for convo- lutional neural networks. In: Computer Vision and Pattern Recognition (CVPR), Honolulu, HI (2017)   Deep Kernel SPD Representation for Fine-grained Image RecognitionReferences  1. Sivic, J., Zisserman, A.: Video google: A text retrieval approach to object matching in videos. In: 9th IEEE International Conference on Computer Vision (ICCV 2003). (2003) 1470-1477  2. Wang, J., Yang, J., Yu, K., Lv, F., Huang, T.S., Gong, Y.: Locality-constrained linear coding for image classification. In: The Twenty-Third IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2010. (2010) 3360-3367  3. Jegou, H., Douze, M., Schmid, C., P´erez, P.: Aggregating local descriptors into a compact image representation. In: The Twenty-Third IEEE Conference on Com- puter Vision and Pattern Recognition, CVPR 2010. (2010) 3304-3311  4. S´anchez, J., Perronnin, F., Mensink, T., Verbeek, J.J.: Image classification with the fisher vector: Theory and practice. International Journal of Computer Vision 105(3) (2013) 222-245  5. Jayasumana, S., Hartley, R.I., Salzmann, M., Li, H., Harandi, M.T.: Kernel meth- ods on the riemannian manifold of symmetric positive definite matrices. In: 2013 IEEE Conference on Computer Vision and Pattern Recognition. (2013) 73-80 6. Wang, R., Guo, H., Davis, L.S., Dai, Q.: Covariance discriminative learning: A  natural and eﬃcient approach to image set classification. [7] 2496-2503  7. 2012 IEEE Conference on Computer Vision and Pattern Recognition, Providence,  RI, USA, June 16-21, 2012, IEEE Computer Society (2012)  8. Fleet, D.J., Pajdla, T., Schiele, B., Tuytelaars, T., eds.: Computer Vision - ECCV 2014 - 13th European Conference, Zurich, Switzerland, September 6-12, 2014, Pro- ceedings, Part II. Volume 8690 of Lecture Notes in Computer Science., Springer (2014)  9. Bach, F.R., Blei, D.M., eds.: Proceedings of the 32nd International Conference on Machine Learning, ICML 2015, Lille, France, 6-11 July 2015. Volume 37 of JMLR Workshop and Conference Proceedings., JMLR.org (2015)  10. Li, P., Xie, J., Wang, Q., Zuo, W.: Is second-order information helpful for large- scale visual recognition? In: IEEE International Conference on Computer Vision, ICCV 2017, Venice, Italy, October 22-29, 2017. (2017) 2089-2097  11. Kong, S., Fowlkes, C.C.: Low-rank bilinear pooling for fine-grained classification.  12. Lin, T.Y., Maji, S.: Improved Bilinear Pooling with CNNs. In: British Machine  CoRR abs/1611.05109 (2016)  Vision Conference (BMVC). (2017)  13. Lin, T.Y., RoyChowdhury, A., Maji, S.: Bilinear cnns for fine-grained visual recog- In: Transactions of Pattern Analysis and Machine Intelligence (PAMI).  14. Gao, Y., Beijbom, O., Zhang, N., Darrell, T.: Compact bilinear pooling. CoRR  nition. (2017)  abs/1511.06062 (2015)  15. Harandi, M.T., Salzmann, M., Porikli, F.M.: Bregman divergences for infinite dimensional covariance matrices. In: 2014 IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2014. (2014) 1003-1010  16. Wang, L., Zhang, J., Zhou, L., Tang, C., Li, W.: Beyond covariance: Feature repre- sentation with nonlinear kernel matrices. In: 2015 IEEE International Conference on Computer Vision, ICCV 2015. (2015) 4570-4578  17. Cui, Y., Zhou, F., Wang, J., Liu, X., Lin, Y., Belongie, S.: Kernel pooling for convo- lutional neural networks. In: Computer Vision and Pattern Recognition (CVPR), Honolulu, HI (2017)   16  M Engin, L Wang, L Zhou, X Liu  18. Ionescu, C., Vantzos, O., Sminchisescu, C.: Matrix backpropagation for deep net- works with structured layers. In: 2015 IEEE International Conference on Computer Vision, ICCV 2015. (2015) 2965-2973  19. Dalecki˘i, Y.L., Kre˘in, S.G.: Integration and diﬀerentiation of functions of hermitian operators and applications to the theory of perturbations. (Russian) Vorone. Gos. Univ. Trudy Sem. Funkcional. Anal. 1 (1) (1956) 81-105 English translation is in book Thirteen Papers on Functional Analysis and Partial Diﬀerential Equations, American Mathematical Society Translations: Series 2, vol.47, 1965. 20. Bhatia, R.: Positive Definite Matrices. Princeton University Press (2015) 21. Lin, T., Roy Chowdhury, A., Maji, S.: Bilinear CNN models for fine-grained visual recognition. In: 2015 IEEE International Conference on Computer Vision, ICCV 2015. (2015) 1449-1457  22. Arsigny, V., Fillard, P., Pennec, X., Ayache, N.: Log-euclidean metrics for fast and simple calculus on diﬀusion tensors. Magnetic Resonance in Medicine 56(2) (2006) 411-421  23. Krause, J., Stark, M., Deng, J., Fei-Fei, L.: 3d object representations for fine- grained categorization. In: 4th International IEEE Workshop on 3D Representation and Recognition (3dRR-13), Sydney, Australia (2013)  24. Welinder, P., Branson, S., Mita, T., Wah, C., Schroﬀ, F., Belongie, S., Perona, P.: Caltech-UCSD Birds 200. Technical Report CNS-TR-2010-001, California Institute of Technology (2010)  25. Maji, S., Rahtu, E., Kannala, J., Blaschko, M.B., Vedaldi, A.: Fine-grained visual  classification of aircraft. CoRR abs/1306.5151 (2013)  26. Branson, S., Horn, G.V., Belongie, S., Perona, P.: Bird species categorization using pose normalized deep convolutional nets. In: British Machine Vision Conference (BMVC), Nottingham (2014)  27. Perronnin, F., S´anchez, J., Mensink, T.:  scale image classification. Computer Vision: Part IV. ECCV’10, Springer-Verlag (2010) 143-156  Improving the fisher kernel for large- In: Proceedings of the 11th European Conference on  28. Cimpoi, M., Maji, S., Vedaldi, A.: Deep filter banks for texture recognition and segmentation. In: IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2015. (2015) 3828-3836  29. Chai, Y., Lempitsky, V., Zisserman, A.: Symbiotic segmentation and part lo- In: IEEE International Conference on  calization for fine-grained categorization. Computer Vision. (2013)  30. Gosselin, P.H., Murray, N., J´egou, H., Perronnin, F.: Revisiting the Fisher vector for fine-grained classification. Pattern Recognition Letters 49 (November 2014) 92-98"}