{"1": "1. Lloyd, S.: Least squares quantization in pcm. IEEE transactions on information  theory 28(2) (1982) 129-137  2. Forgy, E.W.: Cluster analysis of multivariate data: eﬃciency versus interpretability  of classifications. biometrics 21 (1965) 768-769  3. Graf, S., Luschgy, H.: Foundations of quantization for probability distributions.  Springer (2007)  4. Agueh, M., Carlier, G.: Barycenters in the Wasserstein space. SIAM Journal on  Mathematical Analysis 43(2) (2011) 904-924  5. Cuturi, M., Doucet, A.: Fast computation of wasserstein barycenters. In: Interna-  tional Conference on Machine Learning. (2014) 685-693  6. Solomon, J., De Goes, F., Peyr´e, G., Cuturi, M., Butscher, A., Nguyen, A., Du, T., Guibas, L.: Convolutional wasserstein distances: Eﬃcient optimal transportation on geometric domains. ACM Transactions on Graphics (TOG) 34(4) (2015) 66 7. Ye, J., Wu, P., Wang, J.Z., Li, J.: Fast discrete distribution clustering using Wasser- IEEE Transactions on Signal Processing  stein barycenter with sparse support. 65(9) (2017) 2317-2332  8. Ho, N., Nguyen, X., Yurochkin, M., Bui, H.H., Huynh, V., Phung, D.: Multilevel  clustering via wasserstein means. arXiv preprint arXiv:1706.03883 (2017)  9. Gu, X., Luo, F., Sun, J., Yau, S.T.: Variational principles for minkowski type problems, discrete optimal transport, and discrete monge-ampere equations. arXiv preprint arXiv:1302.5472 (2013)  10. Courty, N., Flamary, R., Habrard, A., Rakotomamonjy, A.: Joint distribution optimal transportation for domain adaptation. In: Advances in Neural Information Processing Systems. (2017) 3733-3742  11. Monge, G.: M´emoire sur la th´eorie des d´eblais et des remblais. Histoire de  l’Acad´emie Royale des Sciences de Paris (1781)  12. Kantorovich, L.V.: On the translocation of masses. In: Dokl. Akad. Nauk SSSR.  Volume 37. (1942) 199-201  13. Cuturi, M.: Sinkhorn distances: Lightspeed computation of optimal transport. In:  Advances in neural information processing systems. (2013) 2292-2300  14. Brenier, Y.: Polar factorization and monotone rearrangement of vector-valued functions. Communications on pure and applied mathematics 44(4) (1991) 375- 417  15. M´erigot, Q.: A multiscale approach to optimal transport. In: Computer Graphics  Forum. Volume 30., Wiley Online Library (2011) 1583-1592  16. L´evy, B.: A numerical algorithm for l2 semi-discrete optimal transport in 3d. ESAIM: Mathematical Modelling and Numerical Analysis 49(6) (2015) 1693-1715 17. Givens, C.R., Shortt, R.M., et al.: A class of wasserstein metrics for probability  distributions. The Michigan Mathematical Journal 31(2) (1984) 231-240  18. Rubner, Y., Tomasi, C., Guibas, L.J.: The earth mover’s distance as a metric for image retrieval. International journal of computer vision 40(2) (2000) 99-121 19. Ling, H., Okada, K.: An eﬃcient earth mover’s distance algorithm for robust histogram comparison. IEEE transactions on pattern analysis and machine intel- ligence 29(5) (2007) 840-853  20. Lee, K., Xu, W., Fan, F., Tu, Z.: Wasserstein introspective neural networks. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (June 2018)   Variational Wasserstein ClusteringReferences  1. Lloyd, S.: Least squares quantization in pcm. IEEE transactions on information  theory 28(2) (1982) 129-137  2. Forgy, E.W.: Cluster analysis of multivariate data: eﬃciency versus interpretability  of classifications. biometrics 21 (1965) 768-769  3. Graf, S., Luschgy, H.: Foundations of quantization for probability distributions.  Springer (2007)  4. Agueh, M., Carlier, G.: Barycenters in the Wasserstein space. SIAM Journal on  Mathematical Analysis 43(2) (2011) 904-924  5. Cuturi, M., Doucet, A.: Fast computation of wasserstein barycenters. In: Interna-  tional Conference on Machine Learning. (2014) 685-693  6. Solomon, J., De Goes, F., Peyr´e, G., Cuturi, M., Butscher, A., Nguyen, A., Du, T., Guibas, L.: Convolutional wasserstein distances: Eﬃcient optimal transportation on geometric domains. ACM Transactions on Graphics (TOG) 34(4) (2015) 66 7. Ye, J., Wu, P., Wang, J.Z., Li, J.: Fast discrete distribution clustering using Wasser- IEEE Transactions on Signal Processing  stein barycenter with sparse support. 65(9) (2017) 2317-2332  8. Ho, N., Nguyen, X., Yurochkin, M., Bui, H.H., Huynh, V., Phung, D.: Multilevel  clustering via wasserstein means. arXiv preprint arXiv:1706.03883 (2017)  9. Gu, X., Luo, F., Sun, J., Yau, S.T.: Variational principles for minkowski type problems, discrete optimal transport, and discrete monge-ampere equations. arXiv preprint arXiv:1302.5472 (2013)  10. Courty, N., Flamary, R., Habrard, A., Rakotomamonjy, A.: Joint distribution optimal transportation for domain adaptation. In: Advances in Neural Information Processing Systems. (2017) 3733-3742  11. Monge, G.: M´emoire sur la th´eorie des d´eblais et des remblais. Histoire de  l’Acad´emie Royale des Sciences de Paris (1781)  12. Kantorovich, L.V.: On the translocation of masses. In: Dokl. Akad. Nauk SSSR.  Volume 37. (1942) 199-201  13. Cuturi, M.: Sinkhorn distances: Lightspeed computation of optimal transport. In:  Advances in neural information processing systems. (2013) 2292-2300  14. Brenier, Y.: Polar factorization and monotone rearrangement of vector-valued functions. Communications on pure and applied mathematics 44(4) (1991) 375- 417  15. M´erigot, Q.: A multiscale approach to optimal transport. In: Computer Graphics  Forum. Volume 30., Wiley Online Library (2011) 1583-1592  16. L´evy, B.: A numerical algorithm for l2 semi-discrete optimal transport in 3d. ESAIM: Mathematical Modelling and Numerical Analysis 49(6) (2015) 1693-1715 17. Givens, C.R., Shortt, R.M., et al.: A class of wasserstein metrics for probability  distributions. The Michigan Mathematical Journal 31(2) (1984) 231-240  18. Rubner, Y., Tomasi, C., Guibas, L.J.: The earth mover’s distance as a metric for image retrieval. International journal of computer vision 40(2) (2000) 99-121 19. Ling, H., Okada, K.: An eﬃcient earth mover’s distance algorithm for robust histogram comparison. IEEE transactions on pattern analysis and machine intel- ligence 29(5) (2007) 840-853  20. Lee, K., Xu, W., Fan, F., Tu, Z.: Wasserstein introspective neural networks. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (June 2018)   16  Liang Mi et al.  21. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein generative adversarial networks.  In: International Conference on Machine Learning. (2017) 214-223  22. Frogner, C., Zhang, C., Mobahi, H., Araya, M., Poggio, T.A.: Learning with a wasserstein loss. In: Advances in Neural Information Processing Systems. (2015) 2053-2061  23. Gibbs, A.L., Su, F.E.: On choosing and bounding probability metrics. International  statistical review 70(3) (2002) 419-435  24. Applegate, D., Dasu, T., Krishnan, S., Urbanek, S.: Unsupervised clustering of multidimensional distributions using earth mover distance. In: Proceedings of the 17th ACM SIGKDD international conference on Knowledge discovery and data mining, ACM (2011) 636-644  25. Villani, C.: Topics in optimal transportation. Number 58. American Mathematical  Soc. (2003)  26. Alexandrov, A.D.: Convex polyhedra. Springer Science & Business Media (2005) 27. Aurenhammer, F.: Power diagrams: properties, algorithms and applications. SIAM  Journal on Computing 16(1) (1987) 78-96  28. Gu, X.D., Yau, S.T.: Computational conformal geometry.  International Press  Somerville, Mass, USA (2008)  29. Wang, Y., Gu, X., Chan, T.F., Thompson, P.M., Yau, S.T.: Volumetric harmonic brain mapping. In: Biomedical Imaging: Nano to Macro, 2004. IEEE International Symposium on, IEEE (2004) 1275-1278  30. Rycroft, C.: Voro++: A three-dimensional voronoi cell library in c++. (2009) 31. Courty, N., Flamary, R., Tuia, D.: Domain adaptation with regularized optimal transport. In: Joint European Conference on Machine Learning and Knowledge Discovery in Databases, Springer (2014) 274-289  32. Arthur, D., Vassilvitskii, S.: k-means++: The advantages of careful seeding. In: Proceedings of the eighteenth annual ACM-SIAM symposium on Discrete algo- rithms, Society for Industrial and Applied Mathematics (2007) 1027-1035  33. Shewchuk, J.R.: Delaunay refinement algorithms for triangular mesh generation.  Computational geometry 22(1-3) (2002) 21-74  34. Fabri, A., Pion, S.: Cgal: The computational geometry algorithms library.  In: Proceedings of the 17th ACM SIGSPATIAL international conference on advances in geographic information systems, ACM (2009) 538-539  35. Goes, F.d., Memari, P., Mullen, P., Desbrun, M.: Weighted triangulations for geometry processing. ACM Transactions on Graphics (TOG) 33(3) (2014) 28  36. Fischl, B.: Freesurfer. Neuroimage 62(2) (2012) 774-781 37. Si, H., TetGen, A.: A quality tetrahedral mesh generator and three-dimensional delaunay triangulator. Weierstrass Institute for Applied Analysis and Stochastic, Berlin, Germany (2006) 81  38. Fox, N.C., Freeborough, P.A.: Brain atrophy progression measured from registered serial mri: validation and application to alzheimer’s disease. Journal of Magnetic Resonance Imaging 7(6) (1997) 1069-1075"}