{"1": "1. Armeni, I., Sax, A., Zamir, A.R., Savarese, S.: Joint 2D-3D-Semantic Data for  Indoor Scene Understanding. ArXiv e-prints (2017)  2. Barron, J.T., Poole, B.: The fast bilateral solver. In: ECCV (2016) 3. Chen, J., Paris, S., Durand, F.: Real-time edge-aware image processing with the  bilateral grid. In: ACM Transactions on Graphics (TOG) (2007)  4. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. In: ICLR (2015)  5. Cheng, Y., Cai, R., Li, Z., Zhao, X., Huang, K.: Locality-sensitive deconvolution networks with gated fusion for rgb-d indoor semantic segmentation. In: CVPR (2017)  6. Couprie, C., Farabet, C., Najman, L., Lecun, Y.: Indoor semantic segmentation  using depth information. In: ICLR (2013)  7. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. In: ICCV (2017)  8. Eigen, D., Fergus, R.: Predicting depth, surface normals and semantic labels with  a common multi-scale convolutional architecture. In: ICCV (2015)  9. Gupta, S., Girshick, R., Arbelaez, P., Malik, J.: Learning rich features from RGB-D  images for object detection and segmentation. In: ECCV (2014)  10. Hazirbas, C., Ma, L., Domokos, C., Cremers, D.: Fusenet: incorporating depth into  semantic segmentation via fusion-based cnn architecture. In: ACCV (2016)  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  12. He, Y., Chiu, W.C., Keuper, M., Fritz, M.: Std2p: Rgbd semantic segmentation  using spatio-temporal data-driven pooling. In: CVPR (2017)  13. Huang, Q., Wang, W., Neumann, U.: Recurrent slice networks for 3d segmentation  on point clouds. CVPR (2018)  14. Huang, Q., Wang, W., Zhou, K., You, S., Neumann, U.: Scene labeling us- ing gated recurrent units with explicit long range conditioning. arXiv preprint arXiv:1611.07485 (2016)  15. Jaderberg, M., Simonyan, K., Zisserman, A., kavukcuoglu, k.: Spatial transformer  networks. In: NIPS (2015)  16. Janoch, A., Karayev, S., Jia, Y., Barron, J.T., Fritz, M., Saenko, K., Darrell, T.: A category-level 3-d object dataset: Putting the kinect to work. In: ICCV workshop (2011)  17. Khan, S.H., Bennamoun, M., Sohel, F., Togneri, R.: Geometry driven semantic labeling of indoor scenes. In: Fleet, D., Pajdla, T., Schiele, B., Tuytelaars, T. (eds.) ECCV (2014)  18. Li, Z., Gan, Y., Liang, X., Yu, Y., Cheng, H., Lin, L.: Lstm-cf: Unifying context  modeling and fusion with lstms for rgb-d scene labeling. In: ECCV (2016)  19. Lin, D., Chen, G., Cohen-Or, D., Heng, P.A., Huang, H.: Cascaded feature network  for semantic segmentation of rgb-d images. In: ICCV (2017)  20. Lin, G., Milan, A., Shen, C., Reid, I.: RefineNet: Multi-path refinement networks  for high-resolution semantic segmentation. In: CVPR (2017)  21. Ma, L., Stueckler, J., Kerl, C., Cremers, D.: Multi-view deep learning for consistent  semantic mapping with rgb-d cameras. In: IROS (2017)  22. Nathan Silberman, Derek Hoiem, P.K., Fergus, R.: Indoor segmentation and sup-  port inference from rgbd images. In: ECCV (2012)   Depth-aware CNN for RGB-D SegmentationReferences  1. Armeni, I., Sax, A., Zamir, A.R., Savarese, S.: Joint 2D-3D-Semantic Data for  Indoor Scene Understanding. ArXiv e-prints (2017)  2. Barron, J.T., Poole, B.: The fast bilateral solver. In: ECCV (2016) 3. Chen, J., Paris, S., Durand, F.: Real-time edge-aware image processing with the  bilateral grid. In: ACM Transactions on Graphics (TOG) (2007)  4. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. In: ICLR (2015)  5. Cheng, Y., Cai, R., Li, Z., Zhao, X., Huang, K.: Locality-sensitive deconvolution networks with gated fusion for rgb-d indoor semantic segmentation. In: CVPR (2017)  6. Couprie, C., Farabet, C., Najman, L., Lecun, Y.: Indoor semantic segmentation  using depth information. In: ICLR (2013)  7. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. In: ICCV (2017)  8. Eigen, D., Fergus, R.: Predicting depth, surface normals and semantic labels with  a common multi-scale convolutional architecture. In: ICCV (2015)  9. Gupta, S., Girshick, R., Arbelaez, P., Malik, J.: Learning rich features from RGB-D  images for object detection and segmentation. In: ECCV (2014)  10. Hazirbas, C., Ma, L., Domokos, C., Cremers, D.: Fusenet: incorporating depth into  semantic segmentation via fusion-based cnn architecture. In: ACCV (2016)  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  12. He, Y., Chiu, W.C., Keuper, M., Fritz, M.: Std2p: Rgbd semantic segmentation  using spatio-temporal data-driven pooling. In: CVPR (2017)  13. Huang, Q., Wang, W., Neumann, U.: Recurrent slice networks for 3d segmentation  on point clouds. CVPR (2018)  14. Huang, Q., Wang, W., Zhou, K., You, S., Neumann, U.: Scene labeling us- ing gated recurrent units with explicit long range conditioning. arXiv preprint arXiv:1611.07485 (2016)  15. Jaderberg, M., Simonyan, K., Zisserman, A., kavukcuoglu, k.: Spatial transformer  networks. In: NIPS (2015)  16. Janoch, A., Karayev, S., Jia, Y., Barron, J.T., Fritz, M., Saenko, K., Darrell, T.: A category-level 3-d object dataset: Putting the kinect to work. In: ICCV workshop (2011)  17. Khan, S.H., Bennamoun, M., Sohel, F., Togneri, R.: Geometry driven semantic labeling of indoor scenes. In: Fleet, D., Pajdla, T., Schiele, B., Tuytelaars, T. (eds.) ECCV (2014)  18. Li, Z., Gan, Y., Liang, X., Yu, Y., Cheng, H., Lin, L.: Lstm-cf: Unifying context  modeling and fusion with lstms for rgb-d scene labeling. In: ECCV (2016)  19. Lin, D., Chen, G., Cohen-Or, D., Heng, P.A., Huang, H.: Cascaded feature network  for semantic segmentation of rgb-d images. In: ICCV (2017)  20. Lin, G., Milan, A., Shen, C., Reid, I.: RefineNet: Multi-path refinement networks  for high-resolution semantic segmentation. In: CVPR (2017)  21. Ma, L., Stueckler, J., Kerl, C., Cremers, D.: Multi-view deep learning for consistent  semantic mapping with rgb-d cameras. In: IROS (2017)  22. Nathan Silberman, Derek Hoiem, P.K., Fergus, R.: Indoor segmentation and sup-  port inference from rgbd images. In: ECCV (2012)   16  Wang and Neumann  23. Nathan Silberman, Derek Hoiem, P.K., Fergus, R.: Indoor segmentation and sup-  port inference from rgbd images. In: ECCV (2012)  24. Park, S.J., Hong, K.S., Lee, S.: Rdfnet: Rgb-d multi-level residual feature fusion  for indoor semantic segmentation. In: ICCV (2017)  25. Qi, C.R., Su, H., Mo, K., Guibas, L.J.: Pointnet: Deep learning on point sets for  3d classification and segmentation. In: CVPR (2017)  26. Qi, C.R., Yi, L., Su, H., Guibas, L.J.: Pointnet++: Deep hierarchical feature learn-  ing on point sets in a metric space. In: NIPS (2017)  27. Qi, X., Liao, R., Jia, J., Fidler, S., Urtasun, R.: 3d graph neural networks for rgbd  semantic segmentation. In: ICCV (2017)  28. Ren, X., Bo, L., Fox, D.: Rgb-(d) scene labeling: Features and algorithms. In:  29. Shelhamer, E., Long, J., Darrell, T.: Fully convolutional networks for semantic  30. Song, S., Lichtenberg, S.P., Xiao, J.: Sun rgb-d: A rgb-d scene understanding bench-  CVPR (2012)  segmentation. PAMI (2016)  mark suite. In: CVPR (2015)  images. In: CVPR (2016)  31. Song, S., Xiao, J.: Deep Sliding Shapes for amodal 3D object detection in RGB-D  32. Song, S., Yu, F., Zeng, A., Chang, A.X., Savva, M., Funkhouser, T.: Semantic  scene completion from a single depth image. In: CVPR (2017)  33. Wang, J., Wang, Z., Tao, D., See, S., Wang, G.: Learning common and specific fea- tures for RGB-D semantic segmentation with deconvolutional networks. In: ECCV (2016)  34. Wang, W., Huang, Q., You, S., Yang, C., Neumann, U.: Shape inpainting using 3d generative adversarial network and recurrent convolutional networks. In: ICCV (2017)  35. Wang, W., Wang, N., Wu, X., You, S., Yang, C., Neumann, U.: Self-paced cross-  modality transfer learning for eﬃcient road segmentation. In: ICRA (2017)  36. Wang, W., Yu, R., Huang, Q., Neumann, U.: Sgpn: Similarity group proposal  network for 3d point cloud instance segmentation. CVPR (2018)  37. Yu, F., Koltun, V.: Multi-scale context aggregation by dilated convolutions. In:  ICLR (2016)  38. Zhou, B., Zhao, H., Puig, X., Fidler, S., Barriuso, A., Torralba, A.: Scene parsing  through ade20k dataset. In: CVPR (2017)"}