{"1": "1. Bazzani, L., Cristani, M., Murino, V.: Symmetry-driven accumulation of local fea-  tures for human characterization and re-identification. CVIU (2013)  2. Ben-David, S., Blitzer, J., Crammer, K., Kulesza, A., Pereira, F., Vaughan, J.W.:  A theory of learning from diﬀerent domains. Machine learning (2010)  3. Bousmalis, K., Silberman, N., Dohan, D., Erhan, D., Krishnan, D.: Unsupervised pixel-level domain adaptation with generative adversarial networks. In: CVPR (2017)  4. Chen, M., Weinberger, K.Q., Blitzer, J.: Co-training for domain adaptation. In:  Advances in neural information processing systems. pp. 2456-2464 (2011)  5. Choi, Y., Choi, M., Kim, M., Ha, J.W., Kim, S., Choo, J.: Stargan: Unified genera- tive adversarial networks for multi-domain image-to-image translation. In: CVPR (2018)  6. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: CVPR (2009)  7. Deng, W., Zheng, L., Kang, G., Yang, Y., Ye, Q., Jiao, J.: Image-image domain adaptation with preserved self-similarity and domain-dissimilarity for person re- identification. In: CVPR (2018)  8. Dong, X., Yan, Y., Ouyang, W., Yang, Y.: Style aggregated network for facial  landmark detection. In: CVPR (2018)  9. Dong, X., Yu, S.I., Weng, X., Wei, S.E., Yang, Y., Sheikh, Y.: Supervision-by- Registration: An unsupervised approach to improve the precision of facial landmark detectors. In: CVPR (2018)  10. Fan, H., Zheng, L., Yang, Y.: Unsupervised person re-identification: Clustering and  fine-tuning. arXiv preprint arXiv:1705.10444 (2017)  11. Ganin, Y., Ustinova, E., Ajakan, H., Germain, P., Larochelle, H., Laviolette, F., Marchand, M., Lempitsky, V.: Domain-adversarial training of neural networks. JMLR (2016)  12. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S.,  Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  13. Gray, D., Tao, H.: Viewpoint invariant pedestrian recognition with an ensemble of  localized features. In: ECCV (2008)  14. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  15. Hermans, A., Beyer, L., Leibe, B.: In defense of the triplet loss for person re-  identification. arXiv preprint arXiv:1703.07737 (2017)  16. Hoﬀman, J., Tzeng, E., Park, T., Zhu, J.Y., Isola, P., Saenko, K., Efros, A.A., Dar- rell, T.: Cycada: Cycle-consistent adversarial domain adaptation. arXiv preprint arXiv:1711.03213 (2017)  17. Hu, J., Lu, J., Tan, Y.P.: Deep transfer metric learning. In: CVPR (2015) 18. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. In: ICML (2015)  19. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with condi-  tional adversarial networks. In: CVPR (2017)  20. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In: ICLR (2015) 21. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS (2012)  22. Li, W., Zhao, R., Xiao, T., Wang, X.: Deepreid: Deep filter pairing neural network  for person re-identification. In: CVPR (2014)   Generalizing A Person Retrieval Model Hetero- and HomogeneouslyReferences  1. Bazzani, L., Cristani, M., Murino, V.: Symmetry-driven accumulation of local fea-  tures for human characterization and re-identification. CVIU (2013)  2. Ben-David, S., Blitzer, J., Crammer, K., Kulesza, A., Pereira, F., Vaughan, J.W.:  A theory of learning from diﬀerent domains. Machine learning (2010)  3. Bousmalis, K., Silberman, N., Dohan, D., Erhan, D., Krishnan, D.: Unsupervised pixel-level domain adaptation with generative adversarial networks. In: CVPR (2017)  4. Chen, M., Weinberger, K.Q., Blitzer, J.: Co-training for domain adaptation. In:  Advances in neural information processing systems. pp. 2456-2464 (2011)  5. Choi, Y., Choi, M., Kim, M., Ha, J.W., Kim, S., Choo, J.: Stargan: Unified genera- tive adversarial networks for multi-domain image-to-image translation. In: CVPR (2018)  6. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: CVPR (2009)  7. Deng, W., Zheng, L., Kang, G., Yang, Y., Ye, Q., Jiao, J.: Image-image domain adaptation with preserved self-similarity and domain-dissimilarity for person re- identification. In: CVPR (2018)  8. Dong, X., Yan, Y., Ouyang, W., Yang, Y.: Style aggregated network for facial  landmark detection. In: CVPR (2018)  9. Dong, X., Yu, S.I., Weng, X., Wei, S.E., Yang, Y., Sheikh, Y.: Supervision-by- Registration: An unsupervised approach to improve the precision of facial landmark detectors. In: CVPR (2018)  10. Fan, H., Zheng, L., Yang, Y.: Unsupervised person re-identification: Clustering and  fine-tuning. arXiv preprint arXiv:1705.10444 (2017)  11. Ganin, Y., Ustinova, E., Ajakan, H., Germain, P., Larochelle, H., Laviolette, F., Marchand, M., Lempitsky, V.: Domain-adversarial training of neural networks. JMLR (2016)  12. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S.,  Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  13. Gray, D., Tao, H.: Viewpoint invariant pedestrian recognition with an ensemble of  localized features. In: ECCV (2008)  14. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  15. Hermans, A., Beyer, L., Leibe, B.: In defense of the triplet loss for person re-  identification. arXiv preprint arXiv:1703.07737 (2017)  16. Hoﬀman, J., Tzeng, E., Park, T., Zhu, J.Y., Isola, P., Saenko, K., Efros, A.A., Dar- rell, T.: Cycada: Cycle-consistent adversarial domain adaptation. arXiv preprint arXiv:1711.03213 (2017)  17. Hu, J., Lu, J., Tan, Y.P.: Deep transfer metric learning. In: CVPR (2015) 18. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. In: ICML (2015)  19. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with condi-  tional adversarial networks. In: CVPR (2017)  20. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In: ICLR (2015) 21. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS (2012)  22. Li, W., Zhao, R., Xiao, T., Wang, X.: Deepreid: Deep filter pairing neural network  for person re-identification. In: CVPR (2014)   16  Z. Zhong et al.  23. Liao, S., Hu, Y., Zhu, X., Li, S.Z.: Person re-identification by local maximal oc-  currence representation and metric learning. In: CVPR (2015)  24. Liu, M.Y., Tuzel, O.: Coupled generative adversarial networks. In: NIPS (2016) 25. Liu, Z., Wang, D., Lu, H.: Stepwise metric promotion for unsupervised video person  26. Long, M., Cao, Y., Wang, J., Jordan, M.: Learning transferable features with deep  re-identification. In: ICCV (2017)  adaptation networks. In: ICML (2015)  27. Luo, Y., Zheng, Z., Zheng, L., Tao, G., Junqing, Y., Yang, Y.: Macro-micro adver-  sarial network for human parsing. In: ECCV (2018)  28. Peng, P., Xiang, T., Wang, Y., Pontil, M., Gong, S., Huang, T., Tian, Y.: Un- supervised cross-dataset transfer learning for person re-identification. In: CVPR (2016)  29. Qin, D., Gammeter, S., Bossard, L., Quack, T., Van Gool, L.: Hello neighbor: Accurate object retrieval with k-reciprocal nearest neighbors. In: CVPR (2011) 30. Ristani, E., Solera, F., Zou, R., Cucchiara, R., Tomasi, C.: Performance measures  and a data set for multi-target, multi-camera tracking. In: ECCVW (2016)  31. Rohrbach, M., Ebert, S., Schiele, B.: Transfer learning in a transductive setting.  In: NIPS (2013)  32. Saito, K., Ushiku, Y., Harada, T.: Asymmetric tri-training for unsupervised domain  adaptation. arXiv preprint arXiv:1702.08400 (2017)  33. Sener, O., Song, H.O., Saxena, A., Savarese, S.: Learning transferrable representa-  tions for unsupervised domain adaptation. In: NIPS (2016)  34. Srivastava, N., Hinton, G.E., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.: Dropout: a simple way to prevent neural networks from overfitting. JMLR (2014) 35. Sun, B., Feng, J., Saenko, K.: Return of frustratingly easy domain adaptation. In:  36. Sun, B., Saenko, K.: Deep coral: Correlation alignment for deep domain adaptation.  AAAI (2016)  In: ECCV Worksshops (2016)  37. Tzeng, E., Hoﬀman, J., Zhang, N., Saenko, K., Darrell, T.: Deep domain confusion:  Maximizing for domain invariance. arXiv preprint arXiv:1412.3474 (2014)  38. Wang, J., Zhu, X., Gong, S., Li, W.: Transferable joint attribute-identity deep  learning for unsupervised person re-identification. In: CVPR (2018)  39. Wei, L., Zhang, S., Gao, W., Tian, Q.: Person transfer gan to bridge domain gap  for person re-identification. In: CVPR (2018)  40. Wu, Y., Lin, Y., Dong, X., Yan, Y., Ouyang, W., Yang, Y.: Exploit the unknown gradually: One-shot video-based person re-identification by stepwise learning. In: CVPR (2018)  41. Yan, H., Ding, Y., Li, P., Wang, Q., Xu, Y., Zuo, W.: Mind the class weight bias: Weighted maximum mean discrepancy for unsupervised domain adaptation. In: CVPR (2017)  42. Yu, H., Wu, A., Zheng, W.S.: Cross-view asymmetric metric learning for unsuper-  vised person re-identification. In: ICCV (2017)  43. Zheng, L., Shen, L., Tian, L., Wang, S., Wang, J., Tian, Q.: Scalable person re-  identification: A benchmark. In: ICCV (2015)  44. Zheng, L., Yang, Y., Hauptmann, A.G.: Person re-identification: Past, present and  future. arXiv preprint arXiv:1610.02984 (2016)  45. Zheng, Z., Zheng, L., Yang, Y.: Unlabeled samples generated by gan improve the  person re-identification baseline in vitro. In: ICCV (2017)  46. Zhong, Z., Zheng, L., Cao, D., Li, S.: Re-ranking person re-identification with  k-reciprocal encoding. In: CVPR (2017)   Generalizing A Person Retrieval Model Hetero- and Homogeneously47. Zhong, Z., Zheng, L., Kang, G., Li, S., Yang, Y.: Random erasing data augmenta-  tion. arXiv preprint arXiv:1708.04896 (2017)  48. Zhong, Z., Zheng, L., Zheng, Z., Li, S., Yang, Y.: Camera style adaptation for  person re-identification. In: CVPR (2018)  49. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation  using cycle-consistent adversarial networks. In: ICCV (2017)  50. Zhu, X.: Semi-supervised learning literature survey. Technical report, University  of Wisconsin-Madison (2005)"}