{"1": "1. Viola, P., Jones, M.J.: Robust real-time face detection. Internatinoal Journal of  Computer Vision 57(2) (2004) 137-154  2. Brubaker, S.C., Wu, J., Sun, J., Mullin, M.D., Rehg, J.M.: On the design of cas- cades of boosted ensembles for face detection. Internatinoal Journal of Computer Vision 77(1-3) (2008)  3. Pham, M.T., Cham, T.J.: Fast training and selection of haar features using statis-  tics in boosting-based face detection. In: ICCV (2007)  4. Liao, S., Jain, A.K., Li., S.Z.: A fast and accurate unconstrained face detector.  IEEE Trans. Parttern Anal. Mach. Intell. 38 (2016)  5. Lowe, D.G.: Distinctive image features from scale-invariant keypoints. Internati-  noal Journal of Computer Vision 60(2) (2004)  6. Yang, B., Yan, J., Lei, Z., Li, S.Z.: Aggregate channel features for multi-view face  detection. In: IJCB (2014) 1-8  7. Zhu, Q., Yeh, M.C., Cheng, K.T., Avidan, S.: Fast human detection using a cascade  of histograms of oriented gradients. In: CVPR 2 (2006)  8. Mathias, M., Benenson, R., Pedersoli, M., Gool, L.V.: Face detection without bells  9. Yan, J., Lei, Z., Wen, L., Li, S.Z.: The fastest deformable part model for object  and whistles. In: ECCV (2014)  detection. In: CVPR (2014)  in the wild. In: CVPR (2012)  10. Zhu, X., Ramanan, D.: Face detection, pose estimation, and landmark localization  11. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accu-  rate object detection and semantic segmentation. In: CVPR (2014)  12. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Region-based convolutional net- works for accurate object detection and segmentation. TIEEE Trans. Parttern Anal. Mach. Intell. 38(3) (2016)  13. R.Girshick: Fastr-cnn. In: ICCV (2015) 14. Ren, S., Girshick, K.H.R., Sun, J.: Faster r-cnn: Towards real-time object detection  with region proposal networks. In: NIPS (2015)  15. Liu, W., Anguelov, D., D.Erhan, Christian, S., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  single shot multibox detector. In: ECCV (2016)  16. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified,  real-time object detection. In: CVPR (2016)  17. Lin, T.Y., Goyal, P., Girshick, R., He, K., Doll´ar, P.: Focal loss for dense object  detection. In: ICCV (2017)  18. Zhang, S., Wen, L., Bian, X., Lei, Z., Li, S.Z.: Single-shot refinement neural network  for object detection. arXiv preprint (2017)  19. Barbu, A., Gramajo, G.: Face detection with a 3d model.  arXiv preprint  arXiv::1404.3596 (2014)  20. Najibi, M., Samangouei, P., Chellappa, R., Davis, L.S.: Ssh: Single stage headless  face detector. In: ICCV (2017)  21. Zhang, S., Zhu, X., Lei, X., Shi, H., Wang, X., Li, S.Z.: S3fd: Single shot scale-  invariant face detector. In: ICCV (2017)  22. Wang, Y., Ji, X., Zhou, Z., Wang, H., Li, Z.: Detecting faces using region-based  fully convolutional networs. arXiv preprint arXiv::1709.05256 (2017)  23. Wang, J., Y.Yuan, Yu, G.: Face attention network: An eﬀective face detector for  the occluded faces. arXiv preprint arXiv::1711.07246 (2017)   PyramidBox: A Context-assisted Single Shot Face Detector.References  1. Viola, P., Jones, M.J.: Robust real-time face detection. Internatinoal Journal of  Computer Vision 57(2) (2004) 137-154  2. Brubaker, S.C., Wu, J., Sun, J., Mullin, M.D., Rehg, J.M.: On the design of cas- cades of boosted ensembles for face detection. Internatinoal Journal of Computer Vision 77(1-3) (2008)  3. Pham, M.T., Cham, T.J.: Fast training and selection of haar features using statis-  tics in boosting-based face detection. In: ICCV (2007)  4. Liao, S., Jain, A.K., Li., S.Z.: A fast and accurate unconstrained face detector.  IEEE Trans. Parttern Anal. Mach. Intell. 38 (2016)  5. Lowe, D.G.: Distinctive image features from scale-invariant keypoints. Internati-  noal Journal of Computer Vision 60(2) (2004)  6. Yang, B., Yan, J., Lei, Z., Li, S.Z.: Aggregate channel features for multi-view face  detection. In: IJCB (2014) 1-8  7. Zhu, Q., Yeh, M.C., Cheng, K.T., Avidan, S.: Fast human detection using a cascade  of histograms of oriented gradients. In: CVPR 2 (2006)  8. Mathias, M., Benenson, R., Pedersoli, M., Gool, L.V.: Face detection without bells  9. Yan, J., Lei, Z., Wen, L., Li, S.Z.: The fastest deformable part model for object  and whistles. In: ECCV (2014)  detection. In: CVPR (2014)  in the wild. In: CVPR (2012)  10. Zhu, X., Ramanan, D.: Face detection, pose estimation, and landmark localization  11. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accu-  rate object detection and semantic segmentation. In: CVPR (2014)  12. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Region-based convolutional net- works for accurate object detection and segmentation. TIEEE Trans. Parttern Anal. Mach. Intell. 38(3) (2016)  13. R.Girshick: Fastr-cnn. In: ICCV (2015) 14. Ren, S., Girshick, K.H.R., Sun, J.: Faster r-cnn: Towards real-time object detection  with region proposal networks. In: NIPS (2015)  15. Liu, W., Anguelov, D., D.Erhan, Christian, S., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  single shot multibox detector. In: ECCV (2016)  16. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified,  real-time object detection. In: CVPR (2016)  17. Lin, T.Y., Goyal, P., Girshick, R., He, K., Doll´ar, P.: Focal loss for dense object  detection. In: ICCV (2017)  18. Zhang, S., Wen, L., Bian, X., Lei, Z., Li, S.Z.: Single-shot refinement neural network  for object detection. arXiv preprint (2017)  19. Barbu, A., Gramajo, G.: Face detection with a 3d model.  arXiv preprint  arXiv::1404.3596 (2014)  20. Najibi, M., Samangouei, P., Chellappa, R., Davis, L.S.: Ssh: Single stage headless  face detector. In: ICCV (2017)  21. Zhang, S., Zhu, X., Lei, X., Shi, H., Wang, X., Li, S.Z.: S3fd: Single shot scale-  invariant face detector. In: ICCV (2017)  22. Wang, Y., Ji, X., Zhou, Z., Wang, H., Li, Z.: Detecting faces using region-based  fully convolutional networs. arXiv preprint arXiv::1709.05256 (2017)  23. Wang, J., Y.Yuan, Yu, G.: Face attention network: An eﬀective face detector for  the occluded faces. arXiv preprint arXiv::1711.07246 (2017)   16  Xu Tang, Daniel K. Du, Zeqiang He and Jingtuo Liu  24. Lin, T.Y., Doll´ar, P., Girshick, R.: Feature pyramid networks for object detection.  In: CVPR (2017)  25. Zhang, S., Zhu, X., Lei, X., Shi, H., Wang, X., Li, S.Z.: Faceboxes: A cpu real-time  face detector with high accuracy. arXiv preprint arXiv:: 1708.05234 (2017)  26. Yang, S., Xiong, Y., Loy, C.C., Tang, X.: Face detection through scale-friendly  deep convolutional networks. arXiv preprint arXiv::1706.02863 (2017)  27. Zhu, C., Zheng, Y., Luu, K., Savvides, M.: Cms-rcnn: contextual multi-scale region- arXiv preprint arXiv::1606.05413  based cnn for unconstrained face detection. (2016)  28. Hu, P., Ramanan, D.: Finding tiny faces. In: CVPR (2017) 29. Liu, W., Rabinovich, A., Berg, A.C.: Parsenet: Looking wider to see better. ICLR  (2016)  30. Cai, Z., Fan, Q., Feris, R.S., Vasconcelos, N.: A unified multiscale deep convolu-  tional neural network for fast object detection. In: ECCV (2016)  31. Fu, C.Y., Liu, W., Ranga, A., Tyagi, A., Berg, A.C.: Dssd: Deconvolutional single  shot detector. arXiv preprint arXiv:: 1701.06659  32. Szegedy, C., Ioﬀe, S., Vanhoucke, V.: Inception-v4, inception-resnet and the impact of residual connections on learning. arXiv preprint arXiv::1602.07261 (2016) 33. Goodfellow, I.J., Farley, D.W., Mirza, M., Courville, A., Bengio, Y.: Maxout net-  works. (2013)  34. Thompson, S.K.: Sampling. WILEY (Mar. 2012) 35. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recog- nition challenge. Internatinoal Journal of Computer Vision 115(3) (2015)  36. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward  neural networks. In: Aistats 9 (2010)  37. Krizhevsky, A., Sutskever, I., Hinton, G.: Imagenet classification with deep convo-  lutional neural networks. In: NIPS (2012)  38. Jain, V., Learned-Miller, E.G.: Fddb: A benchmark for face detection in uncon-  strained settings. UMass Amherst Technical Report (2010)  39. S. Yang and, P.L.n.C.C.L., Tang, X.: Wider face: A face detection benchmark. In:  CVPR (2016)  40. Zhang, K., Zhang, Z., Li, Z., Qiao, Y.: Joint face detection and alignment using  multitask cascaded convolutional networks. In: SPL 23(10) (2016)  41. Yu, J., Jiang, Y., Wang, Z., Cao, Z., Huang, T.: Unitbox: An advanced object  detection network. In: ACMMM (2016)  42. Triantafyllidou, D., Tefas, A.: A fast deep convolutional neural network for face  detection in big visual data. In INNS Conference on Big Data (2016)  43. S. Yang and, P.L.n.C.C.L., Tang, X.: From facial parts responses to face detection:  A deep learning approach. In: ICCV (2015)  44. Li, Y., Sun, B., Wu, T., Wang, Y.: Facedetection with end-to-end integration of a  convnet and a 3d model. (2016)  volutional neural networks  faces. (2015)  tion. In: ICCV (2015)  45. Farfade, S.S., Saberian, M.J., Li, L.J.: Multi-view face detection using deep con-  46. Ghiasi, G., Fowlkes, C.: Occlusion coherence: Detecting and localizing occluded  47. Kumar, V., Namboodiri, A., Jawahar, C.: Visual phrases for exemplar face detec-  48. Li, H., Hua, G., Lin, Z., Brandt, J., Yang, J.: Probabilistic elastic part model for  unsupervised face detector adaptation. In: ICCV (2013)   PyramidBox: A Context-assisted Single Shot Face Detector.49. Li, J., Zhang, Y.: Learning surf cascade for fast and accurate object detection. In:  50. Li, H., Lin, Z., Brandt, J., Shen, X., Hua, G.: Eﬃcient boosted exemplar-based  CVPR (2013)  face detection. In: CVPR (2014)  51. Ohn-Bar, E., Trivedi, M.M.: To boost or not to boost? on the limits of boosted  trees for object detection. In: ICPR (2016)  52. Ranjan, R., Patel, V.M., Chellappa, R.: A deep pyramid deformable part model  for face detection. In: BTAS (2015)  53. Ranjan, R., Patel, V.M., Chellappa, R.: Hyperface: A deep multi-task learning framework for face detection, landmark localization, pose estimation, and gender recognition. arXiv preprint arXiv::1603.01249 (2016)  54. Wan, S., Chen, Z., Zhang, T., Zhang, B., Wong, K.K.: Bootstrapping face detection  with hard negative examples. arXiv preprint arXiv: 1608.02236 (2016)  55. Zhang, C., Xu, X., Tu, D.: Face detection using improved faster rcnn. arXiv  56. Wang, H., Li, Z., Ji, X., Wang, Y.: Face r-cnn. arxiv preprint. arXiv preprint  preprint arXiv:: 1802.02142 (2018)  arXiv:1706.01061 7 (2017)"}