{"1": "CVPR (2017)  1. Bai, S., Bai, X., Tian, Q.: Scalable person re-identification on supervised smoothed manifold.  2. Barman, A., Shah, S.K.: Shape: A novel graph theoretic algorthm for making consensus-  based decisions in person re-identification systems. ICCV (2017)  3. Bodesheim, P., Freytag, A., Rodner, E., Kemmler, M., Denzler, J.: Kernel null space methods  in novelty detection. CVPR (2013)  4. Chang, C.C., Lin, C.J.: Libsvm: A library for support vector machines. ACM Trans. on In-  telligent Systems and Technology 2(3), 27:1-27:27 (2011)  5. Chen, D., Yuan, Z., Chen, B., Zheng, N.: Similarity learning with spatial constraints for  person re-identification. CVPR (2016)  6. Chen, D., Yuan, Z., Hua, G., Zheng, N., Wang, J.: Similarity learning on an explicit polyno-  mial kernel feature map for person re-identification. CVPR (2015)  7. Chen, W., Chen, X., Zhang, J., Huang, K.: Beyond triplet loss: a deep quadruplet network  for person re-identification. CVPR (2017)  8. Cheng, D., Gong, Y., Zhou, S., Wang, J., Zheng, N.: Person re-identification by multi-channel  parts-based cnn with improved triplet loss function. CVPR (2016)  9. Davis, J.V., Kulis, B., Jain, P., Sra, S., Dhillon, I.S.: Information-theoretic metric learning.  ICML (2007)  10. Farenzena, M., Bazzani, L., Perina, A., Cristani, M., Murino, V.: Person re-identification by  symmetry-driven accumulation of local features. CVPR (2010)  11. Garcia, J., Martinel, N., Micheloni, C., Gardel, A.: Person re-identification ranking optimi-  sation by discriminant context information analysis. ICCV (2015)  12. Gray, D., Tao, H.: Viewpoint invariant pedestrian recognition with an ensemble of localized  13. Guillaumin, M., Verbeek, J., Schmid, C.: Is that you? metric learning approaches for face  14. Guo, Y., Wu, L., Lu, H., Feng, Z., Xue, X.: Null foley-sammon transform. Pattern Recogni-  features. ECCV (2008)  identification. ICCV (2009)  tion (2006)  analysis. ECCV (2016)  learning. ECCV (2016)  TPAMI (2013)  criterion. NIPS (2004)  criterion. IEEE TNN (2006)  (2012)  15. Hirzer, M., Roth, P.M., Kostinger, M., Bischof, H.: Relaxed pairwise learned metric for per-  son re-identification. ECCV (2012)  16. Jose, C., Fleuret, F.: Scalable metric learning via weighted approximate rank component  17. Kodirov, E., Xiang, T., Fu, Z., Gong, S.: Person re-identification by unsupervised l1 graph  18. Kviatkovsky, I., Adam, A., Rivlin, E.: Color invariants for person reidentification. IEEE  19. Kstinger, M., andP. Wohlhart, M.H., Roth, P.M., Bischof, H.: Large scale metric learning  from equivalence constraints. CVPR (2012)  20. Li, H., Jiang, T., Zheng, K.: Efficient and robust feature extraction by maximum margin  21. Li, H., Jiang, T., Zheng, K.: Efficient and robust feature extraction by maximum margin  22. Li, W., Zhao, R., Wang, X.: Human reidentification with transferred metric learning. ACCV  23. Liao, S., Hu, Y., Zhu, X., Li, S.Z.: Person re-identification by local maximal occurrence  representation and metric learning. CVPR (2015)  24. Liao, S., Li, S.Z.: Efficient psd constrained asymmetric metric learning for person re-  identification. ICCV (2015)   Maximum Margin Metric LearningReferences  CVPR (2017)  1. Bai, S., Bai, X., Tian, Q.: Scalable person re-identification on supervised smoothed manifold.  2. Barman, A., Shah, S.K.: Shape: A novel graph theoretic algorthm for making consensus-  based decisions in person re-identification systems. ICCV (2017)  3. Bodesheim, P., Freytag, A., Rodner, E., Kemmler, M., Denzler, J.: Kernel null space methods  in novelty detection. CVPR (2013)  4. Chang, C.C., Lin, C.J.: Libsvm: A library for support vector machines. ACM Trans. on In-  telligent Systems and Technology 2(3), 27:1-27:27 (2011)  5. Chen, D., Yuan, Z., Chen, B., Zheng, N.: Similarity learning with spatial constraints for  person re-identification. CVPR (2016)  6. Chen, D., Yuan, Z., Hua, G., Zheng, N., Wang, J.: Similarity learning on an explicit polyno-  mial kernel feature map for person re-identification. CVPR (2015)  7. Chen, W., Chen, X., Zhang, J., Huang, K.: Beyond triplet loss: a deep quadruplet network  for person re-identification. CVPR (2017)  8. Cheng, D., Gong, Y., Zhou, S., Wang, J., Zheng, N.: Person re-identification by multi-channel  parts-based cnn with improved triplet loss function. CVPR (2016)  9. Davis, J.V., Kulis, B., Jain, P., Sra, S., Dhillon, I.S.: Information-theoretic metric learning.  ICML (2007)  10. Farenzena, M., Bazzani, L., Perina, A., Cristani, M., Murino, V.: Person re-identification by  symmetry-driven accumulation of local features. CVPR (2010)  11. Garcia, J., Martinel, N., Micheloni, C., Gardel, A.: Person re-identification ranking optimi-  sation by discriminant context information analysis. ICCV (2015)  12. Gray, D., Tao, H.: Viewpoint invariant pedestrian recognition with an ensemble of localized  13. Guillaumin, M., Verbeek, J., Schmid, C.: Is that you? metric learning approaches for face  14. Guo, Y., Wu, L., Lu, H., Feng, Z., Xue, X.: Null foley-sammon transform. Pattern Recogni-  features. ECCV (2008)  identification. ICCV (2009)  tion (2006)  analysis. ECCV (2016)  learning. ECCV (2016)  TPAMI (2013)  criterion. NIPS (2004)  criterion. IEEE TNN (2006)  (2012)  15. Hirzer, M., Roth, P.M., Kostinger, M., Bischof, H.: Relaxed pairwise learned metric for per-  son re-identification. ECCV (2012)  16. Jose, C., Fleuret, F.: Scalable metric learning via weighted approximate rank component  17. Kodirov, E., Xiang, T., Fu, Z., Gong, S.: Person re-identification by unsupervised l1 graph  18. Kviatkovsky, I., Adam, A., Rivlin, E.: Color invariants for person reidentification. IEEE  19. Kstinger, M., andP. Wohlhart, M.H., Roth, P.M., Bischof, H.: Large scale metric learning  from equivalence constraints. CVPR (2012)  20. Li, H., Jiang, T., Zheng, K.: Efficient and robust feature extraction by maximum margin  21. Li, H., Jiang, T., Zheng, K.: Efficient and robust feature extraction by maximum margin  22. Li, W., Zhao, R., Wang, X.: Human reidentification with transferred metric learning. ACCV  23. Liao, S., Hu, Y., Zhu, X., Li, S.Z.: Person re-identification by local maximal occurrence  representation and metric learning. CVPR (2015)  24. Liao, S., Li, S.Z.: Efficient psd constrained asymmetric metric learning for person re-  identification. ICCV (2015)   16  Feroz Ali and S. Chaudhuri  25. Lisanti, G., Masi, I., Bimbo, A.D.: Matching people across camera views using kernel canon- ical correlation analysis. In Proceedings of the International Conference on Distributed Smart Cameras. ACM (2014)  26. Lisanti, G., Masi, I., Bimbo, A.D.: Person re-identification by iterative re-weighted sparse  ranking. IEEE TPAMI (2014)  27. Loy, C.C., Xiang, T., Gong, S.: Multi-camera activity correlation analysis. CVPR (2009) 28. Ma, L., Yang, X., Tao, D.: Person re-identification over camera networks using multi-task  29. Martinel, N., Das, A., Micheloni, C., Chowdhury, A.K.R.: Temporal model adaptation for  distance metric learning. IEEE TIP (2014)  person reidentification. ECCV (2016)  30. Martinel, N., Micheloni, C., Foresti, G.L.: Kernelized saliency-based person re-identification  through multiple metric learning. IEEE TIP (2015)  31. Matsukawa, T., Okabe, T., Suzuki, E., Sato, Y.: Hierarchical gaussian descriptor for person  32. Mignon, A., Jurie, F.: Pcca: A new approach for distance learning from sparse pairwise  33. Nowak, E., Jurie, F.: Learning visual similarity measures for comparing never seen objects.  34. Okada, T., Tomita, S.: An optimal orthonormal system for discriminant analysis. Pattern  re-identification. CVPR (2016)  constraints. CVPR (2012)  CVPR (2007)  Recognition (1985)  35. Paisitkriangkrai, S., Shen, C., van den Hengel, A.: Learning to rank in person re-identification  36. Pedagadi, S., Orwell, J., Velastin, S., Boghossian, B.: Local fisher discriminant analysis for  with metric ensembles. CVPR (2015)  pedestrian re-identification. CVPR (2013)  37. Roth, P.M., Hirzer, M., Koestinger, M., Beleznai, C., Bischof, H.: Mahalanobis distance  learning for person re-identification. In Person Re-Identification (2014)  38. Sammon Jr, J.: An optimal discriminant plane. IEEE Transactions on Computers (1970) 39. Shen, Y., Lin, W., Yan, J., Xu, M., Wu, J., Wang, J.: Person re-identification with correspon-  dence structure learning. ICCV (2015)  40. Shi, H., Yang, Y., Zhu, X., Liao, S., Lei, Z., Zheng, W., Li., S.Z.: Embedding deep metric for  person re-identification: A study against large variations. ECCV (2016)  41. Shi, Z., Hospedales, T.M., Xiang, T.: Transferring a semantic representation for person re-  42. Su, C., Li, J., Zhang, S., Xing, J., Gao, W., Tian, Q.: Pose-driven deep convolutional model  identification and search. CVPR (2015)  for person re-identification. ICCV (2017)  43. Su, C., Zhang, S., Xing, J., Gao, W., Tian, Q.: Deep attributes driven multi-camera person  44. Sugiyama, M.: Local fisher discriminant analysis for supervised dimensionality reduction.  re-identification. ECCV (2016)  ICML (2006)  45. Tao, D., Guo, Y., Song, M., Li, Y., Yu, Z., Tang, Y.Y.: Person re-identification by dual-  regularized kiss metric learning. IEEE TIP (2016)  46. Varior, R.R., Haloi, M., Wang., G.: Gated siamese convolutional neural network architecture  for human reidentification. ECCV (2016)  47. Varior, R.R., Shuai, B., Lu, J., Xu, D., Wang, G.: A siamese long short-term memory archi-  tecture for human reidentification. ECCV (2016)  48. Weinberger, K.Q., Blitzer, J., Saul, L.K.: Distance metric learning for large margin nearest  49. Weinberger, K.Q., Saul, L.K.: Fast solvers and efficient implementations for distance metric  neighbor classification. NIPS (2006)  learning. ICML (2008)  50. Xiao, T., Li, H., Ouyang, W., Wang, X.: Learning deep feature representations with domain  guided dropout for person re-identification. CVPR (2016)   Maximum Margin Metric Learning51. Xiong, F., Gou, M., Camps, O., Sznaier, M.: Person re-identification using kernel-based met-  52. Yang, Y., Yang, J., Yan, J., Liao, S., Yi, D., Li, S.Z.: Salient color names for person re-  53. Yu, H.X., Wu, A., Zheng, W.S.: Cross-view asymmetric metric learning for unsupervised  ric learning methods. ECCV (2014)  identification. ECCV (2014)  person re-identification. ICCV (2017)  identification. CVPR (2016)  54. Zhang, Y., Li, B., 1, H.L., 2, A.I., Ruan, X.: Sample-specific svm learning for person re-  55. Zhao, H., Tian, M., Sun, S., Shao, J., Yan, J., Yi, S., Wang, X., Tang, X.: Spindle net: Person re-identification with human body region guided feature decomposition and fusion. CVPR (2017)  56. Zhao, L., Li, X., Zhuang, Y., Wang, J.: Deeply-learned part-aligned representations for per-  son re-identification. ICCV (2017)  57. Zhao, R., Ouyang, W., Wang, X.: Person re-identification by salience matching. ICCV (2013) 58. Zhao, R., Ouyang, W., Wang, X.: Unsupervised salience learning for person re-identification.  CVPR (2013)  CVPR (2014)  59. Zhao, R., Ouyang, W., Wang., X.: Learning mid-level filters for person re-identification.  60. Zheng, L., Wang, S., Tian, L., He, F., Liu, Z., Tian, Q.: Query-adaptive late fusion for image  search and person reidentification. CVPR (2015)  61. Zheng, L., Xiang, T., Gong, S.: Learning a discriminative null space for person re-  identification. CVPR (2016)  comparison. CVPR (2011)  encoding. CVPR (2017)  62. Zheng, S., Gong, S., Xiang, T.: Person re-identification by probabilistic relative distance  63. Zhong, Z., Zheng, L., Cao, D., Li, S.: Re-ranking person re-identification with k-reciprocal  64. Zhou, J., Yu, P., Tang, W., Wu, Y.: Efficient online local metric adaptation via negative sam-  ples for person re-identification. ICCV (2017)"}