{"1": "1. Alliez, P., Cohen-Steiner, D., Tong, Y., Desbrun, M.: Voronoi-based variational reconstruction of unoriented point sets. In: Symposium on Geometry processing. vol. 7, pp. 39-48 (2007)  2. Berger, M., Tagliasacchi, A., Seversky, L.M., Alliez, P., Guennebaud, G., Levine, J.A., Sharf, A., Silva, C.T.: A survey of surface reconstruction from point clouds. In: Computer Graphics Forum. vol. 36, pp. 301-329. Wiley Online Library (2017) stereo 2011),  3. Bleyer, M., Rhemann, C., Rother, C.: Patchmatch  matching with slanted support windows. https://www.microsoft.com/en-us/research/publication/patchmatch-stereo- stereo-matching-with-slanted-support-windows/  - In: BMVC (January  stereo  4. Calakli, F., Taubin, G.: Ssd: Smooth signed distance surface reconstruction. In: Computer Graphics Forum. vol. 30, pp. 1993-2002. Wiley Online Library (2011) 5. Carr, J.C., Beatson, R.K., Cherrie, J.B., Mitchell, T.J., Fright, W.R., McCallum, B.C., Evans, T.R.: Reconstruction and representation of 3d objects with radial ba- sis functions. In: Proceedings of the 28th annual conference on Computer graphics and interactive techniques. pp. 67-76. ACM (2001)  6. Chang, A.X., Funkhouser, T., Guibas, L., Hanrahan, P., Huang, Q., Li, Z., Savarese, S., Savva, M., Song, S., Su, H., et al.: Shapenet: An information-rich 3d model repository. arXiv preprint arXiv:1512.03012 (2015)  7. Charles, R.Q., Su, H., Kaichun, M., Guibas, L.J.: Pointnet: Deep learning on point sets for 3d classification and segmentation. In: Computer Vision and Pattern Recog- nition (CVPR), 2017 IEEE Conference on. pp. 77-85. IEEE (2017)  8. Chauve, A.L., Labatut, P., Pons, J.P.: Robust piecewise-planar 3d reconstruction and completion from large-scale unstructured point data. In: Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on. pp. 1261-1268. IEEE (2010)  9. Chen, K., Lai, Y.K., Hu, S.M.: 3d indoor scene modeling from rgb-d data: a survey.  Computational Visual Media 1(4), 267-278 (2015)  10. Chen, K., Lai, Y., Wu, Y.X., Martin, R.R., Hu, S.M.: Automatic semantic modeling of indoor scenes from low-quality rgb-d data using contextual information. ACM Transactions on Graphics 33(6) (2014)  11. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  12. Chen, Q., Koltun, V.: Fast mrf optimization with application to depth reconstruc- tion. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3914-3921 (2014)  13. Choi, S., Zhou, Q.Y., Koltun, V.: Robust reconstruction of indoor scenes. In: 2015 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 5556- 5565 (June 2015)  14. Choy, C.B., Xu, D., Gwak, J., Chen, K., Savarese, S.: 3d-r2n2: A unified approach for single and multi-view 3d object reconstruction. In: European Conference on Computer Vision. pp. 628-644. Springer (2016)  15. C¸ i¸cek, ¨O., Abdulkadir, A., Lienkamp, S.S., Brox, T., Ronneberger, O.: 3d u-net: learning dense volumetric segmentation from sparse annotation. In: International Conference on Medical Image Computing and Computer-Assisted Intervention. pp. 424-432. Springer (2016)   3D-CFCNReferences  1. Alliez, P., Cohen-Steiner, D., Tong, Y., Desbrun, M.: Voronoi-based variational reconstruction of unoriented point sets. In: Symposium on Geometry processing. vol. 7, pp. 39-48 (2007)  2. Berger, M., Tagliasacchi, A., Seversky, L.M., Alliez, P., Guennebaud, G., Levine, J.A., Sharf, A., Silva, C.T.: A survey of surface reconstruction from point clouds. In: Computer Graphics Forum. vol. 36, pp. 301-329. Wiley Online Library (2017) stereo 2011),  3. Bleyer, M., Rhemann, C., Rother, C.: Patchmatch  matching with slanted support windows. https://www.microsoft.com/en-us/research/publication/patchmatch-stereo- stereo-matching-with-slanted-support-windows/  - In: BMVC (January  stereo  4. Calakli, F., Taubin, G.: Ssd: Smooth signed distance surface reconstruction. In: Computer Graphics Forum. vol. 30, pp. 1993-2002. Wiley Online Library (2011) 5. Carr, J.C., Beatson, R.K., Cherrie, J.B., Mitchell, T.J., Fright, W.R., McCallum, B.C., Evans, T.R.: Reconstruction and representation of 3d objects with radial ba- sis functions. In: Proceedings of the 28th annual conference on Computer graphics and interactive techniques. pp. 67-76. ACM (2001)  6. Chang, A.X., Funkhouser, T., Guibas, L., Hanrahan, P., Huang, Q., Li, Z., Savarese, S., Savva, M., Song, S., Su, H., et al.: Shapenet: An information-rich 3d model repository. arXiv preprint arXiv:1512.03012 (2015)  7. Charles, R.Q., Su, H., Kaichun, M., Guibas, L.J.: Pointnet: Deep learning on point sets for 3d classification and segmentation. In: Computer Vision and Pattern Recog- nition (CVPR), 2017 IEEE Conference on. pp. 77-85. IEEE (2017)  8. Chauve, A.L., Labatut, P., Pons, J.P.: Robust piecewise-planar 3d reconstruction and completion from large-scale unstructured point data. In: Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on. pp. 1261-1268. IEEE (2010)  9. Chen, K., Lai, Y.K., Hu, S.M.: 3d indoor scene modeling from rgb-d data: a survey.  Computational Visual Media 1(4), 267-278 (2015)  10. Chen, K., Lai, Y., Wu, Y.X., Martin, R.R., Hu, S.M.: Automatic semantic modeling of indoor scenes from low-quality rgb-d data using contextual information. ACM Transactions on Graphics 33(6) (2014)  11. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  12. Chen, Q., Koltun, V.: Fast mrf optimization with application to depth reconstruc- tion. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3914-3921 (2014)  13. Choi, S., Zhou, Q.Y., Koltun, V.: Robust reconstruction of indoor scenes. In: 2015 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 5556- 5565 (June 2015)  14. Choy, C.B., Xu, D., Gwak, J., Chen, K., Savarese, S.: 3d-r2n2: A unified approach for single and multi-view 3d object reconstruction. In: European Conference on Computer Vision. pp. 628-644. Springer (2016)  15. C¸ i¸cek, ¨O., Abdulkadir, A., Lienkamp, S.S., Brox, T., Ronneberger, O.: 3d u-net: learning dense volumetric segmentation from sparse annotation. In: International Conference on Medical Image Computing and Computer-Assisted Intervention. pp. 424-432. Springer (2016)   16  Y.-P. Cao et. al.  16. Collet, A., Chuang, M., Sweeney, P., Gillett, D., Evseev, D., Calabrese, D., Hoppe, H., Kirk, A., Sullivan, S.: High-quality streamable free-viewpoint video. ACM Trans. Graph. 34(4), 69:1-69:13 (Jul 2015). https://doi.org/10.1145/2766945, http://doi.acm.org/10.1145/2766945  17. Curless, B., Levoy, M.: A volumetric method for building complex models from range images. In: Proceedings of the 23rd Annual Conference on Com- puter Graphics and Interactive Techniques. pp. 303-312. SIGGRAPH ’96, ACM, New York, NY, USA (1996). https://doi.org/10.1145/237170.237269, http://doi.acm.org/10.1145/237170.237269  18. Dai, A., Nießner, M., Zollh¨ofer, M., Izadi, S., Theobalt, C.: Bundlefusion: Real-time globally consistent 3d reconstruction using on-the-ﬂy surface reintegration. ACM Trans. Graph. 36(3), 24:1-24:18 (May 2017), http://doi.acm.org/10.1145/3054739 19. Dai, A., Qi, C.R., Nießner, M.: Shape completion using 3d-encoder-predictor cnns and shape synthesis. In: Proc. IEEE Conf. on Computer Vision and Pattern Recog- nition (CVPR). vol. 3 (2017)  20. Dou, Q., Yu, L., Chen, H., Jin, Y., Yang, X., Qin, J., Heng, P.A.: 3d deeply super- vised network for automated segmentation of volumetric medical images. Medical image analysis 41, 40-54 (2017)  21. Fanello, S.R., Valentin, J., Rhemann, C., Kowdle, A., Tankovich, V., Davidson, P., Izadi, S.: Ultrastereo: Eﬃcient learning-based matching for active stereo systems. In: Computer Vision and Pattern Recognition (CVPR), 2017 IEEE Conference on. pp. 6535-6544. IEEE (2017)  22. Firman, M., Mac Aodha, O., Julier, S., Brostow, G.J.: Structured prediction of un- observed voxels from a single depth image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5431-5440 (2016)  23. Fuhrmann, S., Goesele, M.: Fusion of depth maps with multiple scales. In: ACM  Transactions on Graphics (TOG). vol. 30, p. 148. ACM (2011)  24. Gallup, D., Pollefeys, M., Frahm, J.M.: 3d reconstruction using an n-layer  heightmap. In: Joint Pattern Recognition Symposium. pp. 1-10. Springer (2010)  25. Guennebaud, G., Gross, M.: Algebraic point set surfaces. In: ACM Transactions  on Graphics (TOG). vol. 26, p. 23. ACM (2007)  26. Han, X., Li, Z., Huang, H., Kalogerakis, E., Yu, Y.: High-resolution shape comple- tion using deep neural networks for global structure and local geometry inference. In: IEEE International Conference on Computer Vision (ICCV) (October 2017)  27. H¨ane, C., Tulsiani, S., Malik, J.: Hierarchical surface prediction for 3d object re-  construction. arXiv preprint arXiv:1704.00710 (2017)  28. Ji, M., Gall, J., Zheng, H., Liu, Y., Fang, L.: Surfacenet: An end-to-end 3d neural  network for multiview stereopsis. arXiv preprint arXiv:1708.01749 (2017)  29. K¨ahler, O., Prisacariu, V.A., Murray, D.W.: Real-Time Large-Scale Dense 3D Re- construction with Loop Closure, pp. 500-516. Springer International Publishing, Cham (2016), http://dx.doi.org/10.1007/978-3-319-46484-8-30  30. Kazhdan, M., Hoppe, H.: Screened poisson surface reconstruction. ACM Trans. Graph. 32(3), 29:1-29:13 (Jul 2013), http://doi.acm.org/10.1145/2487228.2487237 31. Keller, M., Leﬂoch, D., Lambers, M., Izadi, S., Weyrich, T., Kolb, A.: Real-time 3d reconstruction in dynamic scenes using point-based fusion. In: 3D Vision-3DV 2013, 2013 International Conference on. pp. 1-8. IEEE (2013)  32. Kerl, C., Sturm, J., Cremers, D.: Robust odometry estimation for rgb-d cameras. In: 2013 IEEE International Conference on Robotics and Automation. pp. 3748- 3754 (May 2013). https://doi.org/10.1109/ICRA.2013.6631104  33. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)   3D-CFCN34. Kutulakos, K.N., Seitz, S.M.: A theory of shape by space carving. International  journal of computer vision 38(3), 199-218 (2000)  35. Lorensen, W.E., Cline, H.E.: Marching cubes: A high resolution 3d surface con- struction algorithm. In: ACM siggraph computer graphics. vol. 21, pp. 163-169. ACM (1987)  36. Macedo, I., Gois, J.P., Velho, L.: Hermite radial basis functions implicits. In: Com-  puter Graphics Forum. vol. 30, pp. 27-42. Wiley Online Library (2011)  37. McIlroy, P., Izadi, S., Fitzgibbon, A.: Kinectrack: 3d pose estimation using a pro- jected dense dot pattern. IEEE transactions on visualization and computer graph- ics 20(6), 839-851 (2014)  38. Meilland, M., Comport, A.I.: On unifying key-frame and voxel-based dense visual slam at large scales. In: Intelligent Robots and Systems (IROS), 2013 IEEE/RSJ International Conference on. pp. 3677-3683. IEEE (2013)  39. Newcombe, R.A., Izadi, S., Hilliges, O., Molyneaux, D., Kim, D., Davison, A.J., Kohi, P., Shotton, J., Hodges, S., Fitzgibbon, A.: Kinectfusion: Real-time dense surface mapping and tracking. In: 2011 10th IEEE International Symposium on Mixed and Augmented Reality. pp. 127-136 (Oct 2011)  40. Oeztireli, A.C., Guennebaud, G., Gross, M.: Feature Preserving Point Set Sur- faces based on Non-Linear Kernel Regression. Computer Graphics Forum (2009). https://doi.org/10.1111/j.1467-8659.2009.01388.x  41. ¨Oztireli, A.C., Guennebaud, G., Gross, M.: Feature preserving point set surfaces based on non-linear kernel regression. In: Computer Graphics Forum. vol. 28, pp. 493-501. Wiley Online Library (2009)  42. Riegler, G., Ulusoy, A.O., Bischof, H., Geiger, A.: Octnetfusion: Learning depth fusion from data. In: Proceedings of the International Conference on 3D Vision (2017)  43. Riegler, G., Ulusoy, A.O., Geiger, A.: Octnet: Learning deep 3d representations at high resolutions. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. vol. 3 (2017)  44. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomedi- cal image segmentation. In: International Conference on Medical image computing and computer-assisted intervention. pp. 234-241. Springer (2015)  45. Schnabel, R., Degener, P., Klein, R.: Completion and reconstruction with primitive shapes. In: Computer Graphics Forum. vol. 28, pp. 503-512. Wiley Online Library (2009)  46. Shan, Q., Curless, B., Furukawa, Y., Hernandez, C., Seitz, S.M.: Occluding con- tours for multi-view stereo. In: 2014 IEEE Conference on Computer Vision and Pattern Recognition. pp. 4002-4009 (June 2014)  47. Shao, T., Xu, W., Zhou, K., Wang, J., Li, D., Guo, B.: An interactive approach to semantic modeling of indoor scenes with an rgbd camera. ACM Transactions on Graphics (TOG) 31(6), 136 (2012)  48. Sharma, A., Grau, O., Fritz, M.: Vconv-dae: Deep volumetric shape learning with- out object labels. In: European Conference on Computer Vision. pp. 236-250. Springer (2016)  Fu,  C.H.,  49. Shen, ery 180:11 http://doi.acm.org/10.1145/2366145.2366199  H., assembly.  Chen, K.,  part (Nov  2012).  by  Hu, ACM Trans.  recov- 180:1- https://doi.org/10.1145/2366145.2366199,  Structure 31(6),  S.M.: Graph.  50. Sinha, A., Unmesh, A., Huang, Q., Ramani, K.: Surfnet: Generating 3d shape  surfaces using deep residual networks. In: Proc. CVPR (2017)   18  Y.-P. Cao et. al.  51. Song, S., Yu, F., Zeng, A., Chang, A.X., Savva, M., Funkhouser, T.: Semantic scene completion from a single depth image. In: Computer Vision and Pattern Recognition (CVPR), 2017 IEEE Conference on. pp. 190-198. IEEE (2017) 52. Steinbrcker, F., Sturm, J., Cremers, D.: Real-time visual odometry from In: 2011 IEEE International Conference on Com- (ICCV Workshops). pp. 719-722 (Nov 2011).  dense puter Vision Workshops https://doi.org/10.1109/ICCVW.2011.6130321  rgb-d images.  53. Tatarchenko, M., Dosovitskiy, A., Brox, T.: Octree generating networks: Eﬃ- cient convolutional architectures for high-resolution 3d outputs. In: IEEE Interna- tional Conference on Computer Vision (ICCV) (2017), http://lmb.informatik.uni- freiburg.de/Publications/2017/TDB17b  54. Tatarchenko, M., Dosovitskiy, A., Brox, T.: Multi-view 3d models from single im- ages with a convolutional network. In: European Conference on Computer Vision. pp. 322-337. Springer (2016)  55. Tulsiani, S., Zhou, T., Efros, A.A., Malik, J.: Multi-view supervision for single-view reconstruction via diﬀerentiable ray consistency. In: CVPR. vol. 1, p. 3 (2017) 56. Wang, P.S., Liu, Y., Guo, Y.X., Sun, C.Y., Tong, X.: O-cnn: Octree-based con- volutional neural networks for 3d shape analysis. ACM Transactions on Graphics (SIGGRAPH) 36(4) (2017)  57. Wang, W., Huang, Q., You, S., Yang, C., Neumann, U.: Shape inpainting us- ing 3d generative adversarial network and recurrent convolutional networks. arXiv preprint arXiv:1711.06375 (2017)  T.,  59. Whelan,  58. Whelan, T., Leutenegger, S., Salas-Moreno, R.F., Glocker, B., Davison, A.J.: Elas- ticfusion: Dense slam without a pose graph. Robotics: Science and Systems (2015) A.J., light of Robotics Research https://doi.org/10.1177/0278364916669237,  Leutenegger, source 35(14), https://doi.org/10.1177/0278364916669237  S.: estimation. The  Davison, slam and  Salas-Moreno,  Elasticfusion:  International  1697-1716  Real-time  Glocker,  Journal  (2016).  dense  R.F.,  B.,  60. Wu, J., Zhang, C., Xue, T., Freeman, B., Tenenbaum, J.: Learning a probabilistic latent space of object shapes via 3d generative-adversarial modeling. In: Advances in Neural Information Processing Systems. pp. 82-90 (2016)  61. Wu, Z., Song, S., Khosla, A., Yu, F., Zhang, L., Tang, X., Xiao, J.: 3d shapenets: A deep representation for volumetric shapes. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 1912-1920 (2015)  62. Wurm, K.M., Hornung, A., Bennewitz, M., Stachniss, C., Burgard, W.: Octomap: A probabilistic, ﬂexible, and compact 3d map representation for robotic systems. In: Proc. of the ICRA 2010 workshop on best practice in 3D perception and mod- eling for mobile manipulation. vol. 2 (2010)  63. Yan, X., Yang, J., Yumer, E., Guo, Y., Lee, H.: Perspective transformer nets: Learning single-view 3d object reconstruction without 3d supervision. In: Advances in Neural Information Processing Systems. pp. 1696-1704 (2016)  64. Yang, B., Wen, H., Wang, S., Clark, R., Markham, A., Trigoni, N.: 3d object reconstruction from a single depth view with adversarial learning. arXiv preprint arXiv:1708.07969 (2017)  65. Zach, C., Pock, T., Bischof, H.: A globally optimal algorithm for robust tv-l 1 range image integration. In: Computer Vision, 2007. ICCV 2007. IEEE 11th International Conference on. pp. 1-8. IEEE (2007)"}