{"1": "1. Akhtar, N., Shafait, F., Mian, A.: Sparse spatio-spectral representation for hyper- spectral image super-resolution. In: Proc. of European Conference on Computer Vision (ECCV). pp. 63-78 (Sep 2014)  2. Aly, H.A., Sharma, G.: A regularized model-based optimization framework for  pan-sharpening. IEEE Trans. Image Processing 23(6), 2596-2608 (2014)  3. Arad, B., Ben-Shahar, O.: Sparse recovery of hyperspectral signal from natural rgb images. In: Proc. of European Conference on Computer Vision (ECCV). pp. 19-34 (Oct 2016)  4. Arad, B., Ben-Shahar, O.: Filter selection for hyperspectral estimation. In: Proc. of International Conference on Computer Vision (ICCV). pp. 3172-3180 (Oct 2017) 5. Basedow, R.W., Carmer, D.C., Anderson, M.E.: Hydice system: Implementation and performance. In: SPIE’s Symposium on OE/Aerospace Sensing and Dual Use Photonics. pp. 258-267 (1995)  6. Bioucas-Dias, J.M., Plaza, A., Camps-Valls, G., Scheunders, P., Nasrabadi, N.M., Chanussot, J.: Hyperspectral remote sensing data analysis and future challenges. IEEE Geoscience and remote sensing magazine 1(2), 6-36 (2013)  7. Buades, A., Coll, B., Morel, J.M.: A non-local algorithm for image denoising. In: Proc. of IEEE Conference on Computer Vision and Pattern Recognition (CVPR). vol. 2, pp. 60-65 (Jun 2005)  8. Cao, X., Du, H., Tong, X., Dai, Q., Lin, S.: A prism-based system for multispectral bideo acquisition. IEEE Trans. Pattern Analysis and Machine Intelligence (PAMI) 33(12), 2423-2435 (2011)  9. Chakrabarti, A., Zickler, T.: Statistics of real-world hyperspectral images. In: Proc. of IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 193-200 (Jun 2011)  10. Chi, C., Yoo, H., Ben-Ezra, M.: Multi-spectral imaging by optimized wide band illumination. International Journal of Computer Vision (IJCV) 86(2-3), 140-151 (2010)  11. Dian, R., Fang, L., Li, S.: Hyperspectral image super-resolution via non-local sparse tensor factorization. In: Proc. of IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 5344-5353 (Jun 2017)  12. Dong, W., Fu, F., Shi, G., Cao, X., Wu, J., Li, G., Li, X.: Hyperspectral image super-resolution via non-negative structured sparse representation. IEEE Trans. Image Processing 25(5), 2337-2352 (May 2016)  13. Dong, W., Zhang, L., Shi, G.: Centralized sparse representation for image restora- tion. In: Proc. of International Conference on Computer Vision (ICCV). pp. 1259- 1266 (Nov 2011)  14. Ford, B.K., Descour, M.R., Lynch, R.M.: Large-image-format computed tomogra- phy imaging spectrometer for ﬂuorescence microscopy. Optics Express 9(9), 444- 453 (2001)  15. Gao, L., Kester, R.T., Hagen, N., Tkaczyk, T.S.: Snapshot image mapping spec- trometer (ims) with high sampling density for hyperspectral microscopy. Optics Express 18(14), 14330-14344 (2010)  16. Gat, N., Scriven, G., Garman, J., Li, M.D., Zhang, J.: Development of four- dimensional imaging spectrometers (4d-is). In: Proc. of SPIE Optics + Photonics. vol. 6302, pp. 63020M-63020M-11 (2006)  17. Gehm, M.E., John, R., Brady, D.J., Willett, R.M., Schulz, T.J.: Single-shot compressive spectral imaging with a dual-disperser architecture. Optics Express 15(21), 14013-27 (2007)   Joint CSS Selection and HSI RecoveryReferences  1. Akhtar, N., Shafait, F., Mian, A.: Sparse spatio-spectral representation for hyper- spectral image super-resolution. In: Proc. of European Conference on Computer Vision (ECCV). pp. 63-78 (Sep 2014)  2. Aly, H.A., Sharma, G.: A regularized model-based optimization framework for  pan-sharpening. IEEE Trans. Image Processing 23(6), 2596-2608 (2014)  3. Arad, B., Ben-Shahar, O.: Sparse recovery of hyperspectral signal from natural rgb images. In: Proc. of European Conference on Computer Vision (ECCV). pp. 19-34 (Oct 2016)  4. Arad, B., Ben-Shahar, O.: Filter selection for hyperspectral estimation. In: Proc. of International Conference on Computer Vision (ICCV). pp. 3172-3180 (Oct 2017) 5. Basedow, R.W., Carmer, D.C., Anderson, M.E.: Hydice system: Implementation and performance. In: SPIE’s Symposium on OE/Aerospace Sensing and Dual Use Photonics. pp. 258-267 (1995)  6. Bioucas-Dias, J.M., Plaza, A., Camps-Valls, G., Scheunders, P., Nasrabadi, N.M., Chanussot, J.: Hyperspectral remote sensing data analysis and future challenges. IEEE Geoscience and remote sensing magazine 1(2), 6-36 (2013)  7. Buades, A., Coll, B., Morel, J.M.: A non-local algorithm for image denoising. In: Proc. of IEEE Conference on Computer Vision and Pattern Recognition (CVPR). vol. 2, pp. 60-65 (Jun 2005)  8. Cao, X., Du, H., Tong, X., Dai, Q., Lin, S.: A prism-based system for multispectral bideo acquisition. IEEE Trans. Pattern Analysis and Machine Intelligence (PAMI) 33(12), 2423-2435 (2011)  9. Chakrabarti, A., Zickler, T.: Statistics of real-world hyperspectral images. In: Proc. of IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 193-200 (Jun 2011)  10. Chi, C., Yoo, H., Ben-Ezra, M.: Multi-spectral imaging by optimized wide band illumination. International Journal of Computer Vision (IJCV) 86(2-3), 140-151 (2010)  11. Dian, R., Fang, L., Li, S.: Hyperspectral image super-resolution via non-local sparse tensor factorization. In: Proc. of IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 5344-5353 (Jun 2017)  12. Dong, W., Fu, F., Shi, G., Cao, X., Wu, J., Li, G., Li, X.: Hyperspectral image super-resolution via non-negative structured sparse representation. IEEE Trans. Image Processing 25(5), 2337-2352 (May 2016)  13. Dong, W., Zhang, L., Shi, G.: Centralized sparse representation for image restora- tion. In: Proc. of International Conference on Computer Vision (ICCV). pp. 1259- 1266 (Nov 2011)  14. Ford, B.K., Descour, M.R., Lynch, R.M.: Large-image-format computed tomogra- phy imaging spectrometer for ﬂuorescence microscopy. Optics Express 9(9), 444- 453 (2001)  15. Gao, L., Kester, R.T., Hagen, N., Tkaczyk, T.S.: Snapshot image mapping spec- trometer (ims) with high sampling density for hyperspectral microscopy. Optics Express 18(14), 14330-14344 (2010)  16. Gat, N., Scriven, G., Garman, J., Li, M.D., Zhang, J.: Development of four- dimensional imaging spectrometers (4d-is). In: Proc. of SPIE Optics + Photonics. vol. 6302, pp. 63020M-63020M-11 (2006)  17. Gehm, M.E., John, R., Brady, D.J., Willett, R.M., Schulz, T.J.: Single-shot compressive spectral imaging with a dual-disperser architecture. Optics Express 15(21), 14013-27 (2007)   16  Ying Fu, Tao Zhang, Yinqiang Zheng, Debing Zhang, and Hua Huang  18. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward neural networks. In: Proc. of International Conference on Artificial Intelligence and Statistics. pp. 249-256 (May 2010)  19. Han, S., Sato, I., Okabe, T., Sato, Y.: Fast spectral reﬂectance recovery using DLP projector. International Journal of Computer Vision (IJCV) 110(2), 172-184 (2014)  20. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks. In: Proc. of European Conference on Computer Vision (ECCV). pp. 630-645 (Oct 2016)  21. Huang, G., Liu, Z., Maaten, L.v.d., Weinberger, K.Q.: Densely connected convo- lutional networks. In: Proc. of IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2261-2269 (Jul 2017)  22. Jia, Y., Zheng, Y., Gu, L., Subpa-Asa, A., Lam, A., Sato, Y., Sato, I.: From rgb to spectrum for natural scenes via manifold-based mapping. In: Proc. of International Conference on Computer Vision (ICCV). pp. 4715-4723 (Oct 2017)  23. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: Proc. of ACM Multimedia Conference (MM). pp. 675-678 (Nov 2014)  24. Jiang, J., Liu, D., Gu, J., Ssstrunk, S.: What is the space of spectral sensitivity functions for digital color cameras? In: IEEE Workshop on Applications of Com- puter Vision (WACV). pp. 168-179 (2013)  25. Kawakami, R., Wright, J., Tai, Y.W., Matsushita, Y., Ben-Ezra, M., Ikeuchi, K.: High-resolution hyperspectral imaging via matrix factorization. In: Proc. of IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2329-2336 (Jun 2011)  26. Kawakami, R., Zhao, H., Tan, R.T., Ikeuchi, K.: Camera spectral sensitivity and white balance estimation from sky images. International Journal of Computer Vi- sion (IJCV) 105(3), 187-204 (2013)  27. Kim, J., Lee, J.K., Lee, K.M.: Accurate image super-resolution using very deep convolutional networks. In: Proc. of IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 1646-1654 (Jun 2016)  28. Kim, S.J., Deng, F., Brown, M.S.: Visual enhancement of old documents with  hyperspectral imaging. Pattern Recognition 44(7), 1461-1469 (2011)  29. Kingma, D.P., Ba, J.L.: Adam: a method for stochastic optimization. In: Proc. of  International Conference on Learning Representations (ICLR) (May 2015)  30. Kruse, F.A., Lefkoﬀ, A.B., Boardman, J.W., Heidebrecht, K.B., Shapiro, A.T., Bar- loon, P.J., Goetz, A.F.H.: The spectral image processing system (sips)-interactive visualization and analysis of imaging spectrometer data. Remote Sensing of Envi- ronment 44(2-3), 145-163 (May 1993)  31. Kwon, H., Tai, Y.W.: Rgb-guided hyperspectral image upsampling. In: Proc. of International Conference on Computer Vision (ICCV). pp. 307-315 (Dec 2015) 32. Lanaras, C., Baltsavias, E., Schindler, K.: Hyperspectral super-resolution by cou- pled spectral unmixing. In: Proc. of International Conference on Computer Vision (ICCV). pp. 3586-3594 (Dec 2015)  33. Lin, X., Liu, Y., Wu, J., Dai, Q.: Spatial-spectral encoded compressive hyperspec- tral imaging. ACM Trans. on Graph. (Proc. of SIGGRAPH Asia) 33(6), 233:1- 233:11 (Nov 2014)  34. Loﬀe, S., Szegedy, C.: Batch normalization: accelerating deep network training by reducing internal covariate shift. In: Proc. of International Conference on Machine Learning (ICML). pp. 448-456 (Jun 2015)   Joint CSS Selection and HSI Recovery35. Ma, C., Cao, X., Tong, X., Dai, Q., Lin, S.: Acquisition of high spatial and spectral resolution video with a hybrid camera system. International Journal of Computer Vision (IJCV) 110(2), 141-155 (Nov 2014)  36. Nair, V., Hinton, G.E.: Rectified linear units improve restricted boltzmann ma- chines. In: Proc. of International Conference on Machine Learning (ICML). pp. 807-814 (Jun 2010)  37. Nguyen, H.V., Banerjee, A., Chellappa, R.: Tracking via object reﬂectance using a hyperspectral video camera. In: IEEE Conference on Computer Vision and Pattern Recognition - Workshops. pp. 44-51 (Jun 2010)  38. Nguyen, R.M.H., Prasad, D.K., Brown, M.S.: Training-based spectral reconstruc- tion from a single rgb image. In: Proc. of European Conference on Computer Vision (ECCV). pp. 186-201 (Sep 2014)  39. Pan, Z., Healey, G., Prasad, M., Tromberg, B.: Face recognition in hyperspectral images. IEEE Trans. Pattern Analysis and Machine Intelligence (PAMI) 25(12), 1552-1560 (2003)  40. Park, J.I., Lee, M.H., Grossberg, M.D., Nayar, S.K.: Multispectral imaging using multiplexed illumination. In: Proc. of International Conference on Computer Vision (ICCV). pp. 1-8 (Oct 2007)  41. Porter, W.M., Enmark, H.T.: A system overview of the airborne visible/infrared imaging spectrometer (aviris). In: Annual Technical Symposium. pp. 22-31 (1987) 42. Robles-Kelly, A.: Single image spectral reconstruction for multimedia applications.  In: Proc. of ACM Multimedia Conference (MM). pp. 251-260 (Oct 2015)  43. Tarabalka, Y., Chanussot, J., Benediktsson, J.A.: Segmentation and classifica- tion of hyperspectral images using watershed transformation. Pattern Recognition 43(7), 2367-2379 (2010)  44. Wagadarikar, A., John, R., Willett, R., Brady, D.: Single disperser design for coded aperture snapshot spectral imaging. Applied Optics 47(10), 44-51 (Apr 2008) 45. Wang, L., Xiong, Z., Gao, D., Shi, G., Wu, F.: Dual-camera design for coded aperture snapshot spectral imaging. Applied Optics 54(4), 848-858 (Feb 2015) 46. Wang, L., Xiong, Z., Shi, G., Wu, F., Zeng, W.: Adaptive nonlocal sparse represen- tation for dual-camera compressive hyperspectral imaging. IEEE Trans. Pattern Analysis and Machine Intelligence (PAMI) 39(10), 2104-2111 (Oct 2017)  47. Wang, Z., Bovik, A., Sheikh, H., Simoncelli, E.: Image quality assessment: from error visibility to structural similarity. IEEE Trans. Image Processing 13(4), 600- 612 (Apr 2004)  48. Wu, D., Sun, D.W.: Advanced applications of hyperspectral imaging technology for food quality and safety analysis and assessment: A reviewpart i: Fundamentals. Innovative Food Science & Emerging Technologies 19, 1-14 (2013)  49. Xu, X., Li, J., Huang, X., Dalla Mura, M., Plaza, A.: Multiple morphological component analysis based decomposition for remote sensing image classification. IEEE Trans. Geoscience and Remote Sensing 54(5), 3083-3102 (2016)  50. Xu, X., Wu, Z., Li, J., Plaza, A., Wei, Z.: Anomaly detection in hyperspectral images based on low-rank and sparse representation. IEEE Trans. Geoscience and Remote Sensing 54(4), 1990-2000 (2016)  51. Yamaguchi, M., Haneishi, H., Fukuda, H., Kishimoto, J., Kanazawa, H., Tsuchida, M., Iwama, R., Ohyama, N.: High-fidelity video and still-image communication based on spectral information: Natural vision system and its applications. In: Elec- tronic Imaging. pp. 60620G-60620G-12 (2006)  52. Yang, J., Fu, X., Hu, Y., Huang, Y., Ding, X., John, P.: Pannet: A deep network architecture for pan-sharpening. In: Proc. of International Conference on Computer Vision (ICCV). pp. 1753-1761 (Oct 2017)"}