{"1": "1. Wang, X., Yang, M., Zhu, S., Lin, Y.: Regionlets for generic object detection. In:  2. Xiao, S., Yan, S., Kassim, A.A.: Facial landmark detection via progressive initial-  ICCV. (2013) 17-24  ization. In: ICCVW. (2015) 33-40  3. Chrysos, G.G., Antonakos, E., Snape, P., Asthana, A., Zafeiriou, S.: A compre- hensive performance evaluation of deformable face tracking “in-the-wild”. IJCV (2016) 1-35  4. Shen, J., Zafeiriou, S., Chrysos, G.G., Kossaifi, J., Tzimiropoulos, G., Pantic, M.: The first facial landmark tracking in-the-wild challenge: Benchmark and results. In: ICCVW. (2015) 50-58  5. Asthana, A., Zafeiriou, S., Cheng, S., Pantic, M.: Incremental face alignment in  the wild. In: CVPR. (2014) 1859-1866  6. Peng, X., Zhang, S., Yang, Y., Metaxas, D.N.: Piefa: Personalized incremental and  ensemble face alignment. In: ICCV. (2015) 3880-3888  7. Peng, X., Feris, R.S., Wang, X., Metaxas, D.N.: A recurrent encoder-decoder  network for sequential face alignment. In: ECCV. (2016) 38-56  8. Liu, H., Lu, J., Feng, J., Zhou, J.: Two-stream transformer networks for video-  based face alignment. TPAMI (2017)  9. Black, M.J., Yacoob, Y.: Tracking and recognizing rigid and non-rigid facial mo- tions using local parametric models of image motion. In: Computer Vision, 1995. Proceedings., Fifth International Conference on, IEEE (1995) 374-381  10. Chrysos, G.G., Antonakos, E., Zafeiriou, S., Snape, P.: Oﬄine deformable face  tracking in arbitrary videos. In: ICCVW. (2015) 1-9  11. Decarlo, D., Metaxas, D.: Optical ﬂow constraints on deformable models with  applications to face tracking. IJCV 38(2) (2000) 99-127  12. Tzimiropoulos, G.: Project-out cascaded regression with an application to face  alignment. In: CVPR. (2015) 3659-3667  13. Cao, X., Wei, Y., Wen, F., Sun, J.: Face alignment by explicit shape regression.  14. Xiong, X., De la Torre, F.: Supervised descent method and its applications to face  IJCV 107(2) (2014) 177-190  alignment. In: CVPR. (2013) 532-539  task learning. In: ECCV. (2014) 94-108  15. Zhang, Z., Luo, P., Loy, C.C., Tang, X.: Facial landmark detection by deep multi-  16. Trigeorgis, G., Snape, P., Nicolaou, M.A., Antonakos, E., Zafeiriou, S.: Mnemonic descent method: A recurrent process applied for end-to-end face alignment. In: CVPR. (2016) 4177-4187  17. Zhang, J., Shan, S., Kan, M., Chen, X.: Coarse-to-fine auto-encoder networks  (cfan) for real-time face alignment. In: ECCV. (2014) 1-16  18. Kumar, A., Chellappa, R.: Disentangling 3d pose in a dendritic cnn for uncon-  strained 2d face alignment. arXiv preprint arXiv:1802.06713 (2018)  19. Haris Khan, M., McDonagh, J., Tzimiropoulos, G.: Synergy between face alignment and tracking via discriminative global consensus optimization. In: CVPR. (2017) 3791-3799  20. Littman, M.L.: Reinforcement learning improves behaviour from evaluative feed-  back. Nature 521(7553) (2015) 445  21. Gu, S., Lillicrap, T., Sutskever, I., Levine, S.: Continuous deep q-learning with  model-based acceleration. In: ICML. (2016) 2829-2838   Dual-Agent Deep Reinforcement Learning for Deformable Face TrackingReferences  1. Wang, X., Yang, M., Zhu, S., Lin, Y.: Regionlets for generic object detection. In:  2. Xiao, S., Yan, S., Kassim, A.A.: Facial landmark detection via progressive initial-  ICCV. (2013) 17-24  ization. In: ICCVW. (2015) 33-40  3. Chrysos, G.G., Antonakos, E., Snape, P., Asthana, A., Zafeiriou, S.: A compre- hensive performance evaluation of deformable face tracking “in-the-wild”. IJCV (2016) 1-35  4. Shen, J., Zafeiriou, S., Chrysos, G.G., Kossaifi, J., Tzimiropoulos, G., Pantic, M.: The first facial landmark tracking in-the-wild challenge: Benchmark and results. In: ICCVW. (2015) 50-58  5. Asthana, A., Zafeiriou, S., Cheng, S., Pantic, M.: Incremental face alignment in  the wild. In: CVPR. (2014) 1859-1866  6. Peng, X., Zhang, S., Yang, Y., Metaxas, D.N.: Piefa: Personalized incremental and  ensemble face alignment. In: ICCV. (2015) 3880-3888  7. Peng, X., Feris, R.S., Wang, X., Metaxas, D.N.: A recurrent encoder-decoder  network for sequential face alignment. In: ECCV. (2016) 38-56  8. Liu, H., Lu, J., Feng, J., Zhou, J.: Two-stream transformer networks for video-  based face alignment. TPAMI (2017)  9. Black, M.J., Yacoob, Y.: Tracking and recognizing rigid and non-rigid facial mo- tions using local parametric models of image motion. In: Computer Vision, 1995. Proceedings., Fifth International Conference on, IEEE (1995) 374-381  10. Chrysos, G.G., Antonakos, E., Zafeiriou, S., Snape, P.: Oﬄine deformable face  tracking in arbitrary videos. In: ICCVW. (2015) 1-9  11. Decarlo, D., Metaxas, D.: Optical ﬂow constraints on deformable models with  applications to face tracking. IJCV 38(2) (2000) 99-127  12. Tzimiropoulos, G.: Project-out cascaded regression with an application to face  alignment. In: CVPR. (2015) 3659-3667  13. Cao, X., Wei, Y., Wen, F., Sun, J.: Face alignment by explicit shape regression.  14. Xiong, X., De la Torre, F.: Supervised descent method and its applications to face  IJCV 107(2) (2014) 177-190  alignment. In: CVPR. (2013) 532-539  task learning. In: ECCV. (2014) 94-108  15. Zhang, Z., Luo, P., Loy, C.C., Tang, X.: Facial landmark detection by deep multi-  16. Trigeorgis, G., Snape, P., Nicolaou, M.A., Antonakos, E., Zafeiriou, S.: Mnemonic descent method: A recurrent process applied for end-to-end face alignment. In: CVPR. (2016) 4177-4187  17. Zhang, J., Shan, S., Kan, M., Chen, X.: Coarse-to-fine auto-encoder networks  (cfan) for real-time face alignment. In: ECCV. (2014) 1-16  18. Kumar, A., Chellappa, R.: Disentangling 3d pose in a dendritic cnn for uncon-  strained 2d face alignment. arXiv preprint arXiv:1802.06713 (2018)  19. Haris Khan, M., McDonagh, J., Tzimiropoulos, G.: Synergy between face alignment and tracking via discriminative global consensus optimization. In: CVPR. (2017) 3791-3799  20. Littman, M.L.: Reinforcement learning improves behaviour from evaluative feed-  back. Nature 521(7553) (2015) 445  21. Gu, S., Lillicrap, T., Sutskever, I., Levine, S.: Continuous deep q-learning with  model-based acceleration. In: ICML. (2016) 2829-2838   16  Minghao Guo, Jiwen Lu, Jie Zhou  22. Mnih, V., Kavukcuoglu, K., Silver, D., Graves, A., Antonoglou, I., Wierstra, D., Riedmiller, M.: Playing atari with deep reinforcement learning. arXiv preprint arXiv:1312.5602 (2013)  23. Mnih, V., Kavukcuoglu, K., Silver, D., Rusu, A.A., Veness, J., Bellemare, M.G., Graves, A., Riedmiller, M., Fidjeland, A.K., Ostrovski, G., et al.: Human-level control through deep reinforcement learning. Nature 518(7540) (2015) 529  24. Ammar, H.B., Eaton, E., Ruvolo, P., Taylor, M.: Online multi-task learning for  policy gradient methods. In: ICML. (2014) 1206-1214  25. Silver, D., Lever, G., Heess, N., Degris, T., Wierstra, D., Riedmiller, M.: Deter-  ministic policy gradient algorithms. In: ICML. (2014)  26. Rao, Y., Lu, J., Zhou, J.: Attention-aware deep reinforcement learning for video  face recognition. In: CVPR. (2017) 3931-3940  27. Yu, L., Zhang, W., Wang, J., Seqgan, Y.Y.: sequence generative adversarial nets with policy gradient. arxiv preprint. arXiv preprint arXiv:1609.05473 2(3) (2016) 5  28. Yoo, S.Y.J.C.Y., Yun, K., Choi, J.Y.: Action-decision networks for visual tracking  with deep reinforcement learning. (2017)  29. Foerster, J., Assael, Y., de Freitas, N., Whiteson, S.: Learning to communicate  with deep multi-agent reinforcement learning. In: NIPS. (2016) 2137-2145  30. Sukhbaatar, S., Fergus, R., et al.: Learning multiagent communication with back-  31. Kong, X., Xin, B., Wang, Y., Hua, G.: Collaborative deep reinforcement learning  32. Xia, Y., Qin, T., Chen, W., Bian, J., Yu, N., Liu, T.Y.: Dual supervised learning.  propagation. In: NIPS. (2016) 2244-2252  for joint object search. In: CVPR. (2017)  arXiv preprint arXiv:1707.00415 (2017)  33. Lillicrap, T.P., Hunt, J.J., Pritzel, A., Heess, N., Erez, T., Tassa, Y., Silver, D., Wierstra, D.: Continuous control with deep reinforcement learning. arXiv preprint arXiv:1509.02971 (2015)  34. Sagonas, C., Tzimiropoulos, G., Zafeiriou, S., Pantic, M.: A semi-automatic  methodology for facial landmark annotation. In: CVPRW. (2013) 896-903  35. Zafeiriou, S., Chrysos, G.G., Roussos, A., Ververas, E., Deng, J., Trigeorgis, G.: The 3d menpo facial landmark tracking challenge. In: ICCVW. Volume 5. (2017) 36. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., Ghemawat, S., Goodfellow, I., Harp, A., Irving, G., Isard, M., Jia, Y., Jozefowicz, R., Kaiser, L., Kudlur, M., Levenberg, J., Man´e, D., Monga, R., Moore, S., Murray, D., Olah, C., Schuster, M., Shlens, J., Steiner, B., Sutskever, I., Talwar, K., Tucker, P., Vanhoucke, V., Vasudevan, V., Vi´egas, F., Vinyals, O., Warden, P., Wattenberg, M., Wicke, M., Yu, Y., Zheng, X.: TensorFlow: Large-scale machine learning on heterogeneous systems (2015) Software available from tensorﬂow.org.  37. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep  convolutional neural networks. In: NIPS. (2012) 1097-1105  38. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti-  mation. In: ECCV. (2016) 483-499  39. Yang, J., Deng, J., Zhang, K., Liu, Q.: Facial shape tracking via spatio-temporal  cascade shape regression. In: ICCVW. (2015) 41-49  40. S´anchez-Lozano, E., Martinez, B., Tzimiropoulos, G., Valstar, M.: Cascaded con- tinuous regression for real-time incremental face tracking. In: ECCV. (2016) 645- 661"}