{"1": "1. Alexa, M., Behr, J., Cohen-Or, D., Fleishman, S., Levin, D., Silva, C.T.: Computing and rendering point set surfaces. IEEE Trans. Vis. & Comp. Graphics 9(1) (2003) 3-15  2. Gal, R., Shamir, A., Hassner, T., Pauly, M., Cohen-Or, D.: Surface reconstruction using local shape priors. In: Symposium on Geometry Processing. Number EPFL- CONF-149318 (2007) 253-262  3. Sung, M., Kim, V.G., Angst, R., Guibas, L.J.: Data-driven structural priors for shape completion. ACM Trans. on Graphics (SIGGRAPH Asia) 34(6) (2015) 175:1-175:11  4. Xu, K., Kim, V.G., Huang, Q., Kalogerakis, E.: Data-driven shape analysis and  processing. Computer Graphics Forum 36(1) (2017) 101-132  5. Remil, O., Xie, Q., Xie, X., Xu, K., Wang, J.: Surface reconstruction with data-  driven exemplar priors. Computer-Aided Design 88 (2017) 31-41  6. Guerrero, P., Kleiman, Y., Ovsjanikov, M., Mitra, N.J.: PCPNet: Learning local shape properties from raw point clouds. arXiv preprint arXiv:1710.04954 (2017) 7. Yu, L., Li, X., Fu, C.W., Cohen-Or, D., Heng, P.A.: PU-Net: Point cloud upsampling  network. arXiv preprint arXiv:1801.06761 (2018)  8. Groueix, T., Fisher, M., Kim, V.G., Russell, B.C., Aubry, M.: AtlasNet: A papier- mˆach´e approach to learning 3D surface generation. In: IEEE CVPR. (2018) 216-224 9. Qi, C.R., Su, H., Mo, K., Guibas, L.J.: PointNet: deep learning on point sets for  3D classification and segmentation. In: IEEE CVPR. (2017) 77-85  10. Hoppe, H., DeRose, T., Duchamp, T., McDonald, J., Stuetzle, W.: Surface recon-  struction from unorganized points. In: Proc. of SIGGRAPH. (1992) 71-78  11. Turk, G., Levoy, M.: Zippered polygon meshes from range images. In: Proc. of  SIGGRAPH. (1994) 311-318  12. Amenta, N., Bern, M., Kamvysselis, M.: A new voronoi-based surface reconstruction  algorithm. In: Proc. of SIGGRAPH. (1998) 415-422  13. Berger, M., Tagliasacchi, A., Seversky, L.M., Alliez, P., Guennebaud, G., Levine, J.A., Sharf, A., Silva, C.T.: A survey of surface reconstruction from point clouds. In: Computer Graphics Forum. Volume 36., Wiley Online Library (2017) 301-329 14. Lipman, Y., Cohen-Or, D., Levin, D., Tal-Ezer, H.: Parameterization-free projection for geometry reconstruction. ACM Trans. on Graphics (SIGGRAPH) 26(3) (2007) 22:1-22:5  15. Huang, H., Li, D., Zhang, H.R., Ascher, U., Cohen-Or, D.: Consolidation of unorganized point clouds for surface reconstruction. ACM Trans. on Graphics (SIGGRAPH Asia) 28(5) (2009) 176:1-176:8  16. Pauly, M., Keiser, R., Kobbelt, L.P., Gross, M.: Shape modeling with point-sampled  geometry. ACM Trans. on Graphics (SIGGRAPH) 22(3) (2003) 641-650  17. Guennebaud, G., Barthe, L., Paulin, M.: Real-time point cloud refinement. In:  Symposium on Point Based Graphics. (2004) 41-48  18. Fleishman, S., Cohen-Or, D., Silva, C.T.: Robust moving least-squares fitting with sharp features. ACM Trans. on Graphics (SIGGRAPH) 24(3) (2005) 544-552 19. ¨Oztireli, A.C., Guennebaud, G., Gross, M.: Feature preserving point set surfaces based on non-linear kernel regression. Computer Graphics Forum (Eurographics) 28(2) (2009) 493-501  20. Huang, H., Wu, S., Gong, M., Cohen-Or, D., Ascher, U., Zhang, H.R.: Edge-aware  point set resampling. ACM Trans. on Graphics 32(1) (2013) 9:1-9:12   EC-NetReferences  1. Alexa, M., Behr, J., Cohen-Or, D., Fleishman, S., Levin, D., Silva, C.T.: Computing and rendering point set surfaces. IEEE Trans. Vis. & Comp. Graphics 9(1) (2003) 3-15  2. Gal, R., Shamir, A., Hassner, T., Pauly, M., Cohen-Or, D.: Surface reconstruction using local shape priors. In: Symposium on Geometry Processing. Number EPFL- CONF-149318 (2007) 253-262  3. Sung, M., Kim, V.G., Angst, R., Guibas, L.J.: Data-driven structural priors for shape completion. ACM Trans. on Graphics (SIGGRAPH Asia) 34(6) (2015) 175:1-175:11  4. Xu, K., Kim, V.G., Huang, Q., Kalogerakis, E.: Data-driven shape analysis and  processing. Computer Graphics Forum 36(1) (2017) 101-132  5. Remil, O., Xie, Q., Xie, X., Xu, K., Wang, J.: Surface reconstruction with data-  driven exemplar priors. Computer-Aided Design 88 (2017) 31-41  6. Guerrero, P., Kleiman, Y., Ovsjanikov, M., Mitra, N.J.: PCPNet: Learning local shape properties from raw point clouds. arXiv preprint arXiv:1710.04954 (2017) 7. Yu, L., Li, X., Fu, C.W., Cohen-Or, D., Heng, P.A.: PU-Net: Point cloud upsampling  network. arXiv preprint arXiv:1801.06761 (2018)  8. Groueix, T., Fisher, M., Kim, V.G., Russell, B.C., Aubry, M.: AtlasNet: A papier- mˆach´e approach to learning 3D surface generation. In: IEEE CVPR. (2018) 216-224 9. Qi, C.R., Su, H., Mo, K., Guibas, L.J.: PointNet: deep learning on point sets for  3D classification and segmentation. In: IEEE CVPR. (2017) 77-85  10. Hoppe, H., DeRose, T., Duchamp, T., McDonald, J., Stuetzle, W.: Surface recon-  struction from unorganized points. In: Proc. of SIGGRAPH. (1992) 71-78  11. Turk, G., Levoy, M.: Zippered polygon meshes from range images. In: Proc. of  SIGGRAPH. (1994) 311-318  12. Amenta, N., Bern, M., Kamvysselis, M.: A new voronoi-based surface reconstruction  algorithm. In: Proc. of SIGGRAPH. (1998) 415-422  13. Berger, M., Tagliasacchi, A., Seversky, L.M., Alliez, P., Guennebaud, G., Levine, J.A., Sharf, A., Silva, C.T.: A survey of surface reconstruction from point clouds. In: Computer Graphics Forum. Volume 36., Wiley Online Library (2017) 301-329 14. Lipman, Y., Cohen-Or, D., Levin, D., Tal-Ezer, H.: Parameterization-free projection for geometry reconstruction. ACM Trans. on Graphics (SIGGRAPH) 26(3) (2007) 22:1-22:5  15. Huang, H., Li, D., Zhang, H.R., Ascher, U., Cohen-Or, D.: Consolidation of unorganized point clouds for surface reconstruction. ACM Trans. on Graphics (SIGGRAPH Asia) 28(5) (2009) 176:1-176:8  16. Pauly, M., Keiser, R., Kobbelt, L.P., Gross, M.: Shape modeling with point-sampled  geometry. ACM Trans. on Graphics (SIGGRAPH) 22(3) (2003) 641-650  17. Guennebaud, G., Barthe, L., Paulin, M.: Real-time point cloud refinement. In:  Symposium on Point Based Graphics. (2004) 41-48  18. Fleishman, S., Cohen-Or, D., Silva, C.T.: Robust moving least-squares fitting with sharp features. ACM Trans. on Graphics (SIGGRAPH) 24(3) (2005) 544-552 19. ¨Oztireli, A.C., Guennebaud, G., Gross, M.: Feature preserving point set surfaces based on non-linear kernel regression. Computer Graphics Forum (Eurographics) 28(2) (2009) 493-501  20. Huang, H., Wu, S., Gong, M., Cohen-Or, D., Ascher, U., Zhang, H.R.: Edge-aware  point set resampling. ACM Trans. on Graphics 32(1) (2013) 9:1-9:12   16  L. Yu et al.  21. Preiner, R., Mattausch, O., Arikan, M., Pajarola, R., Wimmer, M.: Continuous projection for fast l1 reconstruction. ACM Trans. on Graphics (SIGGRAPH) 33(4) (2014) 47:1-47:13  22. Guo, K., Zou, D., Chen, X.: 3D mesh labeling via deep convolutional neural  networks. ACM Trans. on Graphics 35(1) (2015) 3:1-3:12  23. Boulch, A., Marlet, R.: Deep learning for robust normal estimation in unstructured  point clouds. Computer Graphics Forum (SGP) 35(5) (2016) 281-290  24. Qi, C.R., Su, H., Niessner, M., Dai, A., Yan, M., Guibas, L.J.: Volumetric and multi-view CNNs for object classification on 3D data. In: IEEE CVPR. (2016) 5648-5656  25. Dai, A., Qi, C.R., Nießner, M.: Shape completion using 3D-encoder-predictor CNNs  and shape synthesis. In: IEEE CVPR. (2017) 5868-5877  26. Han, X., Li, Z., Huang, H., Kalogerakis, E., Yu, Y.: High-resolution shape completion using deep neural networks for global structure and local geometry inference. In: IEEE ICCV. (2017) 85-93  27. Wang, P., Liu, Y., Guo, Y., Sun, C., Tong, X.: O-CNN: Octree-based convolutional neural networks for 3D shape analysis. ACM Trans. on Graphics 36(4) (2017) 72:1-72:11  28. Riegler, G., Ulusoy, A.O., Geiger, A.: OctNet: Learning deep 3D representations at  high resolutions. In: IEEE CVPR. (2017) 6620-6629  29. Liu, F., Li, S., Zhang, L., Zhou, C., Ye, R., Wang, Y., Lu, J.: 3DCNN-DQN-RNN: a deep reinforcement learning framework for semantic parsing of large-scale 3D point clouds. In: IEEE ICCV. (2017) 5678-5687  30. Qi, C.R., Yi, L., Su, H., Guibas, L.J.: PointNet++: deep hierarchical feature In: Advances in Neural Information  learning on point sets in a metric space. Processing Systems 30. (2017) 5105-5114  31. Hua, B.S., Tran, M.K., Yeung, S.K.: Point-wise convolutional neural network.  (2017)  32. Klokov, R., Lempitsky, V.: Escape from cells: deep Kd-Networks for the recognition  of 3D point cloud models. In: IEEE ICCV. (2017) 863-872  33. Landrieu, L., Simonovsky, M.: Large-scale point cloud semantic segmentation with  superpoint graphs. arXiv preprint arXiv:1711.09869 (2017)  34. Xu, D., Anguelov, D., Jain, A.: PointFusion: Deep sensor fusion for 3D bounding  box estimation. arXiv preprint arXiv:1711.10871 (2017)  35. Wang, W., Yu, R., Huang, Q., Neumann, U.: SGPN: Similarity group proposal network for 3D point cloud instance segmentation. arXiv preprint arXiv:1711.08588 (2017)  36. Yang, Y., Feng, C., Shen, Y., Tian, D.: FoldingNet: Interpretable unsupervised  learning on 3D point clouds. In: IEEE CVPR. (2018) 206-215  37. Qi, C.R., Liu, W., Wu, C., Su, H., Guibas, L.J.: Frustum PointNets for 3D object  detection from RGB-D data. arXiv preprint arXiv:1711.08488 (2017)  38. Li, Y., Bu, R., Sun, M., Chen, B.: PointCNN. arXiv preprint arXiv:1801.07791  (2018)  39. Wang, Y., Sun, Y., Liu, Z., Sarma, S.E., Bronstein, M.M., Solomon, J.M.: Dynamic graph CNN for learning on point clouds. arXiv preprint arXiv:1801.07829 (2018) 40. Su, H., Jampani, V., Sun, D., Maji, S., Kalogerakis, E., Yang, M.H., Kautz, J.: SPLATNet: Sparse lattice networks for point cloud processing. In: IEEE CVPR. (2018) 2530-2539  41. Fan, H., Su, H., Guibas, L.J.: A point set generation network for 3D object  reconstruction from a single image. In: IEEE CVPR. (2017) 2463-2471   EC-Net42. Lin, C.H., Kong, C., Lucey, S.: Learning eﬃcient point cloud generation for dense  3D object reconstruction. In: AAAI. (2018) to appear  43. Chang, A.X., Funkhouser, T., Guibas, L.J., Hanrahan, P., Huang, Q., Li, Z., Savarese, S., Savva, M., Song, S., Su, H., Xiao, J., Yi, L., Yu, F.: ShapeNet: an information-rich 3D model repository. arXiv preprint arXiv:1512.03012 (2015) between  44. Eberly, D.:  Distance  triangle  point  and  3D.  in  https://www.geometrictools.com/Documentation/DistancePoint3Triangle3.pdf (1999)  45. Eberly, D.:  Distance between point and line,  ray, or  line segment.  https://www.geometrictools.com/Documentation/DistancePointLine.pdf (1999)  46. Kingma, D., Ba, J.: Adam: a method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  47. Bernardini, F., Mittleman, J., Rushmeier, H., Silva, C., Taubin, G.: The ball- pivoting algorithm for surface reconstruction. IEEE Trans. Vis. & Comp. Graphics 5(4) (1999) 349-359  48. Kazhdan, M., Hoppe, H.: Screened poisson surface reconstruction. ACM Trans. on  Graphics 32(3) (2013) 29:1-29:13  49. Zheng, Y., Fu, H., Au, O.K.C., Tai, C.L.: Bilateral normal filtering for mesh  denoising. IEEE Trans. Vis. & Comp. Graphics 17(10) (2011) 1521-1530  50. Berger, M., Levine, J.A., Nonato, L.G., et al.: A benchmark for surface reconstruc-  tion. ACM Trans. on Graphics 32(2) (2013) 20  51. Lu, X., Wu, S., Chen, H., Yeung, S.K., Chen, W., Zwicker, M.: GPF: GMM-inspired feature-preserving point set filtering. IEEE Trans. Vis. & Comp. Graphics 24(8) (2018) 2315-2326"}