{"1": "1. Beck, A., Teboulle, M.: Fast gradient-based algorithms for constrained total vari- ation image denoising and deblurring problems. IEEE Trans. on Image Processing 18(11), 2419-2434 (2009)  2. Blanco, J.L.: A tutorial on se (3) transformation parameterizations and on-  manifold optimization. University of Malaga, Tech. Rep 3 (2010)  3. Blender Online Community: Blender - A 3D modelling and rendering package. Blender Foundation, Blender Institute, Amsterdam (http://www.blender.org 4. Bok, Y., Jeon, H.G., Kweon, I.S.: Geometric calibration of micro-lens-based light- field cameras using line features. In: Proc. of the European Conference on Com- puter Vision. pp. 47-61 (2014)  5. Chan, T.F., Wong, C.K.: Total variation blind deconvolution. IEEE Trans. on  Image Processing 7(3), 370-375 (1998)  6. Chandramouli, P., Perrone, D., Favaro, P.: Light field blind deconvolution. CoRR  abs/1408.3686 (2014), http://arxiv.org/abs/1408.3686  7. Chen, C., Lin, H., Yu, Z., Bing Kang, S., Yu, J.: Light field stereo matching us- ing bilateral statistics of surface cameras. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1518-1525 (2014)  8. Cho, S., Lee, S.: Fast motion deblurring. In: Proc. of the ACM Trans. on Graphics.  vol. 28, p. 145 (2009)  9. Cho, S., Matsushita, Y., Lee, S.: Removing non-uniform motion blur from images. In: Proc. of the IEEE International Conference on Computer Vision. pp. 1-8 (2007) 10. Cho, S., Wang, J., Lee, S.: Video deblurring for hand-held cameras using patch-  based synthesis. ACM Trans. on Graphics 31(4), 64 (2012)  11. Dansereau, D.G., Eriksson, A., Leitner, J.: Richardson-lucy deblurring for moving light field cameras. Proc. of the IEEE Conference on Computer Vision and Pattern Recognition Workshop (2017)  12. Fergus, R., Singh, B., Hertzmann, A., Roweis, S.T., Freeman, W.T.: Removing camera shake from a single photograph. In: Proc. of the ACM Trans. on Graphics. vol. 25, pp. 787-794 (2006)  13. Gupta, A., Joshi, N., Zitnick, C.L., Cohen, M., Curless, B.: Single image deblurring using motion density functions. In: Proc. of the European Conference on Computer Vision. pp. 171-184 (2010)  14. Hu, Z., Xu, L., Yang, M.H.: Joint depth estimation and camera shake removal from single blurry image. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2893-2900 (2014)  15. Hu, Z., Yang, M.H.: Fast non-uniform deblurring using constrained camera pose  subspace. In: Proc. of the British Machine Vision Conference. vol. 2, p. 4 (2012)  16. Jeon, H.G., Park, J., Choe, G., Park, J., Bok, Y., Tai, Y.W., Kweon, I.S.: Accurate depth map estimation from a lenslet light field camera. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1547-1555 (2015)  17. Ji, H., Wang, K.: A two-stage approach to blind spatially-varying motion deblur- ring. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recogni- tion. pp. 73-80 (2012)  18. Jin, M., Chandramouli, P., Favaro, P.: Bilayer blind deconvolution with the light field camera. In: Proc. of the IEEE International Conference on Computer Vision Workshop. pp. 10-18 (2015)  19. Kim, T.H., Lee, K.M.: Segmentation-free dynamic scene deblurring. In: Proc. of IEEE Conference on Computer Vision and Pattern Recognition. pp. 2766-2773 (2014)   Joint Blind Motion Deblurring and Depth Estimation of Light FieldReferences  1. Beck, A., Teboulle, M.: Fast gradient-based algorithms for constrained total vari- ation image denoising and deblurring problems. IEEE Trans. on Image Processing 18(11), 2419-2434 (2009)  2. Blanco, J.L.: A tutorial on se (3) transformation parameterizations and on-  manifold optimization. University of Malaga, Tech. Rep 3 (2010)  3. Blender Online Community: Blender - A 3D modelling and rendering package. Blender Foundation, Blender Institute, Amsterdam (http://www.blender.org 4. Bok, Y., Jeon, H.G., Kweon, I.S.: Geometric calibration of micro-lens-based light- field cameras using line features. In: Proc. of the European Conference on Com- puter Vision. pp. 47-61 (2014)  5. Chan, T.F., Wong, C.K.: Total variation blind deconvolution. IEEE Trans. on  Image Processing 7(3), 370-375 (1998)  6. Chandramouli, P., Perrone, D., Favaro, P.: Light field blind deconvolution. CoRR  abs/1408.3686 (2014), http://arxiv.org/abs/1408.3686  7. Chen, C., Lin, H., Yu, Z., Bing Kang, S., Yu, J.: Light field stereo matching us- ing bilateral statistics of surface cameras. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1518-1525 (2014)  8. Cho, S., Lee, S.: Fast motion deblurring. In: Proc. of the ACM Trans. on Graphics.  vol. 28, p. 145 (2009)  9. Cho, S., Matsushita, Y., Lee, S.: Removing non-uniform motion blur from images. In: Proc. of the IEEE International Conference on Computer Vision. pp. 1-8 (2007) 10. Cho, S., Wang, J., Lee, S.: Video deblurring for hand-held cameras using patch-  based synthesis. ACM Trans. on Graphics 31(4), 64 (2012)  11. Dansereau, D.G., Eriksson, A., Leitner, J.: Richardson-lucy deblurring for moving light field cameras. Proc. of the IEEE Conference on Computer Vision and Pattern Recognition Workshop (2017)  12. Fergus, R., Singh, B., Hertzmann, A., Roweis, S.T., Freeman, W.T.: Removing camera shake from a single photograph. In: Proc. of the ACM Trans. on Graphics. vol. 25, pp. 787-794 (2006)  13. Gupta, A., Joshi, N., Zitnick, C.L., Cohen, M., Curless, B.: Single image deblurring using motion density functions. In: Proc. of the European Conference on Computer Vision. pp. 171-184 (2010)  14. Hu, Z., Xu, L., Yang, M.H.: Joint depth estimation and camera shake removal from single blurry image. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2893-2900 (2014)  15. Hu, Z., Yang, M.H.: Fast non-uniform deblurring using constrained camera pose  subspace. In: Proc. of the British Machine Vision Conference. vol. 2, p. 4 (2012)  16. Jeon, H.G., Park, J., Choe, G., Park, J., Bok, Y., Tai, Y.W., Kweon, I.S.: Accurate depth map estimation from a lenslet light field camera. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1547-1555 (2015)  17. Ji, H., Wang, K.: A two-stage approach to blind spatially-varying motion deblur- ring. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recogni- tion. pp. 73-80 (2012)  18. Jin, M., Chandramouli, P., Favaro, P.: Bilayer blind deconvolution with the light field camera. In: Proc. of the IEEE International Conference on Computer Vision Workshop. pp. 10-18 (2015)  19. Kim, T.H., Lee, K.M.: Segmentation-free dynamic scene deblurring. In: Proc. of IEEE Conference on Computer Vision and Pattern Recognition. pp. 2766-2773 (2014)   16  D. Lee, H. Park, I. K. Park, and K. M. Lee  20. Kim, T.H., Lee, K.M.: Generalized video deblurring for dynamic scenes. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5426-5434 (2015)  21. K¨ohler, R., Hirsch, M., Mohler, B., Sch¨olkopf, B., Harmeling, S.: Recording and playback of camera shake: Benchmarking blind deconvolution with a real-world database pp. 27-40 (2012)  22. Ng, R.: Digital light field photography. Ph.D. thesis, stanford university (2006) 23. Ng, R., Levoy, M., Br´edif, M., Duval, G., Horowitz, M., Hanrahan, P.: Light field photography with a hand-held plenoptic camera. Computer Science Technical Re- port 2(11), 1-11 (2005)  24. Park, H., Lee, K.M.: Joint estimation of camera pose, depth, deblurring, and super- resolution from a blurred image sequence. In: Proc. of the IEEE International Conference on Computer Vision (2017)  25. Scales, J.A., Gersztenkorn, A.: Robust methods in inverse theory. Inverse problems  4(4), 1071 (1988)  26. Sellent, A., Rother, C., Roth, S.: Stereo video deblurring. In: Proc. of the European  Conference on Computer Vision. pp. 558-575 (2016)  27. Shan, Q., Jia, J., Agarwala, A.: High-quality motion deblurring from a single image.  In: ACM Trans. on Graphics. vol. 27, p. 73 (2008)  28. Snoswell, A., Singh, S.: Light field de-blurring for robotics applications. In: Aus-  tralasian Conference on Robotics and Automation (2014)  29. Srinivasan, P.P., Ng, R., Ramamoorthi, R.: Light field blind motion deblurring. Proc. of the IEEE Conference on Computer Vision and Pattern Recognition (2017) 30. Sun, J., Cao, W., Xu, Z., Ponce, J.: Learning a convolutional neural network for non-uniform motion blur removal. In: Proc. of IEEE Conference on Computer Vision and Pattern Recognition. pp. 769-777 (2015)  31. Tao, M.W., Srinivasan, P.P., Malik, J., Rusinkiewicz, S., Ramamoorthi, R.: Depth from shading, defocus, and correspondence using light-field angular coherence. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1940-1948 (2015)  32. Wang, T.C., Efros, A.A., Ramamoorthi, R.: Occlusion-aware depth estimation us- ing light-field cameras. In: Proc. of the IEEE International Conference on Com- puter Vision. pp. 3487-3495 (2015)  33. Whyte, O., Sivic, J., Zisserman, A., Ponce, J.: Non-uniform deblurring for shaken  images. International Journal of Computer Vision 98(2), 168-186 (2012)  34. Williem, Park, I.K.: Robust light field depth estimation for noisy scene with occlu- sion. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recogni- tion. pp. 4396-4404 (2016)  35. Wulﬀ, J., Black, M.J.: Modeling blurred video with layers. In: Proc. of the Euro-  pean Conference on Computer Vision. pp. 236-252 (2014)  36. Xu, L., Jia, J.: Two-phase kernel estimation for robust motion deblurring. In: Proc.  of the European Conference on Computer Vision. pp. 157-170 (2010)  37. Xu, L., Jia, J.: Depth-aware motion deblurring. In: Proc. of IEEE International  Conference on Computational Photography. pp. 1-8 (2012)  38. Zheng, S., Xu, L., Jia, J.: Forward motion deblurring. In: Proc. of the IEEE Inter-  national Conference on Computer Vision. pp. 1465-1472 (2013)"}