{"1": "1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., Ghemawat, S., Goodfellow, I., Harp, A., Irving, G., Isard, M., Jia, Y., Jozefowicz, R., Kaiser, L., Kudlur, M., Levenberg, J., Mané, D., Monga, R., Moore, S., Murray, D., Olah, C., Schuster, M., Shlens, J., Steiner, B., Sutskever, I., Talwar, K., Tucker, P., Vanhoucke, V., Vasudevan, V., Viégas, F., Vinyals, O., Warden, P., Wattenberg, M., Wicke, M., Yu, Y., Zheng, X.: TensorFlow: Large-scale machine learning on heterogeneous systems (2015), https://www.tensorflow.org/, software available from tensorlow.org  2. Arandjelovic, R., Zisserman, A.: All About VLAD. In: CVPR. pp. 1578-1585  (2013)  3. Arsigny, V., Fillard, P., Pennec, X., Ayache, N.: Log-Euclidean metrics for fast and simple calculus on difusion tensors. Magnetic Resonance in Medicine (2006) 4. Bartlett, M.S., Kendall, D.G.: The statistical analysis of variance-heterogeneity and the logarithmic transformation. Supplement to the Journal of the Royal Statistical Society 8(1), 128-138 (1946), http://www.jstor.org/stable/2983618  5. Bell, S., Upchurch, P., Snavely, N., Bala, K.: Material Recognition in the Wild  with the Materials in Context Database. In: CVPR (2015)  6. Carreira, J., Caseiro, R., Batista, J., Sminchisescu, C.: Semantic Segmentation  with Second-Order Pooling. ECCV (2012)  7. Cherian, A., Sra, S.: Riemannian Sparse Coding for Positive Deinite Matrices. In:  ECCV (2014)  8. Chollet, F., et al.: Keras. https://github.com/fchollet/keras (2015) 9. Cimpoi, M., Maji, S., Kokkinos, I., Mohamed, S., Vedaldi, A.: Describing Textures  in the Wild. In: CVPR (2014)  10. Cui, Y., Zhou, F., Wang, J., Liu, X., Lin, Y., Belongie, S.: Kernel Pooling for  Convolutional Neural Networks. In: CVPR (2017)  11. Dalal, N., Triggs, B.: Histograms of Oriented Gradients for Human Detection. In:  CVPR. pp. 886-893 (2005)  12. Freund, Y., Schapire, R.E.: A Decision-Theoretic Generalization of On-Line Learn- ing and an Application to Boosting. Journal of Computer and System Sciences (1997)  13. Gao, Y., Beijbom, O., Zhang, N., Darrell, T.: Compact Bilinear Pooling. In: CVPR.  14. Glorot, X., Bengio, Y.: Understanding the diiculty of training deep feedforward  15. Goodfellow, I., Bengio, Y., Courville, A.: Deep Learning. MIT Press (2016), http:  pp. 317-326 (2016)  neural networks. In: AISTATS (2010)  //www.deeplearningbook.org  16. Guo, K., Ishwar, P., Konrad, J.: Action Recognition Using Sparse Representation on Covariance Manifolds of Optical Flow. In: IEEE International Conference on Advanced Video and Signal Based Surveillance (AVSS) (2010)  17. Harandi, M.T., Salzmann, M., Hartley, R.: From manifold to manifold: Geometry-  aware dimensionality reduction for SPD matrices. In: ECCV (2014)  18. Harandi, M., Salzmann, M.: Riemannian coding and dictionary learning: Kernels  to the rescue. In: CVPR (2015)  19. Harandi, M.T., Sanderson, C., Hartley, R.I., Lovell, B.C.: Sparse Coding and Dic- tionary Learning for Symmetric Positive Deinite Matrices - A Kernel Approach. In: ECCV (2012)   Statistically-motivated Second-order PoolingReferences  1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., Ghemawat, S., Goodfellow, I., Harp, A., Irving, G., Isard, M., Jia, Y., Jozefowicz, R., Kaiser, L., Kudlur, M., Levenberg, J., Mané, D., Monga, R., Moore, S., Murray, D., Olah, C., Schuster, M., Shlens, J., Steiner, B., Sutskever, I., Talwar, K., Tucker, P., Vanhoucke, V., Vasudevan, V., Viégas, F., Vinyals, O., Warden, P., Wattenberg, M., Wicke, M., Yu, Y., Zheng, X.: TensorFlow: Large-scale machine learning on heterogeneous systems (2015), https://www.tensorflow.org/, software available from tensorlow.org  2. Arandjelovic, R., Zisserman, A.: All About VLAD. In: CVPR. pp. 1578-1585  (2013)  3. Arsigny, V., Fillard, P., Pennec, X., Ayache, N.: Log-Euclidean metrics for fast and simple calculus on difusion tensors. Magnetic Resonance in Medicine (2006) 4. Bartlett, M.S., Kendall, D.G.: The statistical analysis of variance-heterogeneity and the logarithmic transformation. Supplement to the Journal of the Royal Statistical Society 8(1), 128-138 (1946), http://www.jstor.org/stable/2983618  5. Bell, S., Upchurch, P., Snavely, N., Bala, K.: Material Recognition in the Wild  with the Materials in Context Database. In: CVPR (2015)  6. Carreira, J., Caseiro, R., Batista, J., Sminchisescu, C.: Semantic Segmentation  with Second-Order Pooling. ECCV (2012)  7. Cherian, A., Sra, S.: Riemannian Sparse Coding for Positive Deinite Matrices. In:  ECCV (2014)  8. Chollet, F., et al.: Keras. https://github.com/fchollet/keras (2015) 9. Cimpoi, M., Maji, S., Kokkinos, I., Mohamed, S., Vedaldi, A.: Describing Textures  in the Wild. In: CVPR (2014)  10. Cui, Y., Zhou, F., Wang, J., Liu, X., Lin, Y., Belongie, S.: Kernel Pooling for  Convolutional Neural Networks. In: CVPR (2017)  11. Dalal, N., Triggs, B.: Histograms of Oriented Gradients for Human Detection. In:  CVPR. pp. 886-893 (2005)  12. Freund, Y., Schapire, R.E.: A Decision-Theoretic Generalization of On-Line Learn- ing and an Application to Boosting. Journal of Computer and System Sciences (1997)  13. Gao, Y., Beijbom, O., Zhang, N., Darrell, T.: Compact Bilinear Pooling. In: CVPR.  14. Glorot, X., Bengio, Y.: Understanding the diiculty of training deep feedforward  15. Goodfellow, I., Bengio, Y., Courville, A.: Deep Learning. MIT Press (2016), http:  pp. 317-326 (2016)  neural networks. In: AISTATS (2010)  //www.deeplearningbook.org  16. Guo, K., Ishwar, P., Konrad, J.: Action Recognition Using Sparse Representation on Covariance Manifolds of Optical Flow. In: IEEE International Conference on Advanced Video and Signal Based Surveillance (AVSS) (2010)  17. Harandi, M.T., Salzmann, M., Hartley, R.: From manifold to manifold: Geometry-  aware dimensionality reduction for SPD matrices. In: ECCV (2014)  18. Harandi, M., Salzmann, M.: Riemannian coding and dictionary learning: Kernels  to the rescue. In: CVPR (2015)  19. Harandi, M.T., Sanderson, C., Hartley, R.I., Lovell, B.C.: Sparse Coding and Dic- tionary Learning for Symmetric Positive Deinite Matrices - A Kernel Approach. In: ECCV (2012)   16  K. Yu and M. Salzmann  20. He, K., Zhang, X., Ren, S., Sun, J.: Deep Residual Learning for Image Recognition.  In: CVPR. pp. 770-778 (2016)  21. Huang, C.H., Boyer, E., Angonese, B.D.C., Navab, N., Ilic, S.: Toward User-Speciic Tracking by Detection of Human Shapes in Multi-Cameras. In: CVPR (2015) 22. Huang, G., Liu, Z., Weinberger, K., van der Maaten, L.: Densely Connected Con-  volutional Networks. In: CVPR (2017)  23. Iofe, S., Szegedy, C.: Batch Normalization: Accelerating Deep Network Training  by Reducing Internal Covariate Shift. In: ICML (2015)  24. Ionescu, C., Vantzos, O., Sminchisescu, C.: Matrix backpropagation for Deep Net-  works with Structured Layers (2015)  25. James, A.T.: The non-central wishart distribution. Proceedings of the Royal Soci- ety of London. Series A, Mathematical and Physical Sciences 229(1178), 364-366 (1955), http://www.jstor.org/stable/99771  26. Johnson, R.A., Wichern, D.W., et al.: Applied multivariate statistical analysis,  vol. 4. Prentice-Hall New Jersey (2014)  27. Kong, S., Fowlkes, C.: Low-Rank Bilinear Pooling for Fine-Grained Classiication.  In: CVPR (2017)  28. Koniusz, P., Tas, Y., Porikli, F.: Domain Adaptation by Mixture of Alignments of  Second- or Higher-Order Scatter Tensors. In: CVPR (2017)  29. Koniusz, P., Zhang, H., Porikli, F.: A deeper look at power normalizations. In:  CVPR. pp. 5774-5783 (2018)  30. Krizhevsky, A., Sutskever, I., Hinton, G.: ImageNet Classiication with Deep Con-  volutional Neural Networks. In: NIPS. pp. 1106-1114 (2012)  31. Lazebnik, S., Schmid, C., Ponce, J.: Beyond Bags of Features: Spatial Pyramid  Matching for Recognizing Natural Scene Categories. In: CVPR (2006)  32. Li, P., Xie, J., Wang, Q., Zuo, W.: Is Second-Order Information Helpful for Large-  Scale Visual Recognition? In: ICCV (2017)  33. Li, P., Wang, Q., Zuo, W., Zhang, L.: Log-Euclidean Kernels for Sparse Represen-  tation and Dictionary Learning. In: ICCV (2013)  34. Lin, T.Y., Maji, S.: Improved Bilinear Pooling with CNNs. In: BMVC (2017) 35. Lin, T.Y., Maji, S., Koniusz, P.: Second-order democratic aggregation. In: ECCV  36. Lin, T., RoyChowdhury, A., Maji, S.: Bilinear Cnn Models for Fine-Grained Visual  Recognition. In: ICCV. pp. 1449-1457 (2015)  37. Pennec, X., Fillard, P., Ayache, N.: A Riemannian Framework for Tensor Com-  puting. IJCV (2006)  38. Perronnin, F., Sánchez, J., Mensink, T.: Improving the Fisher Kernel for Large-  Scale Image Classiication. ECCV (2010)  39. Quang, M.H., San-Biagio, M., Murino, V.: Log-Hilbert-Schmidt metric between  positive deinite operators on Hilbert spaces. NIPS (2014)  40. Quattoni, A., Torralba, A.: Recognizing Indoor Scenes. In: CVPR. pp. 413-420  (2018)  (2009)  41. Sermanet, P., Chintala, S., LeCun, Y.: Convolutional Neural Networks Applied to  House Numbers Digit Classiication. In: ICPR (2012)  42. Simonyan, K., Zisserman, A.: Very Deep Convolutional Networks for Large-Scale  43. Sra, S.: A new metric on the manifold of kernel matrices with application to matrix  Image Recognition. In: ICLR (2015)  geometric means. In: NIPS (2012)  44. Sra, S., Cherian, A.: Generalized Dictionary Learning for Symmetric Positive Def- inite Matrices with Application to Nearest Neighbor Retrieval. In: Machine Learn- ing and Knowledge Discovery in Databases. Springer, Berlin, Heidelberg (2011)   Statistically-motivated Second-order Pooling45. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A.: Going Deeper with Convolutions. In: CVPR. pp. 1- 9 (June 2015)  46. Tuzel, O., Porikli, F., Meer, P.: Human Detection via Classiication on Riemannian  Manifolds. In: CVPR. pp. 1-8 (2007)  47. Vapnik, V.: Statistical Learning Theory. Wiley-Interscience (1998) 48. Wah, C., Branson, S., Welinder, P., Perona, P., Belongie, S.: The Caltech-UCSD  Birds-200-2011 Dataset. Tech. rep. (2011)  49. Wang, Q., Li, P., Zuo, W., Zhang, L.: RAID-G - Robust Estimation of Approximate Ininite Dimensional Gaussian with Application to Material Recognition. In: CVPR (2016)  50. Wilson, E.B., Hilferty, M.M.: The distribution of chi-square. Proceedings of the  National Academy of Sciences 17(12), 684-688 (1931)"}