{"1": "1. Hirschmuller, H.: Accurate and eﬃcient stereo processing by semi-global matching and mutual information. In: Computer Vision and Pattern Recognition, 2005. CVPR 2005. IEEE Computer Society Conference on. Volume 2., IEEE (2005) 807-814  2. Bleyer, M., Rhemann, C., Rother, C.: Patchmatch stereo-stereo matching with  slanted support windows. In: Bmvc. Volume 11. (2011) 1-11  3. Zbontar, J., LeCun, Y.: Computing the stereo matching cost with a convolutional neural network. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2015) 1592-1599  4. Luo, W., Schwing, A.G., Urtasun, R.: Eﬃcient deep learning for stereo match- In: Proceedings of the IEEE Conference on Computer Vision and Pattern  ing. Recognition. (2016) 5695-5703  5. Kendall, A., Martirosyan, H., Dasgupta, S., Henry, P., Kennedy, R., Bachrach, A., Bry, A.: End-to-end learning of geometry and context for deep stereo regression. CoRR, vol. abs/1703.04309 (2017)  6. Diamond, S., Sitzmann, V., Boyd, S., Wetzstein, G., Heide, F.: Dirty pixels: Op- timizing image classification architectures for raw sensor data. arXiv preprint arXiv:1701.06487 (2017)  7. Jeon, H.G., Lee, J.Y., Im, S., Ha, H., So Kweon, I.: Stereo matching with color In: Proceedings of the IEEE  and monochrome cameras in low-light conditions. Conference on Computer Vision and Pattern Recognition. (2016) 4086-4094  8. Buades, A., Coll, B., Morel, J.M.: A non-local algorithm for image denoising. In: Computer Vision and Pattern Recognition, 2005. CVPR 2005. IEEE Computer Society Conference on. Volume 2., IEEE (2005) 60-65  9. Rudin, L.I., Osher, S., Fatemi, E.: Nonlinear total variation based noise removal  algorithms. Physica D: nonlinear phenomena 60(1-4) (1992) 259-268  10. Dabov, K., Foi, A., Katkovnik, V., Egiazarian, K.: Image denoising by sparse 3-d transform-domain collaborative filtering. IEEE Transactions on image processing 16(8) (2007) 2080-2095  11. Burger, H.C., Schuler, C.J., Harmeling, S.:  Image denoising: Can plain neural networks compete with bm3d? In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 2392-2399  12. Xie, J., Xu, L., Chen, E.: Image denoising and inpainting with deep neural net- works. In: Advances in neural information processing systems. (2012) 341-349 13. Zhang, K., Zuo, W., Chen, Y., Meng, D., Zhang, L.: Beyond a gaussian denoiser: Residual learning of deep cnn for image denoising. IEEE Transactions on Image Processing 26(7) (2017) 3142-3155  14. Ruderman, D.L., Bialek, W.: Statistics of natural images: Scaling in the woods.  In: Advances in neural information processing systems. (1994) 551-558  15. Maddern, W., Pascoe, G., Linegar, C., Newman, P.: 1 Year, 1000km: The Oxford RobotCar Dataset. The International Journal of Robotics Research (IJRR) 36(1) (2017) 3-15  16. Guo, X.: Lime: A method for low-light image enhancement. In: Proceedings of the  2016 ACM on Multimedia Conference, ACM (2016) 87-91  17. Zhang, C., Li, Z., Cheng, Y., Cai, R., Chao, H., Rui, Y.: Meshstereo: A global stereo model with mesh alignment regularization for view interpolation. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 2057-2065   Depth Estimation using Joint Structure-Stereo OptimizationReferences  1. Hirschmuller, H.: Accurate and eﬃcient stereo processing by semi-global matching and mutual information. In: Computer Vision and Pattern Recognition, 2005. CVPR 2005. IEEE Computer Society Conference on. Volume 2., IEEE (2005) 807-814  2. Bleyer, M., Rhemann, C., Rother, C.: Patchmatch stereo-stereo matching with  slanted support windows. In: Bmvc. Volume 11. (2011) 1-11  3. Zbontar, J., LeCun, Y.: Computing the stereo matching cost with a convolutional neural network. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2015) 1592-1599  4. Luo, W., Schwing, A.G., Urtasun, R.: Eﬃcient deep learning for stereo match- In: Proceedings of the IEEE Conference on Computer Vision and Pattern  ing. Recognition. (2016) 5695-5703  5. Kendall, A., Martirosyan, H., Dasgupta, S., Henry, P., Kennedy, R., Bachrach, A., Bry, A.: End-to-end learning of geometry and context for deep stereo regression. CoRR, vol. abs/1703.04309 (2017)  6. Diamond, S., Sitzmann, V., Boyd, S., Wetzstein, G., Heide, F.: Dirty pixels: Op- timizing image classification architectures for raw sensor data. arXiv preprint arXiv:1701.06487 (2017)  7. Jeon, H.G., Lee, J.Y., Im, S., Ha, H., So Kweon, I.: Stereo matching with color In: Proceedings of the IEEE  and monochrome cameras in low-light conditions. Conference on Computer Vision and Pattern Recognition. (2016) 4086-4094  8. Buades, A., Coll, B., Morel, J.M.: A non-local algorithm for image denoising. In: Computer Vision and Pattern Recognition, 2005. CVPR 2005. IEEE Computer Society Conference on. Volume 2., IEEE (2005) 60-65  9. Rudin, L.I., Osher, S., Fatemi, E.: Nonlinear total variation based noise removal  algorithms. Physica D: nonlinear phenomena 60(1-4) (1992) 259-268  10. Dabov, K., Foi, A., Katkovnik, V., Egiazarian, K.: Image denoising by sparse 3-d transform-domain collaborative filtering. IEEE Transactions on image processing 16(8) (2007) 2080-2095  11. Burger, H.C., Schuler, C.J., Harmeling, S.:  Image denoising: Can plain neural networks compete with bm3d? In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 2392-2399  12. Xie, J., Xu, L., Chen, E.: Image denoising and inpainting with deep neural net- works. In: Advances in neural information processing systems. (2012) 341-349 13. Zhang, K., Zuo, W., Chen, Y., Meng, D., Zhang, L.: Beyond a gaussian denoiser: Residual learning of deep cnn for image denoising. IEEE Transactions on Image Processing 26(7) (2017) 3142-3155  14. Ruderman, D.L., Bialek, W.: Statistics of natural images: Scaling in the woods.  In: Advances in neural information processing systems. (1994) 551-558  15. Maddern, W., Pascoe, G., Linegar, C., Newman, P.: 1 Year, 1000km: The Oxford RobotCar Dataset. The International Journal of Robotics Research (IJRR) 36(1) (2017) 3-15  16. Guo, X.: Lime: A method for low-light image enhancement. In: Proceedings of the  2016 ACM on Multimedia Conference, ACM (2016) 87-91  17. Zhang, C., Li, Z., Cheng, Y., Cai, R., Chao, H., Rui, Y.: Meshstereo: A global stereo model with mesh alignment regularization for view interpolation. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 2057-2065   16  Aashish Sharma, Loong-Fah Cheong  18. Scharstein, D., Hirschm¨uller, H., Kitajima, Y., Krathwohl, G., Neˇsi´c, N., Wang, X., Westling, P.: High-resolution stereo datasets with subpixel-accurate ground truth. In: German Conference on Pattern Recognition, Springer (2014) 31-42 19. Jiao, J., Yang, Q., He, S., Gu, S., Zhang, L., Lau, R.W.: Joint image denoising and disparity estimation via stereo structure pca and noise-tolerant cost. International Journal of Computer Vision 124(2) (2017) 204-222  20. Levin, A., Nadler, B., Durand, F., Freeman, W.T.: Patch complexity, finite pixel correlations and optimal denoising. In: European Conference on Computer Vision, Springer (2012) 73-86  21. Scharstein, D., Szeliski, R.: A taxonomy and evaluation of dense two-frame stereo correspondence algorithms. International journal of computer vision 47(1-3) (2002) 7-42  22. Hirschmuller, H., Scharstein, D.: Evaluation of stereo matching costs on images with radiometric diﬀerences. IEEE transactions on pattern analysis and machine intelligence 31(9) (2009) 1582-1599  23. Buades, A., Coll, B., Morel, J.M.: Image denoising methods. a new nonlocal prin-  ciple. SIAM review 52(1) (2010) 113-147  24. Wen, B., Li, Y., Pfister, L., Bresler, Y.: Joint adaptive sparsity and low-rankness on the ﬂy: an online tensor reconstruction scheme for video denoising. In: IEEE International Conference on Computer Vision (ICCV). (2017)  25. Li, N., Li, J.S.J., Randhawa, S.: 3d image denoising using stereo correspondences.  In: TENCON 2015-2015 IEEE Region 10 Conference, IEEE (2015) 1-4  26. Liu, C., Freeman, W.T.: A high-quality video denoising algorithm based on reliable motion estimation. In: European Conference on Computer Vision, Springer (2010) 706-719  27. Zhang, L., Vaddadi, S., Jin, H., Nayar, S.K.: Multiple view image denoising. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on, IEEE (2009) 1542-1549  28. Aujol, J.F., Gilboa, G., Chan, T., Osher, S.: Structure-texture image decom- International journal of  positionmodeling, algorithms, and parameter selection. computer vision 67(1) (2006) 111-136  29. Xu, Y., Long, Q., Mita, S., Tehrani, H., Ishimaru, K., Shirai, N.: Real-time stereo vision system at nighttime with noise reduction using simplified non-local matching cost. In: Intelligent Vehicles Symposium (IV), 2016 IEEE, IEEE (2016) 998-1003 30. Heo, Y.S., Lee, K.M., Lee, S.U.: Simultaneous depth reconstruction and restoration of noisy stereo images using non-local pixel distribution. In: Computer Vision and Pattern Recognition, 2007. CVPR’07. IEEE Conference on, IEEE (2007) 1-8 31. Xu, L., Yan, Q., Xia, Y., Jia, J.: Structure extraction from texture via relative  total variation. ACM Transactions on Graphics (TOG) 31(6) (2012) 139  32. Yamaguchi, K., McAllester, D., Urtasun, R.: Eﬃcient joint segmentation, occlusion labeling, stereo and ﬂow estimation. In: European Conference on Computer Vision, Springer (2014) 756-771  33. Gong, P., Zhang, C., Lu, Z., Huang, J., Ye, J.: A general iterative shrinkage and thresholding algorithm for non-convex regularized optimization problems. In: International Conference on Machine Learning. (2013) 37-45  34. Parikh, N., Boyd, S., et al.: Proximal algorithms. Foundations and Trends R(cid:13) in  Optimization 1(3) (2014) 127-239  35. Boyd, S., Parikh, N., Chu, E., Peleato, B., Eckstein, J., et al.: Distributed opti- mization and statistical learning via the alternating direction method of multipliers. Foundations and Trends R(cid:13) in Machine Learning 3(1) (2011) 1-122"}