{"1": "1. Everingham, M., Eslami, S.M.A., Gool, L.V., Williams, C.K.I., Winn, J., Zisser- man, A.: The pascal visual object classes challenge a retrospective. IJCV (2014) 2. Mottaghi, R., Chen, X., Liu, X., Cho, N.G., Lee, S.W., Fidler, S., Urtasun, R., Yuille, A.: The role of context for object detection and semantic segmentation in the wild. In: CVPR. (2014)  3. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. (2016)  4. Zhou, B., Zhao, H., Puig, X., Fidler, S., Barriuso, A., Torralba, A.: Scene parsing  through ade20k dataset. In: CVPR. (2017)  5. Caesar, H., Uijlings, J., Ferrari, V.: COCO-Stuﬀ: Thing and stuﬀ classes in context.  In: CVPR. (2018)  6. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. In: Proc. IEEE. (1998) 7. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  convolutional neural networks. In: NIPS. (2012)  Imagenet classification with deep  8. Sermanet, P., Eigen, D., Zhang, X., Mathieu, M., Fergus, R., LeCun, Y.: Overfeat: Integrated recognition, localization and detection using convolutional networks. In: ICLR. (2014)  9. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. In: ICLR. (2015)  10. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A.: Going deeper with convolutions. In: CVPR. (2015) 11. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  12. He, X., Zemel, R.S., Carreira-Perpindn, M.: Multiscale conditional random fields  segmentation. In: CVPR. (2015)  for image labeling. In: CVPR. (2004)  13. Shotton, J., Winn, J., Rother, C., Criminisi, A.: Textonboost for image understand- ing: Multi-class object recognition and segmentation by jointly modeling texture, layout, and context. IJCV (2009)  14. Kohli, P., Torr, P.H., et al.: Robust higher order potentials for enforcing label  consistency. IJCV 82(3) (2009) 302-324  15. Ladicky, L., Russell, C., Kohli, P., Torr, P.H.: Associative hierarchical crfs for  object class image segmentation. In: ICCV. (2009)  16. Gould, S., Fulton, R., Koller, D.: Decomposing a scene into geometric and seman-  tically consistent regions. In: ICCV. (2009)  17. Yao, J., Fidler, S., Urtasun, R.: Describing the scene as a whole: Joint object detection, scene classification and semantic segmentation. In: CVPR. (2012) 18. Grauman, K., Darrell, T.: The pyramid match kernel: Discriminative classification  with sets of image features. In: ICCV. (2005)  19. Lazebnik, S., Schmid, C., Ponce, J.: Beyond bags of features: Spatial pyramid  matching for recognizing natural scene categories. In: CVPR. (2006)  20. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional  networks for visual recognition. In: ECCV. (2014)  21. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomed-  ical image segmentation. In: MICCAI. (2015) 22. Badrinarayanan, V., Kendall, A., Cipolla, R.:  Segnet: A deep convolutional  encoder-decoder architecture for image segmentation. PAMI (2017)   DeepLabv3+: Encoder-Decoder with Atrous Separable ConvolutionReferences  1. Everingham, M., Eslami, S.M.A., Gool, L.V., Williams, C.K.I., Winn, J., Zisser- man, A.: The pascal visual object classes challenge a retrospective. IJCV (2014) 2. Mottaghi, R., Chen, X., Liu, X., Cho, N.G., Lee, S.W., Fidler, S., Urtasun, R., Yuille, A.: The role of context for object detection and semantic segmentation in the wild. In: CVPR. (2014)  3. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. (2016)  4. Zhou, B., Zhao, H., Puig, X., Fidler, S., Barriuso, A., Torralba, A.: Scene parsing  through ade20k dataset. In: CVPR. (2017)  5. Caesar, H., Uijlings, J., Ferrari, V.: COCO-Stuﬀ: Thing and stuﬀ classes in context.  In: CVPR. (2018)  6. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. In: Proc. IEEE. (1998) 7. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  convolutional neural networks. In: NIPS. (2012)  Imagenet classification with deep  8. Sermanet, P., Eigen, D., Zhang, X., Mathieu, M., Fergus, R., LeCun, Y.: Overfeat: Integrated recognition, localization and detection using convolutional networks. In: ICLR. (2014)  9. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. In: ICLR. (2015)  10. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A.: Going deeper with convolutions. In: CVPR. (2015) 11. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  12. He, X., Zemel, R.S., Carreira-Perpindn, M.: Multiscale conditional random fields  segmentation. In: CVPR. (2015)  for image labeling. In: CVPR. (2004)  13. Shotton, J., Winn, J., Rother, C., Criminisi, A.: Textonboost for image understand- ing: Multi-class object recognition and segmentation by jointly modeling texture, layout, and context. IJCV (2009)  14. Kohli, P., Torr, P.H., et al.: Robust higher order potentials for enforcing label  consistency. IJCV 82(3) (2009) 302-324  15. Ladicky, L., Russell, C., Kohli, P., Torr, P.H.: Associative hierarchical crfs for  object class image segmentation. In: ICCV. (2009)  16. Gould, S., Fulton, R., Koller, D.: Decomposing a scene into geometric and seman-  tically consistent regions. In: ICCV. (2009)  17. Yao, J., Fidler, S., Urtasun, R.: Describing the scene as a whole: Joint object detection, scene classification and semantic segmentation. In: CVPR. (2012) 18. Grauman, K., Darrell, T.: The pyramid match kernel: Discriminative classification  with sets of image features. In: ICCV. (2005)  19. Lazebnik, S., Schmid, C., Ponce, J.: Beyond bags of features: Spatial pyramid  matching for recognizing natural scene categories. In: CVPR. (2006)  20. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional  networks for visual recognition. In: ECCV. (2014)  21. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomed-  ical image segmentation. In: MICCAI. (2015) 22. Badrinarayanan, V., Kendall, A., Cipolla, R.:  Segnet: A deep convolutional  encoder-decoder architecture for image segmentation. PAMI (2017)   16  L.-C Chen, Y. Zhu, G. Papandreou, F. Schroﬀ, and H. Adam  23. Chen, L.C., Papandreou, G., Schroﬀ, F., Adam, H.: Rethinking atrous convolution  for semantic image segmentation. arXiv:1706.05587 (2017)  24. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In:  25. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  26. Chollet, F.: Xception: Deep learning with depthwise separable convolutions. In:  CVPR. (2017)  In: CVPR. (2016)  CVPR. (2017)  27. Sifre, L.: Rigid-motion scattering for image classification. PhD thesis (2014) 28. Vanhoucke, V.: Learning visual representations at scale. ICLR invited talk (2014) 29. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: Mobilenets: Eﬃcient convolutional neural networks for mobile vision applications. arXiv:1704.04861 (2017)  30. Zhang, X., Zhou, X., Lin, M., Sun, J.: Shuﬄenet: An extremely eﬃcient convolu-  tional neural network for mobile devices. In: CVPR. (2018)  31. Qi, H., Zhang, Z., Xiao, B., Hu, H., Cheng, B., Wei, Y., Dai, J.: Deformable convolutional networks - coco detection and segmentation challenge 2017 entry. ICCV COCO Challenge Workshop (2017)  32. Mostajabi, M., Yadollahpour, P., Shakhnarovich, G.: Feedforward semantic seg-  mentation with zoom-out features. In: CVPR. (2015)  33. Dai, J., He, K., Sun, J.: Convolutional feature masking for joint object and stuﬀ  34. Farabet, C., Couprie, C., Najman, L., LeCun, Y.: Learning hierarchical features  segmentation. In: CVPR. (2015)  for scene labeling. PAMI (2013)  35. Eigen, D., Fergus, R.: Predicting depth, surface normals and semantic labels with  a common multi-scale convolutional architecture. In: ICCV. (2015)  36. Pinheiro, P., Collobert, R.: Recurrent convolutional neural networks for scene  labeling. In: ICML. (2014)  37. Lin, G., Shen, C., van den Hengel, A., Reid, I.: Eﬃcient piecewise training of deep  structured models for semantic segmentation. In: CVPR. (2016)  38. Chen, L.C., Yang, Y., Wang, J., Xu, W., Yuille, A.L.: Attention to scale: Scale-  aware semantic image segmentation. In: CVPR. (2016)  39. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Semantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. TPAMI (2017)  40. Kr¨ahenb¨uhl, P., Koltun, V.: Eﬃcient inference in fully connected crfs with gaussian  edge potentials. In: NIPS. (2011)  41. Adams, A., Baek, J., Davis, M.A.: Fast high-dimensional filtering using the per-  mutohedral lattice. In: Eurographics. (2010)  42. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. In: ICLR. (2015)  43. Bell, S., Upchurch, P., Snavely, N., Bala, K.: Material recognition in the wild with  the materials in context database. In: CVPR. (2015)  44. Zheng, S., Jayasumana, S., Romera-Paredes, B., Vineet, V., Su, Z., Du, D., Huang, C., Torr, P.: Conditional random fields as recurrent neural networks. In: ICCV. (2015)  45. Liu, Z., Li, X., Luo, P., Loy, C.C., Tang, X.: Semantic image segmentation via  deep parsing network. In: ICCV. (2015)  46. Papandreou, G., Chen, L.C., Murphy, K., Yuille, A.L.: Weakly- and semi- supervised learning of a dcnn for semantic image segmentation. In: ICCV. (2015)   DeepLabv3+: Encoder-Decoder with Atrous Separable Convolution47. Schwing, A.G., Urtasun, R.:  Fully connected deep structured networks.  arXiv:1503.02351 (2015)  48. Jampani, V., Kiefel, M., Gehler, P.V.: Learning sparse high dimensional filters: Image filtering, dense crfs and bilateral neural networks. In: CVPR. (2016)  49. Vemulapalli, R., Tuzel, O., Liu, M.Y., Chellappa, R.: Gaussian conditional random  field network for semantic segmentation. In: CVPR. (2016)  50. Chandra, S., Kokkinos, I.: Fast, exact and multi-scale inference for semantic image  segmentation with deep Gaussian CRFs. In: ECCV. (2016)  51. Chandra, S., Usunier, N., Kokkinos, I.: Dense and low-rank gaussian crfs using  deep embeddings. In: ICCV. (2017)  52. Liu, W., Rabinovich, A., Berg, A.C.: Parsenet: Looking wider to see better.  53. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti-  arXiv:1506.04579 (2015)  mation. In: ECCV. (2016)  54. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature  pyramid networks for object detection. In: CVPR. (2017)  55. Shrivastava, A., Sukthankar, R., Malik, J., Gupta, A.: Beyond skip connections:  Top-down modulation for object detection. arXiv:1612.06851 (2016)  56. Fu, C.Y., Liu, W., Ranga, A., Tyagi, A., Berg, A.C.: Dssd: Deconvolutional single  shot detector. arXiv:1701.06659 (2017)  57. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmen-  tation. In: ICCV. (2015)  58. Lin, G., Milan, A., Shen, C., Reid, I.: Refinenet: Multi-path refinement networks In: CVPR.  with identity mappings for high-resolution semantic segmentation. (2017)  59. Pohlen, T., Hermans, A., Mathias, M., Leibe, B.: Full-resolution residual networks  for semantic segmentation in street scenes. In: CVPR. (2017)  60. Peng, C., Zhang, X., Yu, G., Luo, G., Sun, J.: Large kernel matters-improve  semantic segmentation by global convolutional network. In: CVPR. (2017)  61. Islam, M.A., Rochan, M., Bruce, N.D., Wang, Y.: Gated feedback refinement  network for dense image labeling. In: CVPR. (2017)  62. Wojna, Z., Ferrari, V., Guadarrama, S., Silberman, N., Chen, L.C., Fathi, A.,  Uijlings, J.: The devil is in the decoder. In: BMVC. (2017)  63. Fu, J., Liu, J., Wang, Y., Lu, H.: Stacked deconvolutional network for semantic  segmentation. arXiv:1708.04943 (2017)  64. Zhang, Z., Zhang, X., Peng, C., Cheng, D., Sun, J.: Exfuse: Enhancing feature  fusion for semantic segmentation. arXiv:1804.03821 (2018)  65. Xie, S., Girshick, R., Dollr, P., Tu, Z., He, K.: Aggregated residual transformations  for deep neural networks. In: CVPR. (2017)  66. Jin, J., Dundar, A., Culurciello, E.: Flattened convolutional neural networks for  feedforward acceleration. arXiv:1412.5474 (2014)  67. Wang, M., Liu, B., Foroosh, H.: Design of eﬃcient convolutional layers using sin- gle intra-channel convolution, topological subdivisioning and spatial ”bottleneck” structure. arXiv:1608.04337 (2016)  68. Zoph, B., Vasudevan, V., Shlens, J., Le, Q.V.: Learning transferable architectures  for scalable image recognition. In: CVPR. (2018)  69. Holschneider, M., Kronland-Martinet, R., Morlet, J., Tchamitchian, P.: A real-time algorithm for signal analysis with the help of the wavelet transform. In: Wavelets: Time-Frequency Methods and Phase Space. (1989) 289-297  70. Giusti, A., Ciresan, D., Masci, J., Gambardella, L., Schmidhuber, J.: Fast image scanning with deep max-pooling convolutional neural networks. In: ICIP. (2013)   18  L.-C Chen, Y. Zhu, G. Papandreou, F. Schroﬀ, and H. Adam  71. Papandreou, G., Kokkinos, I., Savalle, P.A.: Modeling local and global deforma- tions in deep learning: Epitomic convolution, multiple instance learning, and sliding window detection. In: CVPR. (2015)  72. Abadi, M., Agarwal, A., et al.: Tensorﬂow: Large-scale machine learning on het-  erogeneous distributed systems. arXiv:1603.04467 (2016)  73. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Hypercolumns for object  segmentation and fine-grained localization. In: CVPR. (2015)  74. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., Berg, A.C., Fei-Fei, L.: ImageNet Large Scale Visual Recognition Challenge. IJCV (2015)  75. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. In: ICML. (2015)  76. Hariharan, B., Arbel´aez, P., Bourdev, L., Maji, S., Malik, J.: Semantic contours  from inverse detectors. In: ICCV. (2011)  77. Wang, P., Chen, P., Yuan, Y., Liu, D., Huang, Z., Hou, X., Cottrell, G.: Under-  standing convolution for semantic segmentation. arXiv:1702.08502 (2017)  78. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. In: ICCV. (2017)  79. Lin, T.Y., et al.: Microsoft COCO: Common objects in context. In: ECCV. (2014) 80. Hinton, G., Vinyals, O., Dean, J.: Distilling the knowledge in a neural network.  In: NIPS. (2014)  81. Sun, C., Shrivastava, A., Singh, S., Gupta, A.: Revisiting unreasonable eﬀectiveness  of data in deep learning era. In: ICCV. (2017)  82. Li, X., Liu, Z., Luo, P., Loy, C.C., Tang, X.: Not all pixels are equal: Diﬃculty-  aware semantic segmentation via deep layer cascade. In: CVPR. (2017)  83. Wu, Z., Shen, C., van den Hengel, A.: Wider or deeper: Revisiting the resnet model  for visual recognition. arXiv:1611.10080 (2016)  84. Wang, G., Luo, P., Lin, L., Wang, X.: Learning object interactions and descriptions  for semantic image segmentation. In: CVPR. (2017)  85. Luo, P., Wang, G., Lin, L., Wang, X.: Deep dual learning for semantic image  segmentation. In: ICCV. (2017)  86. Bul`o, S.R., Porzi, L., Kontschieder, P.: In-place activated batchnorm for memory-  optimized training of dnns. In: CVPR. (2018)"}