{"1": "1. Babenko, A., Lempitsky, V.: Aggregating local deep features for image retrieval. In: Proceedings of the IEEE international conference on computer vision. pp. 1269- 1277 (2015)   14  C. Yu et al.  channel. In Fig. 3, we show some randomly selected images from three diﬀerent datasets and their corresponding visualizations.  The visualizations all suggest that the proposed model is capable of ignor- ing cluttered backgrounds and tends to activate strongly on highly specific se- mantic parts. The highlighted activation regions in project5 1, project5 2 and project5 3 are strongly related to semantic parts, such as heads, wings and breast in CUB; front bumpers, wheels and lights in Cars; cockpit, tail stabilizers and engine in Aircraft. These parts are crucial to distinguish the category. More- over, our model is highly consistent with the human perception that resolve the fine details when perceive scenes or objects. In Fig. 3, we can see that the con- volution layers (relu5 1, relu5 2, relu5 3) provide a rough localization of target object. Based on this, the projection layers (project5 1, project5 2, project5 3) further determine essential parts of the object, which distinguish its category by successive interaction and integration of diﬀerent part features. The process is consistent with the coarse-to-fine nature of human perception [20] inspired by the Gestalt dictum that the “whole” is prior to the “parts” and it also provides an intuitive explanation as to why our framework can model subtle and local diﬀerences between subcategories without explicit part detection.  5 Conclusions  In this paper, we propose a hierarchical bilinear pooling approach to fuse multi- layer features for fine-grained recognition, which combines inter-layer interac- tions and discriminative feature learning in a mutually-reinforced way. The pro- posed network requires no bounding box/part annotations and can be trained end-to-end. Extensive experiments on birds, cars and aircrafts demonstrate the eﬀectiveness of our framework. In the future, we will conduct extended research on two directions, i.e., how to eﬀectively fuse more layer features to obtain part representation at multiple scales, and how to merge eﬀective methods for parts localization to learn better fine-grained representation.  Acknowledgements. This work was supported in part by the National Natu- ral Science Foundation of China (No.61772220, 61571205), in part by National Key Technology Research and Development Program of Ministry of Science and Technology of China (No.2015BAK36B00), in part by the Technology Innova- tion Program of Hubei Province (No.2017AAA017), in part by the Key Program for International S&T Cooperation Projects of China (No.2016YFE0121200).  References  1. Babenko, A., Lempitsky, V.: Aggregating local deep features for image retrieval. In: Proceedings of the IEEE international conference on computer vision. pp. 1269- 1277 (2015)   Hierarchical Bilinear Pooling for Fine-Grained Visual Recognition2. Branson, S., Van Horn, G., Belongie, S., Perona, P.: Bird species categorization using pose normalized deep convolutional nets. arXiv preprint arXiv:1406.2952 (2014)  3. Cai, S., Zuo, W., Zhang, L.: Higher-order integration of hierarchical convolution- al activations for fine-grained visual categorization. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 511-520 (2017) 4. Cui, Y., Zhou, F., Wang, J., Liu, X., Lin, Y., Belongie, S.: Kernel pooling for con- volutional neural networks. In: Computer Vision and Pattern Recognition (CVPR) (2017)  5. Fu, J., Zheng, H., Mei, T.: Look closer to see better: Recurrent attention convo- lutional neural network for fine-grained image recognition. In: Conf. on Computer Vision and Pattern Recognition (2017)  6. Gao, Y., Beijbom, O., Zhang, N., Darrell, T.: Compact bilinear pooling. In: Pro- ceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 317-326 (2016)  7. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Hypercolumns for object seg- mentation and fine-grained localization. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 447-456 (2015)  8. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016)  9. Jaderberg, M., Simonyan, K., Zisserman, A., et al.: Spatial transformer networks. In: Advances in neural information processing systems. pp. 2017-2025 (2015) 10. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: Proceedings of the 22nd ACM international conference on Multimedia. pp. 675-678. ACM (2014)  11. Kim, J.H., On, K.W., Lim, W., Kim, J., Ha, J.W., Zhang, B.T.: Hadamard product  for low-rank bilinear pooling. arXiv preprint arXiv:1610.04325 (2016)  12. Kong, S., Fowlkes, C.: Low-rank bilinear pooling for fine-grained classification. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 7025-7034. IEEE (2017)  13. Krause, J., Jin, H., Yang, J., Fei-Fei, L.: Fine-grained recognition without part annotations. In: Computer Vision and Pattern Recognition (CVPR), 2015 IEEE Conference on. pp. 5546-5555. IEEE (2015)  14. Krause, J., Sapp, B., Howard, A., Zhou, H., Toshev, A., Duerig, T., Philbin, J., Fei- Fei, L.: The unreasonable eﬀectiveness of noisy data for fine-grained recognition. In: European Conference on Computer Vision. pp. 301-320. Springer (2016) 15. Krause, J., Stark, M., Deng, J., Fei-Fei, L.: 3d object representations for fine- grained categorization. In: Computer Vision Workshops (ICCVW), 2013 IEEE International Conference on. pp. 554-561. IEEE (2013)  16. Lin, T.Y., Maji, S.: Improved bilinear pooling with cnns. arXiv preprint arX-  iv:1707.06772 (2017)  17. Lin, T.Y., RoyChowdhury, A., Maji, S.: Bilinear cnn models for fine-grained visual recognition. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 1449-1457 (2015)  18. Liu, X., Xia, T., Wang, J., Yang, Y., Zhou, F., Lin, Y.: Fully convolutional attention networks for fine-grained recognition. arXiv preprint arXiv:1603.06765 (2016) 19. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 3431-3440 (2015)   16  C. Yu et al.  20. Lu, Y., Yin, J., Chen, Z., Gong, H., Liu, Y., Qian, L., Li, X., Liu, R., Andolina, I.M., Wang, W.: Revealing detail along the visual hierarchy: neural clustering preserves acuity from v1 to v4. Neuron 98(2), 417-428 (2018)  21. Maji, S., Rahtu, E., Kannala, J., Blaschko, M., Vedaldi, A.: Fine-grained visual  classification of aircraft. arXiv preprint arXiv:1306.5151 (2013)  22. Moghimi, M., Belongie, S.J., Saberian, M.J., Yang, J., Vasconcelos, N., Li, L.J.:  Boosted convolutional neural networks. In: BMVC (2016)  23. Pham, N., Pagh, R.: Fast and scalable polynomial kernels via explicit feature maps. In: Proceedings of the 19th ACM SIGKDD international conference on Knowledge discovery and data mining. pp. 239-247. ACM (2013)  24. Rendle, S.: Factorization machines. In: Data Mining (ICDM), 2010 IEEE 10th  International Conference on. pp. 995-1000. IEEE (2010)  25. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recog- nition challenge. International Journal of Computer Vision 115(3), 211-252 (2015) 26. Simon, M., Rodner, E.: Neural activation constellations: Unsupervised part model discovery with convolutional networks. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 1143-1151 (2015)  27. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)  28. Sochor, J., Herout, A., Havel, J.: Boxcars: 3d boxes as cnn input for improved fine- grained vehicle recognition. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3006-3015 (2016)  29. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A.: Going deeper with convolutions. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 1-9 (2015) 30. Wah, C., Branson, S., Welinder, P., Perona, P., Belongie, S.: The caltech-ucsd  birds-200-2011 dataset (2011)  31. Wang, D., Shen, Z., Shao, J., Zhang, W., Xue, X., Zhang, Z.: Multiple granular- ity descriptors for fine-grained categorization. In: Computer Vision (ICCV), 2015 IEEE International Conference on. pp. 2399-2406. IEEE (2015)  32. Wang, Y., Choi, J., Morariu, V.I., Davis, L.S.: Mining discriminative triplets of patches for fine-grained classification. arXiv preprint arXiv:1605.01130 (2016) 33. Xie, S., Tu, Z.: Holistically-nested edge detection. In: Proceedings of the IEEE  international conference on computer vision. pp. 1395-1403 (2015)  34. Yang, L., Luo, P., Change Loy, C., Tang, X.: A large-scale car dataset for fine- grained categorization and verification. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3973-3981 (2015)  35. Zhang, H., Xu, T., Elhoseiny, M., Huang, X., Zhang, S., Elgammal, A., Metaxas, D.: Spda-cnn: Unifying semantic part detection and abstraction for fine-grained recognition. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1143-1152 (2016)  36. Zhang, X., Xiong, H., Zhou, W., Lin, W., Tian, Q.: Picking deep filter responses for fine-grained image recognition. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1134-1142 (2016)  37. Zheng, H., Fu, J., Mei, T., Luo, J.: Learning multi-attention convolutional neural network for fine-grained image recognition. In: Int. Conf. on Computer Vision (2017)"}