{"1": "1. Armeni, I., Sax, S., Zamir, A.R., Savarese, S.: Joint 2d-3d-semantic data for indoor scene  understanding. arXiv preprint arXiv:1702.01105 (2017)  2. Bircher, A., Kamel, M., Alexis, K., Oleynikova, H., Siegwart, R.: Receding horizon” next- best-view” planner for 3d exploration. In: Robotics and Automation (ICRA), 2016 IEEE International Conference on. pp. 1462-1468. IEEE (2016)  3. Chen, S., Li, Y., Kwok, N.M.: Active vision in robotic systems: A survey of recent develop-  ments. The International Journal of Robotics Research 30(11), 1343-1377 (2011)  4. Choudhury, S., Kapoor, A., Ranade, G., Scherer, S., Dey, D.: Adaptive information gathering  via imitation learning. Robotics Science and Systems (2017)  5. Choy, C.B., Xu, D., Gwak, J., Chen, K., Savarese, S.: 3d-r2n2: A unified approach for single and multi-view 3d object reconstruction. In: European Conference on Computer Vision. pp. 628-644. Springer (2016)  6. Dai, A., Chang, A.X., Savva, M., Halber, M., Funkhouser, T., Nießner, M.: Scannet: Richly-  annotated 3d reconstructions of indoor scenes. http://arxiv.org/abs/1702.04405 (2017)  7. Dai, A., Qi, C.R., Nießner, M.: Shape completion using 3d-encoder-predictor cnns and shape  synthesis. http://arxiv.org/abs/1612.00101 (2016)  8. Delmerico, J., Isler, S., Sabzevari, R., Scaramuzza, D.: A comparison of volumetric informa- tion gain metrics for active 3d object reconstruction. Autonomous Robots pp. 1-12 (2017) 9. Devrim Kaba, M., Gokhan Uzunbas, M., Nam Lim, S.: A reinforcement learning approach to the view planning problem. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 6933-6941 (2017)  10. Dunn, E., Frahm, J.M.: Next best view planning for active model improvement. In: BMVC.  pp. 1-11 (2009)  11. Feige, U.: A threshold of ln n for approximating set cover. JACM (1998) 12. Forster, C., Pizzoli, M., Scaramuzza, D.: Appearance-based active, monocular, dense recon-  struction for micro aerial vehicles. In: Robotics: Science and Systems (RSS) (2014)  13. Fraundorfer, F., Heng, L., Honegger, D., Lee, G.H., Meier, L., Tanskanen, P., Pollefeys, M.: Vision-based autonomous mapping and exploration using a quadrotor mav. In: Intelligent Robots and Systems (IROS), 2012 IEEE/RSJ International Conference on. pp. 4557-4564. IEEE (2012)  14. Ge, L., Liang, H., Yuan, J., Thalmann, D.: 3d convolutional neural networks for efficient and robust hand pose estimation from single depth images. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1991-2000 (2017)  15. Glorot, X., Bengio, Y.: Understanding the difficulty of training deep feedforward neural net- works. In: Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics. pp. 249-256 (2010)  16. Golovin, D., Krause, A.: Adaptive submodularity: Theory and applications in active learning  and stochastic optimization. JAIR (2011)  17. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: The  IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2016)  18. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks. In: Euro-  pean Conference on Computer Vision. pp. 630-645. Springer (2016)  19. Heng, L., Gotovos, A., Krause, A., Pollefeys, M.: Efficient visual exploration and coverage  with a micro aerial vehicle in unknown environments. In: ICRA (2015)  20. Hepp, B., Nießner, M., Hilliges, O.: Plan3d: Viewpoint and trajectory optimization for aerial  multi-view stereo reconstruction. arXiv preprint arXiv:1705.09314 (2017)  21. Hirschmuller, H.: Stereo processing by semiglobal matching and mutual information. IEEE  Transactions on pattern analysis and machine intelligence 30(2), 328-341 (2008)   Learn-to-Score: Efficient 3D Scene Exploration by Predicting View UtilityReferences  1. Armeni, I., Sax, S., Zamir, A.R., Savarese, S.: Joint 2d-3d-semantic data for indoor scene  understanding. arXiv preprint arXiv:1702.01105 (2017)  2. Bircher, A., Kamel, M., Alexis, K., Oleynikova, H., Siegwart, R.: Receding horizon” next- best-view” planner for 3d exploration. In: Robotics and Automation (ICRA), 2016 IEEE International Conference on. pp. 1462-1468. IEEE (2016)  3. Chen, S., Li, Y., Kwok, N.M.: Active vision in robotic systems: A survey of recent develop-  ments. The International Journal of Robotics Research 30(11), 1343-1377 (2011)  4. Choudhury, S., Kapoor, A., Ranade, G., Scherer, S., Dey, D.: Adaptive information gathering  via imitation learning. Robotics Science and Systems (2017)  5. Choy, C.B., Xu, D., Gwak, J., Chen, K., Savarese, S.: 3d-r2n2: A unified approach for single and multi-view 3d object reconstruction. In: European Conference on Computer Vision. pp. 628-644. Springer (2016)  6. Dai, A., Chang, A.X., Savva, M., Halber, M., Funkhouser, T., Nießner, M.: Scannet: Richly-  annotated 3d reconstructions of indoor scenes. http://arxiv.org/abs/1702.04405 (2017)  7. Dai, A., Qi, C.R., Nießner, M.: Shape completion using 3d-encoder-predictor cnns and shape  synthesis. http://arxiv.org/abs/1612.00101 (2016)  8. Delmerico, J., Isler, S., Sabzevari, R., Scaramuzza, D.: A comparison of volumetric informa- tion gain metrics for active 3d object reconstruction. Autonomous Robots pp. 1-12 (2017) 9. Devrim Kaba, M., Gokhan Uzunbas, M., Nam Lim, S.: A reinforcement learning approach to the view planning problem. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 6933-6941 (2017)  10. Dunn, E., Frahm, J.M.: Next best view planning for active model improvement. In: BMVC.  pp. 1-11 (2009)  11. Feige, U.: A threshold of ln n for approximating set cover. JACM (1998) 12. Forster, C., Pizzoli, M., Scaramuzza, D.: Appearance-based active, monocular, dense recon-  struction for micro aerial vehicles. In: Robotics: Science and Systems (RSS) (2014)  13. Fraundorfer, F., Heng, L., Honegger, D., Lee, G.H., Meier, L., Tanskanen, P., Pollefeys, M.: Vision-based autonomous mapping and exploration using a quadrotor mav. In: Intelligent Robots and Systems (IROS), 2012 IEEE/RSJ International Conference on. pp. 4557-4564. IEEE (2012)  14. Ge, L., Liang, H., Yuan, J., Thalmann, D.: 3d convolutional neural networks for efficient and robust hand pose estimation from single depth images. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1991-2000 (2017)  15. Glorot, X., Bengio, Y.: Understanding the difficulty of training deep feedforward neural net- works. In: Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics. pp. 249-256 (2010)  16. Golovin, D., Krause, A.: Adaptive submodularity: Theory and applications in active learning  and stochastic optimization. JAIR (2011)  17. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: The  IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2016)  18. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks. In: Euro-  pean Conference on Computer Vision. pp. 630-645. Springer (2016)  19. Heng, L., Gotovos, A., Krause, A., Pollefeys, M.: Efficient visual exploration and coverage  with a micro aerial vehicle in unknown environments. In: ICRA (2015)  20. Hepp, B., Nießner, M., Hilliges, O.: Plan3d: Viewpoint and trajectory optimization for aerial  multi-view stereo reconstruction. arXiv preprint arXiv:1705.09314 (2017)  21. Hirschmuller, H.: Stereo processing by semiglobal matching and mutual information. IEEE  Transactions on pattern analysis and machine intelligence 30(2), 328-341 (2008)   16  B. Hepp et al.  22. Hollinger, G.A., Englot, B., Hover, F.S., Mitra, U., Sukhatme, G.S.: Active planning for  underwater inspection and the benefit of adaptivity. IJRR (2012)  23. Hornung, A., Wurm, K.M., Bennewitz, M., Stachniss, C., Burgard, W.: OctoMap: An effi- cient probabilistic 3D mapping framework based on octrees. Autonomous Robots (2013). https://doi.org/10.1007/s10514-012-9321-0, http://octomap.github.com, software available at http://octomap.github.com  24. Isler, S., Sabzevari, R., Delmerico, J., Scaramuzza, D.: An Information Gain Formulation for  Active Volumetric 3D Reconstruction. In: ICRA (2016)  25. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  26. Krause, A., Golovin, D.: Submodular function maximization. Tractability: Practical Ap-  arXiv:1412.6980 (2014)  proaches to Hard Problems (2012)  27. Kriegel, S., Rink, C., Bodenm¨uller, T., Suppa, M.: Efficient next-best-scan planning for au- tonomous 3d surface reconstruction of unknown objects. Journal of Real-Time Image Pro- cessing 10(4), 611-631 (2015)  28. Liu, F., Shen, C., Lin, G.: Deep convolutional neural fields for depth estimation from a single image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recogni- tion. pp. 5162-5170 (2015)  29. Nemhauser, G.L., Wolsey, L.A., Fisher, M.L.: An analysis of approximations for maximizing  submodular set functionsi. Mathematical Programming (1978)  30. Riegler, G., Ulusoy, A.O., Geiger, A.: Octnet: Learning deep 3d representations at high res- olutions. In: Conference on Computer Vision and Pattern Recognition (CVPR) (2017) 31. Roberts, M., Dey, D., Truong, A., Sinha, S., Shah, S., Kapoor, A., Hanrahan, P., Joshi, N.: Submodular trajectory optimization for aerial 3d scanning. In: International Conference on Computer Vision (ICCV) 2017 (2017)  32. Shen, S., Michael, N., Kumar, V.: Autonomous multi-ﬂoor indoor navigation with a compu- tationally constrained mav. In: Robotics and automation (ICRA), 2011 IEEE international conference on. pp. 20-25. IEEE (2011)  33. Song, S., Xiao, J.: Deep sliding shapes for amodal 3d object detection in rgb-d images. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 808- 816 (2016)  34. Thrun, S., Burgard, W., Fox, D.: Probabilistic robotics. MIT press (2005) 35. Vasquez-Gomez, J.I., Sucar, L.E., Murrieta-Cid, R., Lopez-Damian, E.: Volumetric next- best-view planning for 3d object reconstruction with positioning error. International Journal of Advanced Robotic Systems 11(10), 159 (2014)  36. Wenhardt, S., Deutsch, B., Angelopoulou, E., Niemann, H.: Active visual object reconstruc- tion using d-, e-, and t-optimal next best views. In: 2007 IEEE Conference on Computer Vision and Pattern Recognition. pp. 1-7. IEEE (2007)  37. Xu, K., Zheng, L., Yan, Z., Yan, G., Zhang, E., Nießner, M., Deussen, O., Cohen-Or, D., Huang, H.: Autonomous reconstruction of unknown indoor scenes guided by time-varying tensor fields. ACM Transactions on Graphics 2017 (TOG) (2017)  38. Yamauchi, B.: A frontier-based approach for autonomous exploration. In: Computational Intelligence in Robotics and Automation, 1997. CIRA’97., Proceedings., 1997 IEEE Inter- national Symposium on. pp. 146-151. IEEE (1997)  39. Zamir, A.R., Wekel, T., Agrawal, P., Wei, C., Malik, J., Savarese, S.: Generic 3d represen- tation via pose estimation and matching. In: European Conference on Computer Vision. pp. 535-553. Springer (2016)  40. Zeng, A., Song, S., Nießner, M., Fisher, M., Xiao, J., Funkhouser, T.: 3dmatch: Learning  local geometric descriptors from rgb-d reconstructions. In: CVPR (2017)"}