{"1": "1. Collet, A., Chuang, M., Sweeney, P., Gillett, D., Evseev, D., Calabrese, D., Hoppe, H., Kirk, A., Sullivan, S.: High-quality streamable free-viewpoint video. ACM Transactions on Graphics (TOG) 34(4) (2015) 69  2. Orts-Escolano, S., Rhemann, C., Fanello, S., Chang, W., Kowdle, A., Degtyarev, Y., Kim, D., Davidson, P.L., Khamis, S., Dou, M., et al.: Holoportation: Virtual 3d teleportation in real-time. In: Proceedings of the 29th Annual Symposium on User Interface Software and Technology, ACM (2016) 741-754  3. Joo, H., Liu, H., Tan, L., Gui, L., Nabbe, B., Matthews, I., Kanade, T., Nobuhara, S., Sheikh, Y.: Panoptic studio: A massively multiview system for social motion capture. In: The IEEE International Conference on Computer Vision (ICCV). (2015)  4. Vlasic, D., Peers, P., Baran, I., Debevec, P., Popovi´c, J., Rusinkiewicz, S., Matusik, W.: Dynamic shape capture using multi-view photometric stereo. ACM Transactions on Graphics (TOG) 28(5) (2009) 174  5. Li, H., Luo, L., Vlasic, D., Peers, P., Popovi´c, J., Pauly, M., Rusinkiewicz, S.: Temporally coherent completion of dynamic shapes. ACM Transactions on Graphics (TOG) 31(1) (2012) 2  6. Vlasic, D., Baran, I., Matusik, W., Popovi´c, J.: Articulated mesh animation from multi-view silhouettes. In: ACM Transactions on Graphics (TOG). Volume 27., ACM (2008) 97  7. De Aguiar, E., Stoll, C., Theobalt, C., Ahmed, N., Seidel, H.P., Thrun, S.: In: ACM Transactions on  Performance capture from sparse multi-view video. Graphics (TOG). Volume 27., ACM (2008) 98  8. Xu, W., Chatterjee, A., Zollh¨ofer, M., Rhodin, H., Mehta, D., Seidel, H.P., Theobalt, C.: Monoperfcap: Human performance capture from monocular video. arXiv preprint arXiv:1708.02136 (2017)  9. Matusik, W., Buehler, C., Raskar, R., Gortler, S.J., McMillan, L.: Image-based visual hulls. In: Proceedings of the 27th annual conference on Computer graphics and interactive techniques, ACM Press/Addison-Wesley Publishing Co. (2000) 369-374  10. Furukawa, Y., Ponce, J.: Carved visual hulls for image-based modeling. In: European  Conference on Computer Vision, Springer (2006) 564-577  11. Esteban, C.H., Schmitt, F.: Silhouette and stereo fusion for 3d object modeling.  Computer Vision and Image Understanding 96(3) (2004) 367-392  12. Cheung, G.K., Baker, S., Kanade, T.: Visual hull alignment and refinement across time: A 3d reconstruction algorithm combining shape-from-silhouette with stereo. In: Computer Vision and Pattern Recognition, 2003. Proceedings. 2003 IEEE Computer Society Conference on. Volume 2., IEEE (2003) II-375 13. Song, D., Tong, R., Chang, J., Yang, X., Tang, M., Zhang, J.J.:  3d body shapes estimation from dressed-human silhouettes. In: Computer Graphics Forum. Volume 35., Wiley Online Library (2016) 147-156  14. Zuo, X., Du, C., Wang, S., Zheng, J., Yang, R.: Interactive visual hull refinement for specular and transparent object surface reconstruction. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 2237-2245  15. Liu, Y., Dai, Q., Xu, W.: A point-cloud-based multiview stereo algorithm for free-viewpoint video. IEEE transactions on visualization and computer graphics 16(3) (2010) 407-418   Deep Sparse Volumetric CaptureReferences  1. Collet, A., Chuang, M., Sweeney, P., Gillett, D., Evseev, D., Calabrese, D., Hoppe, H., Kirk, A., Sullivan, S.: High-quality streamable free-viewpoint video. ACM Transactions on Graphics (TOG) 34(4) (2015) 69  2. Orts-Escolano, S., Rhemann, C., Fanello, S., Chang, W., Kowdle, A., Degtyarev, Y., Kim, D., Davidson, P.L., Khamis, S., Dou, M., et al.: Holoportation: Virtual 3d teleportation in real-time. In: Proceedings of the 29th Annual Symposium on User Interface Software and Technology, ACM (2016) 741-754  3. Joo, H., Liu, H., Tan, L., Gui, L., Nabbe, B., Matthews, I., Kanade, T., Nobuhara, S., Sheikh, Y.: Panoptic studio: A massively multiview system for social motion capture. In: The IEEE International Conference on Computer Vision (ICCV). (2015)  4. Vlasic, D., Peers, P., Baran, I., Debevec, P., Popovi´c, J., Rusinkiewicz, S., Matusik, W.: Dynamic shape capture using multi-view photometric stereo. ACM Transactions on Graphics (TOG) 28(5) (2009) 174  5. Li, H., Luo, L., Vlasic, D., Peers, P., Popovi´c, J., Pauly, M., Rusinkiewicz, S.: Temporally coherent completion of dynamic shapes. ACM Transactions on Graphics (TOG) 31(1) (2012) 2  6. Vlasic, D., Baran, I., Matusik, W., Popovi´c, J.: Articulated mesh animation from multi-view silhouettes. In: ACM Transactions on Graphics (TOG). Volume 27., ACM (2008) 97  7. De Aguiar, E., Stoll, C., Theobalt, C., Ahmed, N., Seidel, H.P., Thrun, S.: In: ACM Transactions on  Performance capture from sparse multi-view video. Graphics (TOG). Volume 27., ACM (2008) 98  8. Xu, W., Chatterjee, A., Zollh¨ofer, M., Rhodin, H., Mehta, D., Seidel, H.P., Theobalt, C.: Monoperfcap: Human performance capture from monocular video. arXiv preprint arXiv:1708.02136 (2017)  9. Matusik, W., Buehler, C., Raskar, R., Gortler, S.J., McMillan, L.: Image-based visual hulls. In: Proceedings of the 27th annual conference on Computer graphics and interactive techniques, ACM Press/Addison-Wesley Publishing Co. (2000) 369-374  10. Furukawa, Y., Ponce, J.: Carved visual hulls for image-based modeling. In: European  Conference on Computer Vision, Springer (2006) 564-577  11. Esteban, C.H., Schmitt, F.: Silhouette and stereo fusion for 3d object modeling.  Computer Vision and Image Understanding 96(3) (2004) 367-392  12. Cheung, G.K., Baker, S., Kanade, T.: Visual hull alignment and refinement across time: A 3d reconstruction algorithm combining shape-from-silhouette with stereo. In: Computer Vision and Pattern Recognition, 2003. Proceedings. 2003 IEEE Computer Society Conference on. Volume 2., IEEE (2003) II-375 13. Song, D., Tong, R., Chang, J., Yang, X., Tang, M., Zhang, J.J.:  3d body shapes estimation from dressed-human silhouettes. In: Computer Graphics Forum. Volume 35., Wiley Online Library (2016) 147-156  14. Zuo, X., Du, C., Wang, S., Zheng, J., Yang, R.: Interactive visual hull refinement for specular and transparent object surface reconstruction. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 2237-2245  15. Liu, Y., Dai, Q., Xu, W.: A point-cloud-based multiview stereo algorithm for free-viewpoint video. IEEE transactions on visualization and computer graphics 16(3) (2010) 407-418   16  Z. Huang, et al.  16. Franco, J.S., Lapierre, M., Boyer, E.: Visual shapes of silhouette sets. In: 3D Data Processing, Visualization, and Transmission, Third International Symposium on, IEEE (2006) 397-404  17. Loop, C., Zhang, C., Zhang, Z.: Real-time high-resolution sparse voxelization with application to image-based modeling. In: Proceedings of the 5th High-Performance Graphics Conference, ACM (2013) 73-79  18. Starck, J., Hilton, A.: Surface capture for performance-based animation. IEEE  computer graphics and applications 27(3) (2007)  19. Zitnick, C.L., Kang, S.B., Uyttendaele, M., Winder, S., Szeliski, R.: High-quality video view interpolation using a layered representation. In: ACM Transactions on Graphics (TOG). Volume 23., ACM (2004) 600-608  20. Waschb¨usch, M., W¨urmlin, S., Cotting, D., Sadlo, F., Gross, M.: Scalable 3d video  of dynamic scenes. The Visual Computer 21(8) (2005) 629-638  21. Wu, C., Varanasi, K., Liu, Y., Seidel, H.P., Theobalt, C.: Shading-based dynamic shape refinement from multi-view video under general illumination. In: Computer Vision (ICCV), 2011 IEEE International Conference on, IEEE (2011) 1108-1115 22. Ahmed, N., Theobalt, C., Dobrev, P., Seidel, H.P., Thrun, S.: Robust fusion of dynamic shape and normal capture for high-quality reconstruction of time-varying geometry. In: Computer Vision and Pattern Recognition, 2008. CVPR 2008. IEEE Conference on, IEEE (2008) 1-8  23. Stoll, C., Gall, J., De Aguiar, E., Thrun, S., Theobalt, C.: Video-based reconstruction of animatable human characters. ACM Transactions on Graphics (TOG) 29(6) (2010) 139  24. Bradley, D., Popa, T., Sheﬀer, A., Heidrich, W., Boubekeur, T.: Markerless garment capture. In: ACM Transactions on Graphics (TOG). Volume 27., ACM (2008) 99 25. Wu, C., Varanasi, K., Theobalt, C.: Full body performance capture under uncontrolled and varying illumination: A shading-based approach. Computer Vision-ECCV 2012 (2012) 757-770  26. Gall, J., Stoll, C., De Aguiar, E., Theobalt, C., Rosenhahn, B., Seidel, H.P.: Motion capture using joint skeleton tracking and surface estimation. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on, IEEE (2009) 1746-1753  27. Liu, Y., Stoll, C., Gall, J., Seidel, H.P., Theobalt, C.: Markerless motion capture In: Computer of interacting characters using multi-view image segmentation. Vision and Pattern Recognition (CVPR), 2011 IEEE Conference on, IEEE (2011) 1249-1256  28. Bray, M., Kohli, P., Torr, P.H.: Posecut: Simultaneous segmentation and 3d pose In: European conference on  estimation of humans using dynamic graph-cuts. computer vision, Springer (2006) 642-655  29. Brox, T., Rosenhahn, B., Cremers, D., Seidel, H.P.: High accuracy optical ﬂow serves 3-d pose tracking: exploiting contour and ﬂow based constraints. Computer Vision-ECCV 2006 (2006) 98-111  30. Brox, T., Rosenhahn, B., Gall, J., Cremers, D.: Combined region and motion-based 3d tracking of rigid and articulated objects. IEEE Transactions on Pattern Analysis and Machine Intelligence 32(3) (2010) 402-415  31. Mustafa, A., Kim, H., Guillemaut, J.Y., Hilton, A.: General dynamic scene reconstruction from multiple view video. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 900-908  32. Wu, C., Stoll, C., Valgaerts, L., Theobalt, C.: On-set performance capture of multiple actors with a stereo camera. ACM Transactions on Graphics (TOG) 32(6) (2013) 161   Deep Sparse Volumetric Capture33. Loper, M., Mahmood, N., Romero, J., Pons-Moll, G., Black, M.J.: Smpl: A skinned multi-person linear model. ACM Transactions on Graphics (TOG) 34(6) (2015) 248  34. Loper, M., Mahmood, N., Black, M.J.: Mosh: Motion and shape capture from  sparse markers. ACM Transactions on Graphics (TOG) 33(6) (2014) 220  35. Hasler, N., Ackermann, H., Rosenhahn, B., Thorm¨ahlen, T., Seidel, H.P.: Multilinear pose and body shape estimation of dressed subjects from image sets. In: Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on, IEEE (2010) 1823-1830  36. Anguelov, D., Srinivasan, P., Koller, D., Thrun, S., Rodgers, J., Davis, J.: Scape: shape completion and animation of people. In: ACM Transactions on Graphics (TOG). Volume 24., ACM (2005) 408-416  37. Balan, A.O., Sigal, L., Black, M.J., Davis, J.E., Haussecker, H.W.: Detailed human shape and pose from images. In: Computer Vision and Pattern Recognition, 2007. CVPR’07. IEEE Conference on, IEEE (2007) 1-8  38. Pl¨ankers, R., Fua, P.: Tracking and modeling people in video sequences. Computer  Vision and Image Understanding 81(3) (2001) 285-302  39. Sminchisescu, C., Triggs, B.: Estimating articulated human motion with covariance scaled sampling. The International Journal of Robotics Research 22(6) (2003) 371-391  40. Tan, J.K.V., Budvytis, I., Cipolla, R.: Indirect deep structured learning for 3d  human body shape and pose prediction  41. Bogo, F., Kanazawa, A., Lassner, C., Gehler, P., Romero, J., Black, M.J.: Keep it smpl: Automatic estimation of 3d human pose and shape from a single image. In: European Conference on Computer Vision, Springer (2016) 561-578  42. Kanazawa, A., Black, M.J., Jacobs, D.W., Malik, J.: End-to-end recovery of human  shape and pose. arXiv preprint arXiv:1712.06584 (2017)  43. Lassner, C., Romero, J., Kiefel, M., Bogo, F., Black, M.J., Gehler, P.V.: Unite the people: Closing the loop between 3d and 2d human representations. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). (2017)  44. Guan, P., Weiss, A., Balan, A.O., Black, M.J.: Estimating human shape and pose from a single image. In: Computer Vision, 2009 IEEE 12th International Conference on, IEEE (2009) 1381-1388  45. Dou, M., Fuchs, H., Frahm, J.M.: Scanning and tracking dynamic objects with commodity depth cameras. In: Mixed and Augmented Reality (ISMAR), 2013 IEEE International Symposium on, IEEE (2013) 99-106  46. Dou, M., Khamis, S., Degtyarev, Y., Davidson, P., Fanello, S.R., Kowdle, A., Escolano, S.O., Rhemann, C., Kim, D., Taylor, J., et al.: Fusion4d: Real-time performance capture of challenging scenes. ACM Transactions on Graphics (TOG) 35(4) (2016) 114  47. Ye, G., Liu, Y., Hasler, N., Ji, X., Dai, Q., Theobalt, C.: Performance capture of interacting characters with handheld kinects. Computer Vision-ECCV 2012 (2012) 828-841  48. Zollh¨ofer, M., Nießner, M., Izadi, S., Rehmann, C., Zach, C., Fisher, M., Wu, C., Fitzgibbon, A., Loop, C., Theobalt, C., et al.: Real-time non-rigid reconstruction using an rgb-d camera. ACM Transactions on Graphics (TOG) 33(4) (2014) 156 49. Wang, R., Wei, L., Vouga, E., Huang, Q., Ceylan, D., Medioni, G., Li, H.: Capturing dynamic textured surfaces of moving targets. In: European Conference on Computer Vision, Springer (2016) 271-288  50. Tylecek, R., Sara, R.: Refinement of surface mesh for accurate multi-view reconstruction. The International Journal of Virtual Reality 9(1) (2010) 45-54   18  Z. Huang, et al.  51. Wu, C., Liu, Y., Dai, Q., Wilburn, B.: Fusing multiview and photometric stereo IEEE transactions on  for 3d reconstruction under uncalibrated illumination. visualization and computer graphics 17(8) (2011) 1082-1095  52. Hern´andez, C., Vogiatzis, G., Brostow, G.J., Stenger, B., Cipolla, R.: Non-rigid photometric stereo with colored lights. In: Computer Vision, 2007. ICCV 2007. IEEE 11th International Conference on, IEEE (2007) 1-8  53. Robertini, N., Casas, D., De Aguiar, E., Theobalt, C.: Multi-view performance capture of surface details. International Journal of Computer Vision (2017) 1-18 54. Pons-Moll, G., Pujades, S., Hu, S., Black, M.: Clothcap: Seamless 4d clothing capture and retargeting. ACM Transactions on Graphics,(Proc. SIGGRAPH)[to appear] 1 (2017)  55. Zhang, C., Pujades, S., Black, M., Pons-Moll, G.: Detailed, accurate, human shape estimation from clothed 3D scan sequences. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017) Spotlight.  56. Yang, J., Franco, J.S., H´etroy-Wheeler, F., Wuhrer, S.: Estimation of human body shape in motion with wide clothing. In: European Conference on Computer Vision, Springer (2016) 439-454  57. Kalogerakis, E., Averkiou, M., Maji, S., Chaudhuri, S.: 3d shape segmentation  with projective convolutional networks. Proc. CVPR, IEEE 2 (2017)  58. Su, H., Maji, S., Kalogerakis, E., Learned-Miller, E.: Multi-view convolutional neural networks for 3d shape recognition. In: Proceedings of the IEEE international conference on computer vision. (2015) 945-953  59. Shi, B., Bai, S., Zhou, Z., Bai, X.: Deeppano: Deep panoramic representation for  3-d shape recognition. IEEE Signal Processing Letters 22(12) (2015) 2339-2343  60. Qi, C.R., Su, H., Nießner, M., Dai, A., Yan, M., Guibas, L.J.: Volumetric and multi-view cnns for object classification on 3d data. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2016) 5648-5656  61. Huang, H., Kalogerakis, E., Chaudhuri, S., Ceylan, D., Kim, V.G., Yumer, E.: Learning local shape descriptors from part correspondences with multiview convolutional networks. ACM Transactions on Graphics (TOG) 37(1) (2018) 6  62. Su, H., Wang, F., Yi, L., Guibas, L.: 3d-assisted image feature synthesis for novel  views of an object. arXiv preprint arXiv:1412.0003 (2014)  63. Zhou, T., Tulsiani, S., Sun, W., Malik, J., Efros, A.A.: View synthesis by appearance ﬂow. In: European conference on computer vision, Springer (2016) 286-301 64. Park, E., Yang, J., Yumer, E., Ceylan, D., Berg, A.C.: Transformation-grounded image generation network for novel 3d view synthesis. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR), IEEE (2017) 702-711 65. Rezende, D.J., Eslami, S.A., Mohamed, S., Battaglia, P., Jaderberg, M., Heess, N.: Unsupervised learning of 3d structure from images. In: Advances In Neural Information Processing Systems. (2016) 4996-5004  66. Sinha, A., Unmesh, A., Huang, Q., Ramani, K.: Surfnet: Generating 3d shape  surfaces using deep residual networks. In: Proc. CVPR. (2017)  67. Choy, C.B., Xu, D., Gwak, J., Chen, K., Savarese, S.: 3d-r2n2: A unified approach for single and multi-view 3d object reconstruction. In: European Conference on Computer Vision, Springer (2016) 628-644  68. Lun, Z., Gadelha, M., Kalogerakis, E., Maji, S., Wang, R.: 3d shape recon- struction from sketches via multi-view convolutional networks. arXiv preprint arXiv:1707.06375 (2017)  69. Soltani, A.A., Huang, H., Wu, J., Kulkarni, T.D., Tenenbaum, J.B.: Synthesizing 3d shapes via modeling multi-view depth maps and silhouettes with deep generative   Deep Sparse Volumetric Capturenetworks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 1511-1519  70. Tatarchenko, M., Dosovitskiy, A., Brox, T.: Multi-view 3d models from single images with a convolutional network. In: European Conference on Computer Vision, Springer (2016) 322-337  71. Tulsiani, S., Zhou, T., Efros, A.A., Malik, J.: Multi-view supervision for single-view  reconstruction via diﬀerentiable ray consistency. In: CVPR. Volume 1. (2017) 3  72. Kar, A., H¨ane, C., Malik, J.: Learning a multi-view stereo machine. In: Advances  in Neural Information Processing Systems. (2017) 364-375  73. Hartmann, W., Galliani, S., Havlena, M., Van Gool, L., Schindler, K.: Learned multi-patch similarity. In: 2017 IEEE International Conference on Computer Vision (ICCV), IEEE (2017) 1595-1603  74. Ji, M., Gall, J., Zheng, H., Liu, Y., Fang, L.: Surfacenet: An end-to-end 3d neural  network for multiview stereopsis. arXiv preprint arXiv:1708.01749 (2017)  75. Dibra, E., Jain, H., Oztireli, C., Ziegler, R., Gross, M.: Human shape from silhouettes using generative hks descriptors and cross-modal neural networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR), Honolulu, HI, USA. Volume 5. (2017)  76. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International conference on machine learning. (2015) 448-456  77. Xu, H., Barbiˇc, J.: Signed distance fields for polygon soup meshes. Graphics  Interface 2014 (2014)  78. Varol, G., Romero, J., Martin, X., Mahmood, N., Black, M.J., Laptev, I., Schmid,  C.: Learning from synthetic humans. In: CVPR. (2017)  79. Adobe: Mixamo (2013) https://www.mixamo.com/. 80. Du, R., Chuang, M., Chang, W., Hoppe, H., Varshney, A.: Montage4d: Interactive seamless fusion of multiview video textures. In: Proceedings of ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games (I3D), ACM (May 2018) 124-133 81. Prada, F., Kazhdan, M., Chuang, M., Collet, A., Hoppe, H.: Spatiotemporal atlas parameterization for evolving meshes. ACM Transactions on Graphics (TOG) 36(4) (2017) 58  82. Furukawa, Y., Ponce, J.: Accurate, dense, and robust multiview stereopsis. IEEE  Trans. Pattern Anal. Mach. Intell. 32(8) (August 2010) 1362-1376"}