{"1": "1. Chetlur, S., Woolley, C., Vandermersch, P., Cohen, J., Tran, J., Catanzaro, B., Shelhamer, E.: cudnn: Eﬃcient primitives for deep learning. arXiv preprint arXiv:1410.0759 (2014)  2. Chollet, F.: Xception: Deep learning with depthwise separable convolutions. arXiv  preprint (2016)  3. Das, D., Avancha, S., Mudigere, D., Vaidynathan, K., Sridharan, S., Kalamkar, D., Kaul, B., Dubey, P.: Distributed deep learning using synchronous stochastic gradient descent. arXiv preprint arXiv:1602.06709 (2016)  4. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on. pp. 248-255. IEEE (2009)  5. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016)  6. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks.  In: European Conference on Computer Vision. pp. 630-645. Springer (2016)  7. He, Y., Zhang, X., Sun, J.: Channel pruning for accelerating very deep neural networks. In: International Conference on Computer Vision (ICCV). vol. 2, p. 6 (2017)  8. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: Mobilenets: Eﬃcient convolutional neural networks for mobile vision applications. arXiv preprint arXiv:1704.04861 (2017)  9. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks. arXiv preprint  arXiv:1709.01507 (2017)  10. Huang, G., Liu, S., van der Maaten, L., Weinberger, K.Q.: Condensenet: An eﬃ- cient densenet using learned group convolutions. arXiv preprint arXiv:1711.09224 (2017)  11. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected convolutional networks. In: Proceedings of the IEEE conference on computer vision and pattern recognition. vol. 1, p. 3 (2017)  12. Ioannou, Y., Robertson, D., Cipolla, R., Criminisi, A.: Deep roots: Improving cnn  eﬃciency with hierarchical filter groups. arXiv preprint arXiv:1605.06489 (2016)  13. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International conference on machine learning. pp. 448-456 (2015)  14. Jaderberg, M., Vedaldi, A., Zisserman, A.: Speeding up convolutional neural net-  works with low rank expansions. arXiv preprint arXiv:1405.3866 (2014)  15. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Advances in neural information processing systems. pp. 1097-1105 (2012)  16. Li, Z., Peng, C., Yu, G., Zhang, X., Deng, Y., Sun, J.: Light-head r-cnn: In defense  of two-stage object detector. arXiv preprint arXiv:1711.07264 (2017)  17. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision. pp. 740-755. Springer (2014)  18. Liu, C., Zoph, B., Shlens, J., Hua, W., Li, L.J., Fei-Fei, L., Yuille, A., Huang, J., Murphy, K.: Progressive neural architecture search. arXiv preprint arXiv:1712.00559 (2017)   ShuﬄeNet V2: Practical Guidelines for Eﬃcient CNN Architecture DesignReferences  1. Chetlur, S., Woolley, C., Vandermersch, P., Cohen, J., Tran, J., Catanzaro, B., Shelhamer, E.: cudnn: Eﬃcient primitives for deep learning. arXiv preprint arXiv:1410.0759 (2014)  2. Chollet, F.: Xception: Deep learning with depthwise separable convolutions. arXiv  preprint (2016)  3. Das, D., Avancha, S., Mudigere, D., Vaidynathan, K., Sridharan, S., Kalamkar, D., Kaul, B., Dubey, P.: Distributed deep learning using synchronous stochastic gradient descent. arXiv preprint arXiv:1602.06709 (2016)  4. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on. pp. 248-255. IEEE (2009)  5. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016)  6. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks.  In: European Conference on Computer Vision. pp. 630-645. Springer (2016)  7. He, Y., Zhang, X., Sun, J.: Channel pruning for accelerating very deep neural networks. In: International Conference on Computer Vision (ICCV). vol. 2, p. 6 (2017)  8. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: Mobilenets: Eﬃcient convolutional neural networks for mobile vision applications. arXiv preprint arXiv:1704.04861 (2017)  9. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks. arXiv preprint  arXiv:1709.01507 (2017)  10. Huang, G., Liu, S., van der Maaten, L., Weinberger, K.Q.: Condensenet: An eﬃ- cient densenet using learned group convolutions. arXiv preprint arXiv:1711.09224 (2017)  11. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected convolutional networks. In: Proceedings of the IEEE conference on computer vision and pattern recognition. vol. 1, p. 3 (2017)  12. Ioannou, Y., Robertson, D., Cipolla, R., Criminisi, A.: Deep roots: Improving cnn  eﬃciency with hierarchical filter groups. arXiv preprint arXiv:1605.06489 (2016)  13. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International conference on machine learning. pp. 448-456 (2015)  14. Jaderberg, M., Vedaldi, A., Zisserman, A.: Speeding up convolutional neural net-  works with low rank expansions. arXiv preprint arXiv:1405.3866 (2014)  15. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Advances in neural information processing systems. pp. 1097-1105 (2012)  16. Li, Z., Peng, C., Yu, G., Zhang, X., Deng, Y., Sun, J.: Light-head r-cnn: In defense  of two-stage object detector. arXiv preprint arXiv:1711.07264 (2017)  17. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision. pp. 740-755. Springer (2014)  18. Liu, C., Zoph, B., Shlens, J., Hua, W., Li, L.J., Fei-Fei, L., Yuille, A., Huang, J., Murphy, K.: Progressive neural architecture search. arXiv preprint arXiv:1712.00559 (2017)   16  Ningning Ma et al.  19. Liu, Z., Li, J., Shen, Z., Huang, G., Yan, S., Zhang, C.: Learning eﬃcient convolu- tional networks through network slimming. In: 2017 IEEE International Conference on Computer Vision (ICCV). pp. 2755-2763. IEEE (2017)  20. Peng, C., Zhang, X., Yu, G., Luo, G., Sun, J.: Large kernel matters-improve seman- tic segmentation by global convolutional network. arXiv preprint arXiv:1703.02719 (2017)  21. Real, E., Aggarwal, A., Huang, Y., Le, Q.V.: Regularized evolution for image clas-  sifier architecture search. arXiv preprint arXiv:1802.01548 (2018)  22. Real, E., Moore, S., Selle, A., Saxena, S., Suematsu, Y.L., Le, Q., Kurakin, A.: Large-scale evolution of image classifiers. arXiv preprint arXiv:1703.01041 (2017) 23. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recog- nition challenge. International Journal of Computer Vision 115(3), 211-252 (2015) 24. Sandler, M., Howard, A., Zhu, M., Zhmoginov, A., Chen, L.C.: Inverted residuals and linear bottlenecks: Mobile networks for classification, detection and segmenta- tion. arXiv preprint arXiv:1801.04381 (2018)  25. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)  26. Sun, K., Li, M., Liu, D., Wang, J.: Igcv3: Interleaved low-rank group convolutions  for eﬃcient deep neural networks. arXiv preprint arXiv:1806.00178 (2018)  27. Szegedy, C., Ioﬀe, S., Vanhoucke, V., Alemi, A.A.: Inception-v4, inception-resnet and the impact of residual connections on learning. In: AAAI. vol. 4, p. 12 (2017) 28. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A., et al.: Going deeper with convolutions. Cvpr (2015) 29. Szegedy, C., Vanhoucke, V., Ioﬀe, S., Shlens, J., Wojna, Z.: Rethinking the incep- tion architecture for computer vision. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2818-2826 (2016)  30. Wen, W., Wu, C., Wang, Y., Chen, Y., Li, H.: Learning structured sparsity in deep neural networks. In: Advances in Neural Information Processing Systems. pp. 2074-2082 (2016)  31. Xie, G., Wang, J., Zhang, T., Lai, J., Hong, R., Qi, G.J.: Igcv 2: Interleaved structured sparse convolutional neural networks. arXiv preprint arXiv:1804.06202 (2018)  32. Xie, L., Yuille, A.: Genetic cnn. arXiv preprint arXiv:1703.01513 (2017) 33. Xie, S., Girshick, R., Doll´ar, P., Tu, Z., He, K.: Aggregated residual transformations for deep neural networks. In: Computer Vision and Pattern Recognition (CVPR), 2017 IEEE Conference on. pp. 5987-5995. IEEE (2017)  34. Zhang, T., Qi, G.J., Xiao, B., Wang, J.: Interleaved group convolutions for deep  neural networks. In: International Conference on Computer Vision (2017)  35. Zhang, X., Zhou, X., Lin, M., Sun, J.: Shuﬄenet: An extremely eﬃcient convolu- tional neural network for mobile devices. arXiv preprint arXiv:1707.01083 (2017) 36. Zhang, X., Zou, J., He, K., Sun, J.: Accelerating very deep convolutional networks for classification and detection. IEEE transactions on pattern analysis and machine intelligence 38(10), 1943-1955 (2016)  37. Zhang, X., Zou, J., Ming, X., He, K., Sun, J.: Eﬃcient and accurate approximations of nonlinear convolutional networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1984-1992 (2015)  38. Zoph, B., Le, Q.V.: Neural architecture search with reinforcement learning. arXiv  preprint arXiv:1611.01578 (2016)  39. Zoph, B., Vasudevan, V., Shlens, J., Le, Q.V.: Learning transferable architectures  for scalable image recognition. arXiv preprint arXiv:1707.07012 (2017)"}