{"1": "1. Shotton, J., Fitzgibbon, A., Cook, M., Sharp, T., Finocchio, M., Moore, R., Kip- man, A., Blake, A.: Real-time human pose recognition in parts from single depth images. In: CVPR, IEEE (2011) 1297-1304 1  2. Ge, L., Cai, Y., Weng, J., Yuan, J.: Hand pointnet: 3d hand pose estimation using  point sets. In: CVPR. Volume 1. (2018) 5 1  3. Ge, L., Ren, Z., Yuan, J.: Point-to-point regression pointnet for 3d hand pose  estimation. In: ECCV, Springer (2018) 1  4. Song, S., Lan, C., Xing, J., Zeng, W., Liu, J.: An end-to-end spatio-temporal atten- tion model for human action recognition from skeleton data. In: AAAI. Volume 1. (2017) 7 1, 2, 3  5. Weng, J., Weng, C., Yuan, J.: Spatio-temporal naive-bayes nearest-neighbor (st- nbnn) for skeleton-based action recognition. In: CVPR. (2017) 4171-4180 1, 3, 4, 10  6. Liu, J., Wang, G., Hu, P., Duan, L.Y., Kot, A.C.: Global context-aware attention  lstm networks for 3d action recognition. In: CVPR. (July 2017) 1, 2, 3, 10  7. Yu, G., Liu, Z., Yuan, J.: Discriminative orderlet mining for real-time recognition  of human-object interaction. In: ACCV, Springer (2014) 50-65 1, 3, 4  8. Veeriah, V., Zhuang, N., Qi, G.J.: Diﬀerential recurrent neural networks for action  recognition. In: ICCV, IEEE (2015) 4041-4049 2  9. Zhu, W., Lan, C., Xing, J., Zeng, W., Li, Y., Shen, L., Xie, X., et al.: Co-occurrence feature learning for skeleton based action recognition using regularized deep lstm networks. In: AAAI. Volume 2. (2016) 8 2, 3  10. Li, W., Wen, L., Chang, M.C., Nam Lim, S., Lyu, S.: Adaptive rnn tree for large-  scale human action recognition. In: ICCV. (Oct 2017) 2, 3, 10  11. Lee, I., Kim, D., Kang, S., Lee, S.: Ensemble deep learning for skeleton-based action recognition using temporal sliding lstm networks. In: ICCV. (Oct 2017) 2, 3  12. Du, Y., Wang, W., Wang, L.: Hierarchical recurrent neural network for skeleton  based action recognition. In: CVPR. (2015) 1110-1118 2, 3, 10  13. Shahroudy, A., Liu, J., Ng, T.T., Wang, G.: Ntu rgb+d: A large scale dataset for  3d human activity analysis. In: CVPR. (June 2016) 2, 8, 9  14. Liu, J., Shahroudy, A., Xu, D., Wang, G.: Spatio-temporal lstm with trust gates for 3d human action recognition. In: ECCV, Springer (2016) 816-833 2, 3, 4, 5, 10, 11  15. Wang, H., Wang, L.: Modeling temporal dynamics and spatial configurations of actions using two-stream recurrent neural networks. In: CVPR. (July 2017) 2, 3, 11  16. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. In: ICCV. (Oct 2017) 3, 6  17. Xingjian, S., Chen, Z., Wang, H., Yeung, D.Y., Wong, W.K., Woo, W.c.: Convo- lutional lstm network: A machine learning approach for precipitation nowcasting. In: NIPS. (2015) 802-810 3, 7  18. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural computation  9(8) (1997) 1735-1780 3  19. Ren, Z., Yuan, J., Zhang, Z.: Robust hand gesture recognition based on finger- In: ACM MM. (2011)  earth mover’s distance with a commodity depth camera. 1093-1096 3   Deformable Pose Traversal ConvolutionReferences  1. Shotton, J., Fitzgibbon, A., Cook, M., Sharp, T., Finocchio, M., Moore, R., Kip- man, A., Blake, A.: Real-time human pose recognition in parts from single depth images. In: CVPR, IEEE (2011) 1297-1304 1  2. Ge, L., Cai, Y., Weng, J., Yuan, J.: Hand pointnet: 3d hand pose estimation using  point sets. In: CVPR. Volume 1. (2018) 5 1  3. Ge, L., Ren, Z., Yuan, J.: Point-to-point regression pointnet for 3d hand pose  estimation. In: ECCV, Springer (2018) 1  4. Song, S., Lan, C., Xing, J., Zeng, W., Liu, J.: An end-to-end spatio-temporal atten- tion model for human action recognition from skeleton data. In: AAAI. Volume 1. (2017) 7 1, 2, 3  5. Weng, J., Weng, C., Yuan, J.: Spatio-temporal naive-bayes nearest-neighbor (st- nbnn) for skeleton-based action recognition. In: CVPR. (2017) 4171-4180 1, 3, 4, 10  6. Liu, J., Wang, G., Hu, P., Duan, L.Y., Kot, A.C.: Global context-aware attention  lstm networks for 3d action recognition. In: CVPR. (July 2017) 1, 2, 3, 10  7. Yu, G., Liu, Z., Yuan, J.: Discriminative orderlet mining for real-time recognition  of human-object interaction. In: ACCV, Springer (2014) 50-65 1, 3, 4  8. Veeriah, V., Zhuang, N., Qi, G.J.: Diﬀerential recurrent neural networks for action  recognition. In: ICCV, IEEE (2015) 4041-4049 2  9. Zhu, W., Lan, C., Xing, J., Zeng, W., Li, Y., Shen, L., Xie, X., et al.: Co-occurrence feature learning for skeleton based action recognition using regularized deep lstm networks. In: AAAI. Volume 2. (2016) 8 2, 3  10. Li, W., Wen, L., Chang, M.C., Nam Lim, S., Lyu, S.: Adaptive rnn tree for large-  scale human action recognition. In: ICCV. (Oct 2017) 2, 3, 10  11. Lee, I., Kim, D., Kang, S., Lee, S.: Ensemble deep learning for skeleton-based action recognition using temporal sliding lstm networks. In: ICCV. (Oct 2017) 2, 3  12. Du, Y., Wang, W., Wang, L.: Hierarchical recurrent neural network for skeleton  based action recognition. In: CVPR. (2015) 1110-1118 2, 3, 10  13. Shahroudy, A., Liu, J., Ng, T.T., Wang, G.: Ntu rgb+d: A large scale dataset for  3d human activity analysis. In: CVPR. (June 2016) 2, 8, 9  14. Liu, J., Shahroudy, A., Xu, D., Wang, G.: Spatio-temporal lstm with trust gates for 3d human action recognition. In: ECCV, Springer (2016) 816-833 2, 3, 4, 5, 10, 11  15. Wang, H., Wang, L.: Modeling temporal dynamics and spatial configurations of actions using two-stream recurrent neural networks. In: CVPR. (July 2017) 2, 3, 11  16. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. In: ICCV. (Oct 2017) 3, 6  17. Xingjian, S., Chen, Z., Wang, H., Yeung, D.Y., Wong, W.K., Woo, W.c.: Convo- lutional lstm network: A machine learning approach for precipitation nowcasting. In: NIPS. (2015) 802-810 3, 7  18. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural computation  9(8) (1997) 1735-1780 3  19. Ren, Z., Yuan, J., Zhang, Z.: Robust hand gesture recognition based on finger- In: ACM MM. (2011)  earth mover’s distance with a commodity depth camera. 1093-1096 3   16  J. Weng, M. Liu, X. Jiang, J. Yuan  20. Wang, J., Liu, Z., Wu, Y., Yuan, J.: Mining actionlet ensemble for action recogni-  tion with depth cameras. In: CVPR, IEEE (2012) 1290-1297 3  21. Wang, J., Liu, Z., Wu, Y., Yuan, J.: Learning actionlet ensemble for 3d human  action recognition. T-PAMI 36(5) (2014) 914-927 3  22. Liang, H., Yuan, J., Thalmann, D., Thalmann, N.M.: Ar in hand: Egocentric palm pose tracking and gesture recognition for augmented reality applications. In: ACM MM, ACM (2015) 743-744 3  23. Ren, Z., Yuan, J., Meng, J., Zhang, Z.: Robust part-based hand gesture recognition  using kinect sensor. T-MM 15 (2016) 3  24. Weng, J., Weng, C., Yuan, J., Liu, Z.: Discriminative spatio-tempoal pattern  discovery for 3d action recognition. T-CSVT (2018) 3  25. Oﬂi, F., Chaudhry, R., Kurillo, G., Vidal, R., Bajcsy, R.: Sequence of the most in- formative joints (smij): A new representation for human skeletal action recognition. JVCI 25(1) (2014) 24-38 3, 10  26. Vemulapalli, R., Chellapa, R.: Rolling rotations for recognizing human actions  from 3d skeletal data. In: CVPR. (2016) 4471-4479 3  27. Garcia-Hernando, G., Kim, T.K.: Transition forests: Learning discriminative tem- poral transitions for action recognition and detection. In: CVPR. (2017) 432-440 3  28. Wang, P., Yuan, C., Hu, W., Li, B., Zhang, Y.: Graph based skeleton motion rep- resentation and similarity measurement for action recognition. In: ECCV, Springer (2016) 370-385 3  29. De Smedt, Q., Wannous, H., Vandeborre, J.P.: Skeleton-based dynamic hand ges-  ture recognition. In: CVPRW. (2016) 1-9 3, 8, 9  30. Liu, M., Yuan, J.: Recognizing human actions as the evolution of pose estimation  maps. In: CVPR. (June 2018) 3, 4  31. Li, Y., Lan, C., Xing, J., Zeng, W., Yuan, C., Liu, J.: Online human action detection using joint classification-regression recurrent neural networks. In: ECCV, Springer (2016) 203-220 3  32. Ke, Q., Bennamoun, M., An, S., Sohel, F., Boussaid, F.: A new representation of skeleton sequences for 3d action recognition. In: CVPR. (July 2017) 3, 4, 10 33. Wang, P., Li, Z., Hou, Y., Li, W.: Action recognition based on joint trajectory maps using convolutional neural networks. In: ACM MM, ACM (2016) 102-106 3, 4  34. Liu, M., Liu, H., Chen, C.: Enhanced skeleton visualization for view invariant  human action recognition. Pattern Recognition 68 (2017) 346-362 4  35. Lea, C., Flynn, M.D., Vidal, R., Reiter, A., Hager, G.D.: Temporal convolutional  networks for action segmentation and detection. In: CVPR. (July 2017) 5, 9, 10  36. Graves, A.: Supervised sequence labelling. In: Supervised sequence labelling with  recurrent neural networks. Springer (2012) 5-13 8  37. Oﬂi, F., Chaudhry, R., Kurillo, G., Vidal, R., Bajcsy, R.: Berkeley mhad: A com- prehensive multimodal human action database. In: WACV, IEEE (2013) 53-60 8, 10  38. Evangelidis, G., Singh, G., Horaud, R.: Skeletal quads: Human action recognition  using joint quadruples. In: ICPR, IEEE (2014) 4513-4518 9  39. Kingma, D.P., Ba, J.L.: Adam: A method for stochastic optimization. (2015) 9 40. Sutskever, I., Vinyals, O., Le, Q.V.: Sequence to sequence learning with neural  networks. In: NIPS. (2014) 3104-3112 9  41. Chao Li, Qiaoyong Zhong, D.X.S.P.: Skeleton-based action recognition with con-  volutional neural networks. In: ICMEW, IEEE (1997) 597-600 10   Deformable Pose Traversal Convolution42. Vantigodi, S., Radhakrishnan, V.B.: Action recognition from motion capture data using meta-cognitive rbf network classifier. In: ISSNIP, IEEE (2014) 1-6 10 43. Kapsouras, I., Nikolaidis, N.: Action recognition on motion capture data using a dynemes and forward diﬀerences representation. JVCI 25(6) (2014) 1432-1445 10 44. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR. Volume 1. (2017) 7 12  45. Cai, Y., Ge, L., Cai, J., Yuan, J.: Weakly-supervised 3d hand pose estimation from  monocular rgb images. In: ECCV, Springer (2018) 12"}