{"1": "1. Yang, S., Maturana, D., Scherer, S.: Real-time 3D scene layout from a single image  using convolutional neural networks. In: ICRA. (2016) 2183-2189  2. Shao, T., Xu, W., Zhou, K., Wang, J., Li, D., Guo, B.: An interactive approach to semantic modeling of indoor scenes with an RGBD camera. ACM Trans. Graph. 31(6) (2012) 136  3. Porzi, L., Bul´o, S.R., Penate-Sanchez, A., Ricci, E., Moreno-Noguer, F.: Learning IEEE Robot. Autom.  depth-aware deep representations for robotic perception. Lett. 2(2) (2017) 468-475  4. Kim, K.R., Koh, Y.J., Kim, C.S.: Multiscale feature extractors for stereo matching  cost computation. IEEE Access 6 (May 2018) 27971-27983  5. Gupta, A., Efros, A.A., Hebert, M.: Blocks world revisited: Image understanding  using qualitative geometry and mechanics. In: Proc. ECCV. (2010) 482-496  6. Lee, D.C., Gupta, A., Hebert, M., Kanade, T.: Estimating spatial layout of rooms In: Proc. NIPS. (2010)  using volumetric reasoning about objects and surfaces. 1288-1296  7. Russell, B.C., Torralba, A.: Building a database of 3D scenes from user annotations.  In: Proc. IEEE CVPR. (2009) 2711-2718  8. Ladicky, L., Shi, J., Pollefeys, M.: Pulling things out of perspective.  In: Proc.  9. Saxena, A., Chung, S.H., Ng, A.Y.: Learning depth from single monocular images.  IEEE CVPR. (2014) 89-96  In: Proc. NIPS. (2005) 1161-1168  10. Saxena, A., Sun, M., Ng, A.Y.: Make3D: Learning 3D scene sctructure from a single still image. IEEE Trans. Pattern Anal. Mach. Intell. 31(5) (2009) 824-840 11. Liu, B., Gould, S., Koller, D.: Single image depth estimation from predicted se-  mantic labels. In: Proc. IEEE CVPR. (2010) 1253-1260  12. Karsch, K., Liu, C., Kang, S.B.: Depth transfer: Depth extraction from video using non-parametric sampling. IEEE Trans. Pattern Anal. Mach. Intell. 36(11) (2014) 2144-2158  13. Eigen, D., Puhrsch, C., Fergus, R.: Depth map prediction from a single image  using a multi-scale deep network. In: Proc. NIPS. (2014) 2366-2374  14. Eigen, D., Fergus, R.: Predicting depth, surface normals and semantic labels with a common multi-scale convolutional architecture. In: Proc. IEEE ICCV. (2015) 2650-2658  15. Liu, F., Shen, C., Lin, G.: Deep convolutional neural fields for depth estimation  from a single image. In: Proc. IEEE CVPR. (2015) 5162-5170  16. Wang, P., Shen, X., Lin, Z., S.Cohen, Price, B., Yuille, A.: Towards unified depth and semantic prediction from a single image. In: Proc. IEEE CVPR. (2015) 2800- 2809  17. Li, B., Shen, C., Dai, Y., van den Hengel, A., He, M.: Depth and surface normal es- timation from monocular images using regression on deep features and hierarchical CRFs. In: Proc. IEEE CVPR. (2015) 1119-1127  18. Chakrabarti, A., Shao, J., Shakhnarovich, G.: Depth from a single image by harmo- nizing overcomplete local network predictions. In: Proc. NIPS. (2016) 2658-2666 19. Laina, I., Rupprecht, C., Belagiannis, V.: Deeper depth prediction with fully con-  volutional residual networks. In: Proc. IEEE 3DV. (2016) 239-248  20. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: Proc. IEEE CVPR. (2016) 770-778   Monocular depth estimation via WSM and reliability-based refinementReferences  1. Yang, S., Maturana, D., Scherer, S.: Real-time 3D scene layout from a single image  using convolutional neural networks. In: ICRA. (2016) 2183-2189  2. Shao, T., Xu, W., Zhou, K., Wang, J., Li, D., Guo, B.: An interactive approach to semantic modeling of indoor scenes with an RGBD camera. ACM Trans. Graph. 31(6) (2012) 136  3. Porzi, L., Bul´o, S.R., Penate-Sanchez, A., Ricci, E., Moreno-Noguer, F.: Learning IEEE Robot. Autom.  depth-aware deep representations for robotic perception. Lett. 2(2) (2017) 468-475  4. Kim, K.R., Koh, Y.J., Kim, C.S.: Multiscale feature extractors for stereo matching  cost computation. IEEE Access 6 (May 2018) 27971-27983  5. Gupta, A., Efros, A.A., Hebert, M.: Blocks world revisited: Image understanding  using qualitative geometry and mechanics. In: Proc. ECCV. (2010) 482-496  6. Lee, D.C., Gupta, A., Hebert, M., Kanade, T.: Estimating spatial layout of rooms In: Proc. NIPS. (2010)  using volumetric reasoning about objects and surfaces. 1288-1296  7. Russell, B.C., Torralba, A.: Building a database of 3D scenes from user annotations.  In: Proc. IEEE CVPR. (2009) 2711-2718  8. Ladicky, L., Shi, J., Pollefeys, M.: Pulling things out of perspective.  In: Proc.  9. Saxena, A., Chung, S.H., Ng, A.Y.: Learning depth from single monocular images.  IEEE CVPR. (2014) 89-96  In: Proc. NIPS. (2005) 1161-1168  10. Saxena, A., Sun, M., Ng, A.Y.: Make3D: Learning 3D scene sctructure from a single still image. IEEE Trans. Pattern Anal. Mach. Intell. 31(5) (2009) 824-840 11. Liu, B., Gould, S., Koller, D.: Single image depth estimation from predicted se-  mantic labels. In: Proc. IEEE CVPR. (2010) 1253-1260  12. Karsch, K., Liu, C., Kang, S.B.: Depth transfer: Depth extraction from video using non-parametric sampling. IEEE Trans. Pattern Anal. Mach. Intell. 36(11) (2014) 2144-2158  13. Eigen, D., Puhrsch, C., Fergus, R.: Depth map prediction from a single image  using a multi-scale deep network. In: Proc. NIPS. (2014) 2366-2374  14. Eigen, D., Fergus, R.: Predicting depth, surface normals and semantic labels with a common multi-scale convolutional architecture. In: Proc. IEEE ICCV. (2015) 2650-2658  15. Liu, F., Shen, C., Lin, G.: Deep convolutional neural fields for depth estimation  from a single image. In: Proc. IEEE CVPR. (2015) 5162-5170  16. Wang, P., Shen, X., Lin, Z., S.Cohen, Price, B., Yuille, A.: Towards unified depth and semantic prediction from a single image. In: Proc. IEEE CVPR. (2015) 2800- 2809  17. Li, B., Shen, C., Dai, Y., van den Hengel, A., He, M.: Depth and surface normal es- timation from monocular images using regression on deep features and hierarchical CRFs. In: Proc. IEEE CVPR. (2015) 1119-1127  18. Chakrabarti, A., Shao, J., Shakhnarovich, G.: Depth from a single image by harmo- nizing overcomplete local network predictions. In: Proc. NIPS. (2016) 2658-2666 19. Laina, I., Rupprecht, C., Belagiannis, V.: Deeper depth prediction with fully con-  volutional residual networks. In: Proc. IEEE 3DV. (2016) 239-248  20. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: Proc. IEEE CVPR. (2016) 770-778   16  M. Heo et al.  21. Liu, M., Salzmann, M., He, X.: Discrete-continuous depth estimation from a single  image. In: Proc. IEEE CVPR. (2014) 716-723  22. Kim, H.U., Kim, C.S.: CDT: Cooperative detection and tracking for tracing mul-  tiple objects in video sequences. In: Proc. ECCV. (2016) 851-867  23. Jang, W.D., Kim, C.S.: Online video object segmentation via convolutional trident  network. In: Proc. IEEE CVPR. (2017) 5849-5856  24. Lee, J.T., Kim, H.U., Lee, C., Kim, C.S.: Semantic line detection and its applica-  tions. In: Proc. IEEE ICCV. (2017) 3229-3237  25. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  ImageNet classification with deep  convolutional neural networks. In: Proc. NIPS. (2012) 1097-1105  26. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. In: ICLR. (2012)  27. Lee, J.H., Heo, M., Kim, K.R., Kim, C.S.: Single-image depth estimation based  on Fourier domain analysis. In: Proc. IEEE CVPR. (2018) 330-339  28. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A large-scale  hierarchical image database. In: Proc. IEEE CVPR. (2009) 248-255  29. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  segmentation. In: Proc. IEEE CVPR. (2015) 3431-3440  30. Luo, W., Li, Y., Urtasun, R., Zemel, R.: Understanding the eﬀective receptive field  in deep convolutional neural networks. In: Proc. NIPS. (2016) 4898-4906  31. Silberman, N., Hoiem, D., Kohli, P., Fergus, R.: Indoor segmentation and support  inference from RGBD images. In: Proc. ECCV. (2012) 746-760  32. Szegedy, C., Ioﬀe, S., Vanhoucke, V., Alemi, A.: Inception-v4, Inception-ResNet and the impact of residual connections on learning. In: AAAI. (2016) 4278-4284 33. Matthies, L., Kanade, T., Szeliski, R.: Kalman filter-based algorithms for estimat-  ing depth from image sequences. Int. J. Comput. Vis. 3(3) (1989) 209-238  34. Levin, A., Lischinski, D., Weiss, Y.: A closed-form solution to natural image mat-  ting. IEEE Trans. Pattern Anal. Mach. Intell. 30(2) (2008) 228-242  35. Yang, J., Ye, X., Li, K., Hou, C., Wang, Y.: Color-guided depth recovery from RGB-D data using an adaptive autoregressive model. IEEE Trans. Image Process. 23(8) (2016) 3443-3458  36. Diebel, J., Thrun, S.: An application of markov random fields to range sensing.  In: Advances in neural information processing systems. (2006) 291-298  37. Park, J., Kim, H., Tai, Y.W., Brown, M.S., Kweon, I.: High quality depth map upsampling for 3d-tof cameras. In: Computer Vision (ICCV), 2011 IEEE Interna- tional Conference on, IEEE (2011) 1623-1630  38. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R.: Caﬀe: Con- volutional architecture for fast feature embedding. In: ACM Multimedia. (2014) 675-678  39. Li, J., Klein, R., Yao, A.: A two-streamed network for estimating fine-scaled depth In: Proceedings of the 2017 IEEE International  maps from single rgb images. Conference on Computer Vision, Venice, Italy. (2017) 22-29"}