{"1": "1. Ba, J., Mnih, V., Kavukcuoglu, K.: Multiple object recognition with visual atten-  tion. In: International Conference on Learning Representations(2015)  2. Bachman, P., Alsharif, O., Precup, D.: Learning with pseudo-ensembles. In: Ad-  vances in Neural Information Processing Systems(2014)   14  W. Kim, B. Goyal, K. Chawla, J. Lee, K. Kwon  Table 6. Recall@K(%) score on Stanford online products dataset (SOP)  K Contrastive128 [29] LiftedStruct512 [29] N-Pairs512 [27] Clustering64 [28] Proxy NCA†64 [20] Margin†128 [38] HDC384 [39] A-Bier512 [23] ABE-2512 ABE-4512 ABE-8512101000  58.2 79.8 83.8 83.7 - 86.2 84.4 86.9  42.0 62.1 67.7 67.0 73.7 72.7 69.5 74.2  89.1 73.8 97.4 91.3 97.8 93.0 - 93.2 - - 98.0 93.8 97.7 92.8 94.0 97.8 94.7 98.2 75.4 94.8 98.2 75.9 76.3 88.4 94.8 98.2  88.0 88.3  Table 7. Recall@K(%) score on in-shop clothes retrieval dataset  K FasionNet+Joints4096 [18] FasionNet+Poselets4096 [18] FasionNet4096 [18] HDC384 [39] A-BIER512 [23] ABE-2512 ABE-4512 ABE-851241.0 42.0 53.0 62.1 83.164.0 65.0 73.0 84.9 95.168.0 70.0 76.0 89.0 96.971.0 72.0 77.0 91.2 97.573.0 72.0 79.0 92.3 97.873.5 75.0 80.0 93.1 98.0  96.0 96.4  98.4 85.2 98.6 86.7 87.3 96.7 97.9 98.2 98.5 98.7  97.8 98.0  98.2 98.4  97.2 97.6  7 Conclusion  In this work, we present a new framework for ensemble in the domain of deep metric learning. It uses attention-based architecture that attends to parts of the image. We use multiple such attention-based learners for our ensemble. Since ensemble benefits from diverse learners, we further introduce a divergence loss to diversify the feature embeddings learned by each learner. The divergence loss encourages that the attended parts of the image for each learner are diﬀerent. Experimental results demonstrate that the divergence loss not only increases the performance of ensemble but also increases each individual learners’ perfor- mance compared to the baseline. We demonstrate that our method outperforms the current state-of-the-art techniques by significant margin on several image retrieval benchmarks including CARS-196 [13], CUB-200-2011 [35], SOP [29], and in-shop clothes retrieval [18] datasets.  References  1. Ba, J., Mnih, V., Kavukcuoglu, K.: Multiple object recognition with visual atten-  tion. In: International Conference on Learning Representations(2015)  2. Bachman, P., Alsharif, O., Precup, D.: Learning with pseudo-ensembles. In: Ad-  vances in Neural Information Processing Systems(2014)   Attention-based Ensemble for Deep Metric Learning3. Bell, S., Bala, K.: Learning visual similarity for product design with convolutional  neural networks. Graphics 34(4), 98 (2015)  4. Chopra, S., Hadsell, R., LeCun, Y.: Learning a similarity metric discriminatively, with application to face verification. In: Computer Vision and Pattern Recogni- tion(2005)  5. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward neural networks. In: International Conference on Artificial Intelligence and Statis- tics (2010)  6. Hadsell, R., Chopra, S., LeCun, Y.: Dimensionality reduction by learning an in-  variant mapping. In: Computer Vision and Pattern Recognition(2006)  7. Harwood, B., VijayKumarB., G., Carneiro, G., Reid, I.D., Drummond, T.: Smart mining for deep metric learning. In: International Conference on Computer Vi- sion(2017)  8. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: Computer Vision and Pattern Recognition(2016)  9. Huang, C., Loy, C.C., Tang, X.: Local similarity-aware deep feature embedding.  In: Advances in Neural Information Processing Systems(2016)  10. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International Conference on Machine Learn- ing(2015)  11. Jaderberg, M., Simonyan, K., Zisserman, A., Kavukcuoglu, K.: Spatial transformer  networks. In: Advances in Neural Information Processing Systems(2015)  12. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: International Conference on Multimedia (2014)  13. Krause, J., Stark, M., Deng, J., Fei-Fei, L.: 3D object representations for fine- grained categorization. In: Workshop on 3D Representation and Recognition (2013) 14. Law, M.T., Urtasun, R., Zemel, R.S.: Deep spectral clustering learning. In: Inter-  national Conference on Machine Learning(2017)  15. Lee, C.Y., Xie, S., Gallagher, P., Zhang, Z., Tu, Z.: Deeply-supervised nets. In:  Artificial Intelligence and Statistics (2015)  16. Lee, S., Purushwalkam, S., Cogswell, M., Crandall, D., Batra, D.: Why M heads are better than one: Training a diverse ensemble of deep networks. arXiv preprint arXiv:1511.06314 (2015)  17. Liu, X., Xia, T., Wang, J., Lin, Y.: Fully convolutional attention localization net- works: Eﬃcient attention localization for fine-grained recognition. arXiv preprint arXiv:1603.06765 (2016)  18. Liu, Z., Luo, P., Qiu, S., Wang, X., Tang, X.: DeepFashion: Powering robust clothes recognition and retrieval with rich annotations. In: Computer Vision and Pattern Recognition(2016)  19. Mnih, V., Heess, N., Graves, A., et al.: Recurrent models of visual attention. In:  Advances in Neural Information Processing Systems(2014)  20. Movshovitz-Attias, Y., Toshev, A., Leung, T.K., Ioﬀe, S., Singh, S.: No fuss dis- tance metric learning using proxies. In: International Conference on Computer Vision(2017)  21. Opitz, M., Possegger, H., Bischof, H.: Eﬃcient model averaging for deep neural  networks. In: Asian Conference on Computer Vision(2016)  22. Opitz, M., Waltner, G., Possegger, H., Bischof, H.: BIER-boosting independent embeddings robustly. In: International Conference on Computer Vision(2017)   16  W. Kim, B. Goyal, K. Chawla, J. Lee, K. Kwon  23. Opitz, M., Waltner, G., Possegger, H., Bischof, H.: Deep metric learn- ing with BIER: Boosting independent embeddings robustly. arXiv preprint arXiv:1801.04815 (2018)  24. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recog- nition challenge. International Journal of Computer Vision115(3), 211-252 (2015) 25. Schroﬀ, F., Kalenichenko, D., Philbin, J.: Facenet: A unified embedding for face recognition and clustering. In: Computer Vision and Pattern Recognition(2015) 26. Sermanet, P., Frome, A., Real, E.: Attention for fine-grained categorization. In:  International Conference on Learning Representationsworkshop (2015)  27. Sohn, K.: Improved deep metric learning with multi-class n-pair loss objective. In:  Advances in Neural Information Processing Systems(2016)  28. Song, H.O., Jegelka, S., Rathod, V., Murphy, K.: Deep metric learning via facility  location. In: Computer Vision and Pattern Recognition(2017)  29. Song, H.O., Xiang, Y., Jegelka, S., Savarese, S.: Deep metric learning via lifted structured feature embedding. In: Computer Vision and Pattern Recognition(2016) 30. Srivastava, N., Hinton, G., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.: Dropout: A simple way to prevent neural networks from overfitting. Journal of Machine Learning Research 15(1), 1929-1958 (2014)  31. Sutskever, I., Vinyals, O., Le, Q.V.: Sequence to sequence learning with neural  networks. In: Advances in Neural Information Processing Systems(2014)  32. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A.: Going deeper with convolutions. In: Computer Vision and Pattern Recognition(2015)  33. Ustinova, E., Lempitsky, V.: Learning deep embeddings with histogram loss. In:  Advances in Neural Information Processing Systems(2016)  34. Veit, A., Wilber, M.J., Belongie, S.: Residual networks behave like ensembles of relatively shallow networks. In: Advances in Neural Information Processing Sys- tems(2016)  35. Wah, C., Branson, S., Welinder, P., Perona, P., Belongie, S.: The Caltech-UCSD Birds-200-2011 Dataset. Tech. Rep. CNS-TR-2011-001, California Institute of Technology (2011)  36. Wang, J., Zhou, F., Wen, S., Liu, X., Lin, Y.: Deep metric learning with angular  loss. In: International Conference on Computer Vision(2017)  37. Weinberger, K.Q., Saul, L.K.: Distance metric learning for large margin near- est neighbor classification. Journal of Machine Learning Research 10(2), 207-244 (2009)  38. Wu, C.Y., Manmatha, R., Smola, A.J., Kr¨ahenb¨uhl, P.: Sampling matters in deep embedding learning. In: International Conference on Computer Vision(2017) 39. Yuan, Y., Yang, K., Zhang, C.: Hard-aware deeply cascaded embedding. In: Inter-  national Conference on Computer Vision(2017)  40. Zhao, B., Wu, X., Feng, J., Peng, Q., Yan, S.: Diversified visual attention networks  for fine-grained object classification. Multimedia 19(6), 1245-1256 (2017)"}