{"1": "1. Alexe, B., Deselaers, T., Ferrari, V.: Measuring the objectness of image windows.  TPAMI 34(11), 2189-2202 (2012)  2. Bearman, A., Russakovsky, O., Ferrari, V., Fei-Fei, L.: Whats the point: Semantic  segmentation with point supervision. In: ECCV. pp. 549-565 (2016)  3. Bertasius, G., Shi, J., Torresani, L.: Deepedge: A multi-scale bifurcated deep net-  work for top-down contour detection. In: CVPR. pp. 4380-4389 (2015)  4. Bilen, H., Pedersoli, M., Tuytelaars, T.: Weakly supervised object detection with  convex clustering. In: CVPR. pp. 1081-1089 (2015)  5. Bilen, H., Vedaldi, A.: Weakly supervised deep detection networks. In: CVPR. pp.  2846-2854 (2016)  6. Carreira, J., Sminchisescu, C.: CPMC: Automatic object segmentation using con-  strained parametric min-cuts. TPAMI (7), 1312-1328 (2011)  7. Chavali, N., Agrawal, H., Mahendru, A., Batra, D.: Object-proposal evaluation  protocol is ‘gameable’. In: CVPR. pp. 835-844 (2016)  8. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. In: ICLR (2015)  9. Cinbis, R.G., Verbeek, J., Schmid, C.: Weakly supervised object localization with  multi-fold multiple instance learning. TPAMI 39(1), 189-203 (2017)  10. Dabkowski, P., Gal, Y.: Real time image saliency for black box classifiers. In: NIPS.  pp. 6970-6979 (2017)  11. Deselaers, T., Alexe, B., Ferrari, V.: Weakly supervised localization and learning  with generic knowledge. IJCV 100(3), 275-293 (2012)  12. Diba, A., Sharma, V., Pazandeh, A., Pirsiavash, H., Van Gool, L.: Weakly super-  vised cascaded convolutional networks. In: CVPR. pp. 914-922 (2017)  13. Doll´ar, P., Zitnick, C.L.: Fast edge detection using structured forests. TPAMI  37(8), 1558-1570 (2015)  14. Everingham, M., Eslami, S.A., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual object classes challenge: A retrospective. IJCV 111(1), 98- 136 (2015)  15. Girshick, R.: Fast r-cnn. In: ICCV. pp. 1440-1448 (2015) 16. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Region-based convolutional net- works for accurate object detection and segmentation. TPAMI 38(1), 142-158 (2016)  17. Hosang, J., Benenson, R., Doll´ar, P., Schiele, B.: What makes for eﬀective detection  proposals? TPAMI 38(4), 814-830 (2016)  18. Huang, Z., Wang, X., Wang, J., Liu, W., Wang, J.: Weakly-supervised semantic segmentation network with deep seeded region growing. In: CVPR. pp. 7014-7023 (2018)  19. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM MM. pp. 675-678 (2014)  20. Jie, Z., Wei, Y., Jin, X., Feng, J., Liu, W.: Deep self-taught learning for weakly  supervised object localization. In: CVPR. pp. 1377-1385 (2017)  21. Kantorov, V., Oquab, M., Cho, M., Laptev, I.: Contextlocnet: Context-aware deep network models for weakly supervised localization. In: ECCV. pp. 350-365 (2016) 22. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS. pp. 1097-1105 (2012)   Weakly Supervised Region Proposal Network and Object DetectionReferences  1. Alexe, B., Deselaers, T., Ferrari, V.: Measuring the objectness of image windows.  TPAMI 34(11), 2189-2202 (2012)  2. Bearman, A., Russakovsky, O., Ferrari, V., Fei-Fei, L.: Whats the point: Semantic  segmentation with point supervision. In: ECCV. pp. 549-565 (2016)  3. Bertasius, G., Shi, J., Torresani, L.: Deepedge: A multi-scale bifurcated deep net-  work for top-down contour detection. In: CVPR. pp. 4380-4389 (2015)  4. Bilen, H., Pedersoli, M., Tuytelaars, T.: Weakly supervised object detection with  convex clustering. In: CVPR. pp. 1081-1089 (2015)  5. Bilen, H., Vedaldi, A.: Weakly supervised deep detection networks. In: CVPR. pp.  2846-2854 (2016)  6. Carreira, J., Sminchisescu, C.: CPMC: Automatic object segmentation using con-  strained parametric min-cuts. TPAMI (7), 1312-1328 (2011)  7. Chavali, N., Agrawal, H., Mahendru, A., Batra, D.: Object-proposal evaluation  protocol is ‘gameable’. In: CVPR. pp. 835-844 (2016)  8. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. In: ICLR (2015)  9. Cinbis, R.G., Verbeek, J., Schmid, C.: Weakly supervised object localization with  multi-fold multiple instance learning. TPAMI 39(1), 189-203 (2017)  10. Dabkowski, P., Gal, Y.: Real time image saliency for black box classifiers. In: NIPS.  pp. 6970-6979 (2017)  11. Deselaers, T., Alexe, B., Ferrari, V.: Weakly supervised localization and learning  with generic knowledge. IJCV 100(3), 275-293 (2012)  12. Diba, A., Sharma, V., Pazandeh, A., Pirsiavash, H., Van Gool, L.: Weakly super-  vised cascaded convolutional networks. In: CVPR. pp. 914-922 (2017)  13. Doll´ar, P., Zitnick, C.L.: Fast edge detection using structured forests. TPAMI  37(8), 1558-1570 (2015)  14. Everingham, M., Eslami, S.A., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual object classes challenge: A retrospective. IJCV 111(1), 98- 136 (2015)  15. Girshick, R.: Fast r-cnn. In: ICCV. pp. 1440-1448 (2015) 16. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Region-based convolutional net- works for accurate object detection and segmentation. TPAMI 38(1), 142-158 (2016)  17. Hosang, J., Benenson, R., Doll´ar, P., Schiele, B.: What makes for eﬀective detection  proposals? TPAMI 38(4), 814-830 (2016)  18. Huang, Z., Wang, X., Wang, J., Liu, W., Wang, J.: Weakly-supervised semantic segmentation network with deep seeded region growing. In: CVPR. pp. 7014-7023 (2018)  19. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM MM. pp. 675-678 (2014)  20. Jie, Z., Wei, Y., Jin, X., Feng, J., Liu, W.: Deep self-taught learning for weakly  supervised object localization. In: CVPR. pp. 1377-1385 (2017)  21. Kantorov, V., Oquab, M., Cho, M., Laptev, I.: Contextlocnet: Context-aware deep network models for weakly supervised localization. In: ECCV. pp. 350-365 (2016) 22. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS. pp. 1097-1105 (2012)   16  P. Tang et al.  23. Kuo, W., Hariharan, B., Malik, J.: Deepbox: Learning objectness with convolu-  tional networks. In: ICCV. pp. 2479-2487 (2015)  24. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. Proceedings of the IEEE 86(11), 2278-2324 (1998)  25. Li, D., Huang, J.B., Li, Y., Wang, S., Yang, M.H.: Weakly supervised object lo-  calization with progressive domain adaptation. In: CVPR. pp. 3512-3520 (2016)  26. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: ECCV. pp. 740-755 (2014)  27. Oquab, M., Bottou, L., Laptev, I., Sivic, J.: Is object localization for free?-weakly- supervised learning with convolutional neural networks. In: CVPR. pp. 685-694 (2015)  28. Pinheiro, P.O., Lin, T.Y., Collobert, R., Doll´ar, P.: Learning to refine object seg-  ments. In: ECCV. pp. 75-91 (2016)  29. Pont-Tuset, J., Arbelaez, P., Barron, J.T., Marques, F., Malik, J.: Multiscale combinatorial grouping for image segmentation and object proposal generation. TPAMI 39(1), 128-140 (2017)  30. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de-  tection with region proposal networks. TPAMI 39(6), 1137-1149 (2017)  31. Ren, W., Huang, K., Tao, D., Tan, T.: Weakly supervised large scale object local- ization with multiple instance learning and bag splitting. TPAMI 38(2), 405-416 (2016)  32. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recog- nition challenge. IJCV 115(3), 211-252 (2015)  33. Saleh, F., Aliakbarian, M.S., Salzmann, M., Petersson, L., Alvarez, J.M., Gould, S.: Incorporating network built-in priors in weakly-supervised semantic segmentation. TPAMI 40(6), 1382-1396 (2018)  34. Shi, M., Caesar, H., Ferrari, V.: Weakly supervised object localization using things  and stuﬀ transfer. In: ICCV. pp. 3381-3390 (2017)  35. Simonyan, K., Vedaldi, A., Zisserman, A.: Deep inside convolutional net- works: Visualising image classification models and saliency maps. arXiv preprint arXiv:1312.6034 (2013)  36. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. In: ICLR (2015)  37. Tang, P., Wang, C., Wang, X., Liu, W., Zeng, W., Wang, J.: Object detection in videos by short and long range object linking. arXiv preprint arXiv:1801.09823 (2018)  38. Tang, P., Wang, X., Bai, X., Liu, W.: Multiple instance detection network with  online instance classifier refinement. In: CVPR. pp. 2843-2851 (2017)  39. Tang, P., Wang, X., Huang, Z., Bai, X., Liu, W.: Deep patch learning for weakly supervised object classification and discovery. Pattern Recognition 71, 446-459 (2017)  40. Uijlings, J.R., van de Sande, K.E., Gevers, T., Smeulders, A.W.: Selective search  for object recognition. IJCV 104(2), 154-171 (2013)  41. Wang, C., Ren, W., Huang, K., Tan, T.: Weakly supervised object localization  with latent category learning. In: ECCV. pp. 431-445 (2014)  42. Wang, X., Zhu, Z., Yao, C., Bai, X.: Relaxed multiple-instance svm with application  to object discovery. In: ICCV. pp. 1224-1232 (2015)  43. Zhang, Z., Qiao, S., Xie, C., Shen, W., Wang, B., Yuille, A.L.: Single-shot object  detection with enriched semantics. In: CVPR. pp. 5813-5821 (2018)   Weakly Supervised Region Proposal Network and Object Detection44. Zhou, B., Khosla, A., Lapedriza, A., Oliva, A., Torralba, A.: Learning deep features  for discriminative localization. In: CVPR. pp. 2921-2929 (2016)  45. Zhu, Y., Zhou, Y., Ye, Q., Qiu, Q., Jiao, J.: Soft proposal networks for weakly  supervised object localization. In: ICCV. pp. 1814-1850 (2017)  46. Zitnick, C.L., Doll´ar, P.: Edge boxes: Locating object proposals from edges. In:  ECCV. pp. 391-405 (2014)"}