{"1": "1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., et al.: Tensorﬂow: Large-scale machine learning on heterogeneous distributed systems. arXiv preprint arXiv:1603.04467 (2016)  2. Barron, J.T.: A more general robust loss function. arXiv preprint arXiv:1701.03077  (2017)  3. Besse, F., Rother, C., Fitzgibbon, A., Kautz, J.: Pmbp: Patchmatch belief propaga- tion for correspondence field estimation. International Journal of Computer Vision 110(1), 2-13 (2014)  4. Bleyer, M., Rhemann, C., Rother, C.: Patchmatch stereo-stereo matching with  slanted support windows. In: Bmvc. vol. 11, pp. 1-11 (2011)  5. Brachmann, E., Krull, A., Nowozin, S., Shotton, J., Michel, F., Gumhold, S., Rother, C.: Dsac-diﬀerentiable ransac for camera localization. In: IEEE Confer- ence on Computer Vision and Pattern Recognition (CVPR). vol. 3 (2017)  6. Chapelle, O., Wu, M.: Gradient descent optimization of smoothed information  retrieval metrics. Information retrieval 13(3), 216-235 (2010)  7. Chen, Q., Koltun, V.: Photographic image synthesis with cascaded refinement networks. In: The IEEE International Conference on Computer Vision (ICCV). vol. 1 (2017)  8. Chen, Q., Xu, J., Koltun, V.: Fast image processing with fully-convolutional net- works. In: IEEE International Conference on Computer Vision. vol. 9 (2017) 9. Chen, Z., Sun, X., Wang, L., Yu, Y., Huang, C.: A deep visual correspondence em- bedding model for stereo matching costs. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 972-980 (2015)  10. Delon, J., Roug´e, B.: Small baseline stereovision. J. Math. Imaging Vis. (2007) 11. Dou, M., Davidson, P., Fanello, S.R., Khamis, S., Kowdle, A., Rhemann, C., Tankovich, V., Izadi, S.: Motion2fusion: Real-time volumetric performance cap- ture. SIGGRAPH Asia (2017)  12. Dou, M., Khamis, S., Degtyarev, Y., Davidson, P., Fanello, S.R., Kowdle, A., Es- colano, S.O., Rhemann, C., Kim, D., Taylor, J., Kohli, P., Tankovich, V., Izadi, S.: Fusion4d: Real-time performance capture of challenging scenes. SIGGRAPH (2016)  13. Fanello, S.R., Rhemann, C., Tankovich, V., Kowdle, A., Orts Escolano, S., Kim, D., Izadi, S.: Hyperdepth: Learning depth from structured light without matching. In: CVPR (2016)  14. Fanello, S.R., Valentin, J., Kowdle, A., Rhemann, C., Tankovich, V., Ciliberto, C., Davidson, P., Izadi, S.: Low compute and fully parallel computer vision with hashmatch (2017)  15. Fanello, S.R., Valentin, J., Rhemann, C., Kowdle, A., Tankovich, V., Davidson, P., Izadi, S.: Ultrastereo: Eﬃcient learning-based matching for active stereo systems. In: Computer Vision and Pattern Recognition (CVPR), 2017 IEEE Conference on. pp. 6535-6544. IEEE (2017)  16. Fanello, S., Gori, I., Metta, G., Odone, F.: One-shot learning for real-time action  recognition. In: IbPRIA (2013)  17. Felzenszwalb, P.F., Huttenlocher, D.P.: Eﬃcient belief propagation for early vision.  International journal of computer vision 70(1), 41-54 (2006)  18. Flynn, J., Neulander, I., Philbin, J., Snavely, N.: Deepstereo: Learning to predict new views from the world’s imagery. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5515-5524 (2016)   StereoNetReferences  1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., et al.: Tensorﬂow: Large-scale machine learning on heterogeneous distributed systems. arXiv preprint arXiv:1603.04467 (2016)  2. Barron, J.T.: A more general robust loss function. arXiv preprint arXiv:1701.03077  (2017)  3. Besse, F., Rother, C., Fitzgibbon, A., Kautz, J.: Pmbp: Patchmatch belief propaga- tion for correspondence field estimation. International Journal of Computer Vision 110(1), 2-13 (2014)  4. Bleyer, M., Rhemann, C., Rother, C.: Patchmatch stereo-stereo matching with  slanted support windows. In: Bmvc. vol. 11, pp. 1-11 (2011)  5. Brachmann, E., Krull, A., Nowozin, S., Shotton, J., Michel, F., Gumhold, S., Rother, C.: Dsac-diﬀerentiable ransac for camera localization. In: IEEE Confer- ence on Computer Vision and Pattern Recognition (CVPR). vol. 3 (2017)  6. Chapelle, O., Wu, M.: Gradient descent optimization of smoothed information  retrieval metrics. Information retrieval 13(3), 216-235 (2010)  7. Chen, Q., Koltun, V.: Photographic image synthesis with cascaded refinement networks. In: The IEEE International Conference on Computer Vision (ICCV). vol. 1 (2017)  8. Chen, Q., Xu, J., Koltun, V.: Fast image processing with fully-convolutional net- works. In: IEEE International Conference on Computer Vision. vol. 9 (2017) 9. Chen, Z., Sun, X., Wang, L., Yu, Y., Huang, C.: A deep visual correspondence em- bedding model for stereo matching costs. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 972-980 (2015)  10. Delon, J., Roug´e, B.: Small baseline stereovision. J. Math. Imaging Vis. (2007) 11. Dou, M., Davidson, P., Fanello, S.R., Khamis, S., Kowdle, A., Rhemann, C., Tankovich, V., Izadi, S.: Motion2fusion: Real-time volumetric performance cap- ture. SIGGRAPH Asia (2017)  12. Dou, M., Khamis, S., Degtyarev, Y., Davidson, P., Fanello, S.R., Kowdle, A., Es- colano, S.O., Rhemann, C., Kim, D., Taylor, J., Kohli, P., Tankovich, V., Izadi, S.: Fusion4d: Real-time performance capture of challenging scenes. SIGGRAPH (2016)  13. Fanello, S.R., Rhemann, C., Tankovich, V., Kowdle, A., Orts Escolano, S., Kim, D., Izadi, S.: Hyperdepth: Learning depth from structured light without matching. In: CVPR (2016)  14. Fanello, S.R., Valentin, J., Kowdle, A., Rhemann, C., Tankovich, V., Ciliberto, C., Davidson, P., Izadi, S.: Low compute and fully parallel computer vision with hashmatch (2017)  15. Fanello, S.R., Valentin, J., Rhemann, C., Kowdle, A., Tankovich, V., Davidson, P., Izadi, S.: Ultrastereo: Eﬃcient learning-based matching for active stereo systems. In: Computer Vision and Pattern Recognition (CVPR), 2017 IEEE Conference on. pp. 6535-6544. IEEE (2017)  16. Fanello, S., Gori, I., Metta, G., Odone, F.: One-shot learning for real-time action  recognition. In: IbPRIA (2013)  17. Felzenszwalb, P.F., Huttenlocher, D.P.: Eﬃcient belief propagation for early vision.  International journal of computer vision 70(1), 41-54 (2006)  18. Flynn, J., Neulander, I., Philbin, J., Snavely, N.: Deepstereo: Learning to predict new views from the world’s imagery. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5515-5524 (2016)   16  Khamis et al.  19. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the kitti vision benchmark suite. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on. pp. 3354-3361. IEEE (2012)  20. Gharbi, M., Chen, J., Barron, J.T., Hasinoﬀ, S.W., Durand, F.: Deep bilateral learning for real-time image enhancement. ACM Transactions on Graphics (TOG) 36(4), 118 (2017)  21. Gidaris, S., Komodakis, N.: Detect, replace, refine: Deep structured prediction for pixel wise labeling. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5248-5257 (2017)  22. Hamzah, R.A., Ibrahim, H.: Literature survey on stereo vision disparity map al-  gorithms. Journal of Sensors 2016 (2016)  23. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016)  24. Hinton, G., Srivastava, N., Swersky, K.: Neural networks for machine learning-  lecture 6a-overview of mini-batch gradient descent (2012)  25. Hosni, A., Rhemann, C., Bleyer, M., Rother, C., Gelautz, M.: Fast cost-volume fil- tering for visual correspondence and beyond. IEEE Transactions on Pattern Anal- ysis and Machine Intelligence 35(2), 504-511 (2013)  26. Ilg, E., Mayer, N., Saikia, T., Keuper, M., Dosovitskiy, A., Brox, T.: Flownet 2.0: Evolution of optical ﬂow estimation with deep networks. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). vol. 2 (2017)  27. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International conference on machine learning. pp. 448-456 (2015)  28. Izadi, S., Kim, D., Hilliges, O., Molyneaux, D., Newcombe, R., Kohli, P., Shotton, J., Hodges, S., Freeman, D., Davison, A., Fitzgibbon, A.: Kinectfusion: Real-time 3d reconstruction and interaction using a moving depth camera. In: UIST (2011) 29. Kendall, A., Martirosyan, H., Dasgupta, S., Henry, P., Kennedy, R., Bachrach, A., Bry, A.: End-to-end learning of geometry and context for deep stereo regression. CoRR, vol. abs/1703.04309 (2017)  30. Klaus, A., Sormann, M., Karner, K.: Segment-based stereo matching using belief propagation and a self-adapting dissimilarity measure. In: Pattern Recognition, 2006. ICPR 2006. 18th International Conference on. vol. 3, pp. 15-18. IEEE (2006) 31. Kolmogorov, V., Zabih, R.: Computing visual correspondence with occlusions using graph cuts. In: Computer Vision, 2001. ICCV 2001. Proceedings. Eighth IEEE International Conference on. vol. 2, pp. 508-515. IEEE (2001)  32. Kopf, J., Cohen, M.F., Lischinski, D., Uyttendaele, M.: Joint bilateral upsampling.  ACM Transactions on Graphics (ToG) 26(3), 96 (2007)  33. Kr¨ahenb¨uhl, P., Koltun, V.: Eﬃcient inference in fully connected crfs with gaussian  edge potentials. In: NIPS (2011)  34. Lillicrap, T.P., Hunt, J.J., Pritzel, A., Heess, N., Erez, T., Tassa, Y., Silver, D., Wierstra, D.: Continuous control with deep reinforcement learning. arXiv preprint arXiv:1509.02971 (2015)  35. Luo, W., Schwing, A.G., Urtasun, R.: Eﬃcient deep learning for stereo matching. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recog- nition. pp. 5695-5703 (2016)  36. Maas, A.L., Hannun, A.Y., Ng, A.Y.: Rectifier nonlinearities improve neural net-  work acoustic models. In: Proc. icml. vol. 30, p. 3 (2013)   StereoNet37. Mayer, N., Ilg, E., Hausser, P., Fischer, P., Cremers, D., Dosovitskiy, A., Brox, T.: A large dataset to train convolutional networks for disparity, optical ﬂow, and scene ﬂow estimation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 4040-4048 (2016)  38. Menze, M., Geiger, A.: Object scene ﬂow for autonomous vehicles. In: Conference  on Computer Vision and Pattern Recognition (CVPR) (2015)  39. Nehab, D., Rusinkiewicz, S., Davis, J.: Improved sub-pixel stereo correspondences through symmetric refinement. In: International Conference on Computer Vision (ICCV) (2005)  40. Odena, A., Dumoulin, V., Olah, C.: Deconvolution and checkerboard artifacts. Dis- till (2016). https://doi.org/10.23915/distill.00003, http://distill.pub/2016/deconv- checkerboard  41. Orts-Escolano, S., Rhemann, C., Fanello, S., Chang, W., Kowdle, A., Degtyarev, Y., Kim, D., Davidson, P.L., Khamis, S., Dou, M., Tankovich, V., Loop, C., Cai, Q., Chou, P.A., Mennicken, S., Valentin, J., Pradeep, V., Wang, S., Kang, S.B., Kohli, P., Lutchyn, Y., Keskin, C., Izadi, S.: Holoportation: Virtual 3d teleportation in real-time. In: UIST (2016)  42. Pang, J., Sun, W., Ren, J., Yang, C., Yan, Q.: Cascade residual learning: A two- stage convolutional neural network for stereo matching. In: International Conf. on Computer Vision-Workshop on Geometry Meets Deep Learning (ICCVW 2017). vol. 3 (2017)  43. Papandreou, G., Kokkinos, I., Savalle, P.A.: Modeling local and global deforma- tions in deep learning: Epitomic convolution, multiple instance learning, and sliding window detection. In: Computer Vision and Pattern Recognition (CVPR), 2015 IEEE Conference on. pp. 390-399. IEEE (2015)  44. Park, E., Yang, J., Yumer, E., Ceylan, D., Berg, A.C.: Transformation-grounded  image generation network for novel 3d view synthesis. CoRR (2017)  45. Pinggera, P., Pfeiﬀer, D., Franke, U., Mester, R.: Know your limits: Accuracy of long range stereoscopic object measurements in practice. In: European Conference on Computer Vision. pp. 96-111. Springer (2014)  46. Pradeep, V., Rhemann, C., Izadi, S., Zach, C., Bleyer, M., Bathiche, S.: Mono- fusion: Real-time 3d reconstruction of small scenes with a single web camera. In: ISMAR (2013)  47. Ranftl, R., Gehrig, S., Pock, T., Bischof, H.: Pushing the limits of stereo using variational stereo estimation. In: 2012 IEEE Intelligent Vehicles Symposium (2012) 48. Sanger, T.D.: Stereo disparity computation using gabor filters. In: Biological Cy-  bernetics (1988)  49. Scharstein, D., Szeliski, R.: A taxonomy and evaluation of dense two-frame stereo correspondence algorithms. International journal of computer vision 47(1-3), 7-42 (2002)  50. Schulman, J., Heess, N., Weber, T., Abbeel, P.: Gradient estimation using stochas- tic computation graphs. In: Advances in Neural Information Processing Systems. pp. 3528-3536 (2015)  51. Seki, A., Pollefeys, M.: Sgm-nets: Semi-global matching with neural networks. In:  CVPR (2017)  52. Shaked, A., Wolf, L.: Improved stereo matching with constant highway networks  and reﬂective confidence learning. CoRR, vol. abs/1701.00165 (2017)  53. Szeliski, R.: Computer Vision: Algorithms and Applications. Springer-Verlag New  York, Inc., New York, NY, USA, 1st edn. (2010)   18  Khamis et al.  54. Tankovich, V., Schoenberg, M., Fanello, S.R., Kowdle, A., Rhemann, C., Dzitsiuk, M., Schmidt, M., Valentin, J., Izadi, S.: Sos: Stereo matching in o(1) with slanted support windows. IROS (2018)  55. Taylor, J., Tankovich, V., Tang, D., Keskin, C., Kim, D., Davidson, P., Kowdle, A., Izadi, S.: Articulated distance fields for ultra-fast tracking of hands interacting. Siggraph Asia (2017)  56. Wang, S., Fanello, S.R., Rhemann, C., Izadi, S., Kohli, P.: The global patch collider.  CVPR (2016)  57. Williams, R.J.: Simple statistical gradient-following algorithms for connectionist reinforcement learning. In: Reinforcement Learning, pp. 5-32. Springer (1992) 58. Xu, K., Ba, J., Kiros, R., Cho, K., Courville, A., Salakhudinov, R., Zemel, R., Bengio, Y.: Show, attend and tell: Neural image caption generation with visual attention. In: International Conference on Machine Learning. pp. 2048-2057 (2015) 59. Yang, Q., Yang, R., Davis, J., Nister, D.: Spatial-depth super resolution for range images. In: 2007 IEEE Conference on Computer Vision and Pattern Recognition (2007)  60. Zagoruyko, S., Komodakis, N.: Learning to compare image patches via convolu- tional neural networks. In: Computer Vision and Pattern Recognition (CVPR), 2015 IEEE Conference on. pp. 4353-4361. IEEE (2015)  61. Zbontar, J., LeCun, Y.: Computing the stereo matching cost with a convolutional neural network. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 1592-1599 (2015)  62. Zbontar, J., LeCun, Y.: Stereo matching by training a convolutional neural network to compare image patches. Journal of Machine Learning Research 17(1-32), 2 (2016)  63. Zhang, Y., Khamis, S., Rhemann, C., Valentin, J., Kowdle, A., Tankovich, V., Schoenberg, M., Izadi, S., Funkhouser, T., Fanello, S.: Activestereonet: End-to- end self-supervised learning for active stereo systems. In: ECCV (2018)"}