{"1": "1. Wanner, S., Goldluecke, B.: Variational light field analysis for disparity estimation and super- resolution. IEEE Transactions on Pattern Analysis and Machine Intelligence 36(3) (2014) 606-619  2. Jeon, H.G., Park, J., Choe, G., Park, J., Bok, Y., Tai, Y.W., So Kweon, I.: Accurate depth map estimation from a lenslet light field camera. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 1547-1555  3. Wang, T.C., Efros, A.A., Ramamoorthi, R.: Occlusion-aware depth estimation using light- field cameras. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 3487-3495  4. Chen, J., Hou, J., Ni, Y., Chau, L.P.: Accurate light field depth estimation with superpixel reg- ularization over partially occluded regions. IEEE Transactions on Image Processing 27(10) (Oct 2018) 4889-4900  5. Fiss, J., Curless, B., Szeliski, R.: Refocusing plenoptic images using depth-adaptive splat- In: Proceedings of IEEE International Conference on Computational Photography.  ting. (2014) 1-9  6. Levoy, M., Hanrahan, P.: Light field rendering. In: Proceedings of the 23rd annual conference  on Computer graphics and interactive techniques, ACM (1996) 31-42  7. Jones, A., McDowall, I., Yamada, H., Bolas, M., Debevec, P.: Rendering for an interactive  360 light field display. ACM Transactions on Graphics 26(3) (2007) 40  8. Ihrke, I., Restrepo, J., Mignard-Debise, L.: Principles of light field imaging: Brieﬂy revisiting  25 years of research. IEEE Signal Processing Magazine 33(5) (2016) 59-69  9. Wu, G., Masia, B., Jarabo, A., Zhang, Y., Wang, L., Dai, Q., Chai, T., Liu, Y.: Light field image processing: An overview. IEEE Journal of Selected Topics in Signal Processing 11(7) (2017) 926-954  10. Wilburn, B., Joshi, N., Vaish, V., Talvala, E.V., Antunez, E., Barth, A., Adams, A., Horowitz, M., Levoy, M.: High performance imaging using large camera arrays. ACM Transactions on Graphics 24(3) (2005) 765-776  11. Lytro Illum. https://www.lytro.com/ 12. Raytrix. https://www.raytrix.de/ 13. Kalantari, N.K., Wang, T.C., Ramamoorthi, R.: Learning-based view synthesis for light field  cameras. ACM Transactions on Graphics 35(6) (2016) 193  14. Wu, G., Zhao, M., Wang, L., Dai, Q., Chai, T., Liu, Y.: Light field reconstruction using deep convolutional network on epi. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 6319-6327  15. Dong, C., Loy, C.C., He, K., Tang, X.: Learning a deep convolutional network for image super-resolution. In: Proceedings of the European Conference on Computer Vision. (2014) 184-199  16. Kim, J., Kwon Lee, J., Mu Lee, K.: Accurate image super-resolution using very deep convo- lutional networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 1646-1654  17. Lai, W.S., Huang, J.B., Ahuja, N., Yang, M.H.: Deep laplacian pyramid networks for fast and accurate super-resolution. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Number 3 (2017) 5835-5843  18. Tai, Y., Yang, J., Liu, X.: Image super-resolution via deep recursive residual network. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 2790-2798  19. Yoon, Y., Jeon, H.G., Yoo, D., Lee, J.Y., So Kweon, I.: Learning a deep convolutional In: Proceedings of the IEEE International  network for light-field image super-resolution. Conference on Computer Vision Workshops. (2015) 24-32   Fast Light Field ReconstructionReferences  1. Wanner, S., Goldluecke, B.: Variational light field analysis for disparity estimation and super- resolution. IEEE Transactions on Pattern Analysis and Machine Intelligence 36(3) (2014) 606-619  2. Jeon, H.G., Park, J., Choe, G., Park, J., Bok, Y., Tai, Y.W., So Kweon, I.: Accurate depth map estimation from a lenslet light field camera. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 1547-1555  3. Wang, T.C., Efros, A.A., Ramamoorthi, R.: Occlusion-aware depth estimation using light- field cameras. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 3487-3495  4. Chen, J., Hou, J., Ni, Y., Chau, L.P.: Accurate light field depth estimation with superpixel reg- ularization over partially occluded regions. IEEE Transactions on Image Processing 27(10) (Oct 2018) 4889-4900  5. Fiss, J., Curless, B., Szeliski, R.: Refocusing plenoptic images using depth-adaptive splat- In: Proceedings of IEEE International Conference on Computational Photography.  ting. (2014) 1-9  6. Levoy, M., Hanrahan, P.: Light field rendering. In: Proceedings of the 23rd annual conference  on Computer graphics and interactive techniques, ACM (1996) 31-42  7. Jones, A., McDowall, I., Yamada, H., Bolas, M., Debevec, P.: Rendering for an interactive  360 light field display. ACM Transactions on Graphics 26(3) (2007) 40  8. Ihrke, I., Restrepo, J., Mignard-Debise, L.: Principles of light field imaging: Brieﬂy revisiting  25 years of research. IEEE Signal Processing Magazine 33(5) (2016) 59-69  9. Wu, G., Masia, B., Jarabo, A., Zhang, Y., Wang, L., Dai, Q., Chai, T., Liu, Y.: Light field image processing: An overview. IEEE Journal of Selected Topics in Signal Processing 11(7) (2017) 926-954  10. Wilburn, B., Joshi, N., Vaish, V., Talvala, E.V., Antunez, E., Barth, A., Adams, A., Horowitz, M., Levoy, M.: High performance imaging using large camera arrays. ACM Transactions on Graphics 24(3) (2005) 765-776  11. Lytro Illum. https://www.lytro.com/ 12. Raytrix. https://www.raytrix.de/ 13. Kalantari, N.K., Wang, T.C., Ramamoorthi, R.: Learning-based view synthesis for light field  cameras. ACM Transactions on Graphics 35(6) (2016) 193  14. Wu, G., Zhao, M., Wang, L., Dai, Q., Chai, T., Liu, Y.: Light field reconstruction using deep convolutional network on epi. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 6319-6327  15. Dong, C., Loy, C.C., He, K., Tang, X.: Learning a deep convolutional network for image super-resolution. In: Proceedings of the European Conference on Computer Vision. (2014) 184-199  16. Kim, J., Kwon Lee, J., Mu Lee, K.: Accurate image super-resolution using very deep convo- lutional networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 1646-1654  17. Lai, W.S., Huang, J.B., Ahuja, N., Yang, M.H.: Deep laplacian pyramid networks for fast and accurate super-resolution. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Number 3 (2017) 5835-5843  18. Tai, Y., Yang, J., Liu, X.: Image super-resolution via deep recursive residual network. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 2790-2798  19. Yoon, Y., Jeon, H.G., Yoo, D., Lee, J.Y., So Kweon, I.: Learning a deep convolutional In: Proceedings of the IEEE International  network for light-field image super-resolution. Conference on Computer Vision Workshops. (2015) 24-32   16  H. W. F. Yeung, J. Hou, J. Chen, Y. Y. Chung and X. Chen  20. Yoon, Y., Jeon, H.G., Yoo, D., Lee, J.Y., Kweon, I.S.: Light-field image super-resolution using convolutional neural network. IEEE Signal Processing Letters 24(6) (2017) 848-852 21. Ng, R., Levoy, M., Br´edif, M., Duval, G., Horowitz, M., Hanrahan, P.: Light field photog- raphy with a hand-held plenoptic camera. Computer Science Technical Report CSTR 2(11) (2005) 1-11  22. Rigamonti, R., Sironi, A., Lepetit, V., Fua, P.: Learning separable filters. In: Proceedings of  the IEEE International Conference on Computer Vision. (2013) 2754-2761  23. Yan, L.Q., Mehta, S.U., Ramamoorthi, R., Durand, F.: Fast 4d sheared filtering for interactive  rendering of distribution effects. ACM Transactions on Graphics 35(1) (2015) 7  24. Niklaus, S., Mai, L., Liu, F.: Video frame interpolation via adaptive separable convolution. In: Proceedings of the IEEE International Conference on Computer Vision. (2017) 261-270 25. Wang, T.C., Zhu, J.Y., Hiroaki, E., Chandraker, M., Efros, A.A., Ramamoorthi, R.: A 4d In: Proceedings of the  light-field dataset and cnn architectures for material recognition. European Conference on Computer Vision. (2016) 121-138  26. Vedaldi, A., Lenc, K.: Matconvnet - convolutional neural networks for matlab. In: Proceed-  ings of the ACM International Conference on Multimedia. (2015) 689-692  27. He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpassing human-level per- formance on imagenet classification. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 1026-1034  28. Raj, A.S., Lowney, M., Shah, R., Wetzstein, G.: Stanford lytro light field archive. http:  //lightfields.stanford.edu/  29. Levoy, M., Ng, R., Adams, A., Footer, M., Horowitz, M.: Light field microscopy. ACM  Transactions on Graphics 25(3) (2006) 924-934  30. Wanner, S., Meister, S., Goldluecke, B.: Datasets and benchmarks for densely sampled 4d  light fields. In: VMV, Citeseer (2013) 225-226  31. Blender Online Community: Blender - a 3D modelling and rendering package. Blender  Foundation, Blender Institute, Amsterdam  32. Rerabek, M., Ebrahimi, T.: New light field image dataset. In: Proceedings of the 8th Inter- national Conference on Quality of Multimedia Experience. Number EPFL-CONF-218363 (2016)  33. Hou, J., Chen, J., Chau, L.P.: Light field image compression based on bi-level view com- pensation with rate-distortion optimization. IEEE Transactions on Circuits and Systems for Video Technology (2018) 1-1  34. Chen, J., Hou, J., Chau, L.P.: Light field compression with disparity-guided sparse coding IEEE Transactions on Image Processing 27(1) (Jan 2018)  based on structural key views. 314-324"}