{"1": "1. Donahue, J., Anne Hendricks, L., Guadarrama, S., Rohrbach, M., Venugopalan, S., Saenko, K., Darrell, T.: Long-term recurrent convolutional networks for visual recognition and description. In: CVPR (2015)  2. Feichtenhofer, C., Pinz, A., Zisserman, A.: Detect to track and track to detect. In:  3. Gao, Y., Beijbom, O., Zhang, N., Darrell, T.: Compact bilinear pooling. In: CVPR  CVPR (2017)  (2016)  4. Girshick, R.: Fast r-cnn. In: ICCV (2015) 5. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accu-  rate object detection and semantic segmentation. In: CVPR (2014)  6. Gkioxari, G., Girshick, R., Malik, J.: Contextual action recognition with r* cnn.  In: ICCV (2015)  7. Gkioxari, G., Malik, J.: Finding action tubes. In: CVPR (2015) 8. Gu, C., Sun, C., Vijayanarasimhan, S., Pantofaru, C., Ross, D.A., Toderici, G., Li, Y., Ricco, S., Sukthankar, R., Schmid, C., et al.: Ava: A video dataset of spatio- temporally localized atomic visual actions. arXiv preprint arXiv:1705.08421 (2017) 9. He, J., Ibrahim, M.S., Deng, Z., Mori, G.: Generic tubelet proposals for action  10. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  11. Hou, R., Chen, C., Shah, M.: Tube convolutional neural network (t-cnn) for action  localization. In: WACV (2018)  In: CVPR (2016)  detection in videos. In: ICCV (2017)  action recognition. In: ICCV (2013)  12. Jhuang, H., Gall, J., Zuﬃ, S., Schmid, C., Black, M.J.: Towards understanding  13. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM MM (2014)  14. Kalogeiton, V., Weinzaepfel, P., Ferrari, V., Schmid, C.: Action tubelet detector  for spatio-temporal action localization. In: ICCV (2017)  15. Karpathy, A., Toderici, G., Shetty, S., Leung, T., Sukthankar, R., Fei-Fei, L.: Large- scale video classification with convolutional neural networks. In: CVPR (2014) 16. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS (2012)  17. Lan, T., Wang, Y., Mori, G.: Discriminative figure-centric models for joint action  localization and recognition. In: ICCV (2011)  18. Laptev, I., P´erez, P.: Retrieving actions in movies. In: ICCV (2007) 19. Li, Q., Qiu, Z., Yao, T., Mei, T., Rui, Y., Luo, J.: Action recognition by learning deep multi-granular spatio-temporal video representation. In: ICMR (2016) 20. Li, Q., Qiu, Z., Yao, T., Mei, T., Rui, Y., Luo, J.: Learning hierarchical video  representation for action recognition. IJMIR 6(1), 85-98 (2017)  21. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  Single shot multibox detector. In: ECCV (2016)  22. Peng, X., Schmid, C.: Multi-region two-stream r-cnn for action detection. In: ECCV  (2016)  23. Qiu, Z., Yao, T., Mei, T.: Deep quantization: Encoding convolutional activations  with deep generative model. In: CVPR (2017)  24. Qiu, Z., Yao, T., Mei, T.: Learning spatio-temporal representation with pseudo-3d  residual networks. In: ICCV (2017)   Recurrent Tubelet Proposal and Recognition Networks for Action DetectionReferences  1. Donahue, J., Anne Hendricks, L., Guadarrama, S., Rohrbach, M., Venugopalan, S., Saenko, K., Darrell, T.: Long-term recurrent convolutional networks for visual recognition and description. In: CVPR (2015)  2. Feichtenhofer, C., Pinz, A., Zisserman, A.: Detect to track and track to detect. In:  3. Gao, Y., Beijbom, O., Zhang, N., Darrell, T.: Compact bilinear pooling. In: CVPR  CVPR (2017)  (2016)  4. Girshick, R.: Fast r-cnn. In: ICCV (2015) 5. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accu-  rate object detection and semantic segmentation. In: CVPR (2014)  6. Gkioxari, G., Girshick, R., Malik, J.: Contextual action recognition with r* cnn.  In: ICCV (2015)  7. Gkioxari, G., Malik, J.: Finding action tubes. In: CVPR (2015) 8. Gu, C., Sun, C., Vijayanarasimhan, S., Pantofaru, C., Ross, D.A., Toderici, G., Li, Y., Ricco, S., Sukthankar, R., Schmid, C., et al.: Ava: A video dataset of spatio- temporally localized atomic visual actions. arXiv preprint arXiv:1705.08421 (2017) 9. He, J., Ibrahim, M.S., Deng, Z., Mori, G.: Generic tubelet proposals for action  10. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  11. Hou, R., Chen, C., Shah, M.: Tube convolutional neural network (t-cnn) for action  localization. In: WACV (2018)  In: CVPR (2016)  detection in videos. In: ICCV (2017)  action recognition. In: ICCV (2013)  12. Jhuang, H., Gall, J., Zuﬃ, S., Schmid, C., Black, M.J.: Towards understanding  13. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM MM (2014)  14. Kalogeiton, V., Weinzaepfel, P., Ferrari, V., Schmid, C.: Action tubelet detector  for spatio-temporal action localization. In: ICCV (2017)  15. Karpathy, A., Toderici, G., Shetty, S., Leung, T., Sukthankar, R., Fei-Fei, L.: Large- scale video classification with convolutional neural networks. In: CVPR (2014) 16. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS (2012)  17. Lan, T., Wang, Y., Mori, G.: Discriminative figure-centric models for joint action  localization and recognition. In: ICCV (2011)  18. Laptev, I., P´erez, P.: Retrieving actions in movies. In: ICCV (2007) 19. Li, Q., Qiu, Z., Yao, T., Mei, T., Rui, Y., Luo, J.: Action recognition by learning deep multi-granular spatio-temporal video representation. In: ICMR (2016) 20. Li, Q., Qiu, Z., Yao, T., Mei, T., Rui, Y., Luo, J.: Learning hierarchical video  representation for action recognition. IJMIR 6(1), 85-98 (2017)  21. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  Single shot multibox detector. In: ECCV (2016)  22. Peng, X., Schmid, C.: Multi-region two-stream r-cnn for action detection. In: ECCV  (2016)  23. Qiu, Z., Yao, T., Mei, T.: Deep quantization: Encoding convolutional activations  with deep generative model. In: CVPR (2017)  24. Qiu, Z., Yao, T., Mei, T.: Learning spatio-temporal representation with pseudo-3d  residual networks. In: ICCV (2017)   16  D. Li, Z. Qiu, Q. Dai, T. Yao, T. Mei  25. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified,  real-time object detection. In: CVPR (2016)  26. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de-  tection with region proposal networks. In: NIPS (2015)  27. Rodriguez, M.D., Ahmed, J., Shah, M.: Action mach a spatio-temporal maximum  average correlation height filter for action recognition. In: CVPR (2008)  28. Saha, S., Singh, G., Sapienza, M., Torr, P.H., Cuzzolin, F.: Deep learning for de-  tecting multiple space-time action tubes in videos. In: BMVC (2016)  29. Simonyan, K., Zisserman, A.: Two-stream convolutional networks for action recog-  30. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  nition in videos. In: NIPS (2014)  image recognition. In: ICLR (2015)  31. Singh, G., Saha, S., Cuzzolin, F.: Online real time multiple spatiotemporal action  localisation and prediction. In: ICCV (2017)  32. Soomro, K., Zamir, A.R., Shah, M.: Ucf101: A dataset of 101 human actions classes  from videos in the wild. arXiv preprint arXiv:1212.0402 (2012)  33. Srivastava, N., Mansimov, E., Salakhudinov, R.: Unsupervised learning of video  representations using lstms. In: ICML (2015)  34. Tian, Y., Sukthankar, R., Shah, M.: Spatiotemporal deformable part models for  action detection. In: CVPR (2013)  35. Tran, D., Bourdev, L., Fergus, R., Torresani, L., Paluri, M.: Learning spatiotem-  poral features with 3d convolutional networks. In: ICCV (2015)  36. Wang, L., Qiao, Y., Tang, X., Van Gool, L.: Actionness estimation using hybrid  fully convolutional networks. In: CVPR (2016)  37. Wang, Y., Song, J., Wang, L., Van Gool, L., Hilliges, O.: Two-stream sr-cnns for  action recognition in videos. In: BMVC (2016)  38. Weinzaepfel, P., Harchaoui, Z., Schmid, C.: Learning to track for spatio-temporal  action localization. In: ICCV (2015)  39. Yang, Z., Gao, J., Nevatia, R.: Spatio-temporal action detection with cascade pro-  posal and location anticipation. In: BMVC (2017)  40. Yuan, J., Liu, Z., Wu, Y.: Discriminative subvolume search for eﬃcient action  detection. In: CVPR (2009)  41. Yue-Hei Ng, J., Hausknecht, M., Vijayanarasimhan, S., Vinyals, O., Monga, R., Toderici, G.: Beyond short snippets: Deep networks for video classification. In: CVPR (2015)"}