{"1": "1. Lin, T.Y., Maire, M., Belongie, S.J., Hays, J., Perona, P., Ramanan, D., Doll´ar, In: European  P., Zitnick, C.L.: Microsoft COCO: Common objects in context. Conference on Computer Vision (ECCV). (2014)  2. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Simultaneous detection and segmentation. In Fleet, D., Pajdla, T., Schiele, B., Tuytelaars, T., eds.: Computer Vision - ECCV 2014, Cham, Springer International Publishing (2014) 297-312 3. Hu, R., Rohrbach, M., Darrell, T.: Segmentation from natural language expres-  sions. European Conference on Computer Vision (ECCV) (2016)  4. Liu, C., Lin, Z.L., Shen, X., Yang, J., Lu, X., Yuille, A.L.: Recurrent multimodal interaction for referring image segmentation. International Conference on Com- puter Vision (ICCV) (2017) 1280-1289  5. Li, Z., Tao, R., Gavves, E., Snoek, C.G.M., Smeulders, A.W.M.: Tracking by nat- ural language specification. Conference on Computer Vision and Pattern Recog- nition (CVPR) (2017)  6. Lei, T., Zhang, Y., Artzi, Y.: Training RNNs as fast as CNNs. CoRR  7. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural computation  abs/1709.02755 (2017)  9(8) (1997) 1735-1780  8. Paszke, A., Gross, S., Chintala, S., Chanan, G., Yang, E., DeVito, Z., Lin, Z., Desmaison, A., Antiga, L., Lerer, A.: Automatic diﬀerentiation in pytorch. In: Conference on Neural Information Processing Systems (NIPS). (2017)  9. Hu, R., Xu, H., Rohrbach, M., Feng, J., Saenko, K., Darrell, T.: Natural language object retrieval. Conference on Computer Vision and Pattern Recognition (CVPR) (2016) 4555-4564  10. Guadarrama, S., Rodner, E., Saenko, K., Darrell, T.: Understanding object de- scriptions in robotics by open-vocabulary object retrieval and detection. The In- ternational Journal of Robotics Research 35(1-3) (2016) 265-280  11. Hendricks, L.A., Venugopalan, S., Rohrbach, M., Mooney, R.J., Saenko, K., Darrell, T.: Deep compositional captioning: Describing novel object categories without paired training data. Conference on Computer Vision and Pattern Recognition (CVPR) (2016) 1-10  12. Gan, Z., Gan, C., He, X., Pu, Y., Tran, K., Gao, J., Carin, L., Deng, L.: Semantic compositional networks for visual captioning. Conference on Computer Vision and Pattern Recognition (CVPR) (2017) 1141-1150  13. Johnson, J., Karpathy, A., Fei-Fei, L., Li, C., Li, Y.W., fei Li, F.: Densecap: Fully convolutional localization networks for dense captioning. Conference on Computer Vision and Pattern Recognition (CVPR) (2016) 4565-4574  14. Yang, Z., Yuan, Y., Wu, Y., Cohen, W.W., Salakhutdinov, R.: Review networks for caption generation. In: Conference on Neural Information Processing Systems (NIPS). (2016)  15. Goyal, Y., Khot, T., Summers-Stay, D., Batra, D., Parikh, D.: Making the V in VQA matter: Elevating the role of image understanding in visual question answer- ing. 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017) 6325-6334  16. Li, C., Groth, O., Bernstein, M.S., Fei-Fei, L., Li, Y.W., Li, F.F.: Visual7w: Grounded question answering in images. Conference on Computer Vision and Pattern Recognition (CVPR) (2016) 4995-5004   Dynamic Multimodal Instance SegmentationReferences  1. Lin, T.Y., Maire, M., Belongie, S.J., Hays, J., Perona, P., Ramanan, D., Doll´ar, In: European  P., Zitnick, C.L.: Microsoft COCO: Common objects in context. Conference on Computer Vision (ECCV). (2014)  2. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Simultaneous detection and segmentation. In Fleet, D., Pajdla, T., Schiele, B., Tuytelaars, T., eds.: Computer Vision - ECCV 2014, Cham, Springer International Publishing (2014) 297-312 3. Hu, R., Rohrbach, M., Darrell, T.: Segmentation from natural language expres-  sions. European Conference on Computer Vision (ECCV) (2016)  4. Liu, C., Lin, Z.L., Shen, X., Yang, J., Lu, X., Yuille, A.L.: Recurrent multimodal interaction for referring image segmentation. International Conference on Com- puter Vision (ICCV) (2017) 1280-1289  5. Li, Z., Tao, R., Gavves, E., Snoek, C.G.M., Smeulders, A.W.M.: Tracking by nat- ural language specification. Conference on Computer Vision and Pattern Recog- nition (CVPR) (2017)  6. Lei, T., Zhang, Y., Artzi, Y.: Training RNNs as fast as CNNs. CoRR  7. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural computation  abs/1709.02755 (2017)  9(8) (1997) 1735-1780  8. Paszke, A., Gross, S., Chintala, S., Chanan, G., Yang, E., DeVito, Z., Lin, Z., Desmaison, A., Antiga, L., Lerer, A.: Automatic diﬀerentiation in pytorch. In: Conference on Neural Information Processing Systems (NIPS). (2017)  9. Hu, R., Xu, H., Rohrbach, M., Feng, J., Saenko, K., Darrell, T.: Natural language object retrieval. Conference on Computer Vision and Pattern Recognition (CVPR) (2016) 4555-4564  10. Guadarrama, S., Rodner, E., Saenko, K., Darrell, T.: Understanding object de- scriptions in robotics by open-vocabulary object retrieval and detection. The In- ternational Journal of Robotics Research 35(1-3) (2016) 265-280  11. Hendricks, L.A., Venugopalan, S., Rohrbach, M., Mooney, R.J., Saenko, K., Darrell, T.: Deep compositional captioning: Describing novel object categories without paired training data. Conference on Computer Vision and Pattern Recognition (CVPR) (2016) 1-10  12. Gan, Z., Gan, C., He, X., Pu, Y., Tran, K., Gao, J., Carin, L., Deng, L.: Semantic compositional networks for visual captioning. Conference on Computer Vision and Pattern Recognition (CVPR) (2017) 1141-1150  13. Johnson, J., Karpathy, A., Fei-Fei, L., Li, C., Li, Y.W., fei Li, F.: Densecap: Fully convolutional localization networks for dense captioning. Conference on Computer Vision and Pattern Recognition (CVPR) (2016) 4565-4574  14. Yang, Z., Yuan, Y., Wu, Y., Cohen, W.W., Salakhutdinov, R.: Review networks for caption generation. In: Conference on Neural Information Processing Systems (NIPS). (2016)  15. Goyal, Y., Khot, T., Summers-Stay, D., Batra, D., Parikh, D.: Making the V in VQA matter: Elevating the role of image understanding in visual question answer- ing. 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017) 6325-6334  16. Li, C., Groth, O., Bernstein, M.S., Fei-Fei, L., Li, Y.W., Li, F.F.: Visual7w: Grounded question answering in images. Conference on Computer Vision and Pattern Recognition (CVPR) (2016) 4995-5004   16  Edgar Margﬀoy-Tuay, Juan C. P´erez, Emilio Botero, Pablo Arbel´aez  17. Krishna, R., Li, C., Groth, O., Johnson, J., Hata, K., Kravitz, J., Chen, S., Kalan- tidis, Y., Shamma, D.A., Bernstein, M.S., Fei-Fei, L.: Visual genome: Connecting language and vision using crowdsourced dense image annotations. International Journal of Computer Vision (IJCV) 123 (2016) 32-73  18. Agrawal, A., Lu, J., Antol, S., Mitchell, M., Zitnick, C.L., Parikh, D., Batra, D.: VQA: Visual question answering. International Conference on Computer Vision (ICCV) (2015) 2425-2433  19. Teney, D., Liu, L., van den Hengel, A.: Graph-structured representations for visual question answering. Conference on Computer Vision and Pattern Recognition (CVPR) (2017) 3233-3241  20. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The International Journal of Computer  pascal visual object classes (voc) challenge. Vision 88(2) (June 2010) 303-338  21. Nair, V., Hinton, G.E.: Rectified linear units improve restricted boltzmann ma- chines. In: Proceedings of the 27th international conference on machine learning (ICML-10). (2010) 807-814  22. Odena, A., Dumoulin, V., Olah, C.: Deconvolution and checkerboard artifacts.  Distill (2016)  23. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale image recognition. International Conference on Learning Representations (ICLR) (2015)  24. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomed- ical image segmentation. In: Medical Image Computing and Computer-Assisted Intervention - MICCAI 2015. (2015) 234-241  25. Shelhamer, E., Long, J., Darrell, T.: Fully convolutional networks for semantic segmentation. Conference on Computer Vision and Pattern Recognition (CVPR) (2015) 3431-3440  26. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Object instance segmentation and fine-grained localization using hypercolumns. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 39(4) (2017) 627-639  27. Chen, Y., Li, J., Xiao, H., Jin, X., Yan, S., Feng, J.: Dual path networks.  In:  Conference on Neural Information Processing Systems (NIPS). (2017)  28. Huang, G., Liu, Z., Weinberger, K.Q.: Densely connected convolutional networks. Conference on Computer Vision and Pattern Recognition (CVPR) (2017) 2261- 2269  29. Kazemzadeh, S., Ordonez, V., Matten, M., Berg, T.L.: Referit game: Referring to  objects in photographs of natural scenes. In: EMNLP. (2014)  30. Mao, J., Huang, J., Toshev, A., Camburu, O., Yuille, A.L., Murphy, K.: Generation and comprehension of unambiguous object descriptions. Conference on Computer Vision and Pattern Recognition (CVPR) (2016) 11-20  31. Yu, L., Poirson, P., Yang, S., Berg, A.C., Berg, T.L.: Modeling context in referring expressions. In: European Conference on Computer Vision (ECCV). (2016) 32. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. International  Conference on Learning Representations (ICLR) (2015)  33. Hu, R., Rohrbach, M., Venugopalan, S., Darrell, T.: Utilizing large scale vision and text datasets for image segmentation from referring expressions. European Conference on Computer Vision (ECCV) (2016)"}