{"1": "(2004) 91-110  1. Lowe, D.G.: Distinctive image features from scale-invariant keypoints. IJCV 60(2)  2. Leung, T., Malik, J.: Representing and recognizing the visual appearance of ma-  terials using three-dimensional textons. IJCV 43(1) (2001) 29-44  3. Lazebnik, S., Schmid, C., Ponce, J.: Beyond bags of features: Spatial pyramid matching for recognizing natural scene categories. In: CVPR. (2006) 2169-2178 4. Yang, J., Yu, K., Gong, Y., Huang, T.: Linear spatial pyramid matching using  sparse coding for image classification. In: CVPR. (2009) 1794-1801  5. Wang, J., Yang, J., Yu, K., Lv, F., Huang, T., Gong, Y.: Locality-constrained  linear coding for image classification. In: CVPR. (2010) 3360-3367  6. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep  convolutional neural networks. In: NIPS. (2012) 1097-1105  7. Krause, J., Stark, M., Deng, J., Fei-Fei, L.: 3d object representations for fine- grained categorization. In: 4th International IEEE Workshop on 3D Representation and Recognition (3dRR). (2013)  8. Yang, L., Luo, P., Change Loy, C., Tang, X.: A large-scale car dataset for fine-  grained categorization and verification. In: CVPR. (2015)  9. Wah, C., Branson, S., Welinder, P., Perona, P., Belongie, S.: The caltech-ucsd  birds-200-2011 dataset. (2011)  10. Maji, S., Rahtu, E., Kannala, J., Blaschko, M., Vedaldi, A.: Fine-grained visual  classification of aircraft. arXiv preprint arXiv:1306.5151 (2013)  11. Bossard, L., Guillaumin, M., Van Gool, L.: Food-101 - mining discriminative  components with random forests. In: ECCV. (2014)  12. Zhang, N., Donahue, J., Girshick, R., Darrell, T.: Part-based r-cnns for fine-grained  category detection. In: ECCV. (2014) 834-849  13. Zhang, X., Zhou, F., Lin, Y., Zhang, S.: Embedding label structures for fine-grained  feature representation. In: CVPR. (2016)  14. Huang, S., Xu, Z., Tao, D., Zhang, Y.: Part-stacked cnn for fine-grained visual  15. Jaderberg, M., Simonyan, K., Zisserman, A., et al.: Spatial transformer networks.  categorization. In: CVPR. (2016)  In: NIPS. (2015) 2017-2025  16. Xiao, T., Xu, Y., Yang, K., Zhang, J., Peng, Y., Zhang, Z.: The application of two-level attention models in deep convolutional neural network for fine-grained image classification. In: CVPR. (2015)  17. Zheng, H., Fu, J., Mei, T., Luo, J.: Learning multi-attention convolutional neural  network for fine-grained image recognition. In: ICCV. (2017)  18. Krause, J., Sapp, B., Howard, A., Zhou, H., Toshev, A., Duerig, T., Philbin, J., Fei- Fei, L.: The unreasonable eﬀectiveness of noisy data for fine-grained recognition. In: ECCV. (2016) 301-320  19. Xu, Z., Huang, S., Zhang, Y., Tao, D.: Augmenting strong supervision using web  data for fine-grained categorization. In: ICCV. (2015)  20. Cui, Y., Zhou, F., Lin, Y., Belongie, S.: Fine-grained categorization and dataset In: CVPR.  bootstrapping using deep metric learning with humans in the loop. (2016)  21. Lin, T.Y., RoyChowdhury, A., Maji, S.: Bilinear cnn models for fine-grained visual  recognition. In: ICCV. (2015)  22. Tuzel, O., Porikli, F., Meer, P.: Region covariance: A fast descriptor for detection  and classification. In: ECCV. (2006) 589-600   Grassmann Pooling as Compact Homogeneous Bilinear PoolingReferences  (2004) 91-110  1. Lowe, D.G.: Distinctive image features from scale-invariant keypoints. IJCV 60(2)  2. Leung, T., Malik, J.: Representing and recognizing the visual appearance of ma-  terials using three-dimensional textons. IJCV 43(1) (2001) 29-44  3. Lazebnik, S., Schmid, C., Ponce, J.: Beyond bags of features: Spatial pyramid matching for recognizing natural scene categories. In: CVPR. (2006) 2169-2178 4. Yang, J., Yu, K., Gong, Y., Huang, T.: Linear spatial pyramid matching using  sparse coding for image classification. In: CVPR. (2009) 1794-1801  5. Wang, J., Yang, J., Yu, K., Lv, F., Huang, T., Gong, Y.: Locality-constrained  linear coding for image classification. In: CVPR. (2010) 3360-3367  6. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep  convolutional neural networks. In: NIPS. (2012) 1097-1105  7. Krause, J., Stark, M., Deng, J., Fei-Fei, L.: 3d object representations for fine- grained categorization. In: 4th International IEEE Workshop on 3D Representation and Recognition (3dRR). (2013)  8. Yang, L., Luo, P., Change Loy, C., Tang, X.: A large-scale car dataset for fine-  grained categorization and verification. In: CVPR. (2015)  9. Wah, C., Branson, S., Welinder, P., Perona, P., Belongie, S.: The caltech-ucsd  birds-200-2011 dataset. (2011)  10. Maji, S., Rahtu, E., Kannala, J., Blaschko, M., Vedaldi, A.: Fine-grained visual  classification of aircraft. arXiv preprint arXiv:1306.5151 (2013)  11. Bossard, L., Guillaumin, M., Van Gool, L.: Food-101 - mining discriminative  components with random forests. In: ECCV. (2014)  12. Zhang, N., Donahue, J., Girshick, R., Darrell, T.: Part-based r-cnns for fine-grained  category detection. In: ECCV. (2014) 834-849  13. Zhang, X., Zhou, F., Lin, Y., Zhang, S.: Embedding label structures for fine-grained  feature representation. In: CVPR. (2016)  14. Huang, S., Xu, Z., Tao, D., Zhang, Y.: Part-stacked cnn for fine-grained visual  15. Jaderberg, M., Simonyan, K., Zisserman, A., et al.: Spatial transformer networks.  categorization. In: CVPR. (2016)  In: NIPS. (2015) 2017-2025  16. Xiao, T., Xu, Y., Yang, K., Zhang, J., Peng, Y., Zhang, Z.: The application of two-level attention models in deep convolutional neural network for fine-grained image classification. In: CVPR. (2015)  17. Zheng, H., Fu, J., Mei, T., Luo, J.: Learning multi-attention convolutional neural  network for fine-grained image recognition. In: ICCV. (2017)  18. Krause, J., Sapp, B., Howard, A., Zhou, H., Toshev, A., Duerig, T., Philbin, J., Fei- Fei, L.: The unreasonable eﬀectiveness of noisy data for fine-grained recognition. In: ECCV. (2016) 301-320  19. Xu, Z., Huang, S., Zhang, Y., Tao, D.: Augmenting strong supervision using web  data for fine-grained categorization. In: ICCV. (2015)  20. Cui, Y., Zhou, F., Lin, Y., Belongie, S.: Fine-grained categorization and dataset In: CVPR.  bootstrapping using deep metric learning with humans in the loop. (2016)  21. Lin, T.Y., RoyChowdhury, A., Maji, S.: Bilinear cnn models for fine-grained visual  recognition. In: ICCV. (2015)  22. Tuzel, O., Porikli, F., Meer, P.: Region covariance: A fast descriptor for detection  and classification. In: ECCV. (2006) 589-600   16  X. Wei, Y. Zhang, Y. Gong, J. Zhang, and N. Zheng  23. Gao, Y., Beijbom, O., Zhang, N., Darrell, T.: Compact bilinear pooling. In: CVPR.  24. Kong, S., Fowlkes, C.: Low-rank bilinear pooling for fine-grained classification. In:  25. Li, Y., Wang, N., Liu, J., Hou, X.: Factorized bilinear models for image recognition.  26. J´egou, H., Douze, M., Schmid, C.: On the burstiness of visual elements. In: CVPR.  (2016)  CVPR. (2017)  In: ICCV. (2017)  (2009) 1169-1176  27. Arandjelovic, R., Zisserman, A.: All about vlad. In: CVPR. (2013) 28. Jegou, H., Perronnin, F., Douze, M., S´anchez, J., Perez, P., Schmid, C.: Aggre- IEEE TPAMI 34(9) (2012)  gating local image descriptors into compact codes. 1704-1716  29. Lin, T.Y., Maji, S.: Improved bilinear pooling with cnns. In: BMVC. (2017) 30. Turaga, P., Veeraraghavan, A., Chellappa, R.: Statistical analysis on stiefel and grassmann manifolds with applications in computer vision. In: CVPR. (2008) 1-8 31. Hamm, J., Lee, D.D.: Grassmann discriminant analysis: a unifying view on  subspace-based learning. In: ICML. (2008)  32. Jayasumana, S., Hartley, R., Salzmann, M., Li, H., Harandi, M.: Kernel methods on riemannian manifolds with gaussian rbf kernels. IEEE TPAMI 37(12) (2015) 2464-2477  33. Wei, X., Zhang, Y., Gong, Y., Zheng, N.: Kernelized subspace pooling for deep  local descriptors. In: CVPR. (2018)  34. Tenenbaum, J.B., Freeman, W.T.: Separating style and content. In: NIPS. (1997)  662-668  35. Carreira, J., Caseiro, R., Batista, J., Sminchisescu, C.: Semantic segmentation  with second-order pooling. In: ECCV. (2012) 430-443  36. Fukui, A., Park, D.H., Yang, D., Rohrbach, A., Darrell, T., Rohrbach, M.: Multi- modal compact bilinear pooling for visual question answering and visual grounding. arXiv preprint arXiv:1606.01847 (2016)  37. J´egou, H., Chum, O.: Negative evidences and co-occurences in image retrieval:  The benefit of pca and whitening. In: ECCV. (2012) 774-787  38. Kar, P., Karnick, H.: Random feature maps for dot product kernels. In: Artificial  Intelligence and Statistics. (2012) 583-591  39. Pham, N., Pagh, R.: Fast and scalable polynomial kernels via explicit feature maps.  In: ACM SIGKDD. (2013) 239-247  40. Arandjelovi´c, R., Zisserman, A.: Three things everyone should know to improve  object retrieval. In: CVPR. (2012) 2911-2918  41. Maaten, L.v.d., Hinton, G.: Visualizing data using t-sne. JMLR 9 (2008) 2579-42. Ionescu, C., Vantzos, O., Sminchisescu, C.: Matrix backpropagation for deep net-  works with structured layers. In: ICCV. (2015)  43. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)"}