{"1": "1. Agarwal, A., Triggs, B.: 3d human pose from silhouettes by relevance vector regres- sion. In: Computer Vision and Pattern Recognition, 2004. CVPR 2004. Proceedings of the 2004 IEEE Computer Society Conference on. vol. 2, pp. II-II. IEEE (2004) 2. Arikan, O., Forsyth, D.A., O’Brien, J.F.: Motion synthesis from annotations. In:  ACM Transactions on Graphics (TOG). vol. 22, pp. 402-408. ACM (2003)  3. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR. vol. 1, p. 7 (2017)  4. Ho, J., Ermon, S.: Generative adversarial imitation learning. In: Advances in Neural  Information Processing Systems. pp. 4565-4573 (2016)  5. Holden, D., Komura, T., Saito, J.: Phase-functioned neural networks for character  control. ACM Transactions on Graphics (TOG) 36(4), 42 (2017)  6. Hwang, B., Jeon, D.: A method to accurately estimate the muscular torques of human wearing exoskeletons by torque sensors. Sensors 15(4), 8337-8357 (2015) 7. Jiang, H., Grauman, K.: Seeing invisible poses: Estimating 3d body pose from  egocentric video. arXiv preprint arXiv:1603.07763 (2016)  8. Li, C., Kitani, K.M.: Model recommendation with virtual probes for egocentric hand detection. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 2624-2631 (2013)  9. Li, C., Kitani, K.M.: Pixel-level hand detection in ego-centric videos. In: Proceed- ings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3570-3577 (2013)  10. Liu, Z., Zhu, J., Bu, J., Chen, C.: A survey of human pose estimation: the body parts parsing based methods. Journal of Visual Communication and Image Rep- resentation 32, 10-19 (2015)  11. Merel, J., Tassa, Y., Srinivasan, S., Lemmon, J., Wang, Z., Wayne, G., Heess, N.: Learning human behaviors from motion capture by adversarial imitation. arXiv preprint arXiv:1707.02201 (2017)  12. Ng, A.Y., Russell, S.J., et al.: Algorithms for inverse reinforcement learning. In:  Icml. pp. 663-670 (2000)  13. Peng, X.B., Berseth, G., Van de Panne, M.: Terrain-adaptive locomotion skills using deep reinforcement learning. ACM Transactions on Graphics (TOG) 35(4), 81 (2016)  14. Peng, X.B., Berseth, G., Yin, K., Van De Panne, M.: Deeploco: Dynamic locomo- tion skills using hierarchical deep reinforcement learning. ACM Transactions on Graphics (TOG) 36(4), 41 (2017)  15. Pomerleau, D.A.: Eﬃcient training of artificial neural networks for autonomous  navigation. Neural Computation 3(1), 88-97 (1991)  16. Ren, X., Gu, C.: Figure-ground segmentation improves handled object recognition in egocentric video. In: Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on. pp. 3137-3144. IEEE (2010)  17. Rogez, G., Supancic, J.S., Ramanan, D.: First-person pose recognition using ego- centric workspaces. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 4325-4333 (2015)  18. Ross, S., Bagnell, D.: Eﬃcient reductions for imitation learning. In: Proceedings of the thirteenth international conference on artificial intelligence and statistics. pp. 661-668 (2010)  19. Ross, S., Gordon, G.J., Bagnell, D.: A reduction of imitation learning and struc- tured prediction to no-regret online learning. In: International Conference on Ar- tificial Intelligence and Statistics. pp. 627-635 (2011)   3D Ego-Pose Estimation via Imitation LearningReferences  1. Agarwal, A., Triggs, B.: 3d human pose from silhouettes by relevance vector regres- sion. In: Computer Vision and Pattern Recognition, 2004. CVPR 2004. Proceedings of the 2004 IEEE Computer Society Conference on. vol. 2, pp. II-II. IEEE (2004) 2. Arikan, O., Forsyth, D.A., O’Brien, J.F.: Motion synthesis from annotations. In:  ACM Transactions on Graphics (TOG). vol. 22, pp. 402-408. ACM (2003)  3. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR. vol. 1, p. 7 (2017)  4. Ho, J., Ermon, S.: Generative adversarial imitation learning. In: Advances in Neural  Information Processing Systems. pp. 4565-4573 (2016)  5. Holden, D., Komura, T., Saito, J.: Phase-functioned neural networks for character  control. ACM Transactions on Graphics (TOG) 36(4), 42 (2017)  6. Hwang, B., Jeon, D.: A method to accurately estimate the muscular torques of human wearing exoskeletons by torque sensors. Sensors 15(4), 8337-8357 (2015) 7. Jiang, H., Grauman, K.: Seeing invisible poses: Estimating 3d body pose from  egocentric video. arXiv preprint arXiv:1603.07763 (2016)  8. Li, C., Kitani, K.M.: Model recommendation with virtual probes for egocentric hand detection. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 2624-2631 (2013)  9. Li, C., Kitani, K.M.: Pixel-level hand detection in ego-centric videos. In: Proceed- ings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3570-3577 (2013)  10. Liu, Z., Zhu, J., Bu, J., Chen, C.: A survey of human pose estimation: the body parts parsing based methods. Journal of Visual Communication and Image Rep- resentation 32, 10-19 (2015)  11. Merel, J., Tassa, Y., Srinivasan, S., Lemmon, J., Wang, Z., Wayne, G., Heess, N.: Learning human behaviors from motion capture by adversarial imitation. arXiv preprint arXiv:1707.02201 (2017)  12. Ng, A.Y., Russell, S.J., et al.: Algorithms for inverse reinforcement learning. In:  Icml. pp. 663-670 (2000)  13. Peng, X.B., Berseth, G., Van de Panne, M.: Terrain-adaptive locomotion skills using deep reinforcement learning. ACM Transactions on Graphics (TOG) 35(4), 81 (2016)  14. Peng, X.B., Berseth, G., Yin, K., Van De Panne, M.: Deeploco: Dynamic locomo- tion skills using hierarchical deep reinforcement learning. ACM Transactions on Graphics (TOG) 36(4), 41 (2017)  15. Pomerleau, D.A.: Eﬃcient training of artificial neural networks for autonomous  navigation. Neural Computation 3(1), 88-97 (1991)  16. Ren, X., Gu, C.: Figure-ground segmentation improves handled object recognition in egocentric video. In: Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on. pp. 3137-3144. IEEE (2010)  17. Rogez, G., Supancic, J.S., Ramanan, D.: First-person pose recognition using ego- centric workspaces. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 4325-4333 (2015)  18. Ross, S., Bagnell, D.: Eﬃcient reductions for imitation learning. In: Proceedings of the thirteenth international conference on artificial intelligence and statistics. pp. 661-668 (2010)  19. Ross, S., Gordon, G.J., Bagnell, D.: A reduction of imitation learning and struc- tured prediction to no-regret online learning. In: International Conference on Ar- tificial Intelligence and Statistics. pp. 627-635 (2011)   16  Y. Yuan and K. Kitani  20. Russell, S.: Learning agents for uncertain environments. In: Proceedings of the eleventh annual conference on Computational learning theory. pp. 101-103. ACM (1998)  21. Sarafianos, N., Boteanu, B., Ionescu, B., Kakadiaris, I.A.: 3d human pose estima- tion: A review of the literature and analysis of covariates. Computer Vision and Image Understanding 152, 1-20 (2016)  22. Schulman, J., Levine, S., Abbeel, P., Jordan, M., Moritz, P.: Trust region policy optimization. In: Proceedings of the 32nd International Conference on Machine Learning (ICML-15). pp. 1889-1897 (2015)  23. Schulman, J., Wolski, F., Dhariwal, P., Radford, A., Klimov, O.: Proximal policy  optimization algorithms. arXiv preprint arXiv:1707.06347 (2017)  24. Shakhnarovich, G., Viola, P., Darrell, T.: Fast pose estimation with parameter-  sensitive hashing. In: null. p. 750. IEEE (2003)  25. Shiratori, T., Park, H.S., Sigal, L., Sheikh, Y., Hodgins, J.K.: Motion capture from body-mounted cameras. In: ACM Transactions on Graphics (TOG). vol. 30, p. 31. ACM (2011)  26. Sminchisescu, C., Kanaujia, A., Metaxas, D.N.: Bm3e: Discriminative density prop- agation for visual tracking. IEEE Transactions on Pattern Analysis and Machine Intelligence 29(11) (2007)  27. Sussillo, D., Abbott, L.F.: Generating coherent patterns of activity from chaotic  neural networks. Neuron 63(4), 544-557 (2009)  28. Tassa, Y., Doron, Y., Muldal, A., Erez, T., Li, Y., Casas, D.d.L., Budden, D., Abdolmaleki, A., Merel, J., Lefrancq, A., et al.: Deepmind control suite. arXiv preprint arXiv:1801.00690 (2018)  29. Taylor, G.W., Hinton, G.E., Roweis, S.T.: Modeling human motion using binary latent variables. In: Advances in neural information processing systems. pp. 1345- 1352 (2007)  30. Todorov, E., Erez, T., Tassa, Y.: Mujoco: A physics engine for model-based con- trol. In: Intelligent Robots and Systems (IROS), 2012 IEEE/RSJ International Conference on. pp. 5026-5033. IEEE (2012)  31. Toshev, A., Szegedy, C.: Deeppose: Human pose estimation via deep neural net- works. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1653-1660 (2014)  32. Wang, Z., Merel, J., Reed, S., Wayne, G., de Freitas, N., Heess, N.: Robust imitation  of diverse behaviors. arXiv preprint arXiv:1707.02747 (2017)"}