{"1": "1. Courbariaux, M., Hubara, I., Soudry, D., El-Yaniv, R., Bengio, Y.: Binarized neural networks: Training deep neural networks with weights and activations constrained to+ 1 or-1. arXiv preprint arXiv:1602.02830 (2016) 2, 4, 5  2. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: Mobilenets: Eﬃcient convolutional neural networks for mobile vision applications. arXiv preprint arXiv:1704.04861 (2017) 2, 3  3. He, Y., Zhang, X., Sun, J.: Channel pruning for accelerating very deep neural In: Proceedings of the IEEE International Conference on Computer  networks. Vision (ICCV). (2017) 2, 4, 9, 10  4. Li, Q., Jin, S., Yan, J.: Mimicking very eﬃcient network for object detection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 2, 4, 6, 9, 10, 14  5. Zeng, X., Ouyang, W., Yan, J., Li, H., Xiao, T., Wang, K., Liu, Y., Zhou, Y., Yang, B., Wang, Z., et al.: Crafting gbd-net for object detection. IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI) (2017) 3  6. Liu, Y., Li, H., Yan, J., Wei, F., Wang, X., Tang, X.: Recurrent scale approximation for object detection in cnn. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV). (2017) 3  7. Yan, J., Yu, Y., Zhu, X., Lei, Z., Li, S.Z.: Object detection by labeling super- pixels. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2015) 3  8. Yan, J., Lei, Z., Wen, L., Li, S.Z.: The fastest deformable part model for object de- tection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2014) 3  9. Ouyang, W., Wang, X., Zeng, X., Qiu, S., Luo, P., Tian, Y., Li, H., Yang, S., Wang, Z., Loy, C.C., et al.: Deepid-net: Deformable deep convolutional neural networks for object detection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2015) 3  10. Ouyang, W., Wang, K., Zhu, X., Wang, X.: Chained cascade network for object In: Proceedings of the IEEE International Conference on Computer  11. Wang, X., Han, T.X., Yan, S.: An hog-lbp human detector with partial occlusion In: Proceedings of the IEEE International Conference on Computer  detection. Vision (ICCV). (2017) 3  handling. Vision (ICCV). (2009) 3  12. Lowe, D.G.: Distinctive image features from scale-invariant keypoints. Interna-  tional journal of computer vision (IJCV) 60(2) (2004) 91-110 3  13. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2014) 3 14. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional In: European Conference on Computer Vision  networks for visual recognition. (ECCV). (2014) 3  15. Girshick, R.: Fast r-cnn. In: Proceedings of the IEEE International Conference on  Computer Vision (ICCV). (2015) 3, 6  16. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified, real-time object detection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2016) 3   Quantization MimicReferences  1. Courbariaux, M., Hubara, I., Soudry, D., El-Yaniv, R., Bengio, Y.: Binarized neural networks: Training deep neural networks with weights and activations constrained to+ 1 or-1. arXiv preprint arXiv:1602.02830 (2016) 2, 4, 5  2. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: Mobilenets: Eﬃcient convolutional neural networks for mobile vision applications. arXiv preprint arXiv:1704.04861 (2017) 2, 3  3. He, Y., Zhang, X., Sun, J.: Channel pruning for accelerating very deep neural In: Proceedings of the IEEE International Conference on Computer  networks. Vision (ICCV). (2017) 2, 4, 9, 10  4. Li, Q., Jin, S., Yan, J.: Mimicking very eﬃcient network for object detection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 2, 4, 6, 9, 10, 14  5. Zeng, X., Ouyang, W., Yan, J., Li, H., Xiao, T., Wang, K., Liu, Y., Zhou, Y., Yang, B., Wang, Z., et al.: Crafting gbd-net for object detection. IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI) (2017) 3  6. Liu, Y., Li, H., Yan, J., Wei, F., Wang, X., Tang, X.: Recurrent scale approximation for object detection in cnn. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV). (2017) 3  7. Yan, J., Yu, Y., Zhu, X., Lei, Z., Li, S.Z.: Object detection by labeling super- pixels. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2015) 3  8. Yan, J., Lei, Z., Wen, L., Li, S.Z.: The fastest deformable part model for object de- tection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2014) 3  9. Ouyang, W., Wang, X., Zeng, X., Qiu, S., Luo, P., Tian, Y., Li, H., Yang, S., Wang, Z., Loy, C.C., et al.: Deepid-net: Deformable deep convolutional neural networks for object detection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2015) 3  10. Ouyang, W., Wang, K., Zhu, X., Wang, X.: Chained cascade network for object In: Proceedings of the IEEE International Conference on Computer  11. Wang, X., Han, T.X., Yan, S.: An hog-lbp human detector with partial occlusion In: Proceedings of the IEEE International Conference on Computer  detection. Vision (ICCV). (2017) 3  handling. Vision (ICCV). (2009) 3  12. Lowe, D.G.: Distinctive image features from scale-invariant keypoints. Interna-  tional journal of computer vision (IJCV) 60(2) (2004) 91-110 3  13. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2014) 3 14. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional In: European Conference on Computer Vision  networks for visual recognition. (ECCV). (2014) 3  15. Girshick, R.: Fast r-cnn. In: Proceedings of the IEEE International Conference on  Computer Vision (ICCV). (2015) 3, 6  16. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified, real-time object detection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2016) 3   16  Wei et al.  17. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd: Single shot multibox detector. In: European conference on computer vision (ECCV). (2016) 3  18. Chollet, F.: Xception: Deep learning with depthwise separable convolutions. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 3  19. Zhang, T., Qi, G.J., Xiao, B., Wang, J.: Interleaved group convolutions for deep neural networks. In: Proceedings of the IEEE International Conference on Com- puter Vision (ICCV). (2017) 4  20. Zhang, X., Zhou, X., Lin, M., Sun, J.: Shuﬄenet: An extremely eﬃcient convolu- tional neural network for mobile devices. arXiv preprint arXiv:1707.01083 (2017) 4  21. Rastegari, M., Ordonez, V., Redmon, J., Farhadi, A.: Xnor-net: Imagenet classi- fication using binary convolutional neural networks. In: European Conference on Computer Vision (ECCV). (2016) 4  22. Zhou, S., Wu, Y., Ni, Z., Zhou, X., Wen, H., Zou, Y.: Dorefa-net: Training low bitwidth convolutional neural networks with low bitwidth gradients. In: Pro- ceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2016) 4  23. Courbariaux, M., Bengio, Y., David, J.P.: Binaryconnect: Training deep neural networks with binary weights during propagations. In: Advances in Neural Infor- mation Processing Systems (NIPS). (2015) 4  24. Juefei-Xu, F., Boddeti, V.N., Savvides, M.: Local binary convolutional neural networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 4  25. Zhou, A., Yao, A., Guo, Y., Xu, L., Chen, Y.: Incremental network quantization: Towards lossless cnns with low-precision weights. In: International Conference of Learning Representation (ICLR). (2017) 4, 5  26. Alvarez, J.M., Salzmann, M.: Learning the number of neurons in deep networks.  In: Advances in Neural Information Processing Systems (NIPS). (2016) 4  27. Wen, W., Wu, C., Wang, Y., Chen, Y., Li, H.: Learning structured sparsity in deep neural networks. In: Advances in Neural Information Processing Systems (NIPS). (2016) 4  28. Anwar, S., Sung, W.: Compact deep convolutional neural networks with coarse  pruning. arXiv preprint arXiv:1610.09639 (2016) 4  29. Li, H., Kadav, A., Durdanovic, I., Samet, H., Graf, H.P.: Pruning filters for eﬃcient convnets. In: International Conference of Learning Representation (ICLR). (2017) 4  30. Molchanov, P., Tyree, S., Karras, T., Aila, T., Kautz, J.: Pruning convolutional In: International Conference of  neural networks for resource eﬃcient inference. Learning Representation (ICLR). (2017) 4, 10  31. Guo, Y., Yao, A., Chen, Y.: Dynamic network surgery for eﬃcient dnns.  In:  Advances In Neural Information Processing Systems (NIPS). (2016) 4  32. Han, S., Liu, X., Mao, H., Pu, J., Pedram, A., Horowitz, M.A., Dally, W.J.: Eie: eﬃcient inference engine on compressed deep neural network. In: Proceedings of the 43rd International Symposium on Computer Architecture (ISCA). (2016) 4 33. Han, S., Pool, J., Tran, J., Dally, W.: Learning both weights and connections for eﬃcient neural network. In: Advances in Neural Information Processing Systems (NIPS). (2015) 4   Quantization Mimic34. Yang, T.J., Chen, Y.H., Sze, V.: Designing energy-eﬃcient convolutional neural networks using energy-aware pruning. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 4  35. Hinton, G., Vinyals, O., Dean, J.: Distilling the knowledge in a neural network.  arXiv preprint arXiv:1503.02531 (2015) 4, 6  36. Romero, A., Ballas, N., Kahou, S.E., Chassang, A., Gatta, C., Bengio, Y.: Fitnets: Hints for thin deep nets. In: International Conference of Learning Representation (ICLR). (2015) 4  37. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully convolutional networks. In: Advances In Neural Information Processing Systems (NIPS). (2016) 5, 6  38. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object In: Advances In Neural Information  detection with region proposal networks. Processing Systems (NIPS). (2015) 5, 6, 13  39. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embed- ding. In: Proceedings of the 22nd ACM international conference on Multimedia (ACMMM). (2014) 8  40. Shrivastava, A., Gupta, A., Girshick, R.: Training region-based object detectors In: Proceedings of the IEEE Conference on  with online hard example mining. Computer Vision and Pattern Recognition (CVPR). (2016) 9  41. Yang, S., Luo, P., Loy, C.C., Tang, X.: Wider face: A face detection benchmark. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2016) 9  42. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The International journal of computer  pascal visual object classes (voc) challenge. vision (IJCV) 88(2) (2010) 303-338 9, 13  43. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2009) 13"}