{"1": "1. Lin, T.Y., Cui, Y., Patterson, G., Ronchi, M.R., Bourdev, L., Girshick, R., Dollr,  P.: Coco 2016 keypoint challenge. (2016)  2. Newell, A., Deng, J.: Associative embedding: End-to-end learning for joint detec-  3. Li, Y., Qi, H., Dai, J., Ji, X., Wei, Y.: Fully convolutional instance-aware semantic  tion and grouping. In: NIPS. (2017)  segmentation. In: CVPR. (2017)  4. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. In: Proc. IEEE. (1998) 5. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  convolutional neural networks. In: NIPS. (2012)  Imagenet classification with deep  6. Fischler, M.A., Elschlager, R.: The representation and matching of pictorial struc-  tures. In: IEEE TOC. (1973)  7. Felzenszwalb, P., McAllester, D., Ramanan, D.: A discriminatively trained, multi-  scale, deformable part model. In: CVPR. (2008)  8. Andriluka, M., Roth, S., Schiele, B.: Pictorial structures revisited: People detection  and articulated pose estimation. In: CVPR. (2009)  9. Eichner, M., Ferrari, V.: Better appearance models for pictorial structures. In:  BMVC. (2009)  CVPR. (2010)  parts. In: CVPR. (2011)  10. Sapp, B., Jordan, C., B.Taskar: Adaptive pose priors for pictorial structures. In:  11. Yang, Y., Ramanan, D.: Articulated pose estimation with ﬂexible mixtures of  12. Dantone, M., Gall, J., Leistner, C., Gool., L.V.: Human pose estimation using  body parts dependent joint regressors. In: CVPR. (2013)  13. Johnson, S., Everingham, M.: Learning Eﬀective Human Pose Estimation from  Inaccurate Annotation. In: CVPR. (2011)  14. Pishchulin, L., Andriluka, M., Gehler, P., Schiele, B.: Poselet conditioned pictorial  15. Sapp, B., Taskar, B.: Modec: Multimodal decomposable models for human pose  structures. In: CVPR. (2013)  estimation. In: CVPR. (2013)  16. Gkioxari, G., Arbelaez, P., Bourdev, L., Malik, J.: Articulated pose estimation  using discriminative armlet classifiers. In: CVPR. (2013)  17. Toshev, A., Szegedy, C.: Deeppose: Human pose estimation via deep neural net-  works. In: CVPR. (2014)  18. Jain, A., Tompson, J., Andriluka, M., Taylor, G., Bregler, C.: Learning human  pose estimation features with convolutional networks. In: ICLR. (2014)  19. Tompson, J., Jain, A., LeCun, Y., Bregler, C.: Join training of a convolutional network and a graphical model for human pose estimation. In: NIPS. (2014) 20. Chen, X., Yuille, A.: Articulated pose estimation by a graphical model with image  dependent pairwise relations. In: NIPS. (2014)  21. Tompson, J., Goroshin, R., Jain, A., LeCun, Y., Bregler, C.: Eﬃcient object localization using convolutional networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 648-656  22. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti-  mation. In: ECCV. (2016)  23. Andriluka, M., Pishchulin, L., Gehler, P., Schiele, B.: 2d human pose estimation:  New benchmark and state of the art analysis. In: CVPR. (2014)   PersonLab: Person Pose Estimation and Instance SegmentationReferences  1. Lin, T.Y., Cui, Y., Patterson, G., Ronchi, M.R., Bourdev, L., Girshick, R., Dollr,  P.: Coco 2016 keypoint challenge. (2016)  2. Newell, A., Deng, J.: Associative embedding: End-to-end learning for joint detec-  3. Li, Y., Qi, H., Dai, J., Ji, X., Wei, Y.: Fully convolutional instance-aware semantic  tion and grouping. In: NIPS. (2017)  segmentation. In: CVPR. (2017)  4. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. In: Proc. IEEE. (1998) 5. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  convolutional neural networks. In: NIPS. (2012)  Imagenet classification with deep  6. Fischler, M.A., Elschlager, R.: The representation and matching of pictorial struc-  tures. In: IEEE TOC. (1973)  7. Felzenszwalb, P., McAllester, D., Ramanan, D.: A discriminatively trained, multi-  scale, deformable part model. In: CVPR. (2008)  8. Andriluka, M., Roth, S., Schiele, B.: Pictorial structures revisited: People detection  and articulated pose estimation. In: CVPR. (2009)  9. Eichner, M., Ferrari, V.: Better appearance models for pictorial structures. In:  BMVC. (2009)  CVPR. (2010)  parts. In: CVPR. (2011)  10. Sapp, B., Jordan, C., B.Taskar: Adaptive pose priors for pictorial structures. In:  11. Yang, Y., Ramanan, D.: Articulated pose estimation with ﬂexible mixtures of  12. Dantone, M., Gall, J., Leistner, C., Gool., L.V.: Human pose estimation using  body parts dependent joint regressors. In: CVPR. (2013)  13. Johnson, S., Everingham, M.: Learning Eﬀective Human Pose Estimation from  Inaccurate Annotation. In: CVPR. (2011)  14. Pishchulin, L., Andriluka, M., Gehler, P., Schiele, B.: Poselet conditioned pictorial  15. Sapp, B., Taskar, B.: Modec: Multimodal decomposable models for human pose  structures. In: CVPR. (2013)  estimation. In: CVPR. (2013)  16. Gkioxari, G., Arbelaez, P., Bourdev, L., Malik, J.: Articulated pose estimation  using discriminative armlet classifiers. In: CVPR. (2013)  17. Toshev, A., Szegedy, C.: Deeppose: Human pose estimation via deep neural net-  works. In: CVPR. (2014)  18. Jain, A., Tompson, J., Andriluka, M., Taylor, G., Bregler, C.: Learning human  pose estimation features with convolutional networks. In: ICLR. (2014)  19. Tompson, J., Jain, A., LeCun, Y., Bregler, C.: Join training of a convolutional network and a graphical model for human pose estimation. In: NIPS. (2014) 20. Chen, X., Yuille, A.: Articulated pose estimation by a graphical model with image  dependent pairwise relations. In: NIPS. (2014)  21. Tompson, J., Goroshin, R., Jain, A., LeCun, Y., Bregler, C.: Eﬃcient object localization using convolutional networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 648-656  22. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti-  mation. In: ECCV. (2016)  23. Andriluka, M., Pishchulin, L., Gehler, P., Schiele, B.: 2d human pose estimation:  New benchmark and state of the art analysis. In: CVPR. (2014)   16  G. Papandreou, T. Zhu, L.-C. Chen, S. Gidaris, J. Tompson, K. Murphy  24. Bulat, A., Tzimiropoulos, G.: Human pose estimation via convolutional part  heatmap regression. In: ECCV. (2016)  25. Belagiannis, V., Zisserman, A.: Recurrent human pose estimation. In: arxiv. (2016) 26. Gkioxari, G., Toshev, A., Jaitly, N.: Chained predictions using convolutional neural  networks. In: ECCV. (2016)  27. Pishchulin, L., Insafutdinov, E., Tang, S., Andres, B., Andriluka, M., Gehler, P., Schiele, B.: Deepcut: Joint subset partition and labeling for multi person pose estimation. In: CVPR. (2016)  28. Insafutdinov, E., Pishchulin, L., Andres, B., Andriluka, M., Schiele, B.: Deepercut: In: ECCV.  A deeper, stronger, and faster multi-person pose estimation model. (2016)  29. Insafutdinov, E., Andriluka, M., Pishchulin, L., Tang, S., Andres, B., Schiele, B.:  Articulated multi-person tracking in the wild. arXiv:1612.01465 (2016)  30. Iqbal, U., Gall, J.: Multi-person pose estimation with local joint-to-person associ-  ations. In: ECCV Workshops, Crowd Understanding. (2016)  31. Wei, S.E., Ramakrishna, V., Kanade, T., Sheikh, Y.: Convolutional pose machines.  In: arXiv. (2016)  32. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR. (2017)  33. Papandreou, G., Zhu, T., Kanazawa, N., Toshev, A., Tompson, J., Bregler, C., Murphy, K.: Towards accurate multi-person pose estimation in the wild. In: CVPR. (2017)  34. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. arXiv:1703.06870v2  (2017)  ICCV. (2017)  35. Huang, S., Gong, M., Tao, D.: A coarse-fine network for keypoint localization. In:  36. Fang, H.S., Xie, S., Tai, Y.W., Lu, C.: RMPE: Regional multi-person pose esti-  mation. In: ICCV. (2017)  37. Chen, Y., Wang, Z., Peng, Y., Zhang, Z., Yu, G., Sun, J.: Cascaded pyramid  network for multi-person pose estimation. arXiv:1711.07319 (2017)  38. Girshick, R.: Fast r-cnn. In: ICCV. (2015) 1440-1448 39. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object  detection with region proposal networks. In: NIPS. (2015)  40. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully  convolutional networks. In: NIPS. (2016)  41. Carreira, J., Sminchisescu, C.: CPMC: Automatic object segmentation using con-  strained parametric min-cuts. PAMI 34(7) (2012) 1312-1328  42. Arbel´aez, P., Pont-Tuset, J., Barron, J.T., Marques, F., Malik, J.: Multiscale  combinatorial grouping. In: CVPR. (2014)  43. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Simultaneous detection and  44. Pinheiro, P.O., Collobert, R., Doll´ar, P.: Learning to segment object candidates.  45. Dai, J., He, K., Sun, J.: Convolutional feature masking for joint object and stuﬀ  46. Pinheiro, P.O., Lin, T.Y., Collobert, R., Doll´ar, P.: Learning to refine object  47. Dai, J., He, K., Li, Y., Ren, S., Sun, J.:  Instance-sensitive fully convolutional  segmentation. In: ECCV. (2014)  In: NIPS. (2015)  segmentation. In: CVPR. (2015)  segments. In: ECCV. (2016)  networks. In: ECCV. (2016)  48. Dai, J., He, K., Sun, J.:  Instance-aware semantic segmentation via multi-task  network cascades. In: CVPR. (2016)   PersonLab: Person Pose Estimation and Instance Segmentation49. Peng, C., Xiao, T., Li, Z., Jiang, Y., Zhang, X., Jia, K., Yu, G., Sun, J.: Megdet:  A large mini-batch object detector. (2018)  50. Chen, L.C., Hermans, A., Papandreou, G., Schroﬀ, F., Wang, P., Adam, H.: Masklab: Instance segmentation by refining object detection with semantic and direction features. In: CVPR. (2018)  51. Liu, S., Qi, L., Qin, H., Shi, J., Jia, J.: Path aggregation network for instance  segmentation. In: CVPR. (2018)  52. Liang, X., Wei, Y., Shen, X., Yang, J., Lin, L., Yan, S.: Proposal-free network for instance-level object segmentation. arXiv preprint arXiv:1509.02636 (2015) 53. Uhrig, J., Cordts, M., Franke, U., Brox, T.: Pixel-level encoding and depth layering  for instance-level semantic labeling. arXiv:1604.05096 (2016)  54. Zhang, Z., Schwing, A.G., Fidler, S., Urtasun, R.: Monocular object instance  segmentation and depth ordering with cnns. In: ICCV. (2015)  55. Zhang, Z., Fidler, S., Urtasun, R.:  Instance-level segmentation for autonomous  driving with deep densely connected mrfs. In: CVPR. (2016)  56. Wu, Z., Shen, C., van den Hengel, A.: Bridging category-level and instance-level  semantic image segmentation. arXiv:1605.06885 (2016)  57. Liu, S., Qi, X., Shi, J., Zhang, H., Jia, J.: Multi-scale patch aggregation (mpa) for  simultaneous detection and segmentation. In: CVPR. (2016)  58. Levinkov, E., Uhrig, J., Tang, S., Omran, M., Insafutdinov, E., Kirillov, A., Rother, C., Brox, T., Schiele, B., Andres, B.: Joint graph decomposition & node labeling: Problem, algorithms, applications. In: CVPR. (2017)  59. Kirillov, A., Levinkov, E., Andres, B., Savchynskyy, B., Rother, C.: Instancecut:  from edges to instances with multicut. In: CVPR. (2017)  60. Jin, L., Chen, Z., Tu, Z.: Object detection free instance segmentation with labeling  transformations. arXiv:1611.08991 (2016)  61. Fathi, A., Wojna, Z., Rathod, V., Wang, P., Song, H.O., Guadarrama, S., Murphy, K.P.: Semantic instance segmentation via deep metric learning. arXiv:1703.10277 (2017)  62. De Brabandere, B., Neven, D., Van Gool, L.: Semantic instance segmentation with  a discriminative loss function. arXiv:1708.02551 (2017)  63. Bai, M., Urtasun, R.: Deep watershed transform for instance segmentation. In:  CVPR. (2017)  64. Liu, S., Jia, J., Fidler, S., Urtasun, R.: Sgn: Sequential grouping networks for  instance segmentation. In: ICCV. (2017)  65. Bodla, N., Singh, B., Chellappa, R., Davis, L.S.: Soft-nms: Improving object de-  tection with one line of code. In: ICCV. (2017)  66. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  segmentation. In: CVPR. (2015)  67. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Semantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. TPAMI (2017)  68. Radosavovic, I., Doll´ar, P., Girshick, R., Gkioxari, G., He, K.: Data distillation:  Towards omni-supervised learning. arXiv:1712.04440 (2017)  69. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: ECCV. (2014) 740-755  70. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. (2016)   18  G. Papandreou, T. Zhu, L.-C. Chen, S. Gidaris, J. Tompson, K. Murphy  71. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., Berg, A.C., Fei-Fei, L.: ImageNet Large Scale Visual Recognition Challenge. IJCV 115(3) (2015) 211-252  72. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. arXiv:1502.03167 (2015)  73. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., et al.: TensorFlow: Large-scale machine learning on heterogeneous systems (2015) Software available from tensor- ﬂow.org."}