{"1": "1. Bousmalis, K., Silberman, N., Dohan, D., Erhan, D., Krishnan, D.: Unsupervised pixel-level domain adaptation with generative adversarial networks. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017) 4 2. Chang, A.X., Funkhouser, T.A., Guibas, L.J., Hanrahan, P., Huang, Q., Li, Z., Savarese, S., Savva, M., Song, S., Su, H., Xiao, J., Yi, L., Yu, F.: Shapenet: An information-rich 3d model repository. CoRR abs/1512.03012 (2015) 2, 3, 4, 10, 11, 12  3. Choi, S., Zhou, Q.Y., Miller, S., Koltun, V.: A large dataset of object scans.  arXiv:1602.02481 (2016) 1, 2, 3, 10, 11, 12, 13  4. Choy, C.B., Xu, D., Gwak, J., Chen, K., Savarese, S.: 3d-r2n2: A unified approach for single and multi-view 3d object reconstruction. In: Proceedings of the European Conference on Computer Vision (ECCV) (2016) 4  5. Cignoni, P., Callieri, M., Corsini, M., Dellepiane, M., Ganovelli, F., Ranzuglia, G.: Meshlab: an open-source mesh processing tool. In: Eurographics Italian Chapter Conference. vol. 2008, pp. 129-136 (2008) 10  6. Csurka, G.: Domain adaptation for visual applications: A comprehensive survey.  CoRR abs/1702.05374 (2017) 4  7. Fish Tung, H.Y., Harley, A.W., Seto, W., Fragkiadaki, K.: Adversarial inverse graphics networks: Learning 2d-to-3d lifting and image-to-image translation from unpaired supervision. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017) 3, 4  8. Gebru, T., Hoﬀman, J., Fei-Fei, L.: Fine-grained recognition in the wild: A multi- task domain adaptation approach. In: The IEEE International Conference on Com- puter Vision (ICCV) (Oct 2017) 4  9. Gholami, B., (Oggi) Rudovic, O., Pavlovic, V.: Punda: Probabilistic unsupervised domain adaptation for knowledge transfer across visual categories. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017) 4  10. Gupta, S., Arbel´aez, P.A., Girshick, R.B., Malik, J.: Aligning 3D models to RGB-D images of cluttered scenes. In: Computer Vision and Pattern Recognition (CVPR) (2015) 1  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016) 11  12. Herath, S., Harandi, M., Porikli, F.: Learning an invariant hilbert space for domain adaptation. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017) 4  13. Horn, B.K.P.: Closed-form solution of absolute orientation using unit quaternions.  Journal of the Optical Society of America A 4(4), 629-642 (1987) 6  14. Ionescu, C., Papava, D., Olaru, V., Sminchisescu, C.: Human3.6m: Large scale datasets and predictive methods for 3d human sensing in natural environments. IEEE Transactions on Pattern Analysis and Machine Intelligence 36(7) (jul 2014) 13  15. Kalogerakis, E., Averkiou, M., Maji, S., Chaudhuri, S.: 3d shape segmentation  with projective convolutional networks. CoRR abs/1612.02808 (2016) 4  16. Koniusz, P., Tas, Y., Porikli, F.: Domain adaptation by mixture of alignments of second- or higher-order scatter tensors. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017) 4   3D Keypoints via View ConsistencyReferences  1. Bousmalis, K., Silberman, N., Dohan, D., Erhan, D., Krishnan, D.: Unsupervised pixel-level domain adaptation with generative adversarial networks. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017) 4 2. Chang, A.X., Funkhouser, T.A., Guibas, L.J., Hanrahan, P., Huang, Q., Li, Z., Savarese, S., Savva, M., Song, S., Su, H., Xiao, J., Yi, L., Yu, F.: Shapenet: An information-rich 3d model repository. CoRR abs/1512.03012 (2015) 2, 3, 4, 10, 11, 12  3. Choi, S., Zhou, Q.Y., Miller, S., Koltun, V.: A large dataset of object scans.  arXiv:1602.02481 (2016) 1, 2, 3, 10, 11, 12, 13  4. Choy, C.B., Xu, D., Gwak, J., Chen, K., Savarese, S.: 3d-r2n2: A unified approach for single and multi-view 3d object reconstruction. In: Proceedings of the European Conference on Computer Vision (ECCV) (2016) 4  5. Cignoni, P., Callieri, M., Corsini, M., Dellepiane, M., Ganovelli, F., Ranzuglia, G.: Meshlab: an open-source mesh processing tool. In: Eurographics Italian Chapter Conference. vol. 2008, pp. 129-136 (2008) 10  6. Csurka, G.: Domain adaptation for visual applications: A comprehensive survey.  CoRR abs/1702.05374 (2017) 4  7. Fish Tung, H.Y., Harley, A.W., Seto, W., Fragkiadaki, K.: Adversarial inverse graphics networks: Learning 2d-to-3d lifting and image-to-image translation from unpaired supervision. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017) 3, 4  8. Gebru, T., Hoﬀman, J., Fei-Fei, L.: Fine-grained recognition in the wild: A multi- task domain adaptation approach. In: The IEEE International Conference on Com- puter Vision (ICCV) (Oct 2017) 4  9. Gholami, B., (Oggi) Rudovic, O., Pavlovic, V.: Punda: Probabilistic unsupervised domain adaptation for knowledge transfer across visual categories. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017) 4  10. Gupta, S., Arbel´aez, P.A., Girshick, R.B., Malik, J.: Aligning 3D models to RGB-D images of cluttered scenes. In: Computer Vision and Pattern Recognition (CVPR) (2015) 1  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016) 11  12. Herath, S., Harandi, M., Porikli, F.: Learning an invariant hilbert space for domain adaptation. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017) 4  13. Horn, B.K.P.: Closed-form solution of absolute orientation using unit quaternions.  Journal of the Optical Society of America A 4(4), 629-642 (1987) 6  14. Ionescu, C., Papava, D., Olaru, V., Sminchisescu, C.: Human3.6m: Large scale datasets and predictive methods for 3d human sensing in natural environments. IEEE Transactions on Pattern Analysis and Machine Intelligence 36(7) (jul 2014) 13  15. Kalogerakis, E., Averkiou, M., Maji, S., Chaudhuri, S.: 3d shape segmentation  with projective convolutional networks. CoRR abs/1612.02808 (2016) 4  16. Koniusz, P., Tas, Y., Porikli, F.: Domain adaptation by mixture of alignments of second- or higher-order scatter tensors. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017) 4   16  Zhou X., Karpur A., Gan, C., Luo L., Huang Q.  17. Li, Y., Dai, A., Guibas, L., Nießner, M.: Database-assisted object retrieval for real-time 3d reconstruction. In: Computer Graphics Forum. vol. 34. Wiley Online Library (2015) 1  18. Maria Carlucci, F., Porzi, L., Caputo, B., Ricci, E., Rota Bulo, S.: Autodial: Au- tomatic domain alignment layers. In: The IEEE International Conference on Com- puter Vision (ICCV) (Oct 2017) 4  19. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti- mation. In: ECCV (8). Lecture Notes in Computer Science, vol. 9912, pp. 483-499. Springer (2016) 3  20. Panareda Busto, P., Gall, J.: Open set domain adaptation. In: The IEEE Interna-  tional Conference on Computer Vision (ICCV) (Oct 2017) 4  21. Peng, X., Sun, B., Ali, K., Saenko, K.: Learning deep object detectors from 3d  models. In: ICCV. pp. 1278-1286. IEEE Computer Society (2015) 4  22. Qi, C.R., Su, H., Nießner, M., Dai, A., Yan, M., Guibas, L.J.: Volumetric and multi-view cnns for object classification on 3d data. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5648-5656 (2016) 3, 10, 11, 12  23. Rhodin, H., Sprri, J., Katircioglu, I., Constantin, V., Meyer, F., Mller, E., Salz- mann, M., Fua, P.: Learning monocular 3d human pose estimation from multi-view images. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2018) 4  24. Sankaranarayanan, S., Balaji, Y., Castillo, C.D., Chellappa, R.: Generate to adapt: Aligning domains using generative adversarial networks. CoRR abs/1704.01705 (2017) 4  25. Simon, T., Joo, H., Matthews, I., Sheikh, Y.: Hand keypoint detection in single images using multiview bootstrapping. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017) 3, 4  26. Song, S., Xiao, J.: Sliding shapes for 3d object detection in depth images. In: ECCV (6). Lecture Notes in Computer Science, vol. 8694, pp. 634-651. Springer (2014) 4 27. Song, S., Xiao, J.: Deep Sliding Shapes for amodal 3D object detection in RGB-D  images (2016) 4  28. Song, S., Yu, F., Zeng, A., Chang, A.X., Savva, M., Funkhouser, T.: Semantic scene completion from a single depth image. Proceedings of 30th IEEE Conference on Computer Vision and Pattern Recognition (2017) 4  29. Su, H., Qi, C.R., Li, Y., Guibas, L.J.: Render for cnn: Viewpoint estimation in im- ages using cnns trained with rendered 3d model views. In: The IEEE International Conference on Computer Vision (ICCV) (December 2015) 4  30. Su, H., Wang, F., Yi, E., Guibas, L.J.: 3d-assisted feature synthesis for novel views  of an object. In: ICCV. pp. 2677-2685. IEEE Computer Society (2015) 4  31. Sun, X., Shang, J., Liang, S., Wei, Y.: Compositional human pose regression. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017) 7, 13 32. Tatarchenko, M., Dosovitskiy, A., Brox, T.: Multi-view 3d models from single im- ages with a convolutional network. In: ECCV (7). Lecture Notes in Computer Science, vol. 9911, pp. 322-337. Springer (2016) 4  33. Tulsiani, S., Malik, J.: Viewpoints and keypoints. CoRR abs/1411.6067 (2014) 1 34. Tulsiani, S., Zhou, T., Efros, A.A., Malik, J.: Multi-view supervision for single-view reconstruction via diﬀerentiable ray consistency. CoRR abs/1704.06254 (2017) 4  35. Tzeng, E., Hoﬀman, J., Saenko, K., Darrell, T.: Adversarial discriminative domain  adaptation. arXiv preprint arXiv:1702.05464 (2017) 3, 11, 12, 13   3D Keypoints via View Consistency36. Tzeng, E., Hoﬀman, J., Saenko, K., Darrell, T.: Adversarial discriminative domain adaptation. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017) 4  37. Wu, J., Xue, T., Lim, J.J., Tian, Y., Tenenbaum, J.B., Torralba, A., Freeman, W.T.: Single image 3d interpreter network. CoRR abs/1604.08685 (2016) 10 38. Wu, Z., Song, S., Khosla, A., Yu, F., Zhang, L., Tang, X., Xiao, J.: 3d shapenets: A deep representation for volumetric shapes. In: CVPR. pp. 1912-1920 (2015) 2, 3, 4, 10, 11, 12  39. Yan, H., Ding, Y., Li, P., Wang, Q., Xu, Y., Zuo, W.: Mind the class weight bias: Weighted maximum mean discrepancy for unsupervised domain adaptation. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017) 4  40. Yan, X., Yang, J., Yumer, E., Guo, Y., Lee, H.: Perspective transformer nets: Learning single-view 3d object reconstruction without 3d supervision. CoRR abs/1612.00814 (2016) 4  41. Zhang, Y., David, P., Gong, B.: Curriculum domain adaptation for semantic seg- mentation of urban scenes. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017) 4  42. Zhang, Y., Song, S., Yumer, E., Savva, M., Lee, J.Y., Jin, H., Funkhouser, T.: Physically-based rendering for indoor scene understanding using convolutional neu- ral networks. The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017) 4  43. Zhao, B., Wu, X., Cheng, Z., Liu, H., Feng, J.: Multi-view image generation from  a single-view. CoRR abs/1704.04886 (2017) 4  44. Zhou, T., Tulsiani, S., Sun, W., Malik, J., Efros, A.A.: View synthesis by appear-  ance ﬂow. In: ECCV (2016) 4  45. Zhou, X., Huang, Q., Sun, X., Xue, X., Wei, Y.: Towards 3d human pose estimation in the wild: A weakly-supervised approach. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017) 3, 4, 7"}