{"1": "1. Opennn library. http://www.opennn.net/ 2. de Aguiar, E., Sigal, L., Treuille, A., Hodgins, J.K.: Stable spaces for real-time  clothing. ACM Transactions on Graphics 29(4) (2010)  3. de Aguiar, E., Stoll, C., Theobalt, C., Ahmed, N., Seidel, H.P., Thrun, S.: Per- formance capture from sparse multi-view video. ACM Transactions on Graphics 27(3) (2008)  4. Allain, B., Franco, J.S., Boyer, E.: An eﬃcient volumetric framework for shape tracking. In: Conference on Computer Vision and Pattern Recognition (2015) 5. Anguelov, D., Srinivasan, P., Koller, D., Thrun, S., Rodgers, J., Davis, J.: SCAPE: shape completion and animation of people. ACM Transactions on Graphics 24(3) (2005)  6. B˘alan, A., Black, M.: The naked truth: Estimating body shape under clothing.  European Conference on Computer Vision (2008)  7. Baraﬀ, D., Witkin, A.: Large steps in cloth simulation. In: Conference on Computer  Graphics and Interactive Techniques (1998)  8. Bogo, F., Kanazawa, A., Lassner, C., Gehler, P., Romero, J., Black, M.J.: Keep it smpl: Automatic estimation of 3d human pose and shape from a single image. In: European Conference on Computer Vision (2016)  9. Bridson, R., Marino, S., Fedkiw, R.: Simulation of clothing with folds and wrinkles.  In: Symposium on Computer Animation (2003)  10. Collet, A., Chuang, M., Sweeney, P., Gillett, D., Evseev, D., Calabrese, D., Hoppe, H., Kirk, A., Sullivan, S.: High-quality streamable free-viewpoint video. ACM Transactions on Graphics 34(4) (2015)  11. Dibra, E., Jain, H., ¨Oztireli, A.C., Ziegler, R., Gross, M.H.: Hs-nets: Estimating human body shape from silhouettes with convolutional neural networks. In: Inter- national Conference on 3D Vision (2016)  12. Dibra, E., Jain, H., ¨Oztireli, A.C., Ziegler, R., Gross, M.H.: Human shape from silhouettes using generative hks descriptors and cross-modal neural networks. In: Conference on Computer Vision and Pattern Recognition (2017)  13. Dibra, E., ¨Oztireli, A.C., Ziegler, R., Gross, M.H.: Shape from selfies: Human body shape estimation using CCA regression forests. In: European Conference of Computer Vision (2016)  14. Gall, J., Stoll, C., De Aguiar, E., Theobalt, C., Rosenhahn, B., Seidel, H.P.: Motion capture using joint skeleton tracking and surface estimation. In: Conference on Computer Vision and Pattern Recognition (2009)  15. Guan, P., Reiss, L., Hirshberg, D.A., Weiss, A., Black, M.J.: Drape: Dressing any  person. ACM Transactions on Graphics 31(4) (2012)  16. Hasler, N., Stoll, C., Rosenhahn, B., Thorm¨ahlen, T., Seidel, H.P.: Estimating  body shape of dressed humans. Computers & Graphics 33(3) (2009)  17. Kaldor, J.M., James, D.L., Marschner, S.: Eﬃcient yarn-based cloth with adaptive  contact linearization. ACM Transactions on Graphics 29(4) (2010)  18. Li, H., Adams, B., Guibas, L., Pauly, M.: Robust single-view geometry and motion  reconstruction. ACM Transactions on Graphics 28(5) (2009)  19. Li, J., Daviet, G., Narain, R., Bertails-Descoubes, F., Brown, G.E., Overby, M., Boissieux, L.: An implicit frictional contact solver for adaptive cloth simulation. ACM Transactions on Graphics 37(4) (2018)  20. Loper, M., Mahmood, N., Romero, J., Pons-Moll, G., Black, M.: SMPL: A skinned  multi-person linear model. ACM Transactions on Graphics 34(6) (2015)   Analyzing Clothing Layer Deformation StatisticsReferences  1. Opennn library. http://www.opennn.net/ 2. de Aguiar, E., Sigal, L., Treuille, A., Hodgins, J.K.: Stable spaces for real-time  clothing. ACM Transactions on Graphics 29(4) (2010)  3. de Aguiar, E., Stoll, C., Theobalt, C., Ahmed, N., Seidel, H.P., Thrun, S.: Per- formance capture from sparse multi-view video. ACM Transactions on Graphics 27(3) (2008)  4. Allain, B., Franco, J.S., Boyer, E.: An eﬃcient volumetric framework for shape tracking. In: Conference on Computer Vision and Pattern Recognition (2015) 5. Anguelov, D., Srinivasan, P., Koller, D., Thrun, S., Rodgers, J., Davis, J.: SCAPE: shape completion and animation of people. ACM Transactions on Graphics 24(3) (2005)  6. B˘alan, A., Black, M.: The naked truth: Estimating body shape under clothing.  European Conference on Computer Vision (2008)  7. Baraﬀ, D., Witkin, A.: Large steps in cloth simulation. In: Conference on Computer  Graphics and Interactive Techniques (1998)  8. Bogo, F., Kanazawa, A., Lassner, C., Gehler, P., Romero, J., Black, M.J.: Keep it smpl: Automatic estimation of 3d human pose and shape from a single image. In: European Conference on Computer Vision (2016)  9. Bridson, R., Marino, S., Fedkiw, R.: Simulation of clothing with folds and wrinkles.  In: Symposium on Computer Animation (2003)  10. Collet, A., Chuang, M., Sweeney, P., Gillett, D., Evseev, D., Calabrese, D., Hoppe, H., Kirk, A., Sullivan, S.: High-quality streamable free-viewpoint video. ACM Transactions on Graphics 34(4) (2015)  11. Dibra, E., Jain, H., ¨Oztireli, A.C., Ziegler, R., Gross, M.H.: Hs-nets: Estimating human body shape from silhouettes with convolutional neural networks. In: Inter- national Conference on 3D Vision (2016)  12. Dibra, E., Jain, H., ¨Oztireli, A.C., Ziegler, R., Gross, M.H.: Human shape from silhouettes using generative hks descriptors and cross-modal neural networks. In: Conference on Computer Vision and Pattern Recognition (2017)  13. Dibra, E., ¨Oztireli, A.C., Ziegler, R., Gross, M.H.: Shape from selfies: Human body shape estimation using CCA regression forests. In: European Conference of Computer Vision (2016)  14. Gall, J., Stoll, C., De Aguiar, E., Theobalt, C., Rosenhahn, B., Seidel, H.P.: Motion capture using joint skeleton tracking and surface estimation. In: Conference on Computer Vision and Pattern Recognition (2009)  15. Guan, P., Reiss, L., Hirshberg, D.A., Weiss, A., Black, M.J.: Drape: Dressing any  person. ACM Transactions on Graphics 31(4) (2012)  16. Hasler, N., Stoll, C., Rosenhahn, B., Thorm¨ahlen, T., Seidel, H.P.: Estimating  body shape of dressed humans. Computers & Graphics 33(3) (2009)  17. Kaldor, J.M., James, D.L., Marschner, S.: Eﬃcient yarn-based cloth with adaptive  contact linearization. ACM Transactions on Graphics 29(4) (2010)  18. Li, H., Adams, B., Guibas, L., Pauly, M.: Robust single-view geometry and motion  reconstruction. ACM Transactions on Graphics 28(5) (2009)  19. Li, J., Daviet, G., Narain, R., Bertails-Descoubes, F., Brown, G.E., Overby, M., Boissieux, L.: An implicit frictional contact solver for adaptive cloth simulation. ACM Transactions on Graphics 37(4) (2018)  20. Loper, M., Mahmood, N., Romero, J., Pons-Moll, G., Black, M.: SMPL: A skinned  multi-person linear model. ACM Transactions on Graphics 34(6) (2015)   16  J. Yang et al.  21. Neophytou, A., Hilton, A.: Shape and pose space deformation for subject specific  animation. In: International Conference on 3D Vision (2013)  22. Neophytou, A., Hilton, A.: A layered model of human body and garment deforma-  tion. In: International Conference on 3D Vision (2014)  23. Newcombe, R.A., Fox, D., Seitz, S.M.: Dynamicfusion: Reconstruction and tracking of non-rigid scenes in real-time. In: Conference on Computer Vision and Pattern Recognition (2015)  24. Pishchulin, L., Wuhrer, S., Helten, T., Theobalt, C., Schiele, B.: Building statistical  shape spaces for 3d human modeling. Pattern Recognition 67 (2017)  25. Pons-Moll, G., Pujades, S., Hu, S., Black, M.: Clothcap: Seamless 4d clothing  capture and retargeting. ACM Transactions on Graphics 36(4) (2017)  26. Rhodin, H., Robertini, N., Casas, D., Richardt, C., Seidel, H.P., Theobalt, C.: General automatic human shape and motion capture using volumetric contour cues. In: European Conference on Computer Vision (2016)  27. Shehu, A., Yang, J., Franco, J.S., H´etroy-Wheeler, F., Wuhrer, S.: Computing temporal alignments of human motion sequences in wide clothing using geodesic patches. In: International Conference on 3D Vision (2016)  28. Sidenbladh, H., Black, M.J., Fleet, D.J.: Stochastic tracking of 3d human figures using 2d image motion. In: European Conference on Computer Vision (2000) 29. Sigal, L., Balan, A.O., Black, M.J.: Humaneva: Synchronized video and motion capture dataset and baseline algorithm for evaluation of articulated human motion. International Journal of Computer Vision 87(4) (2010)  30. Sigal, L., Mahler, M., Diaz, S., McIntosh, K., Carter, E., Richards, T., Hodgins, J.: A perceptual control space for garment simulation. ACM Transactions on Graphics 34(4) (2015)  31. Sminchisescu, C., Triggs, B.: Estimating articulated human motion with covariance scaled sampling. The International Journal of Robotics Research 22(6) (2003) 32. Stoll, C., Gall, J., De Aguiar, E., Thrun, S., Theobalt, C.: Video-based recon- struction of animatable human characters. ACM Transactions on Graphics 29(6) (2010)  33. Vlasic, D., Baran, I., Matusik, W., Popovi´c, J.: Articulated mesh animation from  multi-view silhouettes. ACM Transactions on Graphics 27(3) (2008)  34. Volino, P., Magnenat-Thalmann, N., Faure, F.: A simple approach to nonlinear tensile stiﬀness for accurate cloth simulation. ACM Transactions on Graphics 28(4) (2009)  35. Wang, H., O’Brien, J.F., Ramamoorthi, R.: Data-driven elastic models for cloth:  modeling and measurement. ACM Transactions on Graphics 30(4) (2011)  36. Wuhrer, S., Pishchulin, L., Brunton, A., Shu, C., Lang, J.: Estimation of human body shape and posture under clothing. Computer Vision and Image Understand- ing 127 (2014)  37. Xu, W., Umentani, N., Chao, Q., Mao, J., Jin, X., Tong, X.: Sensitivity-optimized rigging for example-based real-time clothing synthesis. ACM Transactions on Graphics 33(4) (2014)  38. Yang, J., Franco, J.S., H´etroy-Wheeler, F., Wuhrer, S.: Estimation of human body shape in motion with wide clothing. In: European Conference on Computer Vision (2016)  39. Zaharescu, A., Boyer, E., Varanasi, K., Horaud, R.: Surface feature detection and description with applications to mesh matching. In: Conference on Computer Vi- sion and Pattern Recognition (2009)   Analyzing Clothing Layer Deformation Statistics40. Zhang, C., Pujades, S., Black, M., Pons-Moll, G.: Detailed, accurate, human shape estimation from clothed 3d scan sequences. In: Conference on Computer Vision and Pattern Recognition (2017)  41. Zuﬃ, S., Black, M.J.: The stitched puppet: A graphical model of 3d human shape and pose. In: Conference on Computer Vision and Pattern Recognition (2015)"}