{"1": "1. Abu-El-Haija, S., Kothari, N., Lee, J., Natsev, P., Toderici, G., Varadarajan, B., Vijayanarasimhan, S.: Youtube-8m: A large-scale video classification benchmark. arXiv preprint arXiv:1609.08675 (2016)  2. Bengio, S., Vinyals, O., Jaitly, N., Shazeer, N.: Scheduled sampling for sequence prediction with recurrent neural networks. In: Advances in Neural Information Processing Systems. pp. 1171-1179 (2015)  3. Bengio, Y., Simard, P., Frasconi, P.: Learning long-term dependencies with gradient descent is diﬃcult. IEEE transactions on neural networks 5(2), 157-166 (1994) 4. Brox, T., Malik, J.: Object segmentation by long term analysis of point trajectories.  In: ECCV. pp. 282-295 (2010)  5. Brox, T., Malik, J.: Object segmentation by long term analysis of point trajectories.  In: European conference on computer vision. pp. 282-295. Springer (2010)  6. Caelles, S., Maninis, K.K., Pont-Tuset, J., Leal-Taix´e, L., Cremers, D., Van Gool,  L.: One-shot video object segmentation. In: CVPR (2017)  7. Chen, L., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. In: IEEE T-PAMI. vol. 40, pp. 834-848 (2018)  8. Cheng, J., Tsai, Y.H., Wang, S., Yang, M.H.: Segﬂow: Joint learning for video object segmentation and optical ﬂow. In: IEEE International Conference on Com- puter Vision (ICCV) (2017)  9. Cho, K., Van Merri¨enboer, B., Gulcehre, C., Bahdanau, D., Bougares, F., Schwenk, H., Bengio, Y.: Learning phrase representations using rnn encoder-decoder for statistical machine translation. arXiv preprint arXiv:1406.1078 (2014)  10. Donahue, J., Anne Hendricks, L., Guadarrama, S., Rohrbach, M., Venugopalan, S., Saenko, K., Darrell, T.: Long-term recurrent convolutional networks for visual recognition and description. In: CVPR (2015)  11. Dutt Jain, S., Xiong, B., Grauman, K.: Fusionseg: Learning to combine motion and appearance for fully automatic segmentation of generic objects in videos. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017)  12. Faktor, A., Irani, M.: Video segmentation by non-local consensus voting. In: BMVC  (2014)  13. Fan, Q., Zhong, F., Lischinski, D., Cohen-Or, D., Chen, B.: Jumpcut:non-successive mask transfer and interpolation for video cutout. In: ACM Trans. Graph., 34(6) (2015)  14. Finn, C., Goodfellow, I., Levine, S.: Unsupervised learning for physical interaction through video prediction. In: Advances in neural information processing systems (2016)  15. Galasso, F., Nagaraja, N.S., C´ardenas, T.J., Brox, T., Schiele, B.: A unified video segmentation benchmark: Annotation, metrics and analysis. In: ICCV. IEEE (2013)  16. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward neural networks. In: Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics. pp. 249-256 (2010)  17. Heilbron, F.C., Escorcia, V., Ghanem, B., Niebles, J.C.: Activitynet: A large-scale video benchmark for human activity understanding. In: Computer Vision and Pat- tern Recognition (CVPR), 2015 IEEE Conference on. pp. 961-970. IEEE (2015)   YouTube-VOSReferences  1. Abu-El-Haija, S., Kothari, N., Lee, J., Natsev, P., Toderici, G., Varadarajan, B., Vijayanarasimhan, S.: Youtube-8m: A large-scale video classification benchmark. arXiv preprint arXiv:1609.08675 (2016)  2. Bengio, S., Vinyals, O., Jaitly, N., Shazeer, N.: Scheduled sampling for sequence prediction with recurrent neural networks. In: Advances in Neural Information Processing Systems. pp. 1171-1179 (2015)  3. Bengio, Y., Simard, P., Frasconi, P.: Learning long-term dependencies with gradient descent is diﬃcult. IEEE transactions on neural networks 5(2), 157-166 (1994) 4. Brox, T., Malik, J.: Object segmentation by long term analysis of point trajectories.  In: ECCV. pp. 282-295 (2010)  5. Brox, T., Malik, J.: Object segmentation by long term analysis of point trajectories.  In: European conference on computer vision. pp. 282-295. Springer (2010)  6. Caelles, S., Maninis, K.K., Pont-Tuset, J., Leal-Taix´e, L., Cremers, D., Van Gool,  L.: One-shot video object segmentation. In: CVPR (2017)  7. Chen, L., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. In: IEEE T-PAMI. vol. 40, pp. 834-848 (2018)  8. Cheng, J., Tsai, Y.H., Wang, S., Yang, M.H.: Segﬂow: Joint learning for video object segmentation and optical ﬂow. In: IEEE International Conference on Com- puter Vision (ICCV) (2017)  9. Cho, K., Van Merri¨enboer, B., Gulcehre, C., Bahdanau, D., Bougares, F., Schwenk, H., Bengio, Y.: Learning phrase representations using rnn encoder-decoder for statistical machine translation. arXiv preprint arXiv:1406.1078 (2014)  10. Donahue, J., Anne Hendricks, L., Guadarrama, S., Rohrbach, M., Venugopalan, S., Saenko, K., Darrell, T.: Long-term recurrent convolutional networks for visual recognition and description. In: CVPR (2015)  11. Dutt Jain, S., Xiong, B., Grauman, K.: Fusionseg: Learning to combine motion and appearance for fully automatic segmentation of generic objects in videos. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017)  12. Faktor, A., Irani, M.: Video segmentation by non-local consensus voting. In: BMVC  (2014)  13. Fan, Q., Zhong, F., Lischinski, D., Cohen-Or, D., Chen, B.: Jumpcut:non-successive mask transfer and interpolation for video cutout. In: ACM Trans. Graph., 34(6) (2015)  14. Finn, C., Goodfellow, I., Levine, S.: Unsupervised learning for physical interaction through video prediction. In: Advances in neural information processing systems (2016)  15. Galasso, F., Nagaraja, N.S., C´ardenas, T.J., Brox, T., Schiele, B.: A unified video segmentation benchmark: Annotation, metrics and analysis. In: ICCV. IEEE (2013)  16. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward neural networks. In: Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics. pp. 249-256 (2010)  17. Heilbron, F.C., Escorcia, V., Ghanem, B., Niebles, J.C.: Activitynet: A large-scale video benchmark for human activity understanding. In: Computer Vision and Pat- tern Recognition (CVPR), 2015 IEEE Conference on. pp. 961-970. IEEE (2015)   16  N. Xu et al .  9(8), 1735-1780 (1997)  tation. In: NIPS (2017)  18. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural computation  19. Hu, Y.T., Huang, J.B., Schwing, A.: Maskrnn: Instance level video object segmen-  20. Ilg, E., Mayer, N., Saikia, T., Keuper, M., Dosovitskiy, A., Brox, T.: Flownet 2.0:  Evolution of optical ﬂow estimation with deep networks. CVPR (2017)  21. Jain, S.D., Grauman, K.: Supervoxel-consistent foreground propagation in video.  22. Jampani, V., Gadde, R., Gehler, P.V.: Video propagation networks. In: CVPR  In: ECCV (2014)  (2017)  23. Jozefowicz, R., Zaremba, W., Sutskever, I.: An empirical exploration of recur- rent network architectures. In: International Conference on Machine Learning. pp. 2342-2350 (2015)  24. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  25. Kr¨ahenb¨uhl, P., Koltun, V.: Eﬃcient inference in fully connected crfs with gaussian  edge potentials. In: NIPS. pp. 109-117 (2011)  26. Li, F., Kim, T., Humayun, A., Tsai, D., Rehg, J.M.: Video segmentation by track-  ing many figure-ground segments. In: ICCV (2013)  27. M¨arki, N., Perazzi, F., Wang, O., Sorkine-Hornung, A.: Bilateral space video seg-  mentation. In: CVPR (2016)  28. Nagaraja, N.S., Schmidt, F.R., Brox, T.: Video segmentation with just a few  strokes. In: ICCV. pp. 3235-3243 (2015)  29. Nair, V., Hinton, G.E.: Rectified linear units improve restricted boltzmann ma- chines. In: Proceedings of the 27th international conference on machine learning (ICML-10). pp. 807-814 (2010)  30. Ochs, P., Malik, J., Brox, T.: Segmentation of moving objects by long term video analysis. IEEE transactions on pattern analysis and machine intelligence 36(6), 1187-1200 (2014)  31. Papazoglou, A., Ferrari, V.: Fast object segmentation in unconstrained video. In: Computer Vision (ICCV), 2013 IEEE International Conference on. pp. 1777-1784. IEEE (2013)  32. Perazzi, F., Khoreva, A., Benenson, R., Schiele, B., A.Sorkine-Hornung: Learning  video object segmentation from static images. In: CVPR (2017)  33. Perazzi, F., Pont-Tuset, J., McWilliams, B., Van Gool, L., Gross, M., Sorkine- Hornung, A.: A benchmark dataset and evaluation methodology for video object segmentation. In: CVPR (2016)  34. Pont-Tuset, J., Perazzi, F., Caelles, S., Arbel´aez, P., Sorkine-Hornung, A., Van Gool, L.: The 2017 davis challenge on video object segmentation. arXiv:1704.00675 (2017)  35. Revaud, J., Weinzaepfel, P., Harchaoui, Z., Schmid, C.: Epicﬂow: Edge-preserving  interpolation of correspondences for optical ﬂow. In: CVPR (2015)  36. Shelhamer, E., Long, J., Darrell, T.: Fully convolutional networks for semantic seg- mentation. IEEE transactions on pattern analysis and machine intelligence 39(4), 640-651 (2017)  37. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)  38. Srivastava, N., Mansimov, E., Salakhudinov, R.: Unsupervised learning of video representations using lstms. In: International conference on machine learning (2015)   YouTube-VOS39. Sutskever, I., Vinyals, O., Le, Q.V.: Sequence to sequence learning with neural networks. In: Advances in neural information processing systems. pp. 3104-3112 (2014)  40. Tokmakov, P., Alahari, K., Schmid, C.: Learning motion patterns in videos. In:  41. Tokmakov, P., Alahari, K., Schmid, C.: Learning video object segmentation with  CVPR (2017)  visual memory. In: ICCV (2017)  42. Tran, D., Bourdev, L., Fergus, R., Torresani, L., Paluri, M.: Learning spatiotem-  poral features with 3d convolutional networks. In: ICCV (2015)  43. Tsai, Y.H., Yang, M.H., Black, M.J.: Video segmentation via object ﬂow. In: CVPR  (2016)  44. Voigtlaender, P., Leibe, B.: Online adaptation of convolutional neural networks for  video object segmentation. arXiv preprint arXiv:1706.09364 (2017)  45. Williams, R.J., Zipser, D.: A learning algorithm for continually running fully re-  current neural networks. Neural computation 1(2), 270-280 (1989)  46. Xingjian, S., Chen, Z., Wang, H., Yeung, D.Y., Wong, W.K., Woo, W.c.: Convo- lutional lstm network: A machine learning approach for precipitation nowcasting. In: Advances in neural information processing systems. pp. 802-810 (2015)  47. Xu, H., Gao, Y., Yu, F., Darrell, T.: End-to-end learning of driving models from  large-scale video datasets. In: CVPR (2017)  48. Xu, N., Price, B., Cohen, S., Yang, J., Huang, T.: Deep grabcut for object selection.  arXiv preprint arXiv:1707.00243 (2017)  49. Xu, N., Price, B., Cohen, S., Yang, J., Huang, T.S.: Deep interactive object se- lection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 373-381 (2016)  50. Yang, L., Xiong, X., Wang, Y., Yang, J., Katsaggelos, A.K.: Eﬃcient video object  segmentation via network modulation. In: CVPR (2018)"}