{"1": "1. Abu-El-Haija, S., Kothari, N., Lee, J., Natsev, P., Toderici, G., Varadarajan, B., Vijayanarasimhan, S.: Youtube-8m: A large-scale video classification benchmark. CoRR abs/1609.08675 (2016), https://arxiv.org/abs/1609.08675 2  2. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for seman- tic urban scene understanding. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3213-3223 (2016). https://doi.org/10.1109/CVPR.2016.350 2  3. ECRS:  RAPTOR.  https://www.ecrs.com/products/point-of-sale-pos/  accelerated-checkout/, accessed 2018-03-07 4  4. Everingham, M., Eslami, S.M.A., Gool, L.J.V., Williams, C.K.I., Winn, J.M., Zisserman, A.: The pascal visual object classes challenge: A retro- spective. International Journal of Computer Vision 111(1), 98-136 (2015). https://doi.org/10.1007/s11263-014-0733-5 2, 6, 7, 11  5. Follmann, P., B¨ottger, T.: A rotationally-invariant convolution module by feature map back-rotation. the IEEE Winter Confer- In: Proceedings of ence on Applications of Computer Vision (WACV). pp. 784-792 (2018). https://doi.org/10.1109/WACV.2018.00091 5  6. Geiger, A., Lenz, P., Stiller, C., Urtasun, R.: Vision meets robotics: The KITTI dataset. International Journal of Robotics Research 32(11), 1231-1237 (2013). https://doi.org/10.1177/0278364913491297 2  7. George, M., Floerkemeier, C.: Recognizing products: A per-exemplar multi-label image classification approach. In: European Conference of Computer Vision (ECCV). pp. 440-455. Springer (2014). https://doi.org/10.1007/978-3-319-10605- 2 29 2  8. Gurumurthy, S., Kiran Sarvadevabhatla, R., Venkatesh Babu, R.: DeLiGAN: Gen- erative adversarial networks for diverse and limited data. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 166- 174 (2017). https://doi.org/10.1109/CVPR.2017.525 6  9. He, K., Gkioxari, G., Dollar, P., Girshick, R.: Mask R-CNN. In: IEEE In- ternational Conference on Computer Vision (ICCV). pp. 1059-1067 (2017). https://doi.org/10.1109/ICCV.2017.322 2, 10  10. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 770-778 (2016). https://doi.org/10.1109/CVPR.2016.90 10  11. Huang, X., Li, Y., Poursaeed, O., Hopcroft, J., Belongie, S.: Stacked gen- the IEEE Conference on erative adversarial networks. Computer Vision and Pattern Recognition (CVPR). pp. 5077-5086 (2017). https://doi.org/10.1109/CVPR.2017.202 6  In: Proceedings of  12. ITAB: HyperFLOW. https://itab.com/en/itab/checkout/self-checkouts/,  accessed 2018-03-07 4  13. Jund, P., Abdo, N., Eitel, A., Burgard, W.: The freiburg groceries dataset. CoRR  abs/1611.05799 (2016), https://arxiv.org/abs/1611.05799 2  14. Koubaroulis, D., Matas, J., Kittler, J.: Evaluating colour-based object recognition algorithms using the SOIL-47 database. In: Asian Conference on Computer Vision. p. 2 (2002) 2  15. Lai, K., Bo, L., Fox, D.: Unsupervised feature learning for 3d scene labeling. In: 2014 IEEE International Conference on Robotics and Automation (ICRA). pp. 3050-3057. IEEE (2014). https://doi.org/10.1109/ICRA.2014.6907298 2   MVTec D2S: Densely Segmented Supermarket DatasetReferences  1. Abu-El-Haija, S., Kothari, N., Lee, J., Natsev, P., Toderici, G., Varadarajan, B., Vijayanarasimhan, S.: Youtube-8m: A large-scale video classification benchmark. CoRR abs/1609.08675 (2016), https://arxiv.org/abs/1609.08675 2  2. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for seman- tic urban scene understanding. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3213-3223 (2016). https://doi.org/10.1109/CVPR.2016.350 2  3. ECRS:  RAPTOR.  https://www.ecrs.com/products/point-of-sale-pos/  accelerated-checkout/, accessed 2018-03-07 4  4. Everingham, M., Eslami, S.M.A., Gool, L.J.V., Williams, C.K.I., Winn, J.M., Zisserman, A.: The pascal visual object classes challenge: A retro- spective. International Journal of Computer Vision 111(1), 98-136 (2015). https://doi.org/10.1007/s11263-014-0733-5 2, 6, 7, 11  5. Follmann, P., B¨ottger, T.: A rotationally-invariant convolution module by feature map back-rotation. the IEEE Winter Confer- In: Proceedings of ence on Applications of Computer Vision (WACV). pp. 784-792 (2018). https://doi.org/10.1109/WACV.2018.00091 5  6. Geiger, A., Lenz, P., Stiller, C., Urtasun, R.: Vision meets robotics: The KITTI dataset. International Journal of Robotics Research 32(11), 1231-1237 (2013). https://doi.org/10.1177/0278364913491297 2  7. George, M., Floerkemeier, C.: Recognizing products: A per-exemplar multi-label image classification approach. In: European Conference of Computer Vision (ECCV). pp. 440-455. Springer (2014). https://doi.org/10.1007/978-3-319-10605- 2 29 2  8. Gurumurthy, S., Kiran Sarvadevabhatla, R., Venkatesh Babu, R.: DeLiGAN: Gen- erative adversarial networks for diverse and limited data. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 166- 174 (2017). https://doi.org/10.1109/CVPR.2017.525 6  9. He, K., Gkioxari, G., Dollar, P., Girshick, R.: Mask R-CNN. In: IEEE In- ternational Conference on Computer Vision (ICCV). pp. 1059-1067 (2017). https://doi.org/10.1109/ICCV.2017.322 2, 10  10. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 770-778 (2016). https://doi.org/10.1109/CVPR.2016.90 10  11. Huang, X., Li, Y., Poursaeed, O., Hopcroft, J., Belongie, S.: Stacked gen- the IEEE Conference on erative adversarial networks. Computer Vision and Pattern Recognition (CVPR). pp. 5077-5086 (2017). https://doi.org/10.1109/CVPR.2017.202 6  In: Proceedings of  12. ITAB: HyperFLOW. https://itab.com/en/itab/checkout/self-checkouts/,  accessed 2018-03-07 4  13. Jund, P., Abdo, N., Eitel, A., Burgard, W.: The freiburg groceries dataset. CoRR  abs/1611.05799 (2016), https://arxiv.org/abs/1611.05799 2  14. Koubaroulis, D., Matas, J., Kittler, J.: Evaluating colour-based object recognition algorithms using the SOIL-47 database. In: Asian Conference on Computer Vision. p. 2 (2002) 2  15. Lai, K., Bo, L., Fox, D.: Unsupervised feature learning for 3d scene labeling. In: 2014 IEEE International Conference on Robotics and Automation (ICRA). pp. 3050-3057. IEEE (2014). https://doi.org/10.1109/ICRA.2014.6907298 2   16  Follmann et al .  16. Lai, K., Bo, L., Ren, X., Fox, D.: A large-scale hierarchical multi- IEEE International Conference IEEE (2011).  view RGB-D object dataset. on Robotics https://doi.org/10.1109/ICRA.2011.5980382 2  and Automation (ICRA). pp.  1817-1824.In:  17. LeCun, Y., Bengio, Y., Hinton, G.: Deep learning. Nature 521(7553), 436-444  (2015). https://doi.org/10.1038/nature14539 2  18. Li, J., Liang, X., Wei, Y., Xu, T., Feng, J., Yan, S.: Perceptual generative ad- versarial networks for small object detection. In: Proceedings of the IEEE Confer- ence on Computer Vision and Pattern Recognition (CVPR). pp. 1222-1230 (2017). https://doi.org/10.1109/CVPR.2017.211 6  19. Li, Y., Qi, H., Da, J., Ji, X., Wei, Y.: Fully convolutional  instance- aware semantic segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2359-2367 (2017). https://doi.org/10.1109/CVPR.2017.472 2, 10  20. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Fea- In: Proceedings of the IEEE ture pyramid networks for object detection. Conference on Computer Vision and Pattern Recognition (CVPR) (2017). https://doi.org/10.1109/CVPR.2017.106 10  21. Lin, T.Y., Goyal, P., Girshick, R., He, K., Doll´ar, P.: Focal Loss for Dense Object Detection. In: IEEE International Conference on Computer Vision (ICCV) (2017). https://doi.org/10.1109/ICCV.2017.324 10  22. Lin, T., Maire, M., Belongie, S.J., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft COCO: common objects in context. In: European Conference of Computer Vision (ECCV). pp. 740-755 (2014). https://doi.org/10.1007/978-3-319-10602-1 48 2, 6, 7, 11  23. Merler, M., Galleguillos, C., Belongie, S.: Recognizing groceries  in situ using in vitro training data. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 1-8 (2007). https://doi.org/10.1109/CVPR.2007.383486 2  In: Proceedings of  the  24. Minervini, M., Fischbach, A., Scharr, H., Tsaftaris, S.A.: Finely-grained annotated datasets for image-based plant phenotyping. Pattern Recognition Letters 81, 80-89 (2016). https://doi.org/10.1016/j.patrec.2015.10.013 2  25. Neuhold, G., Ollmann, T., Rota Bulo, S., Kontschieder, P.: The mapillary IEEE In- vistas dataset for semantic understanding of street scenes. ternational Conference on Computer Vision (ICCV). pp. 4990-4999 (2017). https://doi.org/10.1109/ICCV.2017.534 2  In:  26. Redmon, J., Farhadi, A.: Yolo9000: Better, faster, stronger. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017). https://doi.org/10.1109/CVPR.2017.690 4  27. Ren, S., He, K., Girshick, R.B., Sun, J.: Faster R-CNN: Towards object detection with region proposal networks.  real- time IEEE Transac- tions on Pattern Analysis and Machine Intelligence 39(6), 62-66 (2017). https://doi.org/10.1109/TPAMI.2016.2577031 2, 10  28. Rennie, C., Shome, R., Bekris, K.E., De Souza, A.F.: A dataset for im- proved RGBD-based object detection and pose estimation for warehouse pick- and-place. IEEE Robotics and Automation Letters 1(2), 1179-1185 (2016). https://doi.org/10.1109/LRA.2016.2532924 2  29. Richtsfeld, A., M¨orwald, T., Prankl, J., Zillich, M., Vincze, M.: Segmentation of unknown objects in indoor environments. In: IEEE/RSJ International Con- ference on Intelligent Robots and Systems (IROS). pp. 4791-4796. IEEE (2012). https://doi.org/10.1109/IROS.2012.6385661 2   MVTec D2S: Densely Segmented Supermarket Dataset30. Rocha, A., Hauagge, D.C., Wainer, J., Goldenstein, S.: Automatic fruit and veg- etable classification from images. Computers and Electronics in Agriculture 70(1) (2010). https://doi.org/10.1016/j.compag.2009.09.002 2  31. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M.S., Berg, A.C., Li, F.: ImageNet large scale visual recognition challenge. International Journal of Computer Vision 115(3), 211-252 (2015). https://doi.org/10.1007/s11263-015-0816-y 2  32. Shelhamer, E., Long, J., Darrell, T.: Fully convolutional networks for semantic segmentation. IEEE Transactions on Pattern Analysis and Machine Intelligence 39, 640-651 (2015). https://doi.org/10.1109/TPAMI.2016.2572683 1, 2  33. Shrivastava, A., Gupta, A., Girshick, R.: Training region-based object detec- tors with online hard example mining. In: Proceedings of the IEEE Confer- ence on Computer Vision and Pattern Recognition (CVPR). pp. 761-769 (2016). https://doi.org/10.1109/CVPR.2016.89 11  34. Shrivastava, A., Pfister, T., Tuzel, O., Susskind, J., Wang, W., Webb, R.: Learn- ing from simulated and unsupervised images through adversarial training. In: Pro- ceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2107-2116 (2017). https://doi.org/10.1109/CVPR.2017.241 6 35. Zhang, H., Xu, T., Li, H., Zhang, S., Wang, X., Huang, X., Metaxas, D.N.: Stack- GAN: Text to photo-realistic image synthesis with stacked generative adversarial networks. In: IEEE International Conference on Computer Vision (ICCV). pp. 5907-5915 (2017). https://doi.org/10.1109/ICCV.2017.629 6  36. Zhou, B., Khosla, A., Lapedriza, `A., Torralba, A., Oliva, A.: Places: An image database for deep scene understanding. CoRR abs/1610.02055 (2016), http: //arxiv.org/abs/1610.02055 2  37. Zhou, B., Zhao, H., Puig, X., Fidler, S., Barriuso, A., Torralba, A.: Semantic understanding of scenes through the ADE20K dataset. CoRR abs/1608.05442 (2016), http://arxiv.org/abs/1608.05442 2, 9  38. Zhou, Y., Ye, Q., Qiu, Q., Jiao, J.: Oriented response networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 4961-4970 (2017). https://doi.org/10.1109/CVPR.2017.527 5"}