{"1": "1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M.: Tensorﬂow: Large scale machine learning on heterogeneous distributed systems. In: arXiv preprint arXiv:1603.04467 (2016) 2. Bertinetto, L., Valmadre, J., Golodetz, S., Miksik, O., Torr, P.H.S.: Staple: Com-  plementary learners for real-time tracking. In: CVPR (2016)  3. Bertinetto, L., Valmadre, J., Henriques, J.F., Vedaldi, A., Torr, P.H.S.: Fully- convolutional siamese networks for object tracking. In: ECCV Workshop (2016) 4. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. In: ICLR (2015)  5. Choi, J., Chang, H.J., Jeong, J., Demiris, Y., Jin, Y.C.: Visual tracking using  attention-modulated disintegration and integration. In: CVPR (2016)  6. Choi, J., Chang, H.J., Yun, S., Fischer, T., Demiris, Y., Jin, Y.C.: Attentional  correlation filter network for adaptive visual tracking. In: CVPR (2017)  7. Danelljan, M., Bhat, G., Khan, F.S., Felsberg, M.: Eco: Eﬃcient convolution op-  erators for tracking. In: CVPR (2017)  8. Danelljan, M., Hger, G., Khan, F.S., Felsberg, M.: Accurate scale estimation for  robust visual tracking. In: BMVC (2014)  9. Danelljan, M., Hger, G., Khan, F.S., Felsberg, M.: Convolutional features for cor-  relation filter based visual tracking. In: ICCV Workshop (2015)  10. Danelljan, M., Robinson, A., Khan, F.S., Felsberg, M.: Beyond correlation filters:  Learning continuous convolution operators for visual tracking. In: ECCV (2016)  11. Guo, Q., Feng, W., Zhou, C., Huang, R., Wan, L., Wang, S.: Learning dynamic  siamese network for visual object tracking. In: ICCV (2017)  12. He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpassing human-  level performance on imagenet classification. In: ICCV (2015)  13. Henriques, J.F., Caseiro, R., Martins, P., Batista, J.: High-speed tracking with  kernelized correlation filters. In: ICVS (2008)  14. Huang, C., Lucey, S., Ramanan, D.: Learning policies for adaptive tracking with  deep feature cascades. In: ICCV (2017)  15. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. In: ICML (2015)  16. Kr¨ahenb¨uhl, P., Koltun, V.: Eﬃcient inference in fully connected crfs with gaussian  edge potentials. In: NIPS. pp. 109-117 (2011)  17. Kristan, M., Leonardis, A., Matas, J., Felsberg, M., Pﬂugfelder, R., ehovin, L., Vojr, T., Hger, G., Lukei, A., Fernndez, G.: The visual object tracking VOT2016 challenge results. In: ECCV Workshop (2016)  18. Li, P., Wang, D., Wang, L., Lu, H.: Deep visual tracking: Review and experimental  comparison. Pattern Recognition (76), 323-338 (2018)  19. Li, Y., Zhu, J., Hoi, S.C.H.: Reliable patch trackers: Robust visual tracking by  exploiting reliable patches. In: CVPR (2015)  20. Liu, T., Wang, G., Yang, Q.: Real-time part-based visual tracking via adaptive  21. Ma, C., Huang, J.B., Yang, X., Yang, M.H.: Hierarchical convolutional features for  22. Ma, C., Yang, X., Zhang, C., Yang, M.H.: Long-term correlation tracking. In:  correlation filters. In: CVPR (2015)  visual tracking. In: ICCV (2015)  CVPR (2015)   A very long titleReferences  1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M.: Tensorﬂow: Large scale machine learning on heterogeneous distributed systems. In: arXiv preprint arXiv:1603.04467 (2016) 2. Bertinetto, L., Valmadre, J., Golodetz, S., Miksik, O., Torr, P.H.S.: Staple: Com-  plementary learners for real-time tracking. In: CVPR (2016)  3. Bertinetto, L., Valmadre, J., Henriques, J.F., Vedaldi, A., Torr, P.H.S.: Fully- convolutional siamese networks for object tracking. In: ECCV Workshop (2016) 4. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. In: ICLR (2015)  5. Choi, J., Chang, H.J., Jeong, J., Demiris, Y., Jin, Y.C.: Visual tracking using  attention-modulated disintegration and integration. In: CVPR (2016)  6. Choi, J., Chang, H.J., Yun, S., Fischer, T., Demiris, Y., Jin, Y.C.: Attentional  correlation filter network for adaptive visual tracking. In: CVPR (2017)  7. Danelljan, M., Bhat, G., Khan, F.S., Felsberg, M.: Eco: Eﬃcient convolution op-  erators for tracking. In: CVPR (2017)  8. Danelljan, M., Hger, G., Khan, F.S., Felsberg, M.: Accurate scale estimation for  robust visual tracking. In: BMVC (2014)  9. Danelljan, M., Hger, G., Khan, F.S., Felsberg, M.: Convolutional features for cor-  relation filter based visual tracking. In: ICCV Workshop (2015)  10. Danelljan, M., Robinson, A., Khan, F.S., Felsberg, M.: Beyond correlation filters:  Learning continuous convolution operators for visual tracking. In: ECCV (2016)  11. Guo, Q., Feng, W., Zhou, C., Huang, R., Wan, L., Wang, S.: Learning dynamic  siamese network for visual object tracking. In: ICCV (2017)  12. He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpassing human-  level performance on imagenet classification. In: ICCV (2015)  13. Henriques, J.F., Caseiro, R., Martins, P., Batista, J.: High-speed tracking with  kernelized correlation filters. In: ICVS (2008)  14. Huang, C., Lucey, S., Ramanan, D.: Learning policies for adaptive tracking with  deep feature cascades. In: ICCV (2017)  15. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. In: ICML (2015)  16. Kr¨ahenb¨uhl, P., Koltun, V.: Eﬃcient inference in fully connected crfs with gaussian  edge potentials. In: NIPS. pp. 109-117 (2011)  17. Kristan, M., Leonardis, A., Matas, J., Felsberg, M., Pﬂugfelder, R., ehovin, L., Vojr, T., Hger, G., Lukei, A., Fernndez, G.: The visual object tracking VOT2016 challenge results. In: ECCV Workshop (2016)  18. Li, P., Wang, D., Wang, L., Lu, H.: Deep visual tracking: Review and experimental  comparison. Pattern Recognition (76), 323-338 (2018)  19. Li, Y., Zhu, J., Hoi, S.C.H.: Reliable patch trackers: Robust visual tracking by  exploiting reliable patches. In: CVPR (2015)  20. Liu, T., Wang, G., Yang, Q.: Real-time part-based visual tracking via adaptive  21. Ma, C., Huang, J.B., Yang, X., Yang, M.H.: Hierarchical convolutional features for  22. Ma, C., Yang, X., Zhang, C., Yang, M.H.: Long-term correlation tracking. In:  correlation filters. In: CVPR (2015)  visual tracking. In: ICCV (2015)  CVPR (2015)   16  A. Author and B. Author  23. Nair, V., Hinton, G.E.: Rectified linear units improve restricted boltzmann ma-  chines. In: ICML (2010)  24. Nam, H., Baek, M., Han, B.: Modeling and propagating cnns in a tree structure  for visual tracking. In: arXiv preprint arXiv:1608.07242 (2016)  25. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M.: Imagenet large scale visual recognition challenge. International Journal of Computer Vision 115(3), 211-252 (2014) 26. Smeulders, A.W.M., Chu, D.M., Cucchiara, R., Calderara, S., Dehghan, A., Shah, M.: Visual tracking: An experimental survey. IEEE Transactions on Pattern Anal- ysis and Machine Intelligence pp. 1442-1468 (2014)  27. Son, J., Jung, I., Park, K., Han, B.: Tracking-by-segmentation with online gradient  boosting decision tree. In: ICCV. pp. 3056-3064 (2016)  28. Song, Y., Ma, C., Gong, L., Zhang, J., Lau, R., Yang, M.H.: Crest: Convolutional  residual learning for visual tracking. In: ICCV (2017)  29. Sun, C., Wang, D., Lu, H., Yang, M.H.: Correlation tracking via joint discrimina-  tion and reliability learning (2018)  30. Sun, C., Wang, D., Lu, H., Yang, M.H.: Learning spatial-aware regressions for  visual tracking (2018)  CVPR (2016)  31. Tao, R., Gavves, E., Smeulders, A.W.M.: Siamese instance search for tracking. In:  32. Teng, Z., Xing, J., Wang, Q., Lang, C., Feng, S., Jin, Y.: Robust object tracking  based on temporal and spatial deep networks. In: ICCV (2017)  33. Valmadre, J., Bertinetto, L., Henriques, J.F., Vedaldi, A., Torr, P.H.S.: End-to-end representation learning for correlation filter based tracking. In: CVPR (2017) 34. Wang, L., Ouyang, W., Wang, X., Lu, H.: Visual tracking with fully convolutional  networks. In: ICCV (2015)  35. Wang, L., Ouyang, W., Wang, X., Lu, H.: Stct: Sequentially training convolutional  networks for visual tracking. In: CVPR (2016)  36. Wu, Y., Lim, J., Yang, M.H.: Online object tracking: A benchmark. In: CVPR  (2013)  37. Wu, Y., Lim, J., Yang, M.H.: Object tracking benchmark. IEEE Transactions on  Pattern Analysis and Machine Intelligence pp. 1834-1848 (2015)  38. Yeo, D., Son, J., Han, B., Han, J.H.: Superpixel-based tracking-by-segmentation  using markov chains. In: CVPR. pp. 511-520 (2017)  39. Zhang, J., Ma, S., Sclaroﬀ, S.: Meem: Robust tracking via multiple experts using  entropy minimization. In: ECCV (2014)  40. Zheng, S., Jayasumana, S., Romera-Paredes, B., Vineet, V., Su, Z., Du, D., Huang, C., Torr, P.H.S.: Conditional random fields as recurrent neural networks. In: ICCV (2015)  41. Zhu, G., Porikli, F., Li, H.: Beyond local search: Tracking objects everywhere with  instance-specific proposals. In: CVPR (2016)"}