{"1": "1. Bell, S., Zitnick, C.L., Bala, K., Girshick, R.: Inside-outside net: Detecting ob- jects in context with skip pooling and recurrent neural networks. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2016)  2. Cai, Z., Fan, Q., Feris, R.S., Vasconcelos, N.: A unified multi-scale deep convolu- tional neural network for fast object detection. In: Proc. European Conf. Comput. Vis. (2016)  3. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully  convolutional networks. In: Proc. Neural Inf. Process. Syst. (2016)  4. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. In: Proc. IEEE Int. Conf. Comput. Vis. (2017)  5. Doll´ar, P., Appel, R., Belongie, S., Perona, P.: Fast feature pyramids for object  detection. IEEE Trans. Pattern Anal. Mach. Intell. 36(8), 1532-1545 (2014)  6. Everingham, M., Gool, L.V., Williams, C.K.I., Winn, J., Zisserman, A.: The PAS- CAL Visual Object Classes (VOC) Challenge. Int. J. Comput. Vis. 88(2), 303-338 (2010)  7. Felzenszwalb, P.F., Girshick, R.B., McAllester, D., Ramanan, D.: Object detection with discriminatively trained part-based models. IEEE Trans. Pattern Anal. Mach. Intell. 32(9), 1627-1645 (2010)  8. Fu, C.Y., Liu, W., Ranga, A., Tyagi, A., Berg, A.C.: Dssd: Deconvolutional single  shot detector. arXiv preprint arXiv:1701.06659 (2017)  9. Girshick, R.: Fast r-cnn. In: Proc. IEEE Int. Conf. Comput. Vis. (2015)  10. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2014)  11. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward  neural networks. In: AISTATS (2010)  12. Glorot, X., Bordes, A., Bengio, Y.: Deep sparse rectifier neural networks. In: AIS-  TATS (2011)  13. Hariharan, B., Arbelaez, P., Girshick, R., Malik, J.: Hypercolumns for object seg- mentation and fine-grained localization. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2015)  14. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional networks for visual recognition. IEEE Trans. Pattern Anal. Mach. Intell. 37(9), 1904-1916 (2015)  15. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition  (2016)  16. Huang, G., Liu, Z., van der Maaten, L., Weinberger, K.Q.: Densely connected convolutional networks. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2017) 17. Ioﬀe, S., Szegedy, C.: Batch normalization : Accelerating deep network training by  reducing internal covariate shift. In: Proc. Int. Conf. Mach. Learn. (2015)  18. Jeong, J., Park, H., Kwak, N.: Enhancement of ssd by concatenating feature maps  for object detection. In: Proc. British Mach. Vis. Conf. (2017)  19. Kong, T., Yao, A., Chen, Y., Sun, F.: Hypernet: Towards accurate region pro- posal generation and joint object detection. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2016)  20. Kong, T., Sun, F., Yao, A., Liu, H., Lu, M., Chen, Y.: Ron: Reverse connection with objectness prior networks for object detection. In: IEEE Conference on Computer Vision and Pattern Recognition (2017)   Parallel Feature Pyramid Network for Object DetectionReferences  1. Bell, S., Zitnick, C.L., Bala, K., Girshick, R.: Inside-outside net: Detecting ob- jects in context with skip pooling and recurrent neural networks. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2016)  2. Cai, Z., Fan, Q., Feris, R.S., Vasconcelos, N.: A unified multi-scale deep convolu- tional neural network for fast object detection. In: Proc. European Conf. Comput. Vis. (2016)  3. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully  convolutional networks. In: Proc. Neural Inf. Process. Syst. (2016)  4. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. In: Proc. IEEE Int. Conf. Comput. Vis. (2017)  5. Doll´ar, P., Appel, R., Belongie, S., Perona, P.: Fast feature pyramids for object  detection. IEEE Trans. Pattern Anal. Mach. Intell. 36(8), 1532-1545 (2014)  6. Everingham, M., Gool, L.V., Williams, C.K.I., Winn, J., Zisserman, A.: The PAS- CAL Visual Object Classes (VOC) Challenge. Int. J. Comput. Vis. 88(2), 303-338 (2010)  7. Felzenszwalb, P.F., Girshick, R.B., McAllester, D., Ramanan, D.: Object detection with discriminatively trained part-based models. IEEE Trans. Pattern Anal. Mach. Intell. 32(9), 1627-1645 (2010)  8. Fu, C.Y., Liu, W., Ranga, A., Tyagi, A., Berg, A.C.: Dssd: Deconvolutional single  shot detector. arXiv preprint arXiv:1701.06659 (2017)  9. Girshick, R.: Fast r-cnn. In: Proc. IEEE Int. Conf. Comput. Vis. (2015)  10. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2014)  11. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward  neural networks. In: AISTATS (2010)  12. Glorot, X., Bordes, A., Bengio, Y.: Deep sparse rectifier neural networks. In: AIS-  TATS (2011)  13. Hariharan, B., Arbelaez, P., Girshick, R., Malik, J.: Hypercolumns for object seg- mentation and fine-grained localization. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2015)  14. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional networks for visual recognition. IEEE Trans. Pattern Anal. Mach. Intell. 37(9), 1904-1916 (2015)  15. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition  (2016)  16. Huang, G., Liu, Z., van der Maaten, L., Weinberger, K.Q.: Densely connected convolutional networks. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2017) 17. Ioﬀe, S., Szegedy, C.: Batch normalization : Accelerating deep network training by  reducing internal covariate shift. In: Proc. Int. Conf. Mach. Learn. (2015)  18. Jeong, J., Park, H., Kwak, N.: Enhancement of ssd by concatenating feature maps  for object detection. In: Proc. British Mach. Vis. Conf. (2017)  19. Kong, T., Yao, A., Chen, Y., Sun, F.: Hypernet: Towards accurate region pro- posal generation and joint object detection. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2016)  20. Kong, T., Sun, F., Yao, A., Liu, H., Lu, M., Chen, Y.: Ron: Reverse connection with objectness prior networks for object detection. In: IEEE Conference on Computer Vision and Pattern Recognition (2017)   16  S.-W. Kim et al.  21. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. Proc. IEEE 86(11), 2278-2324 (1998)  22. Li, H., Liu, Y., Ouyang, W., Wang, X.: Zoom out-and-in network with map attention decision for region proposal and object detection. arXiv preprint arXiv:1709.04347 (2017)  23. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature pyra- mid networks for object detection. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2017)  24. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: Proc. European Conf. Comput. Vis. (2014)  25. Lin, T.Y., Goyal, P., Girshick, R., He, K., Doll´ar, P.: Focal loss for dense object  detection. In: Proc. IEEE Int. Conf. Comput. Vis. (2017)  26. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  Single shot multibox detector. arXiv preprint arXiv:1512.02325 (2015)  27. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd: Single shot multibox detector. In: Proc. European Conf. Comput. Vis. (2016) 28. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  segmentation. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2015)  29. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti-  mation. In: Proc. European Conf. Comput. Vis. (2016)  30. Pinheiro, P.O., Lin, T.Y., Collobert, R., Doll´ar, P.: Learning to refine object seg-  ments. In: Proc. European Conf. Comput. Vis. (2016)  31. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified, real-time object detection. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2016) 32. Redmon, J., Farhadi, A.: Yolo9000: Better, faster, stronger. In: Proc. IEEE Com-  33. Redmon, J., Farhadi, A.: Yolov3: An incremental improvement. arXiv preprint  put. Vis. Pattern Recognit. (2017)  arXiv:1804.02767 (2018)  34. Ren, J., Chen, X., Liu, J., Sun, W., Pang, J., Yan, Q., Tai, Y.W., Xu, L.: Accurate single stage detector using recurrent rolling convolution. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2017)  35. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de- tection with region proposal networks. In: Proc. Neural Inf. Process. Syst. (2015) 36. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de- tection with region proposal networks. IEEE Trans. Pattern Anal. Mach. Intell. 39(6), 1137-1149 (2017)  37. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., Berg, A.C., Li, F.F.: Imagenet large scale visual recognition challenge. Int. J. Comput. Vis. 115(3), 211-252 (Mar 2015) 38. Sermanet, P., Eigen, D., Zhang, X., Mathieu, M., Fergus, R., LeCun, Y.: Overfeat: Integrated recognition, localization and detection using convolutional networks. In: Proc. Int. Conf. Learn. Representations  39. Shrivastava, A., Sukthankar, R., Malik, J., Gupta, A.: Beyond skip connections: Top-down modulation for object detection. arXiv preprint arXiv:1612.06851 (2016) 40. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition (2014)  41. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A.: Going deeper with convolutions. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2015)   Parallel Feature Pyramid Network for Object Detection42. Wang, F., Jiang, M., Qian, C., Yang, S., Li, C., Zhang, H., Wang, X., Tang, X.: Residual attention network for image classification. In: Proc. IEEE Comput. Vis. Pattern Recognit. (2017)  43. Zhang, S., Wen, L., Bian, X., Lei, Z., Li, S.Z.: Single-shot refinement neural network  for object detection. arXiv preprint arXiv:1711.06897 (2017)  44. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In:  Proc. IEEE Comput. Vis. Pattern Recognit. (2017)  45. Zhu, Y., Zhao, C., Wang, J., Zhao, X., Wu, Y., Lu, H.: Couplenet: Coupling global structure with local parts for object detection. In: Proc. IEEE Int. Conf. Comput. Vis. (2017)"}