{"1": "1. Danelljan, M., H¨ager, G., Khan, F.S., Felsberg, M.: Convolutional features for  correlation filter based visual tracking. In: ICCV Workshops. (2015)  2. Qi, Y., Zhang, S., Qin, L., Yao, H., Huang, Q., Lim, J., Yang, M.: Hedged deep  3. Ma, C., Huang, J.B., Yang, X., Yang, M.H.: Hierarchical convolutional features  tracking. In: CVPR. (2016)  for visual tracking. In: ICCV. (2015)  4. Danelljan, M., Robinson, A., Shahbaz Khan, F., Felsberg, M.: Beyond correlation filters: Learning continuous convolution operators for visual tracking. In: ECCV. (2016)  5. Danelljan, M., Bhat, G., Shahbaz Khan, F., Felsberg, M.: Eco: Eﬃcient convolution  operators for tracking. In: CVPR. (2017)  6. Wang, L., Ouyang, W., Wang, X., Lu, H.: Visual tracking with fully convolutional  networks. In: ICCV. (2015)  7. Wang, L., Ouyang, W., Wang, X., Lu, H.: STCT: sequentially training convolu-  tional networks for visual tracking. In: CVPR. (2016)  8. Song, Y., Ma, C., Gong, L., Zhang, J., Lau, R.W.H., Yang, M.H.: Crest: Convo-  lutional residual learning for visual tracking. In: ICCV. (2017)  9. Wu, Y., Lim, J., Yang, M.: Object tracking benchmark. TPAMI 37(9) (2015) 10. Kristan, M., Leonardis, A., Matas, J., et al.: The visual object tracking VOT2016  challenge results. In: ECCV Workshops. (2016)  11. He, H., Garcia, E.A.: Learning from imbalanced data. TKDE 21(9) (2009) 12. Danelljan, M., H¨ager, G., Khan, F.S., Felsberg, M.: Learning spatially regularized  correlation filters for visual tracking. In: ICCV. (2015)  13. Lukezic, A., Vojir, T., Zajc, L.C., Matas, J., Kristan, M.: Discriminative correlation  filter with channel and spatial reliability. In: CVPR. (2017)  14. Kiani Galoogahi, H., Fagg, A., Lucey, S.: Learning background-aware correlation  filters for visual tracking. In: ICCV. (2017)  15. Copas, J.B.: Regression, prediction and shrinkage. Journal of the Royal Statistical  16. Lin, T.Y., Goyal, P., Girshick, R., He, K., Dollr, P.: Focal loss for dense object  Society 45 (1983)  detection. In: ICCV. (2017)  17. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. In: ICLR. (2015)  18. Salti, S., Cavallaro, A., di Stefano, L.: Adaptive appearance modeling for video  tracking: Survey and evaluation. TIP 21(10) (2012)  19. Smeulders, A.W.M., Chu, D.M., Cucchiara, R., Calderara, S., Dehghan, A., Shah,  M.: Visual tracking: An experimental survey. TPAMI 36(7) (2014)  20. Wang, N., Shi, J., Yeung, D.Y., Jia, J.: Understanding and diagnosing visual  tracking systems. In: ICCV. (2015)  21. Hua, Y., Alahari, K., Schmid, C.: Online object tracking with proposal selection.  In: ICCV. (2015)  22. Zhu, G., Porikli, F., Li, H.: Beyond local search: Tracking objects everywhere with  instance-specific proposals. In: CVPR. (2016)  23. Babenko, B., Yang, M., Belongie, S.J.: Robust object tracking with online multiple  instance learning. TPAMI 33(8) (2011)  24. Hare, S., Saﬀari, A., Torr, P.H.: Struck: Structured output tracking with kernels.  In: ICCV. (2011)   Deep Regression Tracking with Shrinkage LossReferences  1. Danelljan, M., H¨ager, G., Khan, F.S., Felsberg, M.: Convolutional features for  correlation filter based visual tracking. In: ICCV Workshops. (2015)  2. Qi, Y., Zhang, S., Qin, L., Yao, H., Huang, Q., Lim, J., Yang, M.: Hedged deep  3. Ma, C., Huang, J.B., Yang, X., Yang, M.H.: Hierarchical convolutional features  tracking. In: CVPR. (2016)  for visual tracking. In: ICCV. (2015)  4. Danelljan, M., Robinson, A., Shahbaz Khan, F., Felsberg, M.: Beyond correlation filters: Learning continuous convolution operators for visual tracking. In: ECCV. (2016)  5. Danelljan, M., Bhat, G., Shahbaz Khan, F., Felsberg, M.: Eco: Eﬃcient convolution  operators for tracking. In: CVPR. (2017)  6. Wang, L., Ouyang, W., Wang, X., Lu, H.: Visual tracking with fully convolutional  networks. In: ICCV. (2015)  7. Wang, L., Ouyang, W., Wang, X., Lu, H.: STCT: sequentially training convolu-  tional networks for visual tracking. In: CVPR. (2016)  8. Song, Y., Ma, C., Gong, L., Zhang, J., Lau, R.W.H., Yang, M.H.: Crest: Convo-  lutional residual learning for visual tracking. In: ICCV. (2017)  9. Wu, Y., Lim, J., Yang, M.: Object tracking benchmark. TPAMI 37(9) (2015) 10. Kristan, M., Leonardis, A., Matas, J., et al.: The visual object tracking VOT2016  challenge results. In: ECCV Workshops. (2016)  11. He, H., Garcia, E.A.: Learning from imbalanced data. TKDE 21(9) (2009) 12. Danelljan, M., H¨ager, G., Khan, F.S., Felsberg, M.: Learning spatially regularized  correlation filters for visual tracking. In: ICCV. (2015)  13. Lukezic, A., Vojir, T., Zajc, L.C., Matas, J., Kristan, M.: Discriminative correlation  filter with channel and spatial reliability. In: CVPR. (2017)  14. Kiani Galoogahi, H., Fagg, A., Lucey, S.: Learning background-aware correlation  filters for visual tracking. In: ICCV. (2017)  15. Copas, J.B.: Regression, prediction and shrinkage. Journal of the Royal Statistical  16. Lin, T.Y., Goyal, P., Girshick, R., He, K., Dollr, P.: Focal loss for dense object  Society 45 (1983)  detection. In: ICCV. (2017)  17. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. In: ICLR. (2015)  18. Salti, S., Cavallaro, A., di Stefano, L.: Adaptive appearance modeling for video  tracking: Survey and evaluation. TIP 21(10) (2012)  19. Smeulders, A.W.M., Chu, D.M., Cucchiara, R., Calderara, S., Dehghan, A., Shah,  M.: Visual tracking: An experimental survey. TPAMI 36(7) (2014)  20. Wang, N., Shi, J., Yeung, D.Y., Jia, J.: Understanding and diagnosing visual  tracking systems. In: ICCV. (2015)  21. Hua, Y., Alahari, K., Schmid, C.: Online object tracking with proposal selection.  In: ICCV. (2015)  22. Zhu, G., Porikli, F., Li, H.: Beyond local search: Tracking objects everywhere with  instance-specific proposals. In: CVPR. (2016)  23. Babenko, B., Yang, M., Belongie, S.J.: Robust object tracking with online multiple  instance learning. TPAMI 33(8) (2011)  24. Hare, S., Saﬀari, A., Torr, P.H.: Struck: Structured output tracking with kernels.  In: ICCV. (2011)   16  X. Lu, C. Ma, B. Ni, X. Yang, I. Reid, and M.-H. Yang  25. Ning, J., Yang, J., Jiang, S., Zhang, L., Yang, M.: Object tracking via dual linear  structured SVM and explicit feature map. In: CVPR. (2016)  26. Nam, H., Han, B.: Learning multi-domain convolutional neural networks for visual  tracking. In: CVPR. (2016)  27. Li, H., Li, Y., Porikli, F.: Deeptrack: Learning discriminative feature representa- tions by convolutional neural networks for visual tracking. In: BMVC. (2014) 28. Hong, S., You, T., Kwak, S., Han, B.: Online tracking by learning discriminative  saliency map with convolutional neural network. In: ICML. (2015)  29. Girshick, R.B.: Fast R-CNN. In: ICCV. (2015) 30. Bolme, D.S., Beveridge, J.R., Draper, B.A., Lui, Y.M.: Visual object tracking  using adaptive correlation filters. In: CVPR. (2010)  31. Henriques, J.F., Caseiro, R., Martins, P., Batista, J.: High-speed tracking with  kernelized correlation filters. TPAMI 37(3) (2015)  32. Ma, C., Yang, X., Zhang, C., Yang, M.H.: Long-term correlation tracking.  In:  CVPR. (2015)  33. Ma, C., Huang, J.B., Yang, X., Yang, M.H.: Adaptive correlation filters with  long-term and short-term memory for object tracking. IJCV (2018) 1-26  34. Wang, M., Liu, Y., Huang, Z.: Large margin object tracking with circulant feature  35. Zhang, T., Xu, C., Yang, M.H.: Multi-task correlation particle filter for robust  maps. In: CVPR. (2017)  object tracking. In: CVPR. (2017)  example weighting. In: ICDM. (2003)  (1998)  classification. In: CVPR. (2016)  learning. In: ICCV. (2017)  36. Zadrozny, B., Langford, J., Abe, N.: Cost-sensitive learning by cost-proportionate  37. Kukar, M., Kononenko, I.: Cost-sensitive learning with neural networks. In: ECAI.  38. Huang, C., Li, Y., Loy, C.C., Tang, X.: Learning deep representation for imbalanced  39. Dong, Q., Gong, S., Zhu, X.: Class rectification hard mining for imbalanced deep  40. Maciejewski, T., Stefanowski, J.: Local neighbourhood extension of SMOTE for  mining imbalanced data. In: CIDM. (2011)  41. Khan, S.H., Hayat, M., Bennamoun, M., Sohel, F.A., Togneri, R.: Cost-sensitive learning of deep feature representations from imbalanced data. TNNLS (99) (2017) 42. Tang, Y., Zhang, Y., Chawla, N.V., Krasser, S.: Svms modeling for highly imbal-  anced classification. IEEE Trans. Cybern 39(1) (2009)  43. Ting, K.M.: A comparative study of cost-sensitive boosting algorithms. In: ICML.  44. Li, H., Li, Y., Porikli, F.M.: Robust online visual tracking with a single convolu-  tional neural network. In: ACCV. (2014)  45. Bertinetto, L., Valmadre, J., Henriques, J.F., Vedaldi, A., Torr, P.H.S.: Fully- convolutional siamese networks for object tracking. In: ECCV Workshops. (2016) 46. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. (2016)  47. Danelljan, M., Khan, F.S., Felsberg, M., van de Weijer, J.: Adaptive color at-  tributes for real-time visual tracking. In: CVPR. (2014)  48. Danelljan, M., H¨ager, G., Khan, F.S., Felsberg, M.: Accurate scale estimation for  robust visual tracking. In: BMVC. (2014)  49. Wu, Y., Lim, J., Yang, M.H.: Online object tracking: A benchmark. In: CVPR.  (2000)  (2013)  50. Liang, P., Blasch, E., Ling, H.: Encoding color information for visual tracking:  Algorithms and benchmark. TIP 24(12) (2015)   Deep Regression Tracking with Shrinkage Loss51. Mueller, M., Smith, N., Ghanem, B.: A benchmark and simulator for UAV tracking.  In: ECCV. (2016)  52. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACMMM. (2014)  53. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. CoRR (2014) 54. Held, D., Thrun, S., Savarese, S.: Learning to track at 100 FPS with deep regression  networks. In: ECCV. (2016)  55. Hong, Z., Chen, Z., Wang, C., Mei, X., Prokhorov, D.V., Tao, D.: Multi-store tracker (muster): A cognitive psychology inspired approach to object tracking. In: CVPR. (2015)  56. Zhang, J., Ma, S., Sclaroﬀ, S.: MEEM: robust tracking via multiple experts using  entropy minimization. In: ECCV. (2014)  57. Gao, J., Ling, H., Hu, W., Xing, J.: Transfer learning based visual tracking with  gaussian processes regression. In: ECCV. (2014)  58. Tao, R., Gavves, E., Smeulders, A.W.M.: Siamese instance search for tracking. In:  CVPR. (2016)  59. Adam, A., Rivlin, E., Shimshoni, I.: Robust fragments-based tracking using the  integral histogram. In: CVPR. (2006)  60. Li, Y., Zhu, J.: A scale adaptive kernel correlation filter tracker with feature  integration. In: ECCV 2014 Workshops. (2014) 254-265  61. Henriques, J.F., Caseiro, R., Martins, P., Batista, J.P.: Exploiting the circulant  structure of tracking-by-detection with kernels. In: ECCV. (2012) 702-715  62. Kalal, Z., Mikolajczyk, K., Matas, J.: Tracking-learning-detection. IEEE Trans.  Pattern Anal. Mach. Intell. 34(7) (2012) 1409-1422  63. Bertinetto, L., Valmadre, J., Golodetz, S., Miksik, O., Torr, P.H.S.: Staple: Com-  plementary learners for real-time tracking. In: CVPR. (2016)"}