{"1": "1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M.: Tensorﬂow: Large-scale machine learning on heterogeneous distributed systems. arXiv (2016)  2. Amer, M.R., Todorovic, S.: Sum product networks for activity recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence 38(4), 800-813 (2016) 3. Amer, M.R., Todorovic, S., Fern, A., Zhu, S.C.: Monte carlo tree search for schedul-  ing activity recognition. In: ICCV. IEEE (2013)  4. Amer, M.R., Xie, D., Zhao, M., Todorovic, S., Zhu, S.C.: Cost-sensitive top- down/bottom-up inference for multiscale activity recognition. In: ECCV. Springer International Publishing (2012)  5. Amer, M.R., Lei, P., Todorovic, S.: Hirf: Hierarchical random field for collective activity recognition in videos. In: ECCV. Springer International Publishing (2014) 6. Bagautdinov, T., Alahi, A., Fleuret, F., Fua, P., Savarese, S.: Social scene un- derstanding: End-to-end multi-person action localization and collective activity recognition. In: CVPR. IEEE (2017)  7. Bahdanau, D., Cho, K., Bengio, Y.: Neural machine translation by jointly learning  to align and translate. In: ICLR (2015)  8. Bengio, Y., LeCun, Y., Henderson, D.: Globally trained handwritten word rec- ognizer using spatial representation, convolutional neural networks, and hidden markov models. In: NIPS. MIT Press (1994)  9. Cao, C., Liu, X., Yang, Y., Yu, Y.: Look and think twice: Capturing top-down visual attention with feedback convolutional neural networks. In: ICCV. IEEE (2015)  10. Chen, L.C., Schwing, A.G., Yuille, A.L., Urtasun, R.: Learning deep structured  models. ICLR (2014)  11. Cho, K., Van Merri¨enboer, B., Bahdanau, D., Bengio, Y.: On the properties of  neural machine translation: Encoder-decoder approaches. arXiv (2014)  12. Choi, W., Savarese, S.: A unified framework for multi-target tracking and collective  activity recognition. In: ECCV. Springer International Publishing (2012)  13. Choi, W., Shahid, K., Savarese, S.: What are they doing? : Collective activity clas- sification using spatio-temporal relationship among people. In: ICCV Workshops. IEEE (2009)  14. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully  convolutional networks. In: NIPS. MIT Press (2016)  15. Dalal, N., Triggs, B.: Histograms of oriented gradients for human detection. In:  CVPR. IEEE (2005)  16. Dalal, N., Triggs, B., Schmid, C.: Human detection using oriented histograms of  ﬂow and appearance. In: ECCV. Springer International Publishing (2006)  17. Deng, Z., Vahdat, A., Hu, H., Mori, G.: Structure inference machines: Recurrent neural networks for analyzing relations in group activity recognition. In: CVPR. IEEE (2016)  18. Donahue, J., Hendricks, L.A., Guadarrama, S., Rohrbach, M.: Long-term recurrent convolutional networks for visual recognition and description. In: CVPR. IEEE (2015)  19. Hajimirsadeghi, H., Yan, W., Vahdat, A., Mori, G.: Visual recognition by counting  instances: A multi-instance cardinality potential kernel. In: CVPR. IEEE (2015)  20. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. IEEE (2016)   stagNet for Group Activity RecognitionReferences  1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M.: Tensorﬂow: Large-scale machine learning on heterogeneous distributed systems. arXiv (2016)  2. Amer, M.R., Todorovic, S.: Sum product networks for activity recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence 38(4), 800-813 (2016) 3. Amer, M.R., Todorovic, S., Fern, A., Zhu, S.C.: Monte carlo tree search for schedul-  ing activity recognition. In: ICCV. IEEE (2013)  4. Amer, M.R., Xie, D., Zhao, M., Todorovic, S., Zhu, S.C.: Cost-sensitive top- down/bottom-up inference for multiscale activity recognition. In: ECCV. Springer International Publishing (2012)  5. Amer, M.R., Lei, P., Todorovic, S.: Hirf: Hierarchical random field for collective activity recognition in videos. In: ECCV. Springer International Publishing (2014) 6. Bagautdinov, T., Alahi, A., Fleuret, F., Fua, P., Savarese, S.: Social scene un- derstanding: End-to-end multi-person action localization and collective activity recognition. In: CVPR. IEEE (2017)  7. Bahdanau, D., Cho, K., Bengio, Y.: Neural machine translation by jointly learning  to align and translate. In: ICLR (2015)  8. Bengio, Y., LeCun, Y., Henderson, D.: Globally trained handwritten word rec- ognizer using spatial representation, convolutional neural networks, and hidden markov models. In: NIPS. MIT Press (1994)  9. Cao, C., Liu, X., Yang, Y., Yu, Y.: Look and think twice: Capturing top-down visual attention with feedback convolutional neural networks. In: ICCV. IEEE (2015)  10. Chen, L.C., Schwing, A.G., Yuille, A.L., Urtasun, R.: Learning deep structured  models. ICLR (2014)  11. Cho, K., Van Merri¨enboer, B., Bahdanau, D., Bengio, Y.: On the properties of  neural machine translation: Encoder-decoder approaches. arXiv (2014)  12. Choi, W., Savarese, S.: A unified framework for multi-target tracking and collective  activity recognition. In: ECCV. Springer International Publishing (2012)  13. Choi, W., Shahid, K., Savarese, S.: What are they doing? : Collective activity clas- sification using spatio-temporal relationship among people. In: ICCV Workshops. IEEE (2009)  14. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully  convolutional networks. In: NIPS. MIT Press (2016)  15. Dalal, N., Triggs, B.: Histograms of oriented gradients for human detection. In:  CVPR. IEEE (2005)  16. Dalal, N., Triggs, B., Schmid, C.: Human detection using oriented histograms of  ﬂow and appearance. In: ECCV. Springer International Publishing (2006)  17. Deng, Z., Vahdat, A., Hu, H., Mori, G.: Structure inference machines: Recurrent neural networks for analyzing relations in group activity recognition. In: CVPR. IEEE (2016)  18. Donahue, J., Hendricks, L.A., Guadarrama, S., Rohrbach, M.: Long-term recurrent convolutional networks for visual recognition and description. In: CVPR. IEEE (2015)  19. Hajimirsadeghi, H., Yan, W., Vahdat, A., Mori, G.: Visual recognition by counting  instances: A multi-instance cardinality potential kernel. In: CVPR. IEEE (2015)  20. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. IEEE (2016)   16  M. Qi, J. Qin, A. Li, Y. Wang, J. Luo and L. Van Gool  21. Hinton, G., Srivastava, N., Swersky, K.: Neural networks for machine learning-  lecture 6a-overview of mini-batch gradient descent  22. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural Computation  9(8), 1735-1780 (1997)  23. Ibrahim, M.S., Muralidharan, S., Deng, Z., Vahdat, A., Mori, G.: A hierarchical deep temporal model for group activity recognition. In: CVPR. IEEE (2016) 24. Itti, L., Koch, C., Niebur, E.: A model of saliency-based visual attention for rapid scene analysis. IEEE Transactions on Pattern Analysis and Machine Intelligence 20(11), 1254-1259 (1998)  25. Jain, A., Zamir, A.R., Savarese, S., Saxena, A.: Structural-rnn: Deep learning on  spatio-temporal graphs. In: CVPR. IEEE (2016)  26. Krahenbuhl, P., Koltun, V.: Eﬃcient inference in fully connected crfs with gaussian  edge potentials. In: NIPS. MIT Press (2011)  27. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS. MIT Press (2012)  28. Lan, T., Wang, Y., Yang, W., Robinovitch, S.N., Mori, G.: Discriminative latent models for recognizing contextual group activities. IEEE Transactions on Pattern Analysis and Machine Intelligence 34(8), 1549-62 (2012)  29. Li, S., Zhang, W., Chan, A.B.: Maximum-margin structured learning with deep  networks for 3d human pose estimation. In: ICCV. IEEE (2015)  30. Li, X., Chuah, M.C.: Sbgar: Semantics based group activity recognition. In: CVPR.  IEEE (2017)  31. Liu, J., Carr, P., Collins, R.T., Liu, Y.: Tracking sports players with context-  conditioned motion models. In: CVPR. IEEE (2013)  32. Liu, Z., Li, X., Luo, P., Loy, C.C., Tang, X.: Semantic image segmentation via deep  parsing network. In: ICCV. IEEE (2015)  33. Lu, W.L., Ting, J.A., Little, J.J., Murphy, K.P.: Learning to track and identify players from broadcast sports videos. IEEE Transactions on Pattern Analysis and Machine Intelligence 35(7), 1704-1716 (2013)  34. Mnih, V., Heess, N., Graves, A., Kavukcuoglu, K.: Recurrent models of visual  attention. In: NIPS. MIT Press (2014)  35. Mori, G.: Social roles in hierarchical models for human activity recognition. In:  CVPR. IEEE (2012)  36. Munkres, J.: Algorithms for the assignment and transportation problems. Journal  of the society for industrial and applied mathematics 5(1), 32-38 (1957)  37. Qi, M., Wang, Y., Li, A.: Online cross-modal scene retrieval by binary representa-  tion and semantic graph. In: MM. ACM (2017)  38. Qin, J., Liu, L., Shao, L., Ni, B., Chen, C., Shen, F., Wang, Y.: Binary coding for  partial action analysis with limited observation ratios. In: CVPR (2017)  39. Qin, J., Liu, L., Shao, L., Shen, F., Ni, B., Chen, J., Wang, Y.: Zero-shot action  recognition with error-correcting output codes. In: CVPR (2017)  40. Ramanathan, V., Huang, J., Abuelhaija, S., Gorban, A., Murphy, K., Li, F.F.:  Detecting events and key actors in multi-person videos. In: CVPR. IEEE (2016)  41. Ryoo, M.S., Aggarwal, J.K.: Stochastic representation and recognition of high-level group activities: Describing structural uncertainties in human activities. Interna- tional Journal of Computer Vision 93(2), 183-200 (2011)  42. S, R., K, H., R, G., J, S.: Faster r-cnn: Towards real-time object detection with region proposal networks. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(6), 1137 (2017)  43. Shu, T., Todorovic, S., Zhu, S.C.: Cern: Confidence-energy recurrent network for  group activity recognition. In: CVPR. IEEE (2017)   stagNet for Group Activity Recognition44. Shu, T., Xie, D., Rothrock, B., Todorovic, S.: Joint inference of groups, events and  human roles in aerial videos. In: CVPR. IEEE (2015)  45. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)  46. Snoek, J., Larochelle, H., Adams, R.P.: Practical bayesian optimization of machine  learning algorithms. NIPS 4, 2951-2959 (2012)  47. Song, S., Lan, C., Xing, J., Zeng, W., Liu, J.: An end-to-end spatio-temporal attention model for human action recognition from skeleton data. In: AAAI. AAAI (2017)  48. Szegedy, C., Vanhoucke, V., Ioﬀe, S., Shlens, J., Wojna, Z.: Rethinking the incep-  tion architecture for computer vision. In: CVPR (2016)  49. Tompson, J., Jain, A., Lecun, Y., Bregler, C.: Joint training of a convolutional network and a graphical model for human pose estimation. In: NIPS. MIT Press (2014)  50. Wang, M., Ni, B., Yang, X.: Recurrent modeling of interaction context for collective  activity recognition. In: CVPR. IEEE (2017)  51. Wang, Z., Shi, Q., Shen, C., Anton, V.D.H.: Bilinear programming for human  activity recognition with unknown mrf graphs. In: CVPR. IEEE (2013)  52. Xu, D., Zhu, Y., Choy, C.B., Fei-Fei, L.: Scene graph generation by iterative mes-  sage passing. In: CVPR. IEEE (2017)  53. Xu, K., Ba, J., Kiros, R., Cho, K., Courville, A., Salakhutdinov, R., Zemel, R., Bengio, Y.: Show, attend and tell: Neural image caption generation with visual attention. In: ICML. ACM (2015)  54. Yao, L., Torabi, A., Cho, K., Ballas, N.: Describing videos by exploiting temporal  structure. In: ICCV. IEEE (2015)  55. Zhang, N., Paluri, M., Ranzato, M., Darrell, T., Bourdev, L.: Panda: Pose aligned  networks for deep attribute modeling. In: CVPR. IEEE (2014)  56. Zhang, Y., Sohn, K., Villegas, R., Pan, G., Lee, H.: Improving object detection with deep convolutional networks via bayesian optimization and structured prediction. In: CVPR. IEEE (2015)  57. Zheng, S., Jayasumana, S., Romera-Paredes, B., Vineet, V., Su, Z., Du, D., Huang, C., Torr, P.H.S.: Conditional random fields as recurrent neural networks. In: ICCV. IEEE (2015)"}