{"1": "1. Aggarwal, J.K., Ryoo, M.S.: Human activity analysis: A review. ACM Computing Surveys  (CSUR) 43(3), 16 (2011)  2. Arandjelovic, R., Gronat, P., Torii, A., Pajdla, T., Sivic, J.: Netvlad: Cnn architecture for  weakly supervised place recognition. In: CVPR. pp. 5297-5307 (2016)  3. Bearman, A., Russakovsky, O., Ferrari, V., Fei-Fei, L.: Whats the point: Semantic segmenta-  tion with point supervision. In: ECCV. pp. 549-565. Springer (2016)  4. Bilen, H., Vedaldi, A.: Weakly supervised deep detection networks. In: CVPR. pp. 2846-2854  (2016)  5. Bojanowski, P., Bach, F., Laptev, I., Ponce, J., Schmid, C., Sivic, J.: Finding actors and actions  in movies. In: ICCV. pp. 2280-2287. IEEE (2013)  6. Bojanowski, P., Lajugie, R., Bach, F., Laptev, I., Ponce, J., Schmid, C., Sivic, J.: Weakly supervised action labeling in videos under ordering constraints. In: ECCV. pp. 628-643. Springer (2014)  7. Bojanowski, P., Lajugie, R., Grave, E., Bach, F., Laptev, I., Ponce, J., Schmid, C.: Weakly-  supervised alignment of video with text. In: ICCV. pp. 4462-4470. IEEE (2015)  8. Bottou, L.: Large-scale machine learning with stochastic gradient descent. In: COMPSTAT,  pp. 177-186. Springer (2010)  9. Carreira, J., Zisserman, A.: Quo vadis, action recognition? a new model and the kinetics  dataset. In: CVPR. pp. 4724-4733. IEEE (2017)  10. Chen, L., Zhai, M., Mori, G.: Attending to distinctive moments: Weakly-supervised attention  models for action localization in video. In: CVPR. pp. 328-336 (2017)  11. Cinbis, R.G., Verbeek, J., Schmid, C.: Weakly supervised object localization with multi-fold  multiple instance learning. PAMI 39(1), 189-203 (2017)  12. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical  image database. In: CVPR. pp. 248-255. IEEE (2009)  13. Diba, A., Sharma, V., Pazandeh, A., Pirsiavash, H., Van Gool, L.: Weakly supervised cascaded  convolutional networks. CVPR (2016)  14. Duchenne, O., Laptev, I., Sivic, J., Bach, F., Ponce, J.: Automatic annotation of human actions  in video. In: ICCV. pp. 1491-1498. IEEE (2009)  15. Durand, T., Mordan, T., Thome, N., Cord, M.: Wildcat: Weakly supervised learning of deep convnets for image classification, pointwise localization and segmentation. In: CVPR (2017) 16. Durand, T., Thome, N., Cord, M.: Weldon: Weakly supervised learning of deep convolutional  neural networks. In: CVPR. pp. 4743-4752 (2016)  17. Glorot, X., Bengio, Y.: Understanding the difficulty of training deep feedforward neural  networks. In: AISTATS. pp. 249-256 (2010)  18. Hartmann, G., Grundmann, M., Hoffman, J., Tsai, D., Kwatra, V., Madani, O., Vijaya- narasimhan, S., Essa, I., Rehg, J., Sukthankar, R.: Weakly supervised learning of object segmentations from web-scale video. In: ECCVW. pp. 198-208. Springer (2012)  19. Heilbron, F.C., Escorcia, V., Ghanem, B., Niebles, J.C.: Activitynet: A large-scale video  benchmark for human activity understanding. In: CVPR. pp. 961-970. IEEE (2015)  20. Huang, D.A., Fei-Fei, L., Niebles, J.C.: Connectionist temporal modeling for weakly super-  vised action labeling. In: ECCV. pp. 137-153. Springer (2016)  21. Idrees, H., Zamir, A.R., Jiang, Y.G., Gorban, A., Laptev, I., Sukthankar, R., Shah, M.: The thumos challenge on action recognition for videos in the wild. CVIU 155, 1-23 (2017) 22. Jain, M., van Gemert, J., Snoek, C.G., et al.: University of amsterdam at thumos challenge  2014. ECCVW 2014 (2014)  23. Jain, M., van Gemert, J.C., Snoek, C.G.: What do 15,000 object categories tell us about  classifying and localizing actions? In: CVPR. pp. 46-55 (2015)   W-TALC: Weakly-supervised Temporal Activity Localization and ClassificationReferences  1. Aggarwal, J.K., Ryoo, M.S.: Human activity analysis: A review. ACM Computing Surveys  (CSUR) 43(3), 16 (2011)  2. Arandjelovic, R., Gronat, P., Torii, A., Pajdla, T., Sivic, J.: Netvlad: Cnn architecture for  weakly supervised place recognition. In: CVPR. pp. 5297-5307 (2016)  3. Bearman, A., Russakovsky, O., Ferrari, V., Fei-Fei, L.: Whats the point: Semantic segmenta-  tion with point supervision. In: ECCV. pp. 549-565. Springer (2016)  4. Bilen, H., Vedaldi, A.: Weakly supervised deep detection networks. In: CVPR. pp. 2846-2854  (2016)  5. Bojanowski, P., Bach, F., Laptev, I., Ponce, J., Schmid, C., Sivic, J.: Finding actors and actions  in movies. In: ICCV. pp. 2280-2287. IEEE (2013)  6. Bojanowski, P., Lajugie, R., Bach, F., Laptev, I., Ponce, J., Schmid, C., Sivic, J.: Weakly supervised action labeling in videos under ordering constraints. In: ECCV. pp. 628-643. Springer (2014)  7. Bojanowski, P., Lajugie, R., Grave, E., Bach, F., Laptev, I., Ponce, J., Schmid, C.: Weakly-  supervised alignment of video with text. In: ICCV. pp. 4462-4470. IEEE (2015)  8. Bottou, L.: Large-scale machine learning with stochastic gradient descent. In: COMPSTAT,  pp. 177-186. Springer (2010)  9. Carreira, J., Zisserman, A.: Quo vadis, action recognition? a new model and the kinetics  dataset. In: CVPR. pp. 4724-4733. IEEE (2017)  10. Chen, L., Zhai, M., Mori, G.: Attending to distinctive moments: Weakly-supervised attention  models for action localization in video. In: CVPR. pp. 328-336 (2017)  11. Cinbis, R.G., Verbeek, J., Schmid, C.: Weakly supervised object localization with multi-fold  multiple instance learning. PAMI 39(1), 189-203 (2017)  12. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical  image database. In: CVPR. pp. 248-255. IEEE (2009)  13. Diba, A., Sharma, V., Pazandeh, A., Pirsiavash, H., Van Gool, L.: Weakly supervised cascaded  convolutional networks. CVPR (2016)  14. Duchenne, O., Laptev, I., Sivic, J., Bach, F., Ponce, J.: Automatic annotation of human actions  in video. In: ICCV. pp. 1491-1498. IEEE (2009)  15. Durand, T., Mordan, T., Thome, N., Cord, M.: Wildcat: Weakly supervised learning of deep convnets for image classification, pointwise localization and segmentation. In: CVPR (2017) 16. Durand, T., Thome, N., Cord, M.: Weldon: Weakly supervised learning of deep convolutional  neural networks. In: CVPR. pp. 4743-4752 (2016)  17. Glorot, X., Bengio, Y.: Understanding the difficulty of training deep feedforward neural  networks. In: AISTATS. pp. 249-256 (2010)  18. Hartmann, G., Grundmann, M., Hoffman, J., Tsai, D., Kwatra, V., Madani, O., Vijaya- narasimhan, S., Essa, I., Rehg, J., Sukthankar, R.: Weakly supervised learning of object segmentations from web-scale video. In: ECCVW. pp. 198-208. Springer (2012)  19. Heilbron, F.C., Escorcia, V., Ghanem, B., Niebles, J.C.: Activitynet: A large-scale video  benchmark for human activity understanding. In: CVPR. pp. 961-970. IEEE (2015)  20. Huang, D.A., Fei-Fei, L., Niebles, J.C.: Connectionist temporal modeling for weakly super-  vised action labeling. In: ECCV. pp. 137-153. Springer (2016)  21. Idrees, H., Zamir, A.R., Jiang, Y.G., Gorban, A., Laptev, I., Sukthankar, R., Shah, M.: The thumos challenge on action recognition for videos in the wild. CVIU 155, 1-23 (2017) 22. Jain, M., van Gemert, J., Snoek, C.G., et al.: University of amsterdam at thumos challenge  2014. ECCVW 2014 (2014)  23. Jain, M., van Gemert, J.C., Snoek, C.G.: What do 15,000 object categories tell us about  classifying and localizing actions? In: CVPR. pp. 46-55 (2015)   16  S. Paul, S. Roy and A. K. Roy-Chowdhury  24. Jie, Z., Wei, Y., Jin, X., Feng, J., Liu, W.: Deep self-taught learning for weakly supervised  object localization. CVPR (2017)  25. Kanazawa, A., Jacobs, D.W., Chandraker, M.: Warpnet: Weakly supervised matching for  single-view reconstruction. In: CVPR. pp. 3253-3261 (2016)  26. Karaman, S., Seidenari, L., Del Bimbo, A.: Fast saliency based pooling of fisher encoded  dense trajectories. In: ECCVW. vol. 1, p. 5 (2014)  27. Kay, W., Carreira, J., Simonyan, K., Zhang, B., Hillier, C., Vijayanarasimhan, S., Viola, F., Green, T., Back, T., Natsev, P., et al.: The kinetics human action video dataset. arXiv preprint arXiv:1705.06950 (2017)  28. Khoreva, A., Benenson, R., Hosang, J., Hein, M., Schiele, B.: Simple does it: Weakly super-  vised instance and semantic segmentation. In: CVPR (2017)  29. Khoreva, A., Benenson, R., Omran, M., Hein, M., Schiele, B.: Weakly supervised object  boundaries. In: CVPR. pp. 183-192 (2016)  30. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization (2014) 31. Kuehne, H., Richard, A., Gall, J.: Weakly supervised learning of actions from transcripts.  CVIU 163, 78-89 (2017)  32. Laptev, I., Marszalek, M., Schmid, C., Rozenfeld, B.: Learning realistic human actions from  movies. In: CVPR. pp. 1-8. IEEE (2008)  33. Li, D., Huang, J.B., Li, Y., Wang, S., Yang, M.H.: Weakly supervised object localization with  progressive domain adaptation. In: CVPR. pp. 3512-3520 (2016)  34. Nair, V., Hinton, G.E.: Rectified linear units improve restricted boltzmann machines. In:  35. Nguyen, P., Liu, T., Prasad, G., Han, B.: Weakly supervised action localization by sparse  ICML. pp. 807-814 (2010)  temporal pooling network. CVPR (2018)  36. Oneata, D., Verbeek, J., Schmid, C.: The lear submission at thumos 2014 (2014) 37. Panda, R., Das, A., Wu, Z., Ernst, J., Roy-Chowdhury, A.K.: Weakly supervised summariza-  tion of web videos. In: ICCV. pp. 3657-3666 (2017)  38. Pathak, D., Krahenbuhl, P., Darrell, T.: Constrained convolutional neural networks for weakly  supervised segmentation. In: ICCV. pp. 1796-1804 (2015)  39. Richard, A., Gall, J.: Temporal action detection using a statistical language model. In: CVPR.  40. Richard, A., Kuehne, H., Gall, J.: Weakly supervised action learning with rnn based fine-to-  pp. 3131-3140 (2016)  coarse modeling. CVPR (2017)  41. Shen, Z., Li, J., Su, Z., Li, M., Chen, Y., Jiang, Y.G., Xue, X.: Weakly supervised dense video  captioning. In: CVPR. vol. 2, p. 10 (2017)  42. Shi, Z., Siva, P., Xiang, T.: Transfer learning by ranking for weakly supervised object annota-  tion. BMVC (2012)  43. Shou, Z., Chan, J., Zareian, A., Miyazawa, K., Chang, S.F.: Cdc: convolutional-de- convolutional networks for precise temporal action localization in untrimmed videos. In: CVPR. pp. 1417-1426. IEEE (2017)  44. Shou, Z., Wang, D., Chang, S.F.: Temporal action localization in untrimmed videos via  multi-stage cnns. In: CVPR. pp. 1049-1058 (2016)  45. Simonyan, K., Zisserman, A.: Two-stream convolutional networks for action recognition in  46. Singh, A., Yang, L., Levine, S.: Gplac: Generalizing vision-based robotic skills using weakly  videos. In: NIPS. pp. 568-576 (2014)  labeled images. ICCV (2017)  47. Singh, K.K., Lee, Y.J.: Hide-and-seek: Forcing a network to be meticulous for weakly-  supervised object and action localization. In: ICCV (2017)  48. Siva, P., Xiang, T.: Weakly supervised action detection. In: BMVC. vol. 2, p. 6 (2011) 49. Srivastava, N., Hinton, G., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.: Dropout: A simple  way to prevent neural networks from overfitting. JMLR 15(1), 1929-1958 (2014)   W-TALC: Weakly-supervised Temporal Activity Localization and Classification50. Sultani, W., Shah, M.: What if we do not have multiple videos of the same action?-video  action localization using web images. In: CVPR. pp. 1077-1085 (2016)  51. Tran, D., Bourdev, L., Fergus, R., Torresani, L., Paluri, M.: Learning spatiotemporal features  with 3d convolutional networks. In: ICCV. pp. 4489-4497 (2015)  52. Tulyakov, S., Ivanov, A., Fleuret, F.: Weakly supervised learning of deep metrics for stereo  reconstruction. In: CVPR. pp. 1339-1348 (2017)  53. Varol, G., Salah, A.A.: Efficient large-scale action recognition in videos using extreme learning  machines. Expert Systems with Applications 42(21), 8274-8282 (2015)  54. Vezhnevets, A., Buhmann, J.M.: Towards weakly supervised semantic segmentation by means  of multiple instance and multitask learning. In: CVPR. pp. 3249-3256. IEEE (2010)  55. Wang, H., Schmid, C.: Action recognition with improved trajectories. In: ICCV. pp. 3551-  3558 (2013)  56. Wang, L., Qiao, Y., Tang, X.: Action recognition and detection by combining motion and  appearance features. THUMOS14 Action Recognition Challenge 1(2), 2 (2014)  57. Wang, L., Xiong, Y., Lin, D., Van Gool, L.: Untrimmednets for weakly supervised action  recognition and detection. In: CVPR (2017)  58. Wang, L., Xiong, Y., Wang, Z., Qiao, Y., Lin, D., Tang, X., Van Gool, L.: Temporal segment networks: Towards good practices for deep action recognition. In: ECCV. pp. 20-36. Springer (2016)  59. Wei, Y., Liang, X., Chen, Y., Shen, X., Cheng, M.M., Feng, J., Zhao, Y., Yan, S.: Stc: A simple to complex framework for weakly-supervised semantic segmentation. PAMI 39(11), 2314-2320 (2017)  60. Weinzaepfel, P., Martin, X., Schmid, C.: Human action localization with sparse spatial  supervision. arXiv preprint arXiv:1605.05197 (2016)  61. Weinzaepfel, P., Martin, X., Schmid, C.: Towards weaklysupervised action localization. arXiv  62. Xu, H., Das, A., Saenko, K.: R-c3d: Region convolutional 3d network for temporal activity  63. Yan, Y., Xu, C., Cai, D., Corso, J.: Weakly supervised actor-action segmentation via robust  preprint arXiv:1605.05197 3(7) (2016)  detection. In: ICCV. vol. 6, p. 8 (2017)  multi-task ranking. CVPR 48, 61 (2017)  64. Yeung, S., Russakovsky, O., Mori, G., Fei-Fei, L.: End-to-end learning of action detection  from frame glimpses in videos. In: CVPR. pp. 2678-2687 (2016)  65. Yuan, J., Ni, B., Yang, X., Kassim, A.A.: Temporal action localization with pyramid of score  distribution features. In: CVPR. pp. 3093-3102 (2016)  66. Yuan, Z., Stroud, J.C., Lu, T., Deng, J.: Temporal action localization by structured maximal  sums. CVPR (2017)  67. Zhang, B., Wang, L., Wang, Z., Qiao, Y., Wang, H.: Real-time action recognition with  enhanced motion vector cnns. In: CVPR. pp. 2718-2726 (2016)  68. Zhao, Y., Xiong, Y., Wang, L., Wu, Z., Tang, X., Lin, D.: Temporal action detection with  structured segment networks. In: ICCV. vol. 8 (2017)  69. Zhong, B., Yao, H., Chen, S., Ji, R., Chin, T.J., Wang, H.: Visual tracking via weakly su- pervised learning from multiple imperfect oracles. Pattern Recognition 47(3), 1395-1410 (2014)  70. Zhou, Z.H.: Multi-instance learning: A survey. Department of Computer Science & Technol-  ogy, Nanjing University, Tech. Rep (2004)  71. Zhu, Y., Zhou, Y., Ye, Q., Qiu, Q., Jiao, J.: Soft proposal networks for weakly supervised  object localization. arXiv preprint arXiv:1709.01829 (2017)"}