{"1": "(2009)  1. Krizhevsky, A., Hinton, G.: Learning multiple layers of features from tiny images.  2. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Advances in neural information processing systems. (2012) 1097-1105  3. Hannun, A., Case, C., Casper, J., Catanzaro, B., Diamos, G., Elsen, E., Prenger, R., Satheesh, S., Sengupta, S., Coates, A., et al.: Deep speech: Scaling up end-to- end speech recognition. arXiv preprint arXiv:1412.5567 (2014)  4. Sutskever, I., Vinyals, O., Le, Q.V.: Sequence to sequence learning with neural In: Advances in neural information processing systems. (2014) 3104-  5. Negrinho, R., Gordon, G.: Deeparchitect: Automatically designing and training  deep architectures. arXiv preprint arXiv:1704.08792 (2017)  6. Zoph, B., Le, Q.V.: Neural architecture search with reinforcement learning.  networks. 3112  ICLR’17 (2016)  7. Pham, H., Guan, M.Y., Zoph, B., Le, Q.V., Dean, J.: Eﬃcient neural architecture  search via parameter sharing. arXiv preprint arXiv:1802.03268 (2018)  8. Baker, B., Gupta, O., Naik, N., Raskar, R.: Designing neural network architectures  using reinforcement learning. ICLR’17 (2016)  9. Zoph, B., Vasudevan, V., Shlens, J., Le, Q.V.: Learning transferable architectures  for scalable image recognition. arXiv preprint arXiv:1707.07012 (2017)  10. Zhong, Z., Yan, J., Liu, C.L.: Practical network blocks design with q-learning.  AAAI’18 (2017)  11. Real, E., Moore, S., Selle, A., Saxena, S., Suematsu, Y.L., Le, Q., Kurakin, A.:  Large-scale evolution of image classifiers. ICML’17 (2017)  12. Xie, L., Yuille, A.: Genetic cnn. ICCV’17 (2017) 13. Liu, H., Simonyan, K., Vinyals, O., Fernando, C., Kavukcuoglu, K.: Hierarchical  representations for eﬃcient architecture search. ICLR’18 (2017)  14. Real, E., Aggarwal, A., Huang, Y., Le, Q.V.: Regularized evolution for image  classifier architecture search. arXiv preprint arXiv:1802.01548 (2018)   14  J.-D. Dong, A.-C. Cheng, D.-C. Juan, W. Wei, M. Sun  Titan X GPU, (2) NVIDIA Jetson TX1 embedded system, and (3) mobile phone with ARM Cortex-A53. Compared to CondenseNet and NASNet (Mobile), DPP- Net achieves better performances: higher accuracy & shorter inference time on these various devices. Additional experimental results also show that models found by DPP-Net achieve state-of-the-art performance on ImageNet.  8 Acknowledgement  We are grateful to the National Center for High-performance Computing for com- puter time and facilities, and Google Research, MediaTek, MOST 107-2634-F- 007-007 for their support. This research is also supported in part by the Ministry of Science and Technology of Taiwan (MOST 107-2633-E-002-001), National Tai- wan University, Intel Corporation, and Delta Electronics.  References  (2009)  1. Krizhevsky, A., Hinton, G.: Learning multiple layers of features from tiny images.  2. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Advances in neural information processing systems. (2012) 1097-1105  3. Hannun, A., Case, C., Casper, J., Catanzaro, B., Diamos, G., Elsen, E., Prenger, R., Satheesh, S., Sengupta, S., Coates, A., et al.: Deep speech: Scaling up end-to- end speech recognition. arXiv preprint arXiv:1412.5567 (2014)  4. Sutskever, I., Vinyals, O., Le, Q.V.: Sequence to sequence learning with neural In: Advances in neural information processing systems. (2014) 3104-  5. Negrinho, R., Gordon, G.: Deeparchitect: Automatically designing and training  deep architectures. arXiv preprint arXiv:1704.08792 (2017)  6. Zoph, B., Le, Q.V.: Neural architecture search with reinforcement learning.  networks. 3112  ICLR’17 (2016)  7. Pham, H., Guan, M.Y., Zoph, B., Le, Q.V., Dean, J.: Eﬃcient neural architecture  search via parameter sharing. arXiv preprint arXiv:1802.03268 (2018)  8. Baker, B., Gupta, O., Naik, N., Raskar, R.: Designing neural network architectures  using reinforcement learning. ICLR’17 (2016)  9. Zoph, B., Vasudevan, V., Shlens, J., Le, Q.V.: Learning transferable architectures  for scalable image recognition. arXiv preprint arXiv:1707.07012 (2017)  10. Zhong, Z., Yan, J., Liu, C.L.: Practical network blocks design with q-learning.  AAAI’18 (2017)  11. Real, E., Moore, S., Selle, A., Saxena, S., Suematsu, Y.L., Le, Q., Kurakin, A.:  Large-scale evolution of image classifiers. ICML’17 (2017)  12. Xie, L., Yuille, A.: Genetic cnn. ICCV’17 (2017) 13. Liu, H., Simonyan, K., Vinyals, O., Fernando, C., Kavukcuoglu, K.: Hierarchical  representations for eﬃcient architecture search. ICLR’18 (2017)  14. Real, E., Aggarwal, A., Huang, Y., Le, Q.V.: Regularized evolution for image  classifier architecture search. arXiv preprint arXiv:1802.01548 (2018)   DPP-Net15. Liu, C., Zoph, B., Shlens, J., Hua, W., Li, L.J., Fei-Fei, L., Yuille, A., Huang, J., Murphy, K.: Progressive neural architecture search. arXiv preprint arXiv:1712.00559 (2017)  16. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: Mobilenets: Eﬃcient convolutional neural networks for mobile vision applications. arXiv preprint arXiv:1704.04861 (2017)  17. Zhang, X., Zhou, X., Lin, M., Sun, J.: Shuﬄenet: An extremely eﬃcient convolu- tional neural network for mobile devices. arXiv preprint arXiv:1707.01083 (2017) 18. Huang, G., Liu, S., van der Maaten, L., Weinberger, K.Q.: Condensenet: An eﬃ- cient densenet using learned group convolutions. arXiv preprint arXiv:1711.09224 (2017)  19. Kim, Y.H., Reddy, B., Yun, S., Seo, C.: Nemo: Neuro-evolution with multiobjective optimization of deep neural network for speed and accuracy. ICML’17 AutoML Workshop (2017)  20. Williams, R.J.: Simple statistical gradient-following algorithms for connectionist  reinforcement learning. Mach. Learn. 8(3-4) (May 1992) 229-256  21. Schulman, J., Wolski, F., Dhariwal, P., Radford, A., Klimov, O.: Proximal policy  optimization algorithms. arXiv preprint arXiv:1707.06347 (2017)  22. Cai, H., Chen, T., Zhang, W., Yu, Y., Wang, J.: Eﬃcient architecture search by  network transformation. AAAI’18 (2017)  23. Hutter, F., Hoos, H.H., Leyton-Brown, K.: Sequential model-based optimization International Conference on Learning and  for general algorithm configuration. Intelligent Optimization (2011)  24. Baker, B., Gupta, O., Raskar, R., Naik, N.: Accelerating neural architecture search  using performance prediction. (2018)  25. Brock, A., Lim, T., Ritchie, J.M., Weston, N.: Smash: one-shot model architecture  search through hypernetworks. ICLR’18 (2017)  26. Chollet, F.: Xception: Deep learning with depthwise separable convolutions. arXiv  preprint (2016)  27. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on, IEEE (2009) 248-255  28. Ba, J.L., Kiros, J.R., Hinton, G.E.:  Layer normalization.  arXiv preprint  arXiv:1607.06450 (2016)  arXiv:1412.6980 (2014)  29. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  30. Loshchilov, I., Hutter, F.: Sgdr: stochastic gradient descent with restarts. arXiv  preprint arXiv:1608.03983 (2016)  31. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected  convolutional networks. CVPR’17 (2017)  32. Paszke, A., Gross, S., Chintala, S., Chanan, G., Yang, E., DeVito, Z., Lin, Z., Desmaison, A., Antiga, L., Lerer, A.: Automatic diﬀerentiation in pytorch. (2017)"}