{"1": "1. Endres, F., Hess, J., Sturm, J., Cremers, D., Burgard, W.: 3-D mapping with an  RGB-D camera. IEEE Transactions on Robotics 30(1) (2014) 177-187  2. Fischler, M.A., Bolles, R.C.: Random sample consensus: a paradigm for model fitting with applications to image analysis and automated cartography. Commu- nications of the ACM 24(6) (June 1981) 381-395  3. Umeyama, S.: Least-squares estimation of transformation parameters between two point patterns. IEEE Transactions on pattern analysis and machine intelligence 13(4) (1991) 376-380  4. Hulik, R., Spanel, M., Smrz, P., Materna, Z.: Continuous plane detection in point- cloud data based on 3d hough transform. Journal of visual communication and image representation 25(1) (January 2014) 86-97  5. Schnabel, R., Wahl, R., Klein, R.: Eﬃcient ransac for point-cloud shape detection.  Computer Graphics Forum 26(2) (June 2007) 214-226  6. Holz, D., Holzer, S., Rusu, R.B., Behnke, S.: Real-time plane segmentation using rgb-d cameras. In Roefer, T., Mayer, N.M., Savage, J., Saranli, U., eds.: Robot Soccer World Cup XV, Springer, Berlin, Heidelberg (2011) 306-317  7. Feng, C., Taguchi, Y., Kamat, V.R.: Fast plane extraction in organized point clouds using agglomerative hierarchical clustering. In: IEEE International Conference on Robotics and Automation (ICRA), IEEE (2014) 6218-6225  8. Kaiser, A., Ybanez Zepeda, J.A., Boubekeur, T.: A survey of simple geometric primitives detection methods for captured 3d data. Computer Graphics Forum (to appear) (2018)  9. Li, L.: Filtering for 3d time-of-ﬂight sensors. Technical Report SLOA230, Texas  Instruments (January 2016)  10. Tomasi, C., Manduchi, R.: Bilateral filtering for gray and color images. In: Sixth  International Conference on Computer Vision, IEEE (1998) 839-846  11. Shao, L., Han, J., Kohli, P., Zhang, Z., eds.: Computer vision and machine learning with RGB-D sensors. Advances in Computer Vision and Pattern Recognition. Springer International Publishing (2014)  12. Essmaeel, K., Gallo, L., Damiani, E., De Pietro, G., Dipand`a, A.: Temporal de- noising of kinect depth data. In: Eighth International Conference on Signal Image Technology and Internet Based Systems (SITIS), IEEE (2012) 47-52  13. Liu, S., Chen, C., Kehtarnava, N.: A computationally eﬃcient denoising and hole- filling method for depth image enhancement. In Kehtarnavaz, N., Carlsohn, M.F., eds.: SPIE Conference on Real-Time Image and Video Processing, SPIE (April 2016)  14. Le, A.V., Jung, S.W., Won, C.S.: Directional joint bilateral filter for depth images.  Sensors 14(7) (2014) 11362-11378  15. Newcombe, R.A., Izadi, S., Hilliges, O., Molyneaux, D., Kim, D., Davison, A.J., Kohi, P., Shotton, J., Hodges, S., Fitzgibbon, A.: Kinectfusion: Real-time dense surface mapping and tracking. In: IEEE International Symposium on Mixed and Augmented Reality (ISMAR), IEEE (October 2011) 127-136  16. Bapat, A., Ravi, A., Raman, S.: An iterative, non-local approach for restoring depth maps in rgb-d images. In: Twenty First National Conference on Communi- cations (NCC), IEEE (2015) 1-6  17. Camplani, M., Salgado, L.: Adaptive spatio-temporal filter for low-cost camera depth maps. In: IEEE International Conference on Emerging Signal Processing Applications (ESPA), IEEE (2012) 33-36   Proxy CloudsReferences  1. Endres, F., Hess, J., Sturm, J., Cremers, D., Burgard, W.: 3-D mapping with an  RGB-D camera. IEEE Transactions on Robotics 30(1) (2014) 177-187  2. Fischler, M.A., Bolles, R.C.: Random sample consensus: a paradigm for model fitting with applications to image analysis and automated cartography. Commu- nications of the ACM 24(6) (June 1981) 381-395  3. Umeyama, S.: Least-squares estimation of transformation parameters between two point patterns. IEEE Transactions on pattern analysis and machine intelligence 13(4) (1991) 376-380  4. Hulik, R., Spanel, M., Smrz, P., Materna, Z.: Continuous plane detection in point- cloud data based on 3d hough transform. Journal of visual communication and image representation 25(1) (January 2014) 86-97  5. Schnabel, R., Wahl, R., Klein, R.: Eﬃcient ransac for point-cloud shape detection.  Computer Graphics Forum 26(2) (June 2007) 214-226  6. Holz, D., Holzer, S., Rusu, R.B., Behnke, S.: Real-time plane segmentation using rgb-d cameras. In Roefer, T., Mayer, N.M., Savage, J., Saranli, U., eds.: Robot Soccer World Cup XV, Springer, Berlin, Heidelberg (2011) 306-317  7. Feng, C., Taguchi, Y., Kamat, V.R.: Fast plane extraction in organized point clouds using agglomerative hierarchical clustering. In: IEEE International Conference on Robotics and Automation (ICRA), IEEE (2014) 6218-6225  8. Kaiser, A., Ybanez Zepeda, J.A., Boubekeur, T.: A survey of simple geometric primitives detection methods for captured 3d data. Computer Graphics Forum (to appear) (2018)  9. Li, L.: Filtering for 3d time-of-ﬂight sensors. Technical Report SLOA230, Texas  Instruments (January 2016)  10. Tomasi, C., Manduchi, R.: Bilateral filtering for gray and color images. In: Sixth  International Conference on Computer Vision, IEEE (1998) 839-846  11. Shao, L., Han, J., Kohli, P., Zhang, Z., eds.: Computer vision and machine learning with RGB-D sensors. Advances in Computer Vision and Pattern Recognition. Springer International Publishing (2014)  12. Essmaeel, K., Gallo, L., Damiani, E., De Pietro, G., Dipand`a, A.: Temporal de- noising of kinect depth data. In: Eighth International Conference on Signal Image Technology and Internet Based Systems (SITIS), IEEE (2012) 47-52  13. Liu, S., Chen, C., Kehtarnava, N.: A computationally eﬃcient denoising and hole- filling method for depth image enhancement. In Kehtarnavaz, N., Carlsohn, M.F., eds.: SPIE Conference on Real-Time Image and Video Processing, SPIE (April 2016)  14. Le, A.V., Jung, S.W., Won, C.S.: Directional joint bilateral filter for depth images.  Sensors 14(7) (2014) 11362-11378  15. Newcombe, R.A., Izadi, S., Hilliges, O., Molyneaux, D., Kim, D., Davison, A.J., Kohi, P., Shotton, J., Hodges, S., Fitzgibbon, A.: Kinectfusion: Real-time dense surface mapping and tracking. In: IEEE International Symposium on Mixed and Augmented Reality (ISMAR), IEEE (October 2011) 127-136  16. Bapat, A., Ravi, A., Raman, S.: An iterative, non-local approach for restoring depth maps in rgb-d images. In: Twenty First National Conference on Communi- cations (NCC), IEEE (2015) 1-6  17. Camplani, M., Salgado, L.: Adaptive spatio-temporal filter for low-cost camera depth maps. In: IEEE International Conference on Emerging Signal Processing Applications (ESPA), IEEE (2012) 33-36   16  A. Kaiser, J. A. Ybanez Zepeda, T. Boubekeur  18. Schmeing, M., Jiang, X.: Color segmentation based depth image filtering. In Jiang, X., Bellon, O.R.P., Goldgof, D., Oishi, T., eds.: Advances in Depth Image Anal- ysis and Applications (WDIA 2012). Volume 7854 of Lecture Notes in Computer Science., Springer, Berlin, Heidelberg (2013) 68-77  19. Chen, L., Lin, H., Li, S.: Depth image enhancement for kinect using region grow- ing and bilateral filter. In: 21st International Conference on Pattern Recognition (ICPR), IEEE (2012) 3070-3073  20. Wu, C., Zollh¨ofer, M., Nießner, M., Stamminger, M., Izadi, S., Theobalt, C.: Real- time shading-based refinement for consumer depth cameras. ACM Transactions on Graphics (TOG) 33(6) (2014) 200  21. Kopf, J., Cohen, M.F., Lischinski, D., Uyttendaele, M.: Joint bilateral upsampling.  ACM Transactions on Graphics (ToG) 26(3) (2007) 96  22. Min, D., Lu, J., Do, M.N.: Depth video enhancement based on weighted mode  filtering. IEEE Transactions on Image Processing 21(3) (2012) 1176-1190  23. Liu, R., Deng, Z., Yi, L., Huang, Z., Cao, D., Xu, M., Jia, R.: Hole-filling based on disparity map and inpainting for depth-image-based rendering. International Journal of Hybrid Information Technology 9(5) (2016) 145-164  24. Buyssens, P., Daisy, M., Tschumperl´e, D., L´ezoray, O.: Superpixel-based depth In: IEEE International Conference on  map inpainting for rgb-d view synthesis. Image Processing (ICIP), IEEE (2015) 4332-4336  25. Solh, M., AlRegib, G.: Hierarchical hole-filling for depth-based view synthesis in ftv and 3d video. IEEE Journal of Selected Topics in Signal Processing 6(5) (2012) 495-504  26. Schnabel, R., Degener, P., Klein, R.: Completion and reconstruction with primitive  shapes. Computer Graphics Forum 28(2) (March 2009) 503-512  27. Biswas, J., Veloso, M.: Planar polygon extraction and merging from depth images. In: IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), IEEE (2012) 3859-3864  28. Labb´e, M., Michaud, F.: Online global loop closure detection for large-scale multi- session graph-based slam. In: IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), IEEE (September 2014) 2661-2666  29. Hsiao, M., Westman, E., Zhang, G., Kaess, M.: Keyframe-based dense planar slam. In: IEEE International Conference on Robotics and Automation (ICRA), IEEE (May 2017) 5110-5117  30. Mur-Artal, R., Tard´os, J.D.: Orb-slam2: An open-source slam system for monoc- IEEE Transactions on Robotics 33(5) (2017)  ular, stereo, and rgb-d cameras. 1255-1262  31. Keller, M., Leﬂoch, D., Lambers, M., Izadi, S., Weyrich, T., Kolb, A.: Real-time In: International  3d reconstruction in dynamic scenes using point-based fusion. Conference on 3D Vision (3DV), IEEE (June 2013) 1-8  32. Salas-Moreno, R.F., Glocken, B., Kelly, P.H., Davison, A.J.: Dense planar slam. In: IEEE International Symposium on Mixed and Augmented Reality (ISMAR), IEEE (September 2014) 157-164  33. Elghor, H.E., Roussel, D., Ababsa, F., Bouyakhf, E.H.: Planes detection for robust localization and mapping in rgb-d slam systems. In: International Conference on 3D Vision (3DV), IEEE (October 2015) 452-459  34. Dou, M., Guan, L., Frahm, J.M., Fuchs, H.: Exploring high-level plane primi- tives for indoor 3d reconstruction with a hand-held rgb-d camera. In Lee, K.M., Matsushita, Y., Rehg, J.M., Hu, Z., eds.: Asian Conference on Computer Vision. Volume 7724 of Lecture Notes in Computer Science., Springer, Berlin, Heidelberg (November 2012) 94-108   Proxy Clouds35. Kaess, M.: Simultaneous localization and mapping with infinite planes. In: IEEE International Conference on Robotics and Automation (ICRA), IEEE (May 2015) 4605-4611  36. Gao, X., Zhang, T.: Robust rgb-d simultaneous localization and mapping using  planar point features. Robotics and Autonomous Systems 72 (2015) 1-14  37. Zhang, E., Cohen, M.F., Curless, B.: Emptying, refurnishing, and relighting indoor  spaces. ACM Transactions on Graphics (TOG) 35(6) (2016) 174  38. Nießner, M., Zollh¨ofer, M., Izadi, S., Stamminger, M.: Real-time 3d reconstruction at scale using voxel hashing. ACM Transactions on Graphics (ToG) 32(6) (2013) 169  39. Dai, A., Nießner, M., Zollh¨ofer, M., Izadi, S., Theobalt, C.: Bundlefusion: Real- time globally consistent 3d reconstruction using on-the-ﬂy surface reintegration. ACM Transactions on Graphics (TOG) 36(3) (2017) 24  40. Zhang, Y., Xu, W., Tong, Y., Zhou, K.: Online structure analysis for real-time indoor scene reconstruction. ACM Transactions on Graphics (TOG) 34(5) (2015) 159  41. Dzitsiuk, M., Sturm, J., Maier, R., Ma, L., Cremers, D.: De-noising, stabilizing and completing 3d reconstructions on-the-go using plane priors. In: IEEE International Conference on Robotics and Automation (ICRA), IEEE (May 2017) 3976-3983 42. Huang, J., Dai, A., Guibas, L., Niessner, M.: 3dlite: towards commodity 3d scan- ning for content creation. ACM Transactions on Graphics (TOG) 36(6) (2017) 203  43. Kass, M., Solomon, J.: Smoothed local histogram filters. ACM Transactions on  Graphics (TOG) 29(4) (2010) 100  44. Serra, J.: (1983)  Image analysis and mathematical morphology. Academic Press, Inc.  45. Wallace, G.K.: The jpeg still picture compression standard. IEEE transactions on  consumer electronics 38(1) (1992) xviii-xxxiv  46. Nenci, F., Spinello, L., Stachniss, C.: Eﬀective compression of range data streams for remote robot operations using h. 264. In: IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), IEEE (September 2014) 3794-3799 47. Cignoni, P., Rocchini, C., Scopigno, R.: Metro: Measuring error on simplified  surfaces. Computer Graphics Forum 17(2) (1998) 167-174  48. Lefebvre, S., Hoppe, H.: Compressed random-access trees for spatially coherent In Kautz, J., Pattanaik, S., eds.: Proceedings of the 18th Eurographics  data. conference on Rendering Techniques, Eurographics Association (2007) 339-349 49. Raposo, C., Lourenco, M., Goncalves Almeida Antunes, M., Barreto, J.P.: Plane- In: British Machine Vision Conference  based odometry using an rgb-d camera. (BMVC), Elsevier (September 2013)  50. Dai, A., Chang, A.X., Savva, M., Halber, M., Funkhouser, T., Nießner, M.: Scannet: In: IEEE Conference on  Richly-annotated 3d reconstructions of indoor scenes. Computer Vision and Pattern Recognition (CVPR), IEEE (July 2017)"}