{"1": "1. Baradel, F., Wolf, C., Mille, J.: Human action recognition: Pose-based attention draws focus to hands. In: International Conference on Computer Vision Workshop (2017)  2. Bobick, A.F., Davis, J.W.: The recognition of human movement using temporal templates. IEEE Transactions on pattern analysis and machine intelligence 23(3), 257-267 (2001)  3. Cai, Z., Wang, L., Peng, X., Qiao, Y.: Multi-view super vector for action recogni- tion. In: International Conference on Computer Vision and Pattern Recognition. pp. 596-603 (2014)  4. Cao, L., Luo, J., Liang, F., Huang, T.S.: Heterogeneous feature machines for vi- sual recognition. In: International Conference on Computer Vision. pp. 1095-1102 (2009)  5. Du, Y., Wang, W., Wang, L.: Hierarchical recurrent neural network for skeleton based action recognition. In: International Conference on Computer Vision and Pattern Recognition. pp. 1110-1118 (2015)  6. Evangelidis, G., Singh, G., Horaud, R.: Skeletal quads: Human action recognition using joint quadruples. In: International Conference on Pattern Recognition. pp. 4513-4518 (2014)  7. Fernando, B., Gavves, E., Oramas, J., Ghodrati, A., Tuytelaars, T.: Rank pool- ing for action recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(4), 773-787 (2017)  8. Fernando, B., Gould, S.: Learning end-to-end video classification with rank- pooling. In: International Conference on Machine Learning. pp. 1187-1196 (2016) 9. Fukui, A., Park, D.H., Yang, D., Rohrbach, A., Darrell, T., Rohrbach, M.: Multi- modal compact bilinear pooling for visual question answering and visual grounding. arXiv preprint arXiv:1606.01847 (2016)  10. Gao, Y., Beijbom, O., Zhang, N., Darrell, T.: Compact bilinear pooling. In: In- ternational Conference on Computer Vision and Pattern Recognition. pp. 317-326 (2016)  11. Gu, Q., Zhou, J.: Learning the shared subspace for multi-task clustering and trans- ductive transfer classification. In: International Conference on Data Mining. pp. 159-168 (2009)  12. Hu, J.F., Zheng, W.S., Lai, J., Zhang, J.: Jointly learning heterogeneous features for rgb-d activity recognition. In: International Conference on Computer Vision and Pattern Recognition. pp. 5344-5352 (2015)  13. Hu, J.F., Zheng, W.S., Lai, J., Zhang, J.: Jointly learning heterogeneous features for rgb-d activity recognition. IEEE transactions on pattern analysis and machine intelligence 39(11), 2186-2200 (2017)  14. Hu, J.F., Zheng, W.S., Ma, L., Wang, G., Lai, J.: Real-time rgb-d activity predic- tion by soft regression. In: European Conference on Computer Vision. pp. 280-296 (2016)  15. Hussein, M.E., Torki, M., Gowayyed, M.A., El-Saban, M.: Human action recogni- tion using a temporal hierarchy of covariance descriptors on 3d joint locations. In: International Joint Conferences on Artificial Intelligence. vol. 13, pp. 2466-2472 (2013)  16. Karpathy, A., Toderici, G., Shetty, S., Leung, T., Sukthankar, R., Fei-Fei, L.: Large-scale video classification with convolutional neural networks. In: Interna- tional Conference on Computer Vision and Pattern Recognition. pp. 1725-1732 (2014)   Deep Bilinear Learning for RGB-D Action RecognitionReferences  1. Baradel, F., Wolf, C., Mille, J.: Human action recognition: Pose-based attention draws focus to hands. In: International Conference on Computer Vision Workshop (2017)  2. Bobick, A.F., Davis, J.W.: The recognition of human movement using temporal templates. IEEE Transactions on pattern analysis and machine intelligence 23(3), 257-267 (2001)  3. Cai, Z., Wang, L., Peng, X., Qiao, Y.: Multi-view super vector for action recogni- tion. In: International Conference on Computer Vision and Pattern Recognition. pp. 596-603 (2014)  4. Cao, L., Luo, J., Liang, F., Huang, T.S.: Heterogeneous feature machines for vi- sual recognition. In: International Conference on Computer Vision. pp. 1095-1102 (2009)  5. Du, Y., Wang, W., Wang, L.: Hierarchical recurrent neural network for skeleton based action recognition. In: International Conference on Computer Vision and Pattern Recognition. pp. 1110-1118 (2015)  6. Evangelidis, G., Singh, G., Horaud, R.: Skeletal quads: Human action recognition using joint quadruples. In: International Conference on Pattern Recognition. pp. 4513-4518 (2014)  7. Fernando, B., Gavves, E., Oramas, J., Ghodrati, A., Tuytelaars, T.: Rank pool- ing for action recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(4), 773-787 (2017)  8. Fernando, B., Gould, S.: Learning end-to-end video classification with rank- pooling. In: International Conference on Machine Learning. pp. 1187-1196 (2016) 9. Fukui, A., Park, D.H., Yang, D., Rohrbach, A., Darrell, T., Rohrbach, M.: Multi- modal compact bilinear pooling for visual question answering and visual grounding. arXiv preprint arXiv:1606.01847 (2016)  10. Gao, Y., Beijbom, O., Zhang, N., Darrell, T.: Compact bilinear pooling. In: In- ternational Conference on Computer Vision and Pattern Recognition. pp. 317-326 (2016)  11. Gu, Q., Zhou, J.: Learning the shared subspace for multi-task clustering and trans- ductive transfer classification. In: International Conference on Data Mining. pp. 159-168 (2009)  12. Hu, J.F., Zheng, W.S., Lai, J., Zhang, J.: Jointly learning heterogeneous features for rgb-d activity recognition. In: International Conference on Computer Vision and Pattern Recognition. pp. 5344-5352 (2015)  13. Hu, J.F., Zheng, W.S., Lai, J., Zhang, J.: Jointly learning heterogeneous features for rgb-d activity recognition. IEEE transactions on pattern analysis and machine intelligence 39(11), 2186-2200 (2017)  14. Hu, J.F., Zheng, W.S., Ma, L., Wang, G., Lai, J.: Real-time rgb-d activity predic- tion by soft regression. In: European Conference on Computer Vision. pp. 280-296 (2016)  15. Hussein, M.E., Torki, M., Gowayyed, M.A., El-Saban, M.: Human action recogni- tion using a temporal hierarchy of covariance descriptors on 3d joint locations. In: International Joint Conferences on Artificial Intelligence. vol. 13, pp. 2466-2472 (2013)  16. Karpathy, A., Toderici, G., Shetty, S., Leung, T., Sukthankar, R., Fei-Fei, L.: Large-scale video classification with convolutional neural networks. In: Interna- tional Conference on Computer Vision and Pattern Recognition. pp. 1725-1732 (2014)   16  J.-F. Hu, W.-S. Zheng, J. Pan, J. Lai, and J. Zhang  17. Ke, Q., Bennamoun, M., An, S., Sohel, F., Boussaid, F.: A new representation of skeleton sequences for 3d action recognition. arXiv preprint arXiv:1703.03492 (2017)  18. Klaser, A., Marsza lek, M., Schmid, C.: A spatio-temporal descriptor based on 3d-  gradients. In: British Machine Vision Conference. pp. 275-1 (2008)  19. Koppula, H.S., Gupta, R., Saxena, A.: Learning human activities and object af- fordances from rgb-d videos. International Journal of Robotics Research 32(8), 951-970 (2013)  20. Lillo, I., Soto, A., Niebles, J.C.: Discriminative hierarchical modeling of spatio- temporally composable human activities. In: International Conference on Com- puter Vision and Pattern Recognition. pp. 812-819 (2014)  21. Lin, T.Y., RoyChowdhury, A., Maji, S.: Bilinear cnn models for fine-grained visual recognition. In: IEEE International Conference on Computer Vision. pp. 1449-1457 (2015)  22. Liu, J., Shahroudy, A., Xu, D., Wang, G.: Spatio-temporal lstm with trust gates for 3d human action recognition. In: European Conference on Computer Vision, pp. 816-833 (2016)  23. Liu, J., Wang, G., Hu, P., Duan, L.Y., Kot, A.C.: Global context-aware attention lstm networks for 3d action recognition. In: International Conference on Computer Vision and Pattern Recognition. pp. 1647-1656 (2017)  24. Lu, C., Jia, J., Tang, C.K.: Range-sample depth feature for action recognition. In: International Conference on Computer Vision and Pattern Recognition. pp. 772-779 (2014)  25. Oﬂi, F., Chaudhry, R., Kurillo, G., Vidal, R., Bajcsy, R.: Sequence of the most informative joints (smij): A new representation for human skeletal action recog- nition. Journal of Visual Communication and Image Representation 25(1), 24-38 (2014)  26. Oreifej, O., Liu, Z.: Hon4d: Histogram of oriented 4d normals for activity recogni- tion from depth sequences. In: International Conference on Computer Vision and Pattern Recognition. pp. 716-723 (2013)  27. Shahroudy, A., Liu, J., Ng, T.T., Wang, G.: Ntu rgb+ d: A large scale dataset for  3d human activity analysis. arXiv preprint arXiv:1604.02808 (2016)  28. Shahroudy, A., Ng, T.T., Gong, Y., Wang, G.: Deep multimodal feature analysis for action recognition in rgb+ d videos. IEEE Transactions on Pattern Analysis and Machine Intelligence 27(3), 305-317 (2017)  29. Shahroudy, A., Ng, T.T., Yang, Q., Wang, G.: Multimodal multipart learning for action recognition in depth videos. IEEE Transactions on Pattern Analysis and Machine Intelligence 38(10), 2123-2129 (2016)  30. Shotton, J., Sharp, T., Kipman, A., Fitzgibbon, A., Finocchio, M., Blake, A., Cook, M., Moore, R.: Real-time human pose recognition in parts from single depth images. Communications of the ACM 56(1), 116-124 (2013)  31. Simonyan, K., Zisserman, A.: Two-stream convolutional networks for action recog- nition in videos. In: Advances in Neural Information Processing Systems. pp. 568- 576 (2014)  32. Smisek, J., Jancosek, M., Pajdla, T.: 3d with kinect. In: Consumer depth cameras  for computer vision, pp. 3-25 (2013)  33. Vemulapalli, R., Arrate, F., Chellappa, R.: Human action recognition by represent- ing 3d skeletons as points in a lie group. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 588-595 (2014)   Deep Bilinear Learning for RGB-D Action Recognition34. Wang, H., Kl¨aser, A., Schmid, C., Liu, C.L.: Dense trajectories and motion bound- ary descriptors for action recognition. International Journal of Computer Vision 103(1), 60-79 (2013)  35. Wang, H., Wang, L.: Modeling temporal dynamics and spatial configurations of ac- tions using two-stream recurrent neural networks. arXiv preprint arXiv:1704.02581 (2017)  36. Wang, J., Liu, Z., Chorowski, J., Chen, Z., Wu, Y.: Robust 3d action recognition with random occupancy patterns. In: European Conference on Computer Vision, pp. 872-885 (2012)  37. Wang, J., Liu, Z., Wu, Y., Yuan, J.: Learning actionlet ensemble for 3d human ac- tion recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence 20(11), 379-385 (2013)  38. Wang, L., Xiong, Y., Wang, Z., Qiao, Y., Lin, D., Tang, X., Van Gool, L.: Tem- poral segment networks: Towards good practices for deep action recognition. In: European Conference on Computer Vision (2016)  39. Wei, P., Zhao, Y., Zheng, N., Zhu, S.C.: Modeling 4d human-object interactions for event and object recognition. In: International Conference on Computer Vision. pp. 3272-3279 (2013)  40. Xia, L., Chen, C.C., Aggarwal, J.: View invariant human action recognition using histograms of 3d joints. In: International Conference on Computer Vision and Pattern Recognition. pp. 20-27 (2012)  41. Yang, X., Tian, Y.: Eigenjoints-based action recognition using naive-bayes-nearest- neighbor. In: International Conference on Computer Vision and Pattern Recogni- tion. pp. 14-19 (2012)  42. Yang, X., Tian, Y.: Super normal vector for activity recognition using depth se- quences. In: International Conference on Computer Vision and Pattern Recogni- tion. pp. 804-811 (2014)  43. Zanfir, M., Leordeanu, M., Sminchisescu, C.: The moving pose: An eﬃcient 3d kinematics descriptor for low-latency action recognition and detection. In: Inter- national Conference on Computer Vision. pp. 2752-2759 (2013)  44. Zhang, P., Lan, C., Xing, J., Zeng, W., Xue, J., Zheng, N.: View adaptive recurrent neural networks for high performance human action recognition from skeleton data. arXiv preprint arXiv:1703.08274 (2017)  45. Zhang, Y., Yeung, D.Y.: Multi-task learning in heterogeneous feature spaces. In:  Conference on Artificial Intelligence (2011)  46. Zhu, Y., Chen, W., Guo, G.: Fusing spatiotemporal features and joints for 3d action recognition. In: International Conference on Computer Vision and Pattern Recognition. pp. 486-491 (2013)"}