{"1": "1. Besse, F., Rother, C., Fitzgibbon, A., Kautz, J.: PMBP: Patchmatch belief prop- agation for correspondence field estimation. International Journal of Computer Vision 110(1), 2-13 (2014)  2. Camu˜nas-Mesa, L.A., Serrano-Gotarredona, T., Ieng, S.H., Benosman, R.B., Linares-Barranco, B.: On the use of orientation filters for 3D reconstruction in event-driven stereo vision. Frontiers in Neuroscience 8 (2014)  3. Camu˜nas-Mesa, L.A., Serrano-Gotarredona, T., Ieng, S.H., Benosman, R., Linares- Barranco, B.: Event-driven stereo visual tracking algorithm to solve object occlu- sion. IEEE Transactions on Neural Networks and Learning Systems (2017)  4. Felzenszwalb, P.F., Huttenlocher, D.P.: Eﬃcient belief propagation for early vision.  International journal of computer vision 70(1), 41-54 (2006)  5. Gallego, G., Scaramuzza, D.: Accurate angular velocity estimation with an event  camera. IEEE Robotics and Automation Letters 2(2), 632-639 (2017)  6. Geiger, A., Roser, M., Urtasun, R.: Eﬃcient large-scale stereo matching. In: Asian  conference on computer vision. pp. 25-38. Springer (2010)  7. Kogler, J., Humenberger, M., Sulzbachner, C.: Event-based stereo matching ap- proaches for frameless address event stereo data. Advances in Visual Computing pp. 674-685 (2011)  8. Marr, D., Poggio, T., et al.: Cooperative computation of stereo disparity. From the  Retina to the Neocortex pp. 239-243 (1976)  9. Mitrokhin, A., Fermuller, C., Parameshwara, C., Aloimonos, Y.: Event-based Mov-  ing Object Detection and Tracking. arXiv preprint arXiv:1803.04523 (2018) 10. Mueggler, E., Forster, C., Baumli, N., Gallego, G., Scaramuzza, D.: Lifetime es- timation of events from Dynamic Vision Sensors. In: Robotics and Automation (ICRA), 2015 IEEE International Conference on. pp. 4874-4881. IEEE (2015) 11. Piatkowska, E., Belbachir, A.N., Gelautz, M.: Cooperative and asynchronous stereo vision for dynamic vision sensors. Measurement Science and Technology 25(5), 055108 (2014)  12. Piatkowska, E., Kogler, J., Belbachir, N., Gelautz, M.: Improved cooperative stereo matching for dynamic vision sensors with ground truth evaluation. In: Computer Vision and Pattern Recognition Workshops (CVPRW), 2017 IEEE Conference on. pp. 370-377. IEEE (2017)   14  A. Z. Zhu, Y. Chen, K. Daniilidis  methods which perform expensive regularizations on top of the disparity map. In addition, as our disparity results are at a single time, analogous to an image frame, they can be directly passed into any frame based architecture such as a state estimator, as compared to an asynchronous disparity stream. We envision that this method will be coupled with a method for estimating camera velocity, such as a visual odometry algorithm, for real time performance.  Acknowledgements  Thanks to Tobi Delbruck and the team at iniLabs for providing and supporting the DAVIS-346b cameras. We also gratefully appreciate support through the following grants: NSF-IIS-1703319, NSF-IIP-1439681 (I/UCRC), ARL RCTA W911NF-10-2-0016, and the DARPA FLA program.  References  1. Besse, F., Rother, C., Fitzgibbon, A., Kautz, J.: PMBP: Patchmatch belief prop- agation for correspondence field estimation. International Journal of Computer Vision 110(1), 2-13 (2014)  2. Camu˜nas-Mesa, L.A., Serrano-Gotarredona, T., Ieng, S.H., Benosman, R.B., Linares-Barranco, B.: On the use of orientation filters for 3D reconstruction in event-driven stereo vision. Frontiers in Neuroscience 8 (2014)  3. Camu˜nas-Mesa, L.A., Serrano-Gotarredona, T., Ieng, S.H., Benosman, R., Linares- Barranco, B.: Event-driven stereo visual tracking algorithm to solve object occlu- sion. IEEE Transactions on Neural Networks and Learning Systems (2017)  4. Felzenszwalb, P.F., Huttenlocher, D.P.: Eﬃcient belief propagation for early vision.  International journal of computer vision 70(1), 41-54 (2006)  5. Gallego, G., Scaramuzza, D.: Accurate angular velocity estimation with an event  camera. IEEE Robotics and Automation Letters 2(2), 632-639 (2017)  6. Geiger, A., Roser, M., Urtasun, R.: Eﬃcient large-scale stereo matching. In: Asian  conference on computer vision. pp. 25-38. Springer (2010)  7. Kogler, J., Humenberger, M., Sulzbachner, C.: Event-based stereo matching ap- proaches for frameless address event stereo data. Advances in Visual Computing pp. 674-685 (2011)  8. Marr, D., Poggio, T., et al.: Cooperative computation of stereo disparity. From the  Retina to the Neocortex pp. 239-243 (1976)  9. Mitrokhin, A., Fermuller, C., Parameshwara, C., Aloimonos, Y.: Event-based Mov-  ing Object Detection and Tracking. arXiv preprint arXiv:1803.04523 (2018) 10. Mueggler, E., Forster, C., Baumli, N., Gallego, G., Scaramuzza, D.: Lifetime es- timation of events from Dynamic Vision Sensors. In: Robotics and Automation (ICRA), 2015 IEEE International Conference on. pp. 4874-4881. IEEE (2015) 11. Piatkowska, E., Belbachir, A.N., Gelautz, M.: Cooperative and asynchronous stereo vision for dynamic vision sensors. Measurement Science and Technology 25(5), 055108 (2014)  12. Piatkowska, E., Kogler, J., Belbachir, N., Gelautz, M.: Improved cooperative stereo matching for dynamic vision sensors with ground truth evaluation. In: Computer Vision and Pattern Recognition Workshops (CVPRW), 2017 IEEE Conference on. pp. 370-377. IEEE (2017)   Realtime Time Synchronized Event-based Stereo13. Rebecq, H., Gallego, G., Mueggler, E., Scaramuzza, D.: Emvs: Event-based multi- view stereo3d reconstruction with an event camera in real-time. International Jour- nal of Computer Vision pp. 1-21 (2017)  14. Rebecq, H., Horstschaefer, T., Scaramuzza, D.: Real-time visual-inertial odometry for event cameras using keyframe-based nonlinear optimization. In: British Ma- chine Vis. Conf.(BMVC). vol. 3 (2017)  15. Rogister, P., Benosman, R., Ieng, S.H., Lichtsteiner, P., Delbruck, T.: Asyn- chronous event-based binocular stereo matching. IEEE Transactions on Neural Networks and Learning Systems 23(2), 347-353 (2012)  16. Schraml, S., Nabil Belbachir, A., Bischof, H.: Event-driven stereo matching for real- time 3D panoramic vision. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 466-474 (2015)  17. Xie, Z., Chen, S., Orchard, G.: Event-based stereo depth estimation using belief  propagation. Frontiers in Neuroscience 11, 535 (2017)  18. Xie, Z., Zhang, J., Wang, P.: Event-based stereo matching using semiglobal match- ing. International Journal of Advanced Robotic Systems 15(1), 1729881417752759 (2018)  19. Zhu, A.Z., Atanasov, N., Daniilidis, K.: Event-based feature tracking with proba- bilistic data association. In: Robotics and Automation (ICRA), 2017 IEEE Inter- national Conference on. pp. 4465-4470. IEEE (2017)  20. Zhu, A.Z., Thakur, D., Ozaslan, T., Pfrommer, B., Kumar, V., Daniilidis, K.: The multi vehicle stereo event camera dataset: An event camera dataset for 3D perception. IEEE Robotics and Automation Letters (2018)  21. Zhu, A.Z., Yuan, L., Chaney, K., Daniilidis, K.: EV-Flownet: Self-supervised op- tical ﬂow estimation for event-based cameras. arXiv preprint arXiv:1802.06898 (2018)  22. Zou, D., Guo, P., Wang, Q., Wang, X., Shao, G., Shi, F., Li, J., Park, P.K.: Context-aware event-driven stereo matching. In: Image Processing (ICIP), 2016 IEEE International Conference on. pp. 1076-1080. IEEE (2016)  23. Zou, D., Shi, F., Liu, W., Li, J., Wang, Q., Park, P.K., Shi, C.W., Roh, Y.J., Ryu, H.E.: Robust dense depth map estimation from sparse DVS stereos. In: British Machine Vis. Conf.(BMVC). vol. 3 (2017)"}