{"1": "1. Meer, P.: Robust techniques for computer vision. In Medioni, G., Kang, S.B., eds.:  Emerging topics in computer vision. Prentice Hall (2004)  2. Fischler, M.A., Bolles, R.C.: Random sample consensus: a paradigm for model fitting with applications to image analysis and automated cartography. Commu- nications of the ACM 24(6) (1981) 381-395  3. Choi, S., Kim, T., Yu, W.: Performance evaluation of RANSAC family. In: British  Machine Vision Conference (BMVC). (2009)  4. Raguram, R., Chum, O., Pollefeys, M., Matas, J., Frahm, J.M.: USAC: a universal framework for random sample consensus. IEEE Transactions on Pattern Analysis and Machine Intelligence 35(8) (2013) 2022-2038  5. Tran, Q.H., Chin, T.J., Chojnacki, W., Suter, D.: Sampling minimal subsets with large spans for robust estimation. International Journal of Computer Vision (IJCV) 106(1) (2014) 93-112  6. Li, H.: Consensus set maximization with guaranteed global optimality for ro- bust geometry estimation. In: IEEE International Conference on Computer Vision (ICCV). (2009)  7. Zheng, Y., Sugimoto, S., Okutomi, M.: Deterministically maximizing feasible sub- systems for robust model fitting with unit norm constraints. In: IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR). (2011) 8. Enqvist, O., Ask, E., Kahl, F., ˚Astr¨om, K.: Robust fitting for multiple view ge-  ometry. In: European Conference on Computer Vision (ECCV). (2012)  9. Bazin, J.C., Li, H., Kweon, I.S., Demonceaux, C., Vasseur, P., Ikeuchi, K.: A IEEE branch-and-bound approach to correspondence and grouping problems. Transactions on Pattern Analysis and Machine Intelligence 35(7) (2013) 1565- 1576  10. Yang, J., Li, H., Jia, Y.: Optimal essential matrix estimation via inlier-set maxi-  mization. In: European Conference on Computer Vision (ECCV). (2014)  11. Parra Bustos, A., Chin, T.J., Suter, D.: Fast rotation search with stereographic projections for 3d registration. In: IEEE Computer Society Conference on Com- puter Vision and Pattern Recognition (CVPR). (2014)  12. Enqvist, O., Ask, E., Kahl, F., ˚Astr¨om, K.: Tractable algorithms for robust model estimation. International Journal of Computer Vision 112(1) (2015) 115-129 13. Chin, T.J., Purkait, P., Eriksson, A., Suter, D.: Eﬃcient globally optimal con- sensus maximisation with tree search. In: IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR). (2015)  14. Campbell, D., Petersson, L., Kneip, L., Li, H.: Globally-optimal inlier set max- In: IEEE  imisation for simultaneous camera pose and feature correspondence. International Conference on Computer Vision (ICCV). (2017)  15. Garey, M.R., Johnson, D.S.: Computers and intractability: a guide to the theory  of NP-completeness. W H Freeman & Co (1990)  16. Downey, R.G., Fellows, M.R.: Parametrized complexity. Springer-Verlag New York  (1999)  17. Erickson, J., Har-Peled, S., Mount, D.M.: On the least median square problem.  Discrete & Computational Geometry 36(4) (2006) 593-607  18. Vazirani, V.: Approximation algorithms. Springer-Verlag Berlin (2001) 19. Le, H., Chin, T.J., Suter, D.: An exact penalty method for locally convergent maximum consensus. In: IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR). (2017)   Robust Fitting in Computer Vision: Easy or Hard?References  1. Meer, P.: Robust techniques for computer vision. In Medioni, G., Kang, S.B., eds.:  Emerging topics in computer vision. Prentice Hall (2004)  2. Fischler, M.A., Bolles, R.C.: Random sample consensus: a paradigm for model fitting with applications to image analysis and automated cartography. Commu- nications of the ACM 24(6) (1981) 381-395  3. Choi, S., Kim, T., Yu, W.: Performance evaluation of RANSAC family. In: British  Machine Vision Conference (BMVC). (2009)  4. Raguram, R., Chum, O., Pollefeys, M., Matas, J., Frahm, J.M.: USAC: a universal framework for random sample consensus. IEEE Transactions on Pattern Analysis and Machine Intelligence 35(8) (2013) 2022-2038  5. Tran, Q.H., Chin, T.J., Chojnacki, W., Suter, D.: Sampling minimal subsets with large spans for robust estimation. International Journal of Computer Vision (IJCV) 106(1) (2014) 93-112  6. Li, H.: Consensus set maximization with guaranteed global optimality for ro- bust geometry estimation. In: IEEE International Conference on Computer Vision (ICCV). (2009)  7. Zheng, Y., Sugimoto, S., Okutomi, M.: Deterministically maximizing feasible sub- systems for robust model fitting with unit norm constraints. In: IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR). (2011) 8. Enqvist, O., Ask, E., Kahl, F., ˚Astr¨om, K.: Robust fitting for multiple view ge-  ometry. In: European Conference on Computer Vision (ECCV). (2012)  9. Bazin, J.C., Li, H., Kweon, I.S., Demonceaux, C., Vasseur, P., Ikeuchi, K.: A IEEE branch-and-bound approach to correspondence and grouping problems. Transactions on Pattern Analysis and Machine Intelligence 35(7) (2013) 1565- 1576  10. Yang, J., Li, H., Jia, Y.: Optimal essential matrix estimation via inlier-set maxi-  mization. In: European Conference on Computer Vision (ECCV). (2014)  11. Parra Bustos, A., Chin, T.J., Suter, D.: Fast rotation search with stereographic projections for 3d registration. In: IEEE Computer Society Conference on Com- puter Vision and Pattern Recognition (CVPR). (2014)  12. Enqvist, O., Ask, E., Kahl, F., ˚Astr¨om, K.: Tractable algorithms for robust model estimation. International Journal of Computer Vision 112(1) (2015) 115-129 13. Chin, T.J., Purkait, P., Eriksson, A., Suter, D.: Eﬃcient globally optimal con- sensus maximisation with tree search. In: IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR). (2015)  14. Campbell, D., Petersson, L., Kneip, L., Li, H.: Globally-optimal inlier set max- In: IEEE  imisation for simultaneous camera pose and feature correspondence. International Conference on Computer Vision (ICCV). (2017)  15. Garey, M.R., Johnson, D.S.: Computers and intractability: a guide to the theory  of NP-completeness. W H Freeman & Co (1990)  16. Downey, R.G., Fellows, M.R.: Parametrized complexity. Springer-Verlag New York  (1999)  17. Erickson, J., Har-Peled, S., Mount, D.M.: On the least median square problem.  Discrete & Computational Geometry 36(4) (2006) 593-607  18. Vazirani, V.: Approximation algorithms. Springer-Verlag Berlin (2001) 19. Le, H., Chin, T.J., Suter, D.: An exact penalty method for locally convergent maximum consensus. In: IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR). (2017)   16  T.-J. Chin, Z. Cai, and F. Neumann  20. Purkait, P., Zach, C., Eriksson, A.: Maximum consensus parameter estimation by reweighted L1 methods. In: Energy Minimization Methods in Computer Vision and Pattern Recognition (EMMCVPR). (2017)  21. Cai, Z., Chin, T.J., Le, H., Suter, D.: Deterministic consensus maximization with biconvex programming. In: European Conference on Computer Vision (ECCV). (2018)  22. Sv¨arm, L., Enqvist, O., Oskarsson, M., Kahl, F.: Accurate localization and pose es- timation for large 3d models. In: IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR). (2014)  23. Parra Bustos, A., Chin, T.J.: Guaranteed outlier removal for rotation search. In:  IEEE International Conference on Computer Vision (ICCV). (2015)  24. Chin, T.J., Kee, Y.H., Eriksson, A., Neumann, F.: Guaranteed outlier removal with mixed integer linear programs. In: IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR). (2016)  25. Johnson, D.S., Preparata, F.P.: The densest hemisphere problem. Theoretical  Computer Science 6 (1978) 93-107  26. Ben-David, S., Eiron, N., Simon, H.: The computational complexity of densest region detection. Journal of Computer and System Sciences 64(1) (2002) 22-47 27. Aronov, B., Har-Peled, S.: On approximating the depth and related problems.  SIAM Journal on Computing 38(3) (2008) 899-921  28. Bernholt, T.: Robust estimators are hard to compute. Technical Report 52, Tech-  nische Universit¨at Dortmund (2005)  29. Cheney, E.W.: Introduction to Approximation Theory. McGraw-Hill (1966) 30. Giannopoulos, P., Knauer, C., Rote, G.: The parameterized complexity of some geometric problems in unbounded dimension. In: International Workshop on Pa- rameterized and Exact Computation (IWPEC). (2009)  31. https://en.wikipedia.org/wiki/Parameterized_complexity 32. Matouˇsek, J.: On geometric optimization with few violated constraints. Discrete  and Computational Geometry 14(4) (1995) 365-384  33. Chin, T.J., Purkait, P., Eriksson, A., Suter, D.: Eﬃcient globally optimal consen- sus maximisation with tree search. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 39(4) (2017) 758-772  34. Amaldi, E., Kann, V.: The complexity and approximability of finding maximum feasible subsystems of linear relations. Theoretical Computer Science 147 (1995) 181-210  35. https://en.wikipedia.org/wiki/2-satisfiability 36. https://en.wikipedia.org/wiki/L-reduction 37. Johnson, D.S.: Approximation algorithms for combinatorial problems. J. Comput.  System Sci. 9 (1974) 256-278"}