{"1": "1. Apple, Inc.: IPHONE X FACE ID FAIL (2017) Accessed on March 1, 2018 via  https://www.youtube.com/watch?v=m7xmCCTVS7Q.  2. Hern, A.: Apple: Face ID didn’t fail at iPhone X launch, our staﬀ did. The  3. Embretson, S.E., Reise, S.P.: Item response theory for psychologists. Lawrence  Guardian (September 14th, 2017)  Erlbaum Associates, Inc. (2000)  4. Lu, Z.L., Dosher, B.: Visual Psychophysics: From Laboratory to Theory. MIT  5. Kingdom, F., Prins, N.: Psychophysics: a Practical Introduction. Academic Press  Press (2013)  (2016)  6. Yager, N., Dunstone, T.: The biometric menagerie. IEEE Transactions on Pattern  Analysis and Machine Intelligence 32(2) (Feb 2010) 220-230  7. Hendricks, L.A., Akata, Z., Rohrbach, M., Donahue, J., Schiele, B., Darrell, T.:  Generating visual explanations. In: ECCV. (2016)  8. Ribeiro, M.T., Singh, S., Guestrin, C.: Why should I trust you?: Explaining the  predictions of any classifier. In: ACM KDD. (2016)  9. Haralick, R.M.: Performance characterization in computer vision. In: BMVC92.  Springer (1992) 1-8  10. Phillips, P.J., Moon, H., Rizvi, S.A., Rauss, P.J.: The FERET evaluation method- ology for face-recognition algorithms. IEEE Transactions on Pattern Analysis and Machine Intelligence 22(10) (2000) 1090-1104  11. Phillips, P.J., Flynn, P.J., Scruggs, T., Bowyer, K.W., Chang, J., Hoﬀman, K., Marques, J., Min, J., Worek, W.: Overview of the face recognition grand challenge. In: IEEE CVPR. (2005)  12. Phillips, P.J., Flynn, P.J., Beveridge, J.R., Scruggs, W.T., Otoole, A.J., Bolme, D., Bowyer, K.W., Draper, B.A., Givens, G.H., Lui, Y.M., Sahibzada, H., Scallan, III, J.A., Weimer, S.: Overview of the multiple biometrics grand challenge. In: International Conference on Biometrics (ICB). (2009)  13. Beveridge, J.R., Phillips, P.J., Bolme, D.S., Draper, B.A., Givens, G.H., Lui, Y.M., Teli, M.N., Zhang, H., Scruggs, W.T., Bowyer, K.W., Flynn, P., Cheng, S.: The challenge of face recognition from digital point-and-shoot cameras. In: IEEE BTAS. (2013)  14. Phillips, P.J., Beveridge, J.R., Draper, B.A., Givens, G., O’Toole, A.J., Bolme, D.S., Dunlop, J., Lui, Y.M., Sahibzada, H., Weimer, S.: An introduction to the good, the bad, & the ugly face recognition challenge problem. In: IEEE FG. (2011) 15. Kemelmacher-Shlizerman, I., Seitz, S.M., Miller, D., Brossard, E.: The megaface benchmark: 1 million faces for recognition at scale. In: IEEE CVPR. (2016) 16. Klare, B.F., Klein, B., Taborsky, E., Blanton, A., Cheney, J., Allen, K., Grother, P., Mah, A., Jain, A.K.: Pushing the frontiers of unconstrained face detection and recognition: IARPA Janus Benchmark A. In: IEEE CVPR. (2015)  17. Yi, D., Lei, Z., Liao, S., Li, S.Z.: Learning face representation from scratch. arXiv  preprint arXiv:1411.7923 (2014)  18. Ortiz, E.G., Becker, B.C.: Face recognition for web-scale datasets. Computer  Vision and Image Understanding 118 (2014) 153-170  19. Bhattarai, B., Sharma, G., Jurie, F., P´erez, P.: Some faces are more equal than oth- ers: Hierarchical organization for accurate and eﬃcient large-scale identity-based face retrieval. In: ECCV. (2014)   Visual Psychophysics for Face RecognitionReferences  1. Apple, Inc.: IPHONE X FACE ID FAIL (2017) Accessed on March 1, 2018 via  https://www.youtube.com/watch?v=m7xmCCTVS7Q.  2. Hern, A.: Apple: Face ID didn’t fail at iPhone X launch, our staﬀ did. The  3. Embretson, S.E., Reise, S.P.: Item response theory for psychologists. Lawrence  Guardian (September 14th, 2017)  Erlbaum Associates, Inc. (2000)  4. Lu, Z.L., Dosher, B.: Visual Psychophysics: From Laboratory to Theory. MIT  5. Kingdom, F., Prins, N.: Psychophysics: a Practical Introduction. Academic Press  Press (2013)  (2016)  6. Yager, N., Dunstone, T.: The biometric menagerie. IEEE Transactions on Pattern  Analysis and Machine Intelligence 32(2) (Feb 2010) 220-230  7. Hendricks, L.A., Akata, Z., Rohrbach, M., Donahue, J., Schiele, B., Darrell, T.:  Generating visual explanations. In: ECCV. (2016)  8. Ribeiro, M.T., Singh, S., Guestrin, C.: Why should I trust you?: Explaining the  predictions of any classifier. In: ACM KDD. (2016)  9. Haralick, R.M.: Performance characterization in computer vision. In: BMVC92.  Springer (1992) 1-8  10. Phillips, P.J., Moon, H., Rizvi, S.A., Rauss, P.J.: The FERET evaluation method- ology for face-recognition algorithms. IEEE Transactions on Pattern Analysis and Machine Intelligence 22(10) (2000) 1090-1104  11. Phillips, P.J., Flynn, P.J., Scruggs, T., Bowyer, K.W., Chang, J., Hoﬀman, K., Marques, J., Min, J., Worek, W.: Overview of the face recognition grand challenge. In: IEEE CVPR. (2005)  12. Phillips, P.J., Flynn, P.J., Beveridge, J.R., Scruggs, W.T., Otoole, A.J., Bolme, D., Bowyer, K.W., Draper, B.A., Givens, G.H., Lui, Y.M., Sahibzada, H., Scallan, III, J.A., Weimer, S.: Overview of the multiple biometrics grand challenge. In: International Conference on Biometrics (ICB). (2009)  13. Beveridge, J.R., Phillips, P.J., Bolme, D.S., Draper, B.A., Givens, G.H., Lui, Y.M., Teli, M.N., Zhang, H., Scruggs, W.T., Bowyer, K.W., Flynn, P., Cheng, S.: The challenge of face recognition from digital point-and-shoot cameras. In: IEEE BTAS. (2013)  14. Phillips, P.J., Beveridge, J.R., Draper, B.A., Givens, G., O’Toole, A.J., Bolme, D.S., Dunlop, J., Lui, Y.M., Sahibzada, H., Weimer, S.: An introduction to the good, the bad, & the ugly face recognition challenge problem. In: IEEE FG. (2011) 15. Kemelmacher-Shlizerman, I., Seitz, S.M., Miller, D., Brossard, E.: The megaface benchmark: 1 million faces for recognition at scale. In: IEEE CVPR. (2016) 16. Klare, B.F., Klein, B., Taborsky, E., Blanton, A., Cheney, J., Allen, K., Grother, P., Mah, A., Jain, A.K.: Pushing the frontiers of unconstrained face detection and recognition: IARPA Janus Benchmark A. In: IEEE CVPR. (2015)  17. Yi, D., Lei, Z., Liao, S., Li, S.Z.: Learning face representation from scratch. arXiv  preprint arXiv:1411.7923 (2014)  18. Ortiz, E.G., Becker, B.C.: Face recognition for web-scale datasets. Computer  Vision and Image Understanding 118 (2014) 153-170  19. Bhattarai, B., Sharma, G., Jurie, F., P´erez, P.: Some faces are more equal than oth- ers: Hierarchical organization for accurate and eﬃcient large-scale identity-based face retrieval. In: ECCV. (2014)   16  RichardWebster et al.  20. Schroﬀ, F., Kalenichenko, D., Philbin, J.: Facenet: A unified embedding for face  recognition and clustering. In: IEEE CVPR. (2015)  21. Wang, D., Otto, C., Jain, A.K.: Face search at scale. IEEE Transactions on Pattern  Analysis and Machine Intelligence 39(6) (2017) 1122-1136  22. Tanaka, J.W., Farah, M.J.: Parts and wholes in face recognition. The Quarterly  Journal of Experimental Psychology 46(2) (1993) 225-245  23. Duchaine, B., Nakayama, K.: The Cambridge face memory test: Results for neu- rologically intact individuals and an investigation of its validity using inverted face stimuli and prosopagnosic participants. Neuropsychologia 44(4) (2006) 576-585  24. Oosterhof, N.N., Todorov, A.: The functional basis of face evaluation. Proceedings  of the National Academy of Sciences 105(32) (2008) 11087-11092  25. Germine, L.T., Duchaine, B., Nakayama, K.: Where cognitive development and aging meet: Face learning ability peaks after age 30. Cognition 118(2) (2011) 201-210  26. Duchaine, B., Germine, L., Nakayama, K.: Family resemblance: Ten family mem- bers with prosopagnosia and within-class object agnosia. Cognitive Neuropsychol- ogy 24(4) (2007) 419-430  27. Russell, R., Duchaine, B., Nakayama, K.: Super-recognizers: People with extraordi- nary face recognition ability. Psychonomic Bulletin & Review 16(2) (2009) 252-257 28. Wilmer, J.B., Germine, L., Chabris, C.F., Chatterjee, G., Williams, M., Loken, E., Nakayama, K., Duchaine, B.: Human face recognition ability is specific and highly heritable. Proceedings of the National Academy of Sciences 107(11) (2010) 5238-5241  29. RichardWebster, B., Anthony, S., Scheirer, W.: Psyphy: A psychophysics driven evaluation framework for visual recognition. IEEE Transactions on Pattern Anal- ysis and Machine Intelligence (2018) 1-1  30. Scheirer, W.J., Anthony, S.E., Nakayama, K., Cox, D.D.: Perceptual annotation: Measuring human vision to improve computer vision. IEEE Transactions on Pat- tern Analysis and Machine Intelligence 36(8) (2014) 1679-1686  31. Leibo, J.Z., d’Autume, C.d.M., Zoran, D., Amos, D., Beattie, C., Anderson, K., Casta˜neda, A.G., Sanchez, M., Green, S., Gruslys, A., et al.: Psychlab: A psychology laboratory for deep reinforcement learning agents. arXiv preprint arXiv:1801.08116 (2018)  32. Zeiler, M.D., Fergus, R.: Visualizing and understanding convolutional networks.  33. Mahendran, A., Vedaldi, A.: Understanding deep image representations by invert-  In: ECCV. (2014)  ing them. In: IEEE CVPR. (2015)  perturbation. In: IEEE ICCV. (2017)  34. Fong, R.C., Vedaldi, A.: Interpretable explanations of black boxes by meaningful  35. Turner, R.: A model explanation system. In: 2016 IEEE 26th International Work-  shop on Machine Learning for Signal Processing (MLSP). (2016)  36. Lake, B.M., Salakhutdinov, R., Tenenbaum, J.B.: Human-level concept learning through probabilistic program induction. Science 350(6266) (2015) 1332-1338 37. Rajalingham, R., Issa, E.B., Bashivan, P., Kar, K., Schmidt, K., DiCarlo, J.J.: Large-scale, high-resolution comparison of the core visual object recognition be- havior of humans, monkeys, and state-of-the-art deep artificial neural networks. bioRxiv (2018) 240614  38. Gerhard, H.E., Wichmann, F.A., Bethge, M.: How sensitive is the human visual system to the local statistics of natural images? PLoS Computational Biology 9(1) (2013) e1002873   Visual Psychophysics for Face Recognition39. Eberhardt, S., Cader, J., Serre, T.: How deep is the feature analysis underlying  rapid visual categorization? In: NIPS. (2016)  40. Geirhos, R., Janssen, D.H.J., Sch¨utt, H.H., Rauber, J., Bethge, M., Wichmann, F.A.: Comparing deep neural networks against humans: object recognition when the signal gets weaker. arXiv preprint 1706.06969 (2017)  41. Heath, M., Sarkar, S., Sanocki, T., Bowyer, K.: Comparison of edge detectors: a methodology and initial study. In: Computer Vision and Pattern Recognition, 1996. Proceedings CVPR’96, 1996 IEEE Computer Society Conference on, IEEE (1996) 143-148  42. McCurie, M., Beletti, F., Parzianello, L., Westendorp, A., Anthony, S.E., Scheirer, W.J.: Predicting first impressions with deep learning. In: IEEE FG. (2017) 43. Germine, L., Nakayama, K., Duchaine, B.C., Chabris, C.F., Chatterjee, G., Wilmer, J.B.: Is the web as good as the lab? comparable performance from web and lab in cognitive/perceptual experiments. Psychonomic Bulletin & Review 19(5) (2012) 847-857  44. Sinha, P., Balas, B., Ostrovsky, Y., Russell, R.: Face recognition by humans: Nineteen results all computer vision researchers should know about. Proceedings of the IEEE 94(11) (2006) 1948-1962  45. O’Toole, A.J., Phillips, P.J., Jiang, F., Ayyad, J., Penard, N., Abdi, H.: Face recognition algorithms surpass humans matching faces over changes in illumination. IEEE Transactions on Pattern Analysis and Machine Intelligence 29(9) (2007) 1642-1646  46. O’Toole, A.J., Phillips, P.J., Narvekar, A.: Humans versus algorithms: comparisons  from the face recognition vendor test 2006. In: IEEE FG. (2008)  47. O’Toole, A.J., An, X., Dunlop, J., Natu, V., Phillips, P.J.: Comparing face recog- nition algorithms to humans on challenging tasks. ACM Transactions on Applied Perception (TAP) 9(4) (2012) 16  48. Phillips, P.J., O’Toole, A.J.: Comparison of human and computer performance across face recognition experiments. Image and Vision Computing 32(1) (2014) 74-85  49. Phillips, P.J., Hill, M.Q., Swindle, J.A., O’Toole, A.J.: Human and algorithm performance on the PaSC face recognition challenge. In: IEEE BTAS. (2015) 50. Karahan, S., Yildirum, M.K., Kirtac, K., Rende, F.S., Butun, G., Ekenel, H.K.: How image degradations aﬀect deep CNN-based face recognition? In: International Conference of the Biometrics Special Interest Group (BIOSIG). (2016)  51. Grm, K., Struc, V., Artiges, A., Caron, M., Ekenel, H.K.: Strengths and weaknesses of deep learning models for face recognition against image degradations. IET Biometrics 7(1) (2018) 81-89  52. Ding, C., Tao, D.: Trunk-branch ensemble convolutional neural networks for video- based face recognition. IEEE Transactions on Pattern Analysis and Machine In- telligence (To Appear) (2017)  53. Blanz, V., Tarr, M.J., B¨ulthoﬀ, H.H.: What object attributes determine canonical  views? Perception 28(5) (1999) 575-599  54. Doddington, G., Liggett, W., Martin, A., Przybocki, M., Reynolds, D.: Sheep, goats, lambs and wolves: A statistical analysis of speaker performance in the NIST 1998 speaker recognition evaluation. Technical report, National Institute of Stan- dards and Technology (1998)  55. Teli, M.N., Beveridge, J.R., Phillips, P.J., Givens, G.H., Bolme, D.S., Draper, B.A.: Biometric zoos: Theory and experimental evidence. In: IEEE/IAPR IJCB. (2011) 56. Bergstra, J.S., Bardenet, R., Bengio, Y., K´egl, B.: Algorithms for hyper-parameter  optimization. In: NIPS. (2011)   18  RichardWebster et al.  57. Bergstra, J., Yamins, D., Cox, D.D.: Hyperopt: A python library for optimizing the hyperparameters of machine learning algorithms. In: 12th Python in Science Conference. (2013)  58. Bergstra, J., Komer, B., Eliasmith, C., Yamins, D., Cox, D.D.: Hyperopt: a python library for model selection and hyperparameter optimization. Computational Sci- ence & Discovery 8(1) (2015) 014008  59. Parkhi, O.M., Vedaldi, A., Zisserman, A., et al.: Deep face recognition. In: BMVC.  Volume 1. (2015) 6  60. Sandberg, D.: Face recognition using tensorﬂow (2017) Accessed on March 1, 2018  via https://github.com/davidsandberg/facenet.  61. Amos, B., Ludwiczuk, B., Satyanarayanan, M.: Openface: A general-purpose face recognition library with mobile applications. Technical report, CMU-CS-16-118, CMU School of Computer Science (2016)  62. Cox, D.D., Pinto, N.: Beyond simple features: A large-scale feature search approach  to unconstrained face recognition. In: IEEE FG. (2011)  63. Klontz, J.C., Klare, B.F., Klum, S., Jain, A.K., Burge, M.J.: Open source biometric  recognition. In: IEEE BTAS. (2013)  64. Huang, G.B., Ramesh, M., Berg, T., Learned-Miller, E.: Labeled faces in the wild: A database for studying face recognition in unconstrained environments. Technical report, Technical Report 07-49, University of Massachusetts, Amherst (2007) 65. Yildirim, I., Kulkarni, T.D., Freiwald, W.A., Tenenbaum, J.B.: Eﬃcient and robust analysis-by-synthesis in vision: A computational framework, behavioral tests, and modeling neuronal representations. In: Annual conference of the cognitive science society. (2015)  Facegen (2017) Accessed on March 1, 2018 via  66. Singular  Inversions: https://facegen.com/.  67. Amos, B.: Openface 0.2.0: Higher accuracy and halved execution time (2016) Ac- cessed on March 1, 2018 via http://bamos.github.io/2016/01/19/openface-0.2.0/. 68. Ahonen, T., Hadid, A., Pietikainen, M.: Face description with local binary pat- terns: Application to face recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence 28(12) (2006) 2037-2041  69. Lowe, D.G.: Object recognition from local scale-invariant features. In: IEEE ICCV.  70. Sim, T., Baker, S., Bsat, M.: The CMU pose, illumination, and expression (PIE)  (1999)  database. In: IEEE FG. (2002)  71. Gross, R., Matthews, I., Cohn, J., Kanade, T., Baker, S.: Multi-PIE. Image and  Vision Computing 28(5) (2010) 807-813  72. Dutta, A., Veldhuis, R., Spreeuwers, L.: A Bayesian model for predicting face recognition performance using image quality. In: IEEE/IAPR IJCB. (2014) 73. Ng, H.W., Winkler, S.: A data-driven approach to cleaning large face datasets. In:  IEEE ICIP. (2014)  74. Guo, Y., Zhang, L., Hu, Y., He, X., Gao, J.: MS-Celeb-1M: A dataset and bench-  mark for large scale face recognition. In: ECCV. (2016)  75. Szegedy, C., Ioﬀe, S., Vanhoucke, V., Alemi, A.A.: Inception-v4, inception-resnet  and the impact of residual connections on learning. In: AAAI. (2017)  76. Zhang, K., Zhang, Z., Li, Z., Qiao, Y.: Joint face detection and alignment using multitask cascaded convolutional networks. IEEE Signal Processing Letters 23(10) (2016) 1499-1503  77. King, D.E.: Dlib-ml: A machine learning toolkit. Journal of Machine Learning  Research 10(Jul) (2009) 1755-1758   Visual Psychophysics for Face Recognition78. Graves, A.: Practical variational inference for neural networks. In: NIPS. (2011) 79. Goodfellow, I., Bengio, Y., Courville, A., Bengio, Y.: Deep learning. Volume 1.  MIT press Cambridge (2016)  80. O’Toole, A.J., Deﬀenbacher, K.A., Valentin, D., McKee, K., Huﬀ, D., Abdi, H.: The perception of face gender: The role of stimulus structure in recognition and classification. Memory & Cognition 26(1) (Jan 1998) 146-160  81. Webster, M.A., MacLeod, D.I.: Visual adaptation and face perception. Philosoph- ical Transactions of the Royal Society of London B: Biological Sciences 366(1571) (2011) 1702-1725  82. Dick, A.O.:  Iconic memory and its relation to perceptual processing and other  memory mechanisms. Perception & Psychophysics 16(3) (May 1974) 575-596"}