{"1": "1. Aldrian, O., P, W.A.: Inverse rendering of faces with a 3d morphable model. IEEE  Trans. on Pattern Analysis and Machine Intelligence (5), 1080-1093 (2013)  2. Almazan, J., Gordo, A., Fornes, A., Valveny, E.: Word spotting and recognition  with embedded attributes. PAMI (12), 2552-2566 (2014)  3. Bissacco, A., Cummins, M., Netzer, Y., Neven, H.: Photoocr: Reading text in  uncontrolled conditions. In ICCV (2013)  4. Debevec, P.: Rendering synthetic objects into real scenes: bridging traditional and image-based graphics with global illumination and high dynamic range photogra- phy. Proceeding SIGGRAPH ’98 Proceedings of the 25th annual conference pp. 189-198 (1998)  5. Dosovitskiy, A., Fischer, P., Ilg, E., Hausser, P., Hazirbas, C., Golkov, V., Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional net- works. Proc. ICCV (2015)  6. Goodfellow, J., I., Jean, P.A., Mehdi, M., Bing, X., David, W.F., Sherjil, O., Aaron,  C., Yoshua, B.: Generative adversarial networks. arXiv:1406.2661 (2014)  7. Gordo, A.: Supervised mid-level features for word image representation. In CVPR  (2015)  8. Graves, A., Liwicki, M., Fernndez, S.: A novel connectionist system for uncon- strained handwriting recognition. IEEE Trans. Pattern Analysis and Machine In- telligence (TPAMI) 31 (2009)  9. Greenberg, D.P., Torrance, K.E., Shirley, P., Arvo, J., A.Ferwerda, J., Pattanaik, S., Lafortune, E., Walter, B., Foo, S.C., Trumbore, B.: A framework for realistic image synthesis. Communications of the ACM (8), 42-53 (1999)  10. Gupta., A., Vedaldi., A., Zisserman, A.: Synthetic data for text localisation in natural images. IEEE Conference on Computer Vision and Pattern Recognition (2016)  11. He, P., Huang, W., He, T., Zhu, Q., Qiao, Y., Li, X.: Single shot text detector with  regional attention. arXiv:1709.00138 (2017)  12. He, T., Huang, W., Qiao, Y., Yao, J.: Accurate text localization in natural image  with cascaded convolutional text network. arXiv:1603.09423 (2016)  13. He, T., Huang, W., Qiao, Y., Yao, J.: Text-attentional convolutional neural network for scene text detection. IEEE transactions on image processing (6), 2529-2541 (2016)  14. http://cocodataset.org/: 15. Huang, W., Lin, Z., Yang, J., Wang, J.: Text localization in natural images using stroke feature transform and text covariance descriptors. Proceedings of the IEEE International Conference on Computer Vision pp. 1241-1248 (2013)  16. Huang, W., Qiao, Y., Tang, X.: Robust scene text detection with convolution neural network induced mser trees. European Conference on Computer Vision pp. 497-511 (2014)  17. Jaderberg, M., Simonyan, K., Vedaldi, A., Zisserman, A.: Synthetic data and artificial neural networks for natural scene text recognition. arXiv preprint arXiv:1406.2227 (2014)  18. Jaderberg, M., Simonyan, K., Vedaldi, A., Zisserman, A.: Deep structured output  learning for unconstrained text recognition. In ICLR (2015)  19. Jaderberg, M., Simonyan, K., Vedaldi, A., Zisserman, A.: Reading text in the wild with convolutional neural networks. International Journal of Computer Vision (1), 1-20 (2016)   Verisimilar Image Synthesis for Detection and Recognition of TextsReferences  1. Aldrian, O., P, W.A.: Inverse rendering of faces with a 3d morphable model. IEEE  Trans. on Pattern Analysis and Machine Intelligence (5), 1080-1093 (2013)  2. Almazan, J., Gordo, A., Fornes, A., Valveny, E.: Word spotting and recognition  with embedded attributes. PAMI (12), 2552-2566 (2014)  3. Bissacco, A., Cummins, M., Netzer, Y., Neven, H.: Photoocr: Reading text in  uncontrolled conditions. In ICCV (2013)  4. Debevec, P.: Rendering synthetic objects into real scenes: bridging traditional and image-based graphics with global illumination and high dynamic range photogra- phy. Proceeding SIGGRAPH ’98 Proceedings of the 25th annual conference pp. 189-198 (1998)  5. Dosovitskiy, A., Fischer, P., Ilg, E., Hausser, P., Hazirbas, C., Golkov, V., Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional net- works. Proc. ICCV (2015)  6. Goodfellow, J., I., Jean, P.A., Mehdi, M., Bing, X., David, W.F., Sherjil, O., Aaron,  C., Yoshua, B.: Generative adversarial networks. arXiv:1406.2661 (2014)  7. Gordo, A.: Supervised mid-level features for word image representation. In CVPR  (2015)  8. Graves, A., Liwicki, M., Fernndez, S.: A novel connectionist system for uncon- strained handwriting recognition. IEEE Trans. Pattern Analysis and Machine In- telligence (TPAMI) 31 (2009)  9. Greenberg, D.P., Torrance, K.E., Shirley, P., Arvo, J., A.Ferwerda, J., Pattanaik, S., Lafortune, E., Walter, B., Foo, S.C., Trumbore, B.: A framework for realistic image synthesis. Communications of the ACM (8), 42-53 (1999)  10. Gupta., A., Vedaldi., A., Zisserman, A.: Synthetic data for text localisation in natural images. IEEE Conference on Computer Vision and Pattern Recognition (2016)  11. He, P., Huang, W., He, T., Zhu, Q., Qiao, Y., Li, X.: Single shot text detector with  regional attention. arXiv:1709.00138 (2017)  12. He, T., Huang, W., Qiao, Y., Yao, J.: Accurate text localization in natural image  with cascaded convolutional text network. arXiv:1603.09423 (2016)  13. He, T., Huang, W., Qiao, Y., Yao, J.: Text-attentional convolutional neural network for scene text detection. IEEE transactions on image processing (6), 2529-2541 (2016)  14. http://cocodataset.org/: 15. Huang, W., Lin, Z., Yang, J., Wang, J.: Text localization in natural images using stroke feature transform and text covariance descriptors. Proceedings of the IEEE International Conference on Computer Vision pp. 1241-1248 (2013)  16. Huang, W., Qiao, Y., Tang, X.: Robust scene text detection with convolution neural network induced mser trees. European Conference on Computer Vision pp. 497-511 (2014)  17. Jaderberg, M., Simonyan, K., Vedaldi, A., Zisserman, A.: Synthetic data and artificial neural networks for natural scene text recognition. arXiv preprint arXiv:1406.2227 (2014)  18. Jaderberg, M., Simonyan, K., Vedaldi, A., Zisserman, A.: Deep structured output  learning for unconstrained text recognition. In ICLR (2015)  19. Jaderberg, M., Simonyan, K., Vedaldi, A., Zisserman, A.: Reading text in the wild with convolutional neural networks. International Journal of Computer Vision (1), 1-20 (2016)   16  F. Zhan, S. Lu, and C. Xue  20. Jaderberg, M., Vedaldi, A., Zisserman, A.: Deep features for text spotting. Euro-  pean conference on computer vision pp. 512-528 (2014)  21. Kang, L., Li, Y., Doermann, D.: Orientation robust textline detection in natural  images. In Proc. of CVPR (2014)  22. Karatzas, D., Gomez-Bigorda, L., Nicolaou, A., Ghosh, S., Bagdanov, A., Iwamura, M., Matas, J., Neumann, L., Chandrasekhar, V.R., Lu, S., Shafait, F.: Icdar 2015 competition on robust reading. Document Analysis and Recognition (ICDAR) pp. 1156-1160 (2015)  23. Karatzas, D., Shafait, F., Uchida, S., Iwamura, M., Mestre, S.R., Mas, J., Mota, D.F., Almazan, J.A., de las Heras, L.P., et al.: Icdar 2013 robust reading compe- tition. In Proc. ICDAR pp. 1484-1493 (2013)  24. Karsch, K., Hedau, V., Forsyth, D., Hoiem, D.: Rendering synthetic objects into legacy photographs. ACM Transactions on Graphics (6), 157:1-157:12 (2011) 25. Kim, K., Hong, S., Roh, B., Cheon, Y., Park, M.: Pvanet: Deep but lightweight  neural networks for real-time object detection. arXiv:1608.08021 (2016)  26. Liao, M., Shi, B., Bai, X., Wang, X., Liu, W.: Textboxes: A fast text detector with  a single deep neural network. AAAI pp. 4161-4167 (2017)  27. Liu, Y., Jin, L.: Deep matching prior network: Toward tighter multi-oriented text  detection. CVPR (2017)  28. Lu, S., Chen, T., Tian, S., Lim, J.H., Tan, C.L.: Scene text extraction based on edges and support vector regression. International Journal on Document Analysis and Recognition (2), 125-135 (2015)  29. Lu, S., Tan, C., Lim, J.H.: Robust and eﬃcient saliency modeling from image co-occurrence histograms. IEEE Transactions on Pattern Analysis and Machine Intelligence (1) (2014)  30. Mishra, A., Alahari, K., Jawahar, C.V.: Scene text recognition using higher order  language priors. In BMVC (2012)  31. Mishra, A.: Iiit 5k-word. URL:http://tc11.cvc.uab.es/datasets/IIIT 5K-Word 32. Neumann, L., Matas, J.: Real-time scene text localization and recognition. Com-  puter Vision and Pattern Recognition (CVPR) pp. 3538-3545 (2012)  33. Neumann, L., Matas, J.: Real-time lexicon-free scene text localization and recog- nition. IEEE transactions on pattern analysis and machine intelligence (9), 1872- 1885 (2016)  34. Papandreou, G., Chen, L.C., Murphy, K.P., Yuille., A.L.: Weakly-and semi- supervised learning of a deep convolutional network for semantic image segmenta- tion. International Conference on Computer Vision (ICCV) pp. 1742-1750 (2015) 35. Rodrguez-Serrano, J.A., Gordo, A., Perronnin, F.: Label embedding: A frugal base-  line for text recognition. IJCV (2015)  36. Shahab, A., Shafait, F., Dengel, A.: Icdar 2011 robust reading competition chal- lenge 2: Reading text in scene images. 2011 International Conference on Document Analysis and Recognition (ICDAR) pp. 1491-1496 (2011)  37. Shi, B., Bai, X., Belongie, S.: Detecting oriented text in natural images by linking  segments. CVPR (2017)  38. Shi, B., Bai, X., Yao, C.: An end-to-end trainable neural network for image-based sequence recognition and its application to scene text recognition. IEEE Trans. Pattern Anal. Mach. Intell. 39(11), 2298-2304 (2017)  39. Shi, B., Wang, X., Lyu, P., Yao, C., Bai, X.: Robust scene text recognition with  automatic rectification. arXiv:1603.03915 (2016)  40. Shi, B., Yao, C., Liao, M., Yang, M., Xu, P., Cui, L., Belongie, S., Lu, S., Bai, X.: Icdar2017 competition on reading chinese text in the wild (rctw-17). 2017 14th   Verisimilar Image Synthesis for Detection and Recognition of TextsIAPR International Conference on Document Analysis and Recognition (ICDAR) 01, 1429-1434 (2017)  41. Simonyan, K., Vedaldi, A., Zisserman, A.: Deep inside convolutional networks: Visualising image classification models and saliency maps. arXiv:1312.6034 (2013) 42. Sixt, L., Wild, B., Landgraf, T.: Rendergan: Generating realistic labeled data.  43. Su, B., Lu, S.: Accurate scene text recognition based on recurrent neural network.  arXiv:1611.01331 (2017)  ACCV (2014)  44. Su, B., Lu, S.: Accurate recognition of words in scenes without character segmen-  tation using recurrent neural network. Pattern Recognition (2017)  45. Tian, S., Lu, S.: Wetext: Scene text detection underweak supervision. IEEE Inter-  national Conference on Computer Vision pp. 1492-1550 (2017)  46. Tian, S., Pan, Y., Huang, C., Lu, S., Yu, K., Tan, C.L.: Text ﬂow: A unified text detection system in natural scene images. Proceedings of the IEEE International Conference on Computer Vision pp. 4651-4659 (2015)  47. Tian, Z., Huang, W., T. He, P.H., Qiao, Y.: Detecting text in natural image with connectionist text proposal network. European Conference on Computer Vision pp. 56-72 (2016)  48. Timofte, R., Rothe, R., Gool, L.V.: Seven ways to improve example-based single  image super resolution. CVPR (2016)  49. Veit, A., Matera, T., Neumann, L., Matas, J., Belongie, S.: Coco-text: Dataset and benchmark for text detection and recognition in natural images. arXiv:1601.07140 (2016)  50. Wang, K., Babenko, B., Belongie, S.: End-to-end scene text recognition. In ICCV  (2011)  51. Wolf, C., Jolion, J.M.: Object count / area graphs for the evaluation of object de- tection and segmentation algorithms. International Journal of Document Analysis (4), 280-296 (2006)  52. Yao, C., Bai, X., Liu, W., Ma, Y., Tu, Z.: Detecting texts of arbitrary orientations in natural images. Computer Vision and Pattern Recognition (CVPR) pp. 1083- 1090 (2012)  53. Yao, C., Bai, X., Sang, N., Zhou, X., Zhou, S., Cao, Z.: Scene text detection via  holistic, multi-channel prediction. arXiv:1606.09002 (2016)  54. Yao, C., Bai, X., Shi, B., Liu, W.: Strokelets: A learned multi-scale representa- tion for scene text recognition. IEEE Computer Vision and Pattern Recognition (CVPR) (2014)  55. Yildirim, I., Kulkarni, T.D., Freiwald, W.A., Tenenbaum, J.B.: Eﬃcient and robust analysis-by-synthesis in vision: A computational framework, behavioral tests, and modeling neuronal representations. Annual Conference of the Cognitive Science Society (2015)  56. Yin, X.C., Pei, W.Y., Zhang, J., Hao, H.W.: Multiorientation scene text detection  with adaptive clustering. IEEE Trans. on PAMI (9), 1930-1937 (2015)  57. Zhang, Z., Shen, W., Yao, C., Bai, X.: Symmetry-based text line detection in nat- ural scenes. Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition pp. 2558-2567 (2015)  58. Zhang, Z., Zhang, C., Shen, W., Yao, C., Liu, W., Bai, X.: Multi-oriented text  detection with fully convolutional networks. In Proc. of CVPR (2015)  59. Zhang, Z., Zhang, C., Shen, W., Yao, C., Liu, W., Bai, X.: Multi-oriented text detection with fully convolutional networks. Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition pp. 4159-4167 (2016)   18  F. Zhan, S. Lu, and C. Xue  60. Zhou, X., Yao, C., Wen, H., Wang, Y., Zhou, S., He, W., Liang, J.: East: An  eﬃcient and accurate scene text detector. arXiv:1704.03155 (2017)"}