{"1": "1. Langguth, F., Sunkavalli, K., Hadap, S., Goesele, M.: Shading-aware multi-view stereo. In:  Proceedings of the European Conference on Computer Vision (ECCV). (2016)  2. Maier, R., Kim, K., Cremers, D., Kautz, J., Niessner, M.: Intrinsic3d: High-quality 3d re- construction by joint appearance and geometry optimization with spatially-varying lighting. 2017 IEEE International Conference on Computer Vision (ICCV) (2017) 3133-3141  3. Tarini, M., Lensch, H.P.A., Goesele, M., Seidel, H.P.: 3d acquisition of mirroring objects  using striped patterns. Graph. Models 67(4) (July 2005) 233-259  4. Tin, S.K., Ye, J., Nezamabadi, M., Chen, C.: 3d reconstruction of mirror-type objects using efficient ray coding. In: 2016 IEEE International Conference on Computational Photography (ICCP). (May 2016) 1-11  5. Ikeuchi, K.: Determining surface orientations of specular surfaces by using the photometric stereo method. IEEE Trans. Pattern Analysis & Machine Intelligence (6) (1981) 661-669 6. Savarese, S., Perona, P.: Local analysis for 3d reconstruction of specular surfaces. In: Pro- ceedings of the 2001 IEEE Computer Society Conference on Computer Vision and Pattern Recognition. CVPR 2001. Volume 2. (2001) II-738-II-745 vol.2  7. Godard, C., Hedman, P., Li, W., Brostow, G.J.: Multi-view Reconstruction of Highly Spec-  ular Surfaces in Uncontrolled Environments. In: 3DV. (2015)  8. Khanian, M., Boroujerdi, A.S., Breuß, M.: Photometric stereo for strong specular highlights.  Computational Visual Media (Feb 2018)  9. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with conditional ad- versarial networks. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017)  10. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation using cycle- consistent adversarial networks. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  11. Zhang, Y., Song, S., Yumer, E., Savva, M., Lee, J.Y., Jin, H., Funkhouser, T.: Physically- based rendering for indoor scene understanding using convolutional neural networks. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017) 12. Movshovitz-Attias, Y., Kanade, T., Sheikh, Y.: How useful is photo-realistic rendering for visual learning? In: European Conference on Computer Vision, Springer (2016) 202-217 13. Shi, J., Dong, Y., Su, H., Yu, S.X.: Learning non-lambertian object intrinsics across shapenet categories. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017)  14. Meka, A., Maximov, M., Zollhoefer, M., Chatterjee, A., Richardt, C., Theobalt, C.: Live  intrinsic material estimation. arXiv preprint arXiv:1801.01075 (2018)  15. Hoffman, J., Tzeng, E., Park, T., Zhu, J.Y., Isola, P., Saenko, K., Efros, A.A., Darrell, T.: Cycada: Cycle-consistent adversarial domain adaptation. arXiv preprint arXiv:1711.03213 (2017)  16. Benaim, S., Wolf, L.: One-sided unsupervised domain mapping.  In Guyon, I., Luxburg, U.V., Bengio, S., Wallach, H., Fergus, R., Vishwanathan, S., Garnett, R., eds.: Advances in Neural Information Processing Systems 30. Curran Associates, Inc. (2017) 752-762  17. Kim, T., Cha, M., Kim, H., Lee, J.K., Kim, J.: Learning to discover cross-domain relations with generative adversarial networks. In Precup, D., Teh, Y.W., eds.: Proceedings of the 34th International Conference on Machine Learning. Volume 70 of Proceedings of Machine Learning Research., International Convention Centre, Sydney, Australia, PMLR (06-11 Aug 2017) 1857-1865  18. Kang, G., Zheng, L., Yan, Y., Yang, Y.: Deep adversarial attention alignment for unsu- pervised domain adaptation: the benefit of target expectation maximization. arXiv preprint arXiv:1801.10068 (2018)   Specular-to-Diffuse Translation for Multi-View ReconstructionReferences  1. Langguth, F., Sunkavalli, K., Hadap, S., Goesele, M.: Shading-aware multi-view stereo. In:  Proceedings of the European Conference on Computer Vision (ECCV). (2016)  2. Maier, R., Kim, K., Cremers, D., Kautz, J., Niessner, M.: Intrinsic3d: High-quality 3d re- construction by joint appearance and geometry optimization with spatially-varying lighting. 2017 IEEE International Conference on Computer Vision (ICCV) (2017) 3133-3141  3. Tarini, M., Lensch, H.P.A., Goesele, M., Seidel, H.P.: 3d acquisition of mirroring objects  using striped patterns. Graph. Models 67(4) (July 2005) 233-259  4. Tin, S.K., Ye, J., Nezamabadi, M., Chen, C.: 3d reconstruction of mirror-type objects using efficient ray coding. In: 2016 IEEE International Conference on Computational Photography (ICCP). (May 2016) 1-11  5. Ikeuchi, K.: Determining surface orientations of specular surfaces by using the photometric stereo method. IEEE Trans. Pattern Analysis & Machine Intelligence (6) (1981) 661-669 6. Savarese, S., Perona, P.: Local analysis for 3d reconstruction of specular surfaces. In: Pro- ceedings of the 2001 IEEE Computer Society Conference on Computer Vision and Pattern Recognition. CVPR 2001. Volume 2. (2001) II-738-II-745 vol.2  7. Godard, C., Hedman, P., Li, W., Brostow, G.J.: Multi-view Reconstruction of Highly Spec-  ular Surfaces in Uncontrolled Environments. In: 3DV. (2015)  8. Khanian, M., Boroujerdi, A.S., Breuß, M.: Photometric stereo for strong specular highlights.  Computational Visual Media (Feb 2018)  9. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with conditional ad- versarial networks. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017)  10. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation using cycle- consistent adversarial networks. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  11. Zhang, Y., Song, S., Yumer, E., Savva, M., Lee, J.Y., Jin, H., Funkhouser, T.: Physically- based rendering for indoor scene understanding using convolutional neural networks. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017) 12. Movshovitz-Attias, Y., Kanade, T., Sheikh, Y.: How useful is photo-realistic rendering for visual learning? In: European Conference on Computer Vision, Springer (2016) 202-217 13. Shi, J., Dong, Y., Su, H., Yu, S.X.: Learning non-lambertian object intrinsics across shapenet categories. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017)  14. Meka, A., Maximov, M., Zollhoefer, M., Chatterjee, A., Richardt, C., Theobalt, C.: Live  intrinsic material estimation. arXiv preprint arXiv:1801.01075 (2018)  15. Hoffman, J., Tzeng, E., Park, T., Zhu, J.Y., Isola, P., Saenko, K., Efros, A.A., Darrell, T.: Cycada: Cycle-consistent adversarial domain adaptation. arXiv preprint arXiv:1711.03213 (2017)  16. Benaim, S., Wolf, L.: One-sided unsupervised domain mapping.  In Guyon, I., Luxburg, U.V., Bengio, S., Wallach, H., Fergus, R., Vishwanathan, S., Garnett, R., eds.: Advances in Neural Information Processing Systems 30. Curran Associates, Inc. (2017) 752-762  17. Kim, T., Cha, M., Kim, H., Lee, J.K., Kim, J.: Learning to discover cross-domain relations with generative adversarial networks. In Precup, D., Teh, Y.W., eds.: Proceedings of the 34th International Conference on Machine Learning. Volume 70 of Proceedings of Machine Learning Research., International Convention Centre, Sydney, Australia, PMLR (06-11 Aug 2017) 1857-1865  18. Kang, G., Zheng, L., Yan, Y., Yang, Y.: Deep adversarial attention alignment for unsu- pervised domain adaptation: the benefit of target expectation maximization. arXiv preprint arXiv:1801.10068 (2018)   16  S. Wu, H. Huang, T. Portenier, M. Sela, D. Cohen-Or, R. Kimmel and M. Zwicker  19. Chang, A.X., Funkhouser, T., Guibas, L., Hanrahan, P., Huang, Q., Li, Z., Savarese, S., Sav- va, M., Song, S., Su, H., Xiao, J., Yi, L., Yu, F.: ShapeNet: An Information-Rich 3D Model Repository. Technical Report arXiv:1512.03012 [cs.GR], Stanford University — Princeton University — Toyota Technological Institute at Chicago (2015)  20. Or-El, R., Hershkovitz, R., Wetzler, A., Rosman, G., Bruckstein, A.M., Kimmel, R.: Real- In: Proc. IEEE Conf. on Computer Vision &  time depth refinement for specular objects. Pattern Recognition. (2016) 4378-4386  21. Or-El, R., Rosman, G., Wetzler, A., Kimmel, R., Bruckstein, A.M.: Rgbd-fusion: Real- In: Proc. IEEE Conf. on Computer Vision & Pattern  time high precision depth recovery. Recognition. (2015) 5407-5416  22. Chen, T., Goesele, M., Seidel, H.P.: Mesostructure from specularity. In: 2006 IEEE Comput- er Society Conference on Computer Vision and Pattern Recognition (CVPR’06). Volume 2. (2006) 1825-1832  23. Ihrke, I., Kutulakos, K.N., Lensch, H.P.A., Magnor, M., Heidrich, W.: Transparent and Spec-  ular Object Reconstruction. Computer Graphics Forum (2010)  24. Yi, Z., Zhang, H., Tan, P., Gong, M.: Dualgan: Unsupervised dual learning for image-to- image translation. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  25. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial nets. In Ghahramani, Z., Welling, M., Cortes, C., Lawrence, N.D., Weinberger, K.Q., eds.: Advances in Neural Information Processing Sys- tems 27. Curran Associates, Inc. (2014) 2672-2680  26. Karras, T., Aila, T., Laine, S., Lehtinen, J.: Progressive growing of GANs for improved quality, stability, and variation. In: International Conference on Learning Representations. (2018)  27. Wang, T.C., Liu, M.Y., Zhu, J.Y., Tao, A., Kautz, J., Catanzaro, B.: High-resolution image synthesis and semantic manipulation with conditional gans. arXiv preprint arXiv:1711.11585 (2017)  28. Huang, R., Zhang, S., Li, T., He, R.: Beyond face rotation: Global and local perception gan for photorealistic and identity preserving frontal view synthesis. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  29. Richardson, E., Sela, M., Kimmel, R.: 3d face reconstruction by learning from synthetic data. In: 3D Vision (3DV), 2016 Fourth International Conference on, IEEE (2016) 460-469 30. Sela, M., Richardson, E., Kimmel, R.: Unrestricted facial geometry reconstruction using In: The IEEE International Conference on Computer Vision  image-to-image translation. (ICCV). (Oct 2017)  31. Richardson, E., Sela, M., Or-El, R., Kimmel, R.: Learning detailed face reconstruction from In: Proc. IEEE Conf. on Computer Vision & Pattern Recognition, IEEE  a single image. (2017) 5553-5562  32. Sengupta, S., Kanazawa, A., Castillo, C.D., Jacobs, D.: Sfsnet: Learning shape, reﬂectance  and illuminance of faces in the wild. arXiv preprint arXiv:1712.01261 (2017)  33. Qian, R., Tan, R.T., Yang, W., Su, J., Liu, J.: Attentive generative adversarial network for  raindrop removal from a single image. arXiv preprint arXiv:1711.10098 (2017)  34. Wang, J., Li, X., Hui, L., Yang, J.: Stacked conditional generative adversarial networks for jointly learning shadow detection and shadow removal. arXiv preprint arXiv:1712.02478 (2017)  35. Tatarchenko, M., Dosovitskiy, A., Brox, T.: Multi-view 3d models from single images with a convolutional network. In: European Conference on Computer Vision (ECCV). (2016) 36. Choy, C.B., Xu, D., Gwak, J., Chen, K., Savarese, S.: 3d-r2n2: A unified approach for single and multi-view 3d object reconstruction. In: Proceedings of the European Conference on Computer Vision (ECCV). (2016)   Specular-to-Diffuse Translation for Multi-View Reconstruction37. Lin, C.H., Kong, C., Lucey, S.: Learning efficient point cloud generation for dense 3d object  reconstruction. In: AAAI Conference on Artificial Intelligence (AAAI). (2018)  38. Tulsiani, S., Zhou, T., Efros, A.A., Malik, J.: Multi-view supervision for single-view recon- struction via differentiable ray consistency. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017)  39. Wu, J., Zhang, C., Xue, T., Freeman, B., Tenenbaum, J.: Learning a probabilistic latent space of object shapes via 3d generative-adversarial modeling. In: In Advances in Neural Information Processing Systems (NIPS). (2016) 82-90  40. Gwak, J., Choy, C.B., Chandraker, M., Garg, A., Savarese, S.: Weakly supervised 3d recon- struction with adversarial constraint. In: 3D Vision (3DV), 2017 Fifth International Confer- ence on 3D Vision. (2017)  41. Pontes, J.K., Kong, C., Sridharan, S., Lucey, S., Eriksson, A., Fookes, C.: Image2mesh: A learning framework for single image 3d reconstruction. arXiv preprint arXiv:1711.10669 (2017)  42. Zhou, T., Brown, M., Snavely, N., Lowe, D.G.: Unsupervised learning of depth and ego- motion from video. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017)  43. Yi, K.M., Trulls, E., Lepetit, V., Fua, P.: Lift: Learned invariant feature transform.  In:  European Conference on Computer Vision, Springer (2016) 467-483  44. DeTone, D., Malisiewicz, T., Rabinovich, A.: Superpoint: Self-supervised interest point  detection and description. arXiv preprint arXiv:1712.07629 (2017)  45. Ma, L., Stueckler, J., Kerl, C., Cremers, D.: Multi-view deep learning for consistent semantic  mapping with rgb-d cameras. In: iros, Vancouver, Canada (Sep 2017)  46. Zhu, R., Wang, C., Lin, C.H., Wang, Z., Lucey, S.: Object-centric photometric bundle ad-  justment with deep shape prior. arXiv preprint arXiv:1711.01470 (2017)  47. Zhu, R., Wang, C., Lin, C.H., Wang, Z., Lucey, S.: Semantic photometric bundle adjustment  on natural sequences. arXiv preprint arXiv:1712.00110 (2017)  48. Liu, G., Ceylan, D., Yumer, E., Yang, J., Lien, J.M.: Material editing using a physically based rendering network. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  49. Yu, Y., Smith, W.A.: Pvnn: A neural network library for photometric vision. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 526-535 50. Rematas, K., Ritschel, T., Fritz, M., Gavves, E., Tuytelaars, T.: Deep reﬂectance maps. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (June 2016) 51. Georgoulis, S., Rematas, K., Ritschel, T., Fritz, M., Van Gool, L., Tuytelaars, T.: Delight- net: Decomposing reﬂectance maps into specular materials and natural illumination. arXiv preprint arXiv:1603.08240 (2016)  52. Georgoulis, S., Rematas, K., Ritschel, T., Fritz, M., Tuytelaars, T., Van Gool, L.: What is around the camera? In: Proc. IEEE Conf. on Computer Vision & Pattern Recognition. (2017) 5170-5178  53. Pharr, M., Humphreys, G.: Physically based rendering, second edition: From theory to im-  plementation. (2010)  54. Iizuka, S., Simo-Serra, E., Ishikawa, H.: Globally and locally consistent image completion.  ACM Transactions on Graphics (TOG) 36(4) (2017) 107  55. Xian, W., Sangkloy, P., Lu, J., Fang, C., Yu, F., Hays, J.: Texturegan: Controlling deep image  synthesis with texture patches. arXiv preprint arXiv:1706.02823 (2017)  56. Gatys, L.A., Ecker, A.S., Bethge, M.: Image style transfer using convolutional neural net- works. In: Computer Vision and Pattern Recognition (CVPR), 2016 IEEE Conference on, IEEE (2016) 2414-2423  57. Wang, C., Xu, C., Wang, C., Tao, D.: Perceptual adversarial networks for image-to-image  transformation. arXiv preprint arXiv:1706.09138 (2017)   18  S. Wu, H. Huang, T. Portenier, M. Sela, D. Cohen-Or, R. Kimmel and M. Zwicker  58. Vansteenkiste, E., Kern, P.: Taming adversarial domain transfer with structural constraints  for image enhancement. arXiv preprint arXiv:1712.00598 (2017)  59. Mao, X., Li, Q., Xie, H., Lau, R.Y., Wang, Z., Smolley, S.P.: Least squares generative adver-  sarial networks. In: ICCV, IEEE (2017) 2813-2821  60. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomedical image In: International Conference on Medical image computing and computer-  segmentation. assisted intervention, Springer (2015) 234-241  61. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proc.  IEEE Conf. on Computer Vision & Pattern Recognition. (June 2016)  62. Chaitanya, C.R.A., Kaplanyan, A.S., Schied, C., Salvi, M., Lefohn, A., Nowrouzezahrai, Interactive reconstruction of monte carlo image sequences using a recurrent  D., Aila, T.: denoising autoencoder. ACM Trans. Graph. 36(4) (July 2017) 98:1-98:12  63. Rusinkiewicz, S., Levoy, M.: Efficient variants of the icp algorithm. In: 3-D Digital Imaging and Modeling, 2001. Proceedings. Third International Conference on, IEEE (2001) 145-152"}