{"1": "1. Yang, J., Yu, K., Gong, Y., Huang, T.: Linear spatial pyramid matching using sparse coding for image classification. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2009) 1794-1801  2. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep In: Advances in Neural Information Processing  convolutional neural networks. Systems. (2012) 1097-1105  3. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 770-778  4. Wu, S., Ji, Q., Wang, S., Wong, H.S., Yu, Z., Xu, Y.: Semi-supervised image clas- sification with self-paced cross-task networks. IEEE Transactions on Multimedia 20(4) (2018) 851-865  5. Shi, W., Gong, Y., Wang, J.: Improving cnn performance with min-max objective. In: Proceedings of the International Joint Conference on Artificial Intelligence. (2016) 2004-2010  6. Girshick, R.: Fast r-cnn. In: Proceedings of the IEEE International Conference on  Computer Vision. (2015) 1440-1448  7. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object detec- tion with region proposal networks. In: Advances in Neural Information Processing Systems. (2015) 91-99  8. Schroﬀ, F., Kalenichenko, D., Philbin, J.: Facenet: A unified embedding for face recognition and clustering. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 815-823  9. Sun, Y., Liang, D., Wang, X., Tang, X.: Deepid3: Face recognition with very deep  neural networks. arXiv preprint arXiv:1502.00873 (2015)  10. Shi, W., Gong, Y., Tao, X., Wang, J., Zheng, N.:  Improving cnn performance accuracies with min-max objective. IEEE Transactions on Neural Networks and Learning Systems 29(7) (2018) 2872-2885  11. Zhao, F., Huang, Y., Wang, L., Tan, T.: Deep semantic ranking based hashing for multi-label image retrieval. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 1556-1564  12. Yu, M., Liu, L., Shao, L.: Binary set embedding for cross-modal retrieval. IEEE transactions on neural networks and learning systems 28(12) (2017) 2899-2910 13. Liu, Q., Liu, G., Li, L., Yuan, X.T., Wang, M., Liu, W.: Reversed spectral hashing. IEEE transactions on neural networks and learning systems 29(6) (2018) 2441- 2449  14. Huang, L.K., Yang, Q., Zheng, W.S.: Online hashing. IEEE transactions on neural  networks and learning systems 29(6) (2018) 2309-2322  15. Zhu, X., Ghahramani, Z.: Learning from labeled and unlabeled data with label propagation. Technical Report CMU-CALD-02-107, Carnegie Mellon University (2002)  16. Whitney, M., Sarkar, A.: Bootstrapping via graph propagation. In: Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics: Long Papers-Volume 1. (2012) 620-628  17. Gong, C., Tao, D., Liu, W., Liu, L., Yang, J.: Label propagation via teaching-to- learn and learning-to-teach. IEEE transactions on neural networks and learning systems 28(6) (2017) 1452-1465   Transductive Semi-Supervised Deep Learning using Min-Max FeaturesReferences  1. Yang, J., Yu, K., Gong, Y., Huang, T.: Linear spatial pyramid matching using sparse coding for image classification. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2009) 1794-1801  2. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep In: Advances in Neural Information Processing  convolutional neural networks. Systems. (2012) 1097-1105  3. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 770-778  4. Wu, S., Ji, Q., Wang, S., Wong, H.S., Yu, Z., Xu, Y.: Semi-supervised image clas- sification with self-paced cross-task networks. IEEE Transactions on Multimedia 20(4) (2018) 851-865  5. Shi, W., Gong, Y., Wang, J.: Improving cnn performance with min-max objective. In: Proceedings of the International Joint Conference on Artificial Intelligence. (2016) 2004-2010  6. Girshick, R.: Fast r-cnn. In: Proceedings of the IEEE International Conference on  Computer Vision. (2015) 1440-1448  7. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object detec- tion with region proposal networks. In: Advances in Neural Information Processing Systems. (2015) 91-99  8. Schroﬀ, F., Kalenichenko, D., Philbin, J.: Facenet: A unified embedding for face recognition and clustering. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 815-823  9. Sun, Y., Liang, D., Wang, X., Tang, X.: Deepid3: Face recognition with very deep  neural networks. arXiv preprint arXiv:1502.00873 (2015)  10. Shi, W., Gong, Y., Tao, X., Wang, J., Zheng, N.:  Improving cnn performance accuracies with min-max objective. IEEE Transactions on Neural Networks and Learning Systems 29(7) (2018) 2872-2885  11. Zhao, F., Huang, Y., Wang, L., Tan, T.: Deep semantic ranking based hashing for multi-label image retrieval. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 1556-1564  12. Yu, M., Liu, L., Shao, L.: Binary set embedding for cross-modal retrieval. IEEE transactions on neural networks and learning systems 28(12) (2017) 2899-2910 13. Liu, Q., Liu, G., Li, L., Yuan, X.T., Wang, M., Liu, W.: Reversed spectral hashing. IEEE transactions on neural networks and learning systems 29(6) (2018) 2441- 2449  14. Huang, L.K., Yang, Q., Zheng, W.S.: Online hashing. IEEE transactions on neural  networks and learning systems 29(6) (2018) 2309-2322  15. Zhu, X., Ghahramani, Z.: Learning from labeled and unlabeled data with label propagation. Technical Report CMU-CALD-02-107, Carnegie Mellon University (2002)  16. Whitney, M., Sarkar, A.: Bootstrapping via graph propagation. In: Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics: Long Papers-Volume 1. (2012) 620-628  17. Gong, C., Tao, D., Liu, W., Liu, L., Yang, J.: Label propagation via teaching-to- learn and learning-to-teach. IEEE transactions on neural networks and learning systems 28(6) (2017) 1452-1465   16  W. Shi, Y. Gong, C. Ding, Z. Ma, X. Tao and N. Zheng  18. Pei, X., Chen, C., Guan, Y.: Joint sparse representation and embedding prop- IEEE  agation learning: a framework for graph-based semisupervised learning. transactions on neural networks and learning systems 28(12) (2017) 2949-2960 19. Joachims, T.: Transductive inference for text classification using support vector machines. In: Proceedings of the International Conference on Machine Learning. Volume 99. (1999) 200-209  20. Joachims, T.: Transductive learning via spectral graph partitioning. In: Proceed-  ings of the International Conference on Machine Learning. (2003) 290-297  21. Zhang, Y.M., Huang, K., Geng, G.G., Liu, C.L.: Mtc: A fast and robust graph- based transductive learning method. IEEE transactions on neural networks and learning systems 26(9) (2015) 1979-1991  22. Wang, Z., Zhu, X., Adeli, E., Zhu, Y., Zu, C., Nie, F., Shen, D., Wu, G.: Progressive graph-based transductive learning for multi-modal classification of brain disorder disease. In: International Conference on Medical Image Computing and Computer- Assisted Intervention. (2016) 291-299  23. G¨ornitz, N., Lima, L.A., Varella, L.E., M¨uller, K.R., Nakajima, S.: Transductive regression for data with latent dependence structure. IEEE Transactions on Neural Networks and Learning Systems 29(7) (2018) 2743-2756  24. Sajjadi, M., Javanmardi, M., Tasdizen, T.: Regularization with stochastic trans- formations and perturbations for deep semi-supervised learning. In: Advances in Neural Information Processing Systems. (2016) 1163-1171  25. Laine, S., Aila, T.: Temporal ensembling for semi-supervised learning. arXiv  preprint arXiv:1610.02242 (2016)  26. Tarvainen, A., Valpola, H.: Mean teachers are better role models: Weight-averaged consistency targets improve semi-supervised deep learning results. In: Advances in Neural Information Processing Systems. (2017) 1195-1204  27. Miyato, T., Maeda, S.i., Koyama, M., Ishii, S.: Virtual adversarial training: a regularization method for supervised and semi-supervised learning. arXiv preprint arXiv:1704.03976 (2017)  28. Luo, Y., Zhu, J., Li, M., Ren, Y., Zhang, B.: Smooth neighbors on teacher graphs  for semi-supervised learning. arXiv preprint arXiv:1711.00258 (2017)  29. de Sa, V.R.: Learning classification with unlabeled data. In: Advances in Neural  Information Processing Systems. (1994) 112-119  30. Blum, A., Mitchell, T.: Combining labeled and unlabeled data with co-training. In: Proceedings of the eleventh annual conference on Computational learning theory. (1998) 92-100  31. Cozman, F.G., Cohen, I., Cirelo, M.C.: Semi-supervised learning of mixture mod- els. In: Proceedings of the International Conference on Machine Learning. (2003) 99-106  32. Rosenberg, C., Hebert, M., Schneiderman, H.: Semi-supervised self-training of  object detection models. In: Application of Computer Vision. (2005) 29-36  33. LeCun, Y., Kavukcuoglu, K., Farabet, C.: Convolutional networks and applications in vision. In: Proceedings of 2010 IEEE International Symposium on Circuits and Systems. (2010) 253-256  34. Jarrett, K., Kavukcuoglu, K., LeCun, Y., et al.: What is the best multi-stage architecture for object recognition? In: Proceedings of the IEEE International Conference on Computer Vision. (2009) 2146-2153  35. Agrawal, P., Carreira, J., Malik, J.: Learning to see by moving. In: Proceedings of  the IEEE International Conference on Computer Vision. (2015) 37-45   Transductive Semi-Supervised Deep Learning using Min-Max Features36. Doersch, C., Gupta, A., Efros, A.A.: Unsupervised visual representation learning by context prediction. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 1422-1430  37. Hoﬀer, E., Ailon, N.: Semi-supervised deep learning by metric embedding. arXiv  preprint arXiv:1611.01449 (2016)  38. Weston, J., Ratle, F., Collobert, R.: Deep learning via semi-supervised embedding. In: Proceedings of the international conference on Machine learning. (2008) 1168- 1175  39. Kingma, D.P., Mohamed, S., Rezende, D.J., Welling, M.: Semi-supervised learn- ing with deep generative models. In: Advances in Neural Information Processing Systems. (2014) 3581-3589  40. Abbasnejad, M.E., Dick, A., van den Hengel, A.: Infinite variational autoencoder for semi-supervised learning. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 781-790  41. Haeusser, P., Mordvintsev, A., Cremers, D.: Learning by association-a versatile semi-supervised training method for neural networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 89-98  42. Salimans, T., Goodfellow, I., Zaremba, W., Cheung, V., Radford, A., Chen, X.: Improved techniques for training gans. In: Advances in Neural Information Pro- cessing Systems. (2016) 2234-2242  43. Springenberg, J.T.: Unsupervised and semi-supervised learning with categorical  generative adversarial networks. arXiv preprint arXiv:1511.06390 (2015)  44. Chongxuan, L., Xu, T., Zhu, J., Zhang, B.: Triple generative adversarial nets. In:  Advances in Neural Information Processing Systems. (2017) 4091-4101  45. Dai, Z., Yang, Z., Yang, F., Cohen, W.W., Salakhutdinov, R.R.: Good semi- supervised learning that requires a bad gan. In: Advances in Neural Information Processing Systems. (2017) 6513-6523  46. Sajjadi, M., Javanmardi, M., Tasdizen, T.: Regularization with stochastic trans- formations and perturbations for deep semi-supervised learning. In: Advances in Neural Information Processing Systems. (2016) 1163-1171  47. Rasmus, A., Berglund, M., Honkala, M., Valpola, H., Raiko, T.: Semi-supervised In: Advances in Neural Information Processing  learning with ladder networks. Systems. (2015) 3546-3554  48. Valpola, H.: From neural pca to deep unsupervised learning.  In: Advances in  Independent Component Analysis and Learning Machines. (2015) 143-171  49. Dosovitskiy, A., Springenberg, J.T., Riedmiller, M., Brox, T.: Discriminative un- supervised feature learning with convolutional neural networks. In: Advances in Neural Information Processing Systems. (2014) 766-774  50. Krizhevsky, A., Hinton, G.: Learning multiple layers of features from tiny images.  Master’s thesis, University of Toronto (2009)  51. Netzer, Y., Wang, T., Coates, A., Bissacco, A., Wu, B., Ng, A.Y.: Reading dig- its in natural images with unsupervised feature learning. In: Neural Information Processing Systems (NIPS) workshop on deep learning and unsupervised feature learning. Volume 2011. (2011) 5  52. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., et al.: Tensorﬂow: Large-scale machine learning on heterogeneous distributed systems. arXiv preprint arXiv:1603.04467 (2016) 53. Maaten, L.v.d., Hinton, G.: Visualizing data using t-sne. Journal of Machine  Learning Research 9(Nov) (2008) 2579-2605"}