{"1": "1. Silberman, N., Hoiem, D., Kohli, P., Fergus, R.: Indoor segmentation and support  inference from RGBD images. In: ECCV. (2012) 746-760  2. Michels, J., Saxena, A., Ng, A.Y.: High speed obstacle avoidance using monocular  vision and reinforcement learning. In: ICML. (2005) 593-600  3. Hadsell, R., Sermanet, P., Ben, J., Erkan, A., Scoﬃer, M., Kavukcuoglu, K., Muller, U., LeCun, Y.: Learning long-range vision for autonomous oﬀ-road driving. Journal of Field Robotics 26(2) (2009) 120-144  4. Tateno, K., Tombari, F., Laina, I., Navab, N.: Cnn-slam: Real-time dense monoc- ular slam with learned depth prediction. In: CVPR. Volume 2. (2017) 6565-6574 5. Eigen, D., Puhrsch, C., Fergus, R.: Depth map prediction from a single image  using a multi-scale deep network. In: NIPS. (2014) 2366-2374  6. Xu, D., Ricci, E., Ouyang, W., Wang, X., Sebe, N.: Multi-scale continuous CRFs as sequential deep networks for monocular depth estimation. In: CVPR. Volume 1. (2017) 161-169  7. Laina, I., Rupprecht, C., Belagiannis, V., Tombari, F., Navab, N.: Deeper depth prediction with fully convolutional residual networks. In: 3DV. (2016) 239-248 8. Zhang, Z., Xu, C., Yang, J., Gao, J., Cui, Z.: Progressive hard-mining network for monocular depth estimation. IEEE Transactions on Image Processing 27(8) (2018) 3691-3702  9. Zhang, Z., Xu, C., Yang, J., Tai, Y., Chen, L.: Deep hierarchical guidance and reg- ularization learning for end-to-end depth estimation. Pattern Recognition (2018) 430-442  10. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(4) (2017) 640-651  11. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmen-  tation. In: ICCV. (2015) 1520-1528  12. Li, X., Jie, Z., Wang, W., Liu, C., Yang, J., Shen, X., Lin, Z., Chen, Q., Yan, S., Feng, J.: Foveanet: Perspective-aware urban scene parsing. ICCV (2017) 784-792 13. Wei, Y., Liang, X., Chen, Y., Jie, Z., Xiao, Y., Zhao, Y., Yan, S.: Learning to segment with image-level annotations. Pattern Recognition 59 (2016) 234-244 14. Wang, J., Wang, Z., Tao, D., See, S., Wang, G.: Learning common and specific fea- tures for rgb-d semantic segmentation with deconvolutional networks. In: ECCV. (2016) 664-679  15. Caruana, R.: Multitask learning. Machine Learning 28(1) (1997) 41-75 16. Girshick, R.: Fast R-CNN. In: ICCV. (2015) 1440-1448 17. He, K., Gkioxari, G., Dollr, P., Girshick, R.: Mask R-CNN. IEEE International  Conference on Computer Vision  18. Kim, S., Park, K., Sohn, K., Lin, S.: Unified depth prediction and intrinsic image decomposition from a single image via joint convolutional neural fields. In: ECCV. (2016) 143-159  19. Misra, I., Shrivastava, A., Gupta, A., Hebert, M.: Cross-stitch networks for multi-  task learning. In: CVPR. (2016) 3994-4003  20. Shi, J., Pollefeys, M.: Pulling things out of perspective. In: CVPR. (2014) 89-96 21. Wang, P., Shen, X., Lin, Z., Cohen, S.: Towards unified depth and semantic pre-  diction from a single image. In: CVPR. (2015) 2800-2809  22. Kendall, A., Gal, Y., Cipolla, R.: Multi-task learning using uncertainty to weigh  losses for scene geometry and semantics. arXiv:1705.07115   TRL for Semantic Segmentation & Depth EstimationReferences  1. Silberman, N., Hoiem, D., Kohli, P., Fergus, R.: Indoor segmentation and support  inference from RGBD images. In: ECCV. (2012) 746-760  2. Michels, J., Saxena, A., Ng, A.Y.: High speed obstacle avoidance using monocular  vision and reinforcement learning. In: ICML. (2005) 593-600  3. Hadsell, R., Sermanet, P., Ben, J., Erkan, A., Scoﬃer, M., Kavukcuoglu, K., Muller, U., LeCun, Y.: Learning long-range vision for autonomous oﬀ-road driving. Journal of Field Robotics 26(2) (2009) 120-144  4. Tateno, K., Tombari, F., Laina, I., Navab, N.: Cnn-slam: Real-time dense monoc- ular slam with learned depth prediction. In: CVPR. Volume 2. (2017) 6565-6574 5. Eigen, D., Puhrsch, C., Fergus, R.: Depth map prediction from a single image  using a multi-scale deep network. In: NIPS. (2014) 2366-2374  6. Xu, D., Ricci, E., Ouyang, W., Wang, X., Sebe, N.: Multi-scale continuous CRFs as sequential deep networks for monocular depth estimation. In: CVPR. Volume 1. (2017) 161-169  7. Laina, I., Rupprecht, C., Belagiannis, V., Tombari, F., Navab, N.: Deeper depth prediction with fully convolutional residual networks. In: 3DV. (2016) 239-248 8. Zhang, Z., Xu, C., Yang, J., Gao, J., Cui, Z.: Progressive hard-mining network for monocular depth estimation. IEEE Transactions on Image Processing 27(8) (2018) 3691-3702  9. Zhang, Z., Xu, C., Yang, J., Tai, Y., Chen, L.: Deep hierarchical guidance and reg- ularization learning for end-to-end depth estimation. Pattern Recognition (2018) 430-442  10. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(4) (2017) 640-651  11. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmen-  tation. In: ICCV. (2015) 1520-1528  12. Li, X., Jie, Z., Wang, W., Liu, C., Yang, J., Shen, X., Lin, Z., Chen, Q., Yan, S., Feng, J.: Foveanet: Perspective-aware urban scene parsing. ICCV (2017) 784-792 13. Wei, Y., Liang, X., Chen, Y., Jie, Z., Xiao, Y., Zhao, Y., Yan, S.: Learning to segment with image-level annotations. Pattern Recognition 59 (2016) 234-244 14. Wang, J., Wang, Z., Tao, D., See, S., Wang, G.: Learning common and specific fea- tures for rgb-d semantic segmentation with deconvolutional networks. In: ECCV. (2016) 664-679  15. Caruana, R.: Multitask learning. Machine Learning 28(1) (1997) 41-75 16. Girshick, R.: Fast R-CNN. In: ICCV. (2015) 1440-1448 17. He, K., Gkioxari, G., Dollr, P., Girshick, R.: Mask R-CNN. IEEE International  Conference on Computer Vision  18. Kim, S., Park, K., Sohn, K., Lin, S.: Unified depth prediction and intrinsic image decomposition from a single image via joint convolutional neural fields. In: ECCV. (2016) 143-159  19. Misra, I., Shrivastava, A., Gupta, A., Hebert, M.: Cross-stitch networks for multi-  task learning. In: CVPR. (2016) 3994-4003  20. Shi, J., Pollefeys, M.: Pulling things out of perspective. In: CVPR. (2014) 89-96 21. Wang, P., Shen, X., Lin, Z., Cohen, S.: Towards unified depth and semantic pre-  diction from a single image. In: CVPR. (2015) 2800-2809  22. Kendall, A., Gal, Y., Cipolla, R.: Multi-task learning using uncertainty to weigh  losses for scene geometry and semantics. arXiv:1705.07115   16  Z. Zhang, Z. Cui, C. Xu, Z. Jie, X. Li, J. Yang  23. Borst, J.P., Taatgen, N.A., Van, R.H.: The problem state: a cognitive bottleneck in multitasking. Journal of Experimental Psychology Learning Memory and Cog- nition 36(2) (2010) 363  24. Eigen, D., Fergus, R.: Predicting depth, surface normals and semantic labels with a common multi-scale convolutional architecture. In: ICCV. (2015) 2650-2658 25. Liu, F., Shen, C., Lin, G., Reid, I.: Learning depth from single monocular images using deep convolutional neural fields. IEEE Transactions on Pattern Analysis and Machine Intelligence 38(10) (2016) 2024-2039  26. Li, B., Shen, C., Dai, Y., van den Hengel, A., He, M.: Depth and surface normal es- timation from monocular images using regression on deep features and hierarchical crfs. In: CVPR. (2015) 1119-1127  27. Kendall, A., Badrinarayanan, V., , Cipolla, R.: Bayesian segnet: Model uncertainty in deep convolutional encoder-decoder architectures for scene understanding. arXiv preprint arXiv:1511.02680 (2015)  28. Wei, Y., Xiao, H., Shi, H., Jie, Z., Feng, J., Huang, T.S.: Revisiting dilated convo- lution: A simple approach for weakly-and semi-supervised semantic segmentation. In: CVPR. (2018) 7268-7277  29. Jin, X., Chen, Y., Jie, Z., Feng, J., Yan, S.: Multi-path feedback recurrent neural  networks for scene parsing. In: AAAI. Volume 3. (2017) 8  30. Gupta, S., Girshick, R., Arbelez, P., Malik, J.: Learning rich features from rgb-d images for object detection and segmentation. In: ECCV. Volume 8695. (2014) 345-360  31. He, Y., Chiu, W.C., Keuper, M., Fritz, M.: Std2p: Rgbd semantic segmentation using spatio-temporal data-driven pooling. arXiv preprint arXiv:1604.02388 (2016) 32. Cheng, Y., Cai, R., Li, Z., Zhao, X., Huang, K.: Locality-sensitive deconvolution networks with gated fusion for rgb-d indoor semantic segmentation. In: CVPR. Volume 3. (2017) 1475-1483  33. Amit, Y., Fink, M., Srebro, N., Ullman, S.: Uncovering shared structures in mul- In: Machine Learning, Proceedings of the Twenty-Fourth  ticlass classification. International Conference. (2007) 17-24  34. Evgeniou, T., Pontil, M.: Regularized multi-task learning. In: Tenth ACM SIGKD- D International Conference on Knowledge Discovery and Data Mining. (2004) 109- 117  35. Jalali, A., Ravikumar, P.D., Sanghavi, S., Chao, R.: A dirty model for multi-task  learning. In: NIPS. (2010) 964-972  36. Razavian, A.S., Azizpour, H., Sullivan, J., Carlsson, S.: Cnn features oﬀ-the-shelf: An astounding baseline for recognition. In: CVPR Workshops. (2014) 512-519 37. Yosinski, J., Clune, J., Bengio, Y., Lipson, H.: How transferable are features in  deep neural networks? In: NIPS. (2014) 3320-3328  38. Wang, X., Fouhey, D.F., Gupta, A.: Designing deep networks for surface normal  estimation. In: CVPR. (2014) 539-547  39. Gebru, T., Hoﬀman, J., Li, F.F.: Fine-grained recognition in the wild: A multi-task  domain adaptation approach. arXiv:1709.02476  40. Kokkinos, I.: Ubernet: Training a ‘universal’ convolutional neural network for low-, mid-, and high-level vision using diverse datasets and limited memory. In: CVPR. (2017) 5454-5463  41. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. (2016) 770-778  42. Wang, F., Jiang, M., Qian, C., Yang, S., Li, C., Zhang, H., Wang, X., Tang, X.: Residual attention network for image classification. In: CVPR. (2017) 6450-6458   TRL for Semantic Segmentation & Depth Estimation43. Shi, W., Caballero, J., Huszr, F., Totz, J., Aitken, A.P., Bishop, R., Rueckert, D., Wang, Z.: Real-time single image and video super-resolution using an eﬃcient sub-pixel convolutional neural network. In: CVPR. (2016) 1874-1883  44. Song, S., Lichtenberg, S.P., Xiao, J.: Sun RGB-D: A RGB-D scene understanding  benchmark suite. In: CVPR. (2015) 567-576  45. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A large-scale  hierarchical image database. In: CVPR. (2009) 248-255  46. Lin, G., Milan, A., Shen, C., Reid, I.: Refinenet: Multi-path refinement networks for high-resolution semantic segmentation. In: CVPR. Volume 1. (2017) 5168-5177 47. Roy, A., Todorovic, S.: Monocular depth estimation using neural regression forest.  In: CVPR. (2016) 5506-5514  48. Cao, Y., Wu, Z., Shen, C.: Estimating depth from monocular images as classi- fication using deep fully convolutional residual networks. IEEE Transactions on Circuits and Systems for Video Technology (2017)  49. Lin, G., Shen, C., Hengel, A.V.D., Reid, I.: Eﬃcient piecewise training of deep structured models for semantic segmentation. In: CVPR. (2016) 3194-3203 50. Deng, Z., Todorovic, S., Latecki, L.J.: Semantic segmentation of rgbd images with  mutex constraints. In: ICCV. (2015) 1733-1741  51. Li, Z., Gan, Y., Liang, X., Yu, Y., Cheng, H., Lin, L.: Lstm-cf: Unifying context modeling and fusion with lstms for rgb-d scene labeling. In: ECCV. (2016) 541-557 52. Xiaojuan, Q., Renjie, L., Jiaya, J., Sanya, F., Raquel, U.: 3d graph neural networks  for RGBD semantic segmentation. In: ICCV. (2017) 5209-5218  53. Seong-Jin, P., Ki-Sang, H., Seungyong, L.: Rdfnet: Rgb-d multi-level residual feature fusion for indoor semantic segmentation. In: ICCV. (2017) 4990-4999 54. Di, L., Guangyong, C., Daniel, C.O., Pheng-Ann, H., Hui, H.: Cascaded feature network for semantic segmentation of rgb-d images. In: ICCV. (2017) 1320-1328"}