{"1": "1. Aharon, M., Elad, M., Bruckstein, A.: k -svd: An algorithm for designing overcom- plete dictionaries for sparse representation. IEEE Transactions on Signal Process- ing 54(11), 4311-4322 (Nov 2006)  2. Bak, S., Carr, P.: One-shot metric learning for person re-identification. In: CVPR  (June 2017)  3. Chen, W., Chen, X., Zhang, J., Huang, K.: Beyond triplet loss: A deep quadruplet  network for person re-identification. In: CVPR (July 2017)  4. Cheng, D., Gong, Y., Zhou, S., Wang, J., Zheng, N.: Person re-identification by multi-channel parts-based cnn with improved triplet loss function. In: CVPR (June 2016)  5. Debevec, P.: Rendering synthetic objects into real scenes : Bridging traditional and image-based graphics with global illumination and high dynamic range photogra- phy. In: Proceedings of ACM SIGGRAPH. pp. 189-198 (1998)  6. Deng, W., Zheng, L., Kang, G., Yang, Y., Ye, Q., Jiao, J.: Image-image domain adaptation with preserved self-similarity and domain-dissimilarity for person re- identification. In: CVPR (2018)  7. Dibra, E., Maye, J., Diamanti, O., Siegwart, R., Beardsley, P.: Extending the performance of human classifiers using a viewpoint specific approach. In: WACV (2015)  8. Fernando, B., Habrard, A., Sebban, M., Tuytelaars, T.: Unsupervised visual do-  main adaptation using subspace alignment. In: ICCV (2013)  9. Ganin, Y., Lempitsky, V.: Unsupervised domain adaptation by backpropagation.  In: ICML (2015)  10. Gao, S., Tsang, I.W.H., Chia, L.T., Zhao, P.: Local features are not lonely - lapla-  cian sparse coding for image classification. In: CVPR (2010)  11. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S.,  Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  12. Gou, M., Karanam, S., Liu, W., Camps, O., Radke, R.J.: Dukemtmc4reid: A large-  scale multi-camera person re-identification dataset. In: CVPRW (2017)  13. Gray, D., Brennan, S., Tao, H.: Evaluating Appearance Models for Recognition,  Reacquisition, and Tracking. PETS (2007)  14. Hattori, H., Boddeti, Y.V.N., Kitani, K.M., Kanade, T.: Learning scene-specific  pedestrian detectors without real data. In: CVPR (2015)  15. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  16. Hermans, A., Beyer, L., Leibe, B.: In defense of the triplet loss for person re-  In: CVPR (June 2016)  identification. arxiv (2017)  17. Hirzer, M., Beleznai, C., Roth, P.M., Bischof, H.: Person re-identification by de-  scriptive and discriminative classification. In: SCIA. pp. 91-102 (2011) 18. Hu, J., Lu, J., Tan, Y.P.: Deep transfer metric learning. In: CVPR (2015) 19. Huang, S., Ramanan, D.: Expecting the unexpected: Training detectors for unusual  pedestrians with adversarial imposters. In: CVPR (2017)  20. Kodirov, E., Xiang, T., Fu, Z., Gong, S.: Person re-identification by unsupervised  l1 graph learning. In: ECCV (2016)  21. Kodirov, E., Xiang, T., Gong, S.: Dictionary learning with iterative laplacian reg-  ularisation for unsupervised person re-identification. In: BMVC (2015)  22. Li, D., Chen, X., Zhang, Z., Huang, K.: Learning deep context-aware features over  body and latent parts for person re-identification. In: CVPR (July 2017)   Domain Adaptation through SynthesisReferences  1. Aharon, M., Elad, M., Bruckstein, A.: k -svd: An algorithm for designing overcom- plete dictionaries for sparse representation. IEEE Transactions on Signal Process- ing 54(11), 4311-4322 (Nov 2006)  2. Bak, S., Carr, P.: One-shot metric learning for person re-identification. In: CVPR  (June 2017)  3. Chen, W., Chen, X., Zhang, J., Huang, K.: Beyond triplet loss: A deep quadruplet  network for person re-identification. In: CVPR (July 2017)  4. Cheng, D., Gong, Y., Zhou, S., Wang, J., Zheng, N.: Person re-identification by multi-channel parts-based cnn with improved triplet loss function. In: CVPR (June 2016)  5. Debevec, P.: Rendering synthetic objects into real scenes : Bridging traditional and image-based graphics with global illumination and high dynamic range photogra- phy. In: Proceedings of ACM SIGGRAPH. pp. 189-198 (1998)  6. Deng, W., Zheng, L., Kang, G., Yang, Y., Ye, Q., Jiao, J.: Image-image domain adaptation with preserved self-similarity and domain-dissimilarity for person re- identification. In: CVPR (2018)  7. Dibra, E., Maye, J., Diamanti, O., Siegwart, R., Beardsley, P.: Extending the performance of human classifiers using a viewpoint specific approach. In: WACV (2015)  8. Fernando, B., Habrard, A., Sebban, M., Tuytelaars, T.: Unsupervised visual do-  main adaptation using subspace alignment. In: ICCV (2013)  9. Ganin, Y., Lempitsky, V.: Unsupervised domain adaptation by backpropagation.  In: ICML (2015)  10. Gao, S., Tsang, I.W.H., Chia, L.T., Zhao, P.: Local features are not lonely - lapla-  cian sparse coding for image classification. In: CVPR (2010)  11. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S.,  Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  12. Gou, M., Karanam, S., Liu, W., Camps, O., Radke, R.J.: Dukemtmc4reid: A large-  scale multi-camera person re-identification dataset. In: CVPRW (2017)  13. Gray, D., Brennan, S., Tao, H.: Evaluating Appearance Models for Recognition,  Reacquisition, and Tracking. PETS (2007)  14. Hattori, H., Boddeti, Y.V.N., Kitani, K.M., Kanade, T.: Learning scene-specific  pedestrian detectors without real data. In: CVPR (2015)  15. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  16. Hermans, A., Beyer, L., Leibe, B.: In defense of the triplet loss for person re-  In: CVPR (June 2016)  identification. arxiv (2017)  17. Hirzer, M., Beleznai, C., Roth, P.M., Bischof, H.: Person re-identification by de-  scriptive and discriminative classification. In: SCIA. pp. 91-102 (2011) 18. Hu, J., Lu, J., Tan, Y.P.: Deep transfer metric learning. In: CVPR (2015) 19. Huang, S., Ramanan, D.: Expecting the unexpected: Training detectors for unusual  pedestrians with adversarial imposters. In: CVPR (2017)  20. Kodirov, E., Xiang, T., Fu, Z., Gong, S.: Person re-identification by unsupervised  l1 graph learning. In: ECCV (2016)  21. Kodirov, E., Xiang, T., Gong, S.: Dictionary learning with iterative laplacian reg-  ularisation for unsupervised person re-identification. In: BMVC (2015)  22. Li, D., Chen, X., Zhang, Z., Huang, K.: Learning deep context-aware features over  body and latent parts for person re-identification. In: CVPR (July 2017)   16  Sławomir Bąk, Peter Carr, Jean-François Lalonde  23. Li, S., Bak, S., Carr, P., Wang, X.: Diversity regularized spatiotemporal attention  for video-based person re-identification. In: CVPR (June 2018)  24. Li, W., Zhao, R., Wang, X.: Human reidentification with transferred metric learn-  ing. In: ACCV (2012)  25. Li, W., Zhao, R., Xiao, T., Wang, X.: Deepreid: Deep filter pairing neural network  for person re-identification. In: CVPR (2014)  26. Li, Z., Chang, S., Liang, F., Huang, T., Cao, L., Smith, J.: Learning locally-adaptive  decision functions for person verification. In: CVPR (2013)  27. Liao, S., Hu, Y., Zhu, X., Li, S.Z.: Person re-identification by local maximal oc-  currence representation and metric learning. In: CVPR (2015)  28. Liu, X., Song, M., Tao, D., Zhou, X., Chen, C., Bu, J.: Semi-supervised coupled  dictionary learning for person re-identification. In: CVPR (June 2014)  29. Matsukawa, T., Okabe, T., Suzuki, E., Sato, Y.: Hierarchical gaussian descriptor  for person re-identification. In: CVPR (June 2016)  30. McCormac, J., Handa, A., Leutenegger, S., Davison, A.J.: Scenenet rgb-d: Can 5m synthetic images beat generic imagenet pre-training on indoor segmentation? In: ICCV (Oct 2017)  31. Paisitkriangkrai, S., Shen, C., van den Hengel, A.: Learning to rank in person  re-identification with metric ensembles. In: CVPR (2015)  32. Peng, P., Xiang, T., Wang, Y., Pontil, M., Gong, S., Huang, T., Tian, Y.: Unsuper- vised cross-dataset transfer learning for person re-identification. In: CVPR (June 2016)  33. Ristani, E., Solera, F., Zou, R., Cucchiara, R., Tomasi, C.: Performance measures  and a data set for multi-target, multi-camera tracking. In: ECCVW (2016)  34. Ros, G., Sellart, L., Materzynska, J., Vazquez, D., Lopez, A.: The SYNTHIA Dataset: A large collection of synthetic images for semantic segmentation of urban scenes. In: CVPR (2016)  35. Shi, Z., Hospedales, T.M., Xiang, T.: Transferring a semantic representation for  person re-identification and search. In: CVPR (2015)  36. Shotton, J., Girshick, R.B., Fitzgibbon, A.W., Sharp, T., Cook, M., Finocchio, M., Moore, R., Kohli, P., Criminisi, A., Kipman, A., Blake, A.: Eﬃcient human pose estimation from single depth images. TPAMI 35(12), 2821-2840 (2013)  37. Shrivastava, A., Pfister, T., Tuzel, O., Susskind, J., Wang, W., Webb, R.: Learning from simulated and unsupervised images through adversarial training. In: CVPR (2017)  38. Su, C., Zhang, S., Xing, J., Gao, W., Tian, Q.: Deep attributes driven multi-camera  person re-identification. In: ECCV (2016)  39. Taigman, Y., Polyak, A., Wolf, L.: Unsupervised cross-domain image generation.  In: arXiv preprint (2016)  40. Torralba, A., Efros, A.A.: Unbiased look at dataset bias. In: CVPR (2011) 41. Tzeng, E., Hoﬀman, J., Darrell, T., Saenko, K.: Simultaneous deep transfer across  domains and tasks. In: ICCV (2015)  42. Wang, J., Zhu, X., Gong, S., Li, W.: Transferable joint attribute-identity deep  learning for unsupervised person re-identification. In: CVPR (2018)  43. Xiao, T., Li, H., Ouyang, W., Wang, X.: Learning deep feature representations  with domain guided dropout for person re-identification. In: CVPR (2016)  44. Yu, H.X., Wu, A., Zheng, W.S.: Cross-view asymmetric metric learning for unsu-  pervised person re-identification. In: ICCV (2017)  45. Zhang, L., Xiang, T., Gong, S.: Learning a discriminative null space for person  re-identification. In: CVPR (2016)   Domain Adaptation through Synthesis46. Zhao, H., Tian, M., Sun, S., Shao, J., Yan, J., Yi, S., Wang, X., Tang, X.: Spindle net: Person re-identification with human body region guided feature decomposition and fusion. In: CVPR (2017)  47. Zheng, L., Bie, Z., Sun, Y., Wang, J., Su, C., Wang, S., Tian, Q.: MARS: A video  benchmark for large-scale person re-identification. In: ECCV (2016)  48. Zheng, L., Shen, L., Tian, L., Wang, S., Wang, J., Tian, Q.: Scalable person re-  identification: A benchmark. In: ICCV (2015)  49. Zheng, W.S., Gong, S., Xiang, T.: Towards open-world person re-identification by one-shot group-based verification. IEEE Transactions on Pattern Analysis and Machine Intelligence 38(3), 591-606 (March 2016)  50. Zheng, W.S., Gong, S., Xiang, T.: Associating groups of people. In: BMVC (2009) 51. Zheng, W.S., Gong, S., Xiang, T.: Person re-identification by probabilistic relative  distance comparison. In: CVPR (2011)  52. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation  using cycle-consistent adversarial networks. In: ICCV (2017)"}