{"1": "1. Cvejic, N., Nikolov, S.G., Knowles, H.D., Loza, A., Achim, A., Bull, D.R., Cana- garajah, C.N.: The eﬀect of pixel-level fusion on object tracking in multi-sensor surveillance video. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition. (2007)  2. Wu, Y., Blasch, E., Chen, G., Bai, L., Ling, H.: Multiple source data fusion via sparse representation for robust visual tracking. In: Proceedings of International Conference on Information Fusion. (2011)  3. Liu, H., Sun, F.: Fusion tracking in color and infrared images using joint sparse  representation. Information Sciences 55(3) (2012) 590-599  4. Li, C., Cheng, H., Hu, S., Liu, X., Tang, J., Lin, L.: Learning collaborative s- parse representation for grayscale-thermal tracking. IEEE Transactions on Image Processing 25(12) (2016) 5743-5756  5. Li, C., Zhao, N., Lu, Y., Zhu, C., Tang, J.: Weighted sparse representation regular- ized graph learning for rgb-t object tracking. In: Proceedings of ACM International Conference on Multimedia. (2017)  6. Kim, H.U., Lee, D.Y., Sim, J.Y., Kim, C.S.: Sowp: Spatially ordered and weight- In: Proceedings of IEEE International  ed patch descriptor for visual tracking. Conference on Computer Vision. (2015)  7. Ma, C., Huang, J.B., Yang, X., Yang, M.H.: Hierarchical convolutional features for visual tracking. In: Proceedings of IEEE International Conference on Computer Vision. (2015)  8. Wang, L., Ouyang, W., Wang, X., Lu, H.: Visual tracking with fully convolutional networks. In: Proceedings of IEEE International Conference on Computer Vision. (2015)  9. Danelljan, M., Robinson, A., Khan, F.S., Felsberg, M.: Beyond filters: Learning continuous convolution operators for visual tracking. In: Proceedings of European Conference on Computer Vision. (2016)  10. Tsochantaridis, I., Joachims, T., Hofmann, T., Altun, Y.: Large margin methods for structured and interdependent output variables. Journal of Machine Learning Research 6 (2005) 1453-1484  11. Wang, J., Bensmail, H., Gao, X.: Multiple graph regularized protein domain rank-  ing. In: BMC Bioinformatics. (2012)  12. Zhou, D., Weston, J., Gretton, A., Bousquet, O., Scholkopf, B.: Ranking on data manifolds. In: Proceedings of Neural Information Processing Systems. (2004)  13. Zhang, L., Yang, C., Lu, H., Ruan, X., Yang, M.H.: Ranking saliency.  IEEE Transactions on Pattern Analysis and Machine Intelligence 39(9) (2017) 1892- 1904  14. Wang, L., Lu, H., Yang, M.H.: Constrained superpixel tracking. IEEE Transactions  on Cybernetics 48(3) (2017) 1030-1041  15. Boyd, S., Parikh, N., Chu, E., Peleato, B., Eckstein, J.: Distributed optimiza- tion and statistical learning via the alternating direction method of multipliers. Foundations and Trends in Machine Learning 3 (2011) 1-122  16. Lin, Z., Liu, R., Su, Z.: Linearized alternating direction method with adaptive In: Proceedings of Annual Conference on  penalty for low rank representation. Neural Information Processing Systems. (2011)  17. Gade, R., Moeslund, T.B.: Thermal cameras and applications: a survey. Machine  Vision and Applications 25 (2014) 245-262   Cross-Modal Ranking for Robust RGB-T TrackingReferences  1. Cvejic, N., Nikolov, S.G., Knowles, H.D., Loza, A., Achim, A., Bull, D.R., Cana- garajah, C.N.: The eﬀect of pixel-level fusion on object tracking in multi-sensor surveillance video. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition. (2007)  2. Wu, Y., Blasch, E., Chen, G., Bai, L., Ling, H.: Multiple source data fusion via sparse representation for robust visual tracking. In: Proceedings of International Conference on Information Fusion. (2011)  3. Liu, H., Sun, F.: Fusion tracking in color and infrared images using joint sparse  representation. Information Sciences 55(3) (2012) 590-599  4. Li, C., Cheng, H., Hu, S., Liu, X., Tang, J., Lin, L.: Learning collaborative s- parse representation for grayscale-thermal tracking. IEEE Transactions on Image Processing 25(12) (2016) 5743-5756  5. Li, C., Zhao, N., Lu, Y., Zhu, C., Tang, J.: Weighted sparse representation regular- ized graph learning for rgb-t object tracking. In: Proceedings of ACM International Conference on Multimedia. (2017)  6. Kim, H.U., Lee, D.Y., Sim, J.Y., Kim, C.S.: Sowp: Spatially ordered and weight- In: Proceedings of IEEE International  ed patch descriptor for visual tracking. Conference on Computer Vision. (2015)  7. Ma, C., Huang, J.B., Yang, X., Yang, M.H.: Hierarchical convolutional features for visual tracking. In: Proceedings of IEEE International Conference on Computer Vision. (2015)  8. Wang, L., Ouyang, W., Wang, X., Lu, H.: Visual tracking with fully convolutional networks. In: Proceedings of IEEE International Conference on Computer Vision. (2015)  9. Danelljan, M., Robinson, A., Khan, F.S., Felsberg, M.: Beyond filters: Learning continuous convolution operators for visual tracking. In: Proceedings of European Conference on Computer Vision. (2016)  10. Tsochantaridis, I., Joachims, T., Hofmann, T., Altun, Y.: Large margin methods for structured and interdependent output variables. Journal of Machine Learning Research 6 (2005) 1453-1484  11. Wang, J., Bensmail, H., Gao, X.: Multiple graph regularized protein domain rank-  ing. In: BMC Bioinformatics. (2012)  12. Zhou, D., Weston, J., Gretton, A., Bousquet, O., Scholkopf, B.: Ranking on data manifolds. In: Proceedings of Neural Information Processing Systems. (2004)  13. Zhang, L., Yang, C., Lu, H., Ruan, X., Yang, M.H.: Ranking saliency.  IEEE Transactions on Pattern Analysis and Machine Intelligence 39(9) (2017) 1892- 1904  14. Wang, L., Lu, H., Yang, M.H.: Constrained superpixel tracking. IEEE Transactions  on Cybernetics 48(3) (2017) 1030-1041  15. Boyd, S., Parikh, N., Chu, E., Peleato, B., Eckstein, J.: Distributed optimiza- tion and statistical learning via the alternating direction method of multipliers. Foundations and Trends in Machine Learning 3 (2011) 1-122  16. Lin, Z., Liu, R., Su, Z.: Linearized alternating direction method with adaptive In: Proceedings of Annual Conference on  penalty for low rank representation. Neural Information Processing Systems. (2011)  17. Gade, R., Moeslund, T.B.: Thermal cameras and applications: a survey. Machine  Vision and Applications 25 (2014) 245-262   16  Chenglong Li, Chengli Zhu, Yan Huang, Jin Tang, Liang Wang  18. Li, C., Hu, S., Gao, S., Tang, J.: Real-time grayscale-thermal tracking via laplacian sparse representation. In: Proceedings of International Conference on Multimedia Modeling. (2016)  19. Li, C., Lin, L., Zuo, W., Tang, J.: Learning patch-based dynamic graph for visual tracking. In: Proceedings of the AAAI Conference on Artificial Intelligence. (2017) 4126-4132  20. Wright, J., Yang, A.Y., Ganesh, A., Sastry, S.S., Ma, Y.: Robust face recognition via sparse representation. IEEE Transactions on Pattern Analysis and Machine Intelligence 31(2) (2009) 210-227  21. Fu, Y., Hospedales, T.M., Xiang, T., Xiong, J., Gong, S., Wang, Y., Yao, Y.: Robust subjective visual property prediction from crowdsourced pairwise labels. IEEE Transactions on Pattern Analysis and Machine Intelligence 38(3) (2016) 563-577  22. Henriques, J.F., Caseiro, R., Martins, P., Batista, J.: High-speed tracking with kernelized filters. IEEE Transactions on Pattern Analysis and Machine Intelligence (2015)  23. Johnson, R., Zhang, T.: Accelerating stochastic gradient descent using predictive variance reduction. In: Proceedings of Annual Conference on Neural Information Processing Systems. (2013)  24. Ma, C., Yang, X., Zhang, C., Yang, M.H.: Long-term tracking. In: Proceedings of  IEEE Conference on Computer Vision and Pattern Recognition. (2015)  25. Hare, S., Saﬀari, A., Torr, P.H.S.: Struck: Structured output tracking with kernels. In: Proceedings of IEEE International Conference on Computer Vision. (2011) 26. Zhong, W., Lu, H., Yang, M.H.: Robust object tracking via sparsity-based col- laborative model. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition. (2012)  27. Valmadre, J., et al.: End-to-end representation learning for correlation filter based tracking. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition. (2017)  28. Danelljan, M., Bhat, G., Khan, F.S., Felsberg, M.: Eco: Eﬃcient convolution operators for tracking. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition. (2017)  29. Choi, J., Chang, H.J., Yun, S., Fischer, T., Demiris, Y., Choi, J.Y., et al.: At- tentional filter network for adaptive visual tracking. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017)  30. Bertinetto, L., Valmadre, J., Henriques, J.F., Vedaldi, A., Torr, P.H.: Fully- arXiv preprint arX-  convolutional siamese networks for object tracking. iv:1606.09549 (2016)  31. Mueller, M., Smith, N., Ghanem, B.: Context-aware correlation filter tracking. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recognition. (2017)  32. Danelljan, M., Hager, G., Khan, F., Felsberg, M.: Accurate scale estimation for In: Proceedings of British Machine Vision Conference.  robust visual tracking. (2014)  33. Zhang, J., Ma, S., Sclaroﬀ, S.: MEEM: robust tracking via multiple experts us- ing entropy minimization. In: Proceedings of European Conference on Computer Vision. (2014)  34. Hare, S., Saﬀari, A., Torr, P.H.S.: Struck: Structured output tracking with kernels. IEEE Transactions on Pattern Analysis and Machine Intelligence 38(10) (2016) 2096-2109"}