{"1": "1. Loiola, E.M., de Abreu, N.M., Boaventura-Netto, P.O., Hahn, P., Querido, T.: A  survey for the quadratic assignment problem. EJOR (2007) 657-90  2. Wang, W., Lin, W., Chen, Y., Wu, J., Wang, J., Sheng, B.: Finding coherent motions and semantic regions in crowd scenes: a diﬀusion and clustering approach. In: ECCV. (2014)  3. Nie, W., Liu, A., Su, Y., Luan, H., Yang, Z., Cao, L., Ji, R.: Single/cross-camera  multiple-person tracking by graph matching. Neurocomputing (2014)  4. Duchenne, O., Joulin, A., Ponce, J.: A graph-matching kernel for object catego-  rization. In: ICCV. (2011)  5. Cho, M., Alahari, K., Ponce, J.: Learning graphs to match. In: ICCV. (2013) 6. Yan, J., Wang, J., Zha, H., Yang, X.: Consistency-driven alternating optimiza- tion for multigraph matching: A unified approach. IEEE Transactions on Image Processing (2015)  7. Yan, J., Cho, M., Zha, H., Yang, X., Chu, S.: Multi-graph matching via aﬃnity  optimization with graduated consistency regularization. TPAMI (2016)  8. Williams, M.L., Wilson, R.C., Hancock, E.: Multiple graph matching with bayesian  inference. Pattern Recognition Letters (1997) 1275-1281  9. Yan, J., Tian, Y., Zha, H., Yang, X., Zhang, Y., Chu, S.: Joint optimization for  consistent multiple graph matching. In: ICCV. (2013)  10. Sole-Ribalta, A., Serratosa, F.: Graduated assignment algorithm for multiple graph  matching based on a common labeling. IJPRAI (2013)  11. Yan, J., Li, Y., Liu, W., Zha, H., Yang, X., Chu, S.: Graduated consistency-  regularized optimization for multi-graph matching. In: ECCV. (2014)  12. Yan, J., Xu, H., Zha, H., Yang, X., Liu, H., Chu, S.: A matrix decomposition  perspective to multiple graph matching. In: ICCV. (2015)  13. Shi, X., Ling, H., Hu, W., Xing, J., Zhang, Y.: Tensor power iteration for multi-  14. Hu, N., Thibert, B., Guibas, L.: Distributable consistent multi-graph matching.  graph matching. In: CVPR. (2016)  In: CVPR. (2018)  15. Yan, J., Yin, X., Lin, W., Deng, C., Zha, H., Yang, X.: A short survey of recent  advances in graph matching. In: ICMR. (2016)  16. Leordeanu, M., Sukthankar, R., Hebert, M.: Unsupervised learning for graph  matching. Int. J. Comput. Vis. (2012) 28-45  17. Gold, S., Rangarajan, A.: A graduated assignment algorithm for graph matching.  18. Cho, M., Lee, J., Lee, K.M.: Reweighted random walks for graph matching. In:  TPAMI (1996)  ECCV. (2010)  19. Caetano, T., McAuley, J., Cheng, L., Le, Q., Smola, A.J.: Learning graph matching.  20. Egozi, A., Keller, Y., Guterman, H.: A probabilistic approach to spectral graph  TPAMI 31(6) (2009) 1048-1058  matching. TPAMI (2013)  21. Garey, M.R., Johnson, D.S.: Computers and Intractability; A Guide to the Theory  of NP-Completeness. Freeman and Co., NY, USA (1990)  22. Zass, R., Shashua, A.: Probabilistic graph and hypergraph matching. In: CVPR.  (2008)  23. Chertok, M., Keller, Y.: Eﬃcient high order matching. TPAMI (2010) 24. Duchenne, O., Bach, F., Kweon, I., Ponce, J.: A tensor-based algorithm for high-  order graph matching. TPAMI (2011)   Incremental Multi-graph MatchingReferences  1. Loiola, E.M., de Abreu, N.M., Boaventura-Netto, P.O., Hahn, P., Querido, T.: A  survey for the quadratic assignment problem. EJOR (2007) 657-90  2. Wang, W., Lin, W., Chen, Y., Wu, J., Wang, J., Sheng, B.: Finding coherent motions and semantic regions in crowd scenes: a diﬀusion and clustering approach. In: ECCV. (2014)  3. Nie, W., Liu, A., Su, Y., Luan, H., Yang, Z., Cao, L., Ji, R.: Single/cross-camera  multiple-person tracking by graph matching. Neurocomputing (2014)  4. Duchenne, O., Joulin, A., Ponce, J.: A graph-matching kernel for object catego-  rization. In: ICCV. (2011)  5. Cho, M., Alahari, K., Ponce, J.: Learning graphs to match. In: ICCV. (2013) 6. Yan, J., Wang, J., Zha, H., Yang, X.: Consistency-driven alternating optimiza- tion for multigraph matching: A unified approach. IEEE Transactions on Image Processing (2015)  7. Yan, J., Cho, M., Zha, H., Yang, X., Chu, S.: Multi-graph matching via aﬃnity  optimization with graduated consistency regularization. TPAMI (2016)  8. Williams, M.L., Wilson, R.C., Hancock, E.: Multiple graph matching with bayesian  inference. Pattern Recognition Letters (1997) 1275-1281  9. Yan, J., Tian, Y., Zha, H., Yang, X., Zhang, Y., Chu, S.: Joint optimization for  consistent multiple graph matching. In: ICCV. (2013)  10. Sole-Ribalta, A., Serratosa, F.: Graduated assignment algorithm for multiple graph  matching based on a common labeling. IJPRAI (2013)  11. Yan, J., Li, Y., Liu, W., Zha, H., Yang, X., Chu, S.: Graduated consistency-  regularized optimization for multi-graph matching. In: ECCV. (2014)  12. Yan, J., Xu, H., Zha, H., Yang, X., Liu, H., Chu, S.: A matrix decomposition  perspective to multiple graph matching. In: ICCV. (2015)  13. Shi, X., Ling, H., Hu, W., Xing, J., Zhang, Y.: Tensor power iteration for multi-  14. Hu, N., Thibert, B., Guibas, L.: Distributable consistent multi-graph matching.  graph matching. In: CVPR. (2016)  In: CVPR. (2018)  15. Yan, J., Yin, X., Lin, W., Deng, C., Zha, H., Yang, X.: A short survey of recent  advances in graph matching. In: ICMR. (2016)  16. Leordeanu, M., Sukthankar, R., Hebert, M.: Unsupervised learning for graph  matching. Int. J. Comput. Vis. (2012) 28-45  17. Gold, S., Rangarajan, A.: A graduated assignment algorithm for graph matching.  18. Cho, M., Lee, J., Lee, K.M.: Reweighted random walks for graph matching. In:  TPAMI (1996)  ECCV. (2010)  19. Caetano, T., McAuley, J., Cheng, L., Le, Q., Smola, A.J.: Learning graph matching.  20. Egozi, A., Keller, Y., Guterman, H.: A probabilistic approach to spectral graph  TPAMI 31(6) (2009) 1048-1058  matching. TPAMI (2013)  21. Garey, M.R., Johnson, D.S.: Computers and Intractability; A Guide to the Theory  of NP-Completeness. Freeman and Co., NY, USA (1990)  22. Zass, R., Shashua, A.: Probabilistic graph and hypergraph matching. In: CVPR.  (2008)  23. Chertok, M., Keller, Y.: Eﬃcient high order matching. TPAMI (2010) 24. Duchenne, O., Bach, F., Kweon, I., Ponce, J.: A tensor-based algorithm for high-  order graph matching. TPAMI (2011)   16  Tianshu Yu, Junchi Yan, Wei Liu, Baoxin Li  25. Yan, J., Zhang, C., Zha, H., Liu, W., Yang, X., Chu, S.: Discrete hyper-graph  matching. In: CVPR. (2015)  26. Ngoc, Q., Gautier, A., Hein, M.: A ﬂexible tensor block coordinate ascent scheme  for hypergraph matching. In: CVPR. (2015)  27. Leordeanu, M., Hebert, M.: A spectral technique for correspondence problems  using pairwise constraints. In: ICCV. (2005)  28. Leordeanu, M., Hebert, M., Sukthankar, R.: An integer projected fixed point  method for graph matching and map inference. In: NIPS. (2009)  29. Torr, P.H.S.: Solving markov random fields using semidefinite programmin. In:  30. Schellewald, C., Schn¨orr, C.: Probabilistic subgraph matching based on convex  AISTATS. (2003)  relaxation. In: EMMCVPR. (2005)  31. Cour, T., Srinivasan, P., Shi, J.: Balanced graph matching. In: NIPS. (2006) 32. Zaslavskiy, M., Bach, F.R., Vert, J.P.: A path following algorithm for the graph  matching problem. TPAMI (2009)  33. Zhou, F., Torre, F.: Factorized graph matching. TPAMI (2016) 34. Lee, J., Cho, M., Lee, K.: A graph matching algorithm using data-driven markov  chain monte carlo sampling. In: ICPR. (2010)  35. Suh, Y., Cho, M., Lee, K.M.: Graph matching via sequential monte carlo.  In:  36. Adamczewski, K., Suh, Y., Lee, K.: Discrete tabu search for graph matching. In:  ECCV. (2012)  ICCV. (2015)  37. Sol´e-Ribalta, A., Serratosa, F.: Models and algorithms for computing the common  labelling of a set of attributed graphs. CVIU (2011)  38. Huang, Q., Zhang, G., Gao, L., Hu, S., Butscher, A., Guibas, L.: An optimization approach for extracting and encoding consistent maps in a shape collection. ACM Transactions on Graphics (TOG) (2012)  39. Pachauri, D., Kondor, R., Vikas, S.: Solving the multi-way matching problem by  permutation synchronization. In: NIPS. (2013)  40. Chen, Y., Leonidas, G., Huang, Q.: Matching partially similar objects via matrix  completion. In: ICML. (2014)  41. Zhang, Q., Song, X., Shao, X., Zhao, H., Shibasaki, R.: Object discovery: Soft  attributed graph mining. TPAMI 38(3) (2016) 532-545  42. Zhou, X., Zhu, M., Daniilidis, K.: Multi-image matching via fast alternating min-  imization. In: ICCV. (2015)  43. Kulesza, A., Taskar, B., et al.: Determinantal point processes for machine learning.  Foundations and Trends R(cid:13) in Machine Learning 5(2-3) (2012) 123-286 44. Kulesza, A., Taskar, B.: k-dpps: Fixed-size determinantal point processes.  In:  ICML. (2011) 1193-1200  45. Mardia, K.V.: Some properties of clasical multi-dimesional scaling. Communica-  tions in Statistics-Theory and Methods 7(13) (1978) 1233-1241"}