{"1": "1. Agrawal, P., Carreira, J., Malik, J.: Learning to see by moving. In: ICCV (2015) 2. Bach, F.R., Harchaoui, Z.: Diﬀrac: a discriminative and ﬂexible framework for  clustering. In: NIPS (2008)  3. Bautista, M.A., Sanakoyeu, A., Tikhoncheva, E., Ommer, B.: Cliquecnn: Deep unsupervised exemplar learning. In: Advances in Neural Information Processing Systems. pp. 3846-3854 (2016)  4. Bengio, Y., Lamblin, P., Popovici, D., Larochelle, H.: Greedy layer-wise training  of deep networks. In: NIPS (2007)  5. Bojanowski, P., Joulin, A.: Unsupervised learning by predicting noise. ICML (2017) 6. Bojanowski, P., Joulin, A., Lopez-Paz, D., Szlam, A.: Optimizing the latent space  of generative networks. arXiv preprint arXiv:1707.05776 (2017)  7. Bottou, L.: Stochastic gradient descent tricks. In: Neural networks: Tricks of the  trade, pp. 421-436. Springer (2012)  8. Carreira, J., Agrawal, P., Fragkiadaki, K., Malik, J.: Human pose estimation with  iterative error feedback. In: CVPR (2016)  9. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  10. Coates, A., Ng, A.Y.: Learning feature representations with k-means. In: Neural  networks: Tricks of the trade, pp. 561-580. Springer (2012)  11. Csurka, G., Dance, C., Fan, L., Willamowski, J., Bray, C.: Visual categorization with bags of keypoints. In: Workshop on statistical learning in computer vision, ECCV. vol. 1, pp. 1-2. Prague (2004)  12. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: CVPR (2009)  13. Doersch, C., Gupta, A., Efros, A.A.: Unsupervised visual representation learning  by context prediction. In: ICCV (2015)  14. Doersch, C., Zisserman, A.: Multi-task self-supervised visual learning (2017) 15. Donahue, J., Kr¨ahenb¨uhl, P., Darrell, T.: Adversarial feature learning. arXiv  preprint arXiv:1605.09782 (2016)  16. Dosovitskiy, A., Springenberg, J.T., Riedmiller, M., Brox, T.: Discriminative un-  supervised feature learning with convolutional neural networks. In: NIPS (2014)  17. Dumoulin, V., Belghazi, I., Poole, B., Lamb, A., Arjovsky, M., Mastropietro, O., Courville, A.: Adversarially learned inference. arXiv preprint arXiv:1606.00704 (2016)  18. Erhan, D., Bengio, Y., Courville, A., Vincent, P.: Visualizing higher-layer features  of a deep network. University of Montreal 1341, 3 (2009)  19. Friedman, J., Hastie, T., Tibshirani, R.: The elements of statistical learning, vol. 1.  Springer series in statistics New York (2001)  20. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S.,  Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  21. He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpassing human-  level performance on imagenet classification. In: ICCV (2015)  22. Huang, F.J., Boureau, Y.L., LeCun, Y., et al.: Unsupervised learning of invariant feature hierarchies with applications to object recognition. In: CVPR (2007) 23. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected  convolutional networks. arXiv preprint arXiv:1608.06993 (2016)   Deep Clustering for Unsupervised Learning of Visual FeaturesReferences  1. Agrawal, P., Carreira, J., Malik, J.: Learning to see by moving. In: ICCV (2015) 2. Bach, F.R., Harchaoui, Z.: Diﬀrac: a discriminative and ﬂexible framework for  clustering. In: NIPS (2008)  3. Bautista, M.A., Sanakoyeu, A., Tikhoncheva, E., Ommer, B.: Cliquecnn: Deep unsupervised exemplar learning. In: Advances in Neural Information Processing Systems. pp. 3846-3854 (2016)  4. Bengio, Y., Lamblin, P., Popovici, D., Larochelle, H.: Greedy layer-wise training  of deep networks. In: NIPS (2007)  5. Bojanowski, P., Joulin, A.: Unsupervised learning by predicting noise. ICML (2017) 6. Bojanowski, P., Joulin, A., Lopez-Paz, D., Szlam, A.: Optimizing the latent space  of generative networks. arXiv preprint arXiv:1707.05776 (2017)  7. Bottou, L.: Stochastic gradient descent tricks. In: Neural networks: Tricks of the  trade, pp. 421-436. Springer (2012)  8. Carreira, J., Agrawal, P., Fragkiadaki, K., Malik, J.: Human pose estimation with  iterative error feedback. In: CVPR (2016)  9. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  10. Coates, A., Ng, A.Y.: Learning feature representations with k-means. In: Neural  networks: Tricks of the trade, pp. 561-580. Springer (2012)  11. Csurka, G., Dance, C., Fan, L., Willamowski, J., Bray, C.: Visual categorization with bags of keypoints. In: Workshop on statistical learning in computer vision, ECCV. vol. 1, pp. 1-2. Prague (2004)  12. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: CVPR (2009)  13. Doersch, C., Gupta, A., Efros, A.A.: Unsupervised visual representation learning  by context prediction. In: ICCV (2015)  14. Doersch, C., Zisserman, A.: Multi-task self-supervised visual learning (2017) 15. Donahue, J., Kr¨ahenb¨uhl, P., Darrell, T.: Adversarial feature learning. arXiv  preprint arXiv:1605.09782 (2016)  16. Dosovitskiy, A., Springenberg, J.T., Riedmiller, M., Brox, T.: Discriminative un-  supervised feature learning with convolutional neural networks. In: NIPS (2014)  17. Dumoulin, V., Belghazi, I., Poole, B., Lamb, A., Arjovsky, M., Mastropietro, O., Courville, A.: Adversarially learned inference. arXiv preprint arXiv:1606.00704 (2016)  18. Erhan, D., Bengio, Y., Courville, A., Vincent, P.: Visualizing higher-layer features  of a deep network. University of Montreal 1341, 3 (2009)  19. Friedman, J., Hastie, T., Tibshirani, R.: The elements of statistical learning, vol. 1.  Springer series in statistics New York (2001)  20. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S.,  Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  21. He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpassing human-  level performance on imagenet classification. In: ICCV (2015)  22. Huang, F.J., Boureau, Y.L., LeCun, Y., et al.: Unsupervised learning of invariant feature hierarchies with applications to object recognition. In: CVPR (2007) 23. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected  convolutional networks. arXiv preprint arXiv:1608.06993 (2016)   16  Mathilde Caron et al .  24. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. In: ICML (2015)  25. Johnson, J., Douze, M., J´egou, H.: Billion-scale similarity search with gpus. arXiv  26. Joulin, A., Bach, F.: A convex relaxation for weakly supervised classifiers. arXiv  preprint arXiv:1702.08734 (2017)  preprint arXiv:1206.6413 (2012)  segmentation. In: CVPR (2010)  27. Joulin, A., Bach, F., Ponce, J.: Discriminative clustering for  image co-  28. Joulin, A., van der Maaten, L., Jabri, A., Vasilache, N.: Learning visual features  from large weakly supervised data. In: ECCV (2016)  29. Kingma, D.P., Welling, M.: Auto-encoding variational bayes. arXiv preprint  arXiv:1312.6114 (2013)  30. Kovashka, A., Russakovsky, O., Fei-Fei, L., Grauman, K., et al.: Crowdsourcing in computer vision. Foundations and Trends R(cid:13) in Computer Graphics and Vision 10(3), 177-243 (2016)  31. Kr¨ahenb¨uhl, P., Doersch, C., Donahue, J., Darrell, T.: Data-dependent initializa- tions of convolutional neural networks. arXiv preprint arXiv:1511.06856 (2015) 32. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS (2012)  33. Larsson, G., Maire, M., Shakhnarovich, G.: Learning representations for automatic  colorization. In: ECCV (2016)  34. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. Proceedings of the IEEE 86(11), 2278-2324 (1998)  35. Liao, R., Schwing, A., Zemel, R., Urtasun, R.: Learning deep parsimonious repre-  sentations. In: NIPS (2016)  36. Lin, F., Cohen, W.W.: Power iteration clustering. In: ICML (2010) 37. Linsker, R.: Towards an organizing principle for a layered perceptual network. In:  38. Mairal, J., Koniusz, P., Harchaoui, Z., Schmid, C.: Convolutional kernel networks.  NIPS (1988)  In: NIPS (2014)  39. Malisiewicz, T., Gupta, A., Efros, A.A.: Ensemble of exemplar-svms for object  detection and beyond. In: ICCV (2011)  40. Masci, J., Meier, U., Cire¸san, D., Schmidhuber, J.: Stacked convolutional auto- encoders for hierarchical feature extraction. Artificial Neural Networks and Ma- chine Learning pp. 52-59 (2011)  41. Misra, I., Zitnick, C.L., Mitchell, M., Girshick, R.: Seeing through the human reporting bias: Visual classifiers from noisy human-centric labels. In: CVPR (2016) 42. Noroozi, M., Favaro, P.: Unsupervised learning of visual representations by solving  43. Noroozi, M., Pirsiavash, H., Favaro, P.: Representation learning by learning to  jigsaw puzzles. In: ECCV (2016)  count. In: ICCV (2017)  44. Owens, A., Wu, J., McDermott, J.H., Freeman, W.T., Torralba, A.: Ambient sound  provides supervision for visual learning. In: ECCV (2016)  45. Pathak, D., Girshick, R., Doll´ar, P., Darrell, T., Hariharan, B.: Learning features  by watching objects move. CVPR (2017)  46. Pathak, D., Krahenbuhl, P., Donahue, J., Darrell, T., Efros, A.A.: Context en-  coders: Feature learning by inpainting. In: CVPR (2016)  47. Paulin, M., Douze, M., Harchaoui, Z., Mairal, J., Perronin, F., Schmid, C.: Local convolutional features with unsupervised training for image retrieval. In: ICCV (2015)   Deep Clustering for Unsupervised Learning of Visual Features48. Philbin, J., Chum, O., Isard, M., Sivic, J., Zisserman, A.: Object retrieval with  large vocabularies and fast spatial matching. In: CVPR (2007)  49. Philbin, J., Chum, O., Isard, M., Sivic, J., Zisserman, A.: Lost in quantization: Improving particular object retrieval in large scale image databases. In: CVPR (2008)  50. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de-  tection with region proposal networks. In: NIPS (2015)  51. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recog- nition challenge. IJCV 115(3), 211-252 (2015)  52. de Sa, V.R.: Learning classification with unlabeled data. In: NIPS (1994) 53. Sharif Razavian, A., Azizpour, H., Sullivan, J., Carlsson, S.: Cnn features oﬀ-the-  shelf: an astounding baseline for recognition. In: CVPR workshops (2014)  54. Shi, J., Malik, J.: Normalized cuts and image segmentation. TPAMI 22(8), 888-905  (2000)  55. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)  56. Srivastava, N., Hinton, G.E., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.: Dropout: a simple way to prevent neural networks from overfitting. JMLR 15(1), 1929-1958 (2014)  57. Stock, P., Cisse, M.: Convnets and imagenet beyond accuracy: Explana- tions, bias detection, adversarial examples and model criticism. arXiv preprint arXiv:1711.11443 (2017)  58. Thomee, B., Shamma, D.A., Friedland, G., Elizalde, B., Ni, K., Poland, D., Borth, D., Li, L.J.: The new data and new challenges in multimedia research. arXiv preprint arXiv:1503.01817 (2015)  59. Tolias, G., Sicre, R., J´egou, H.: Particular object retrieval with integral max-  pooling of cnn activations. arXiv preprint arXiv:1511.05879 (2015)  60. Turk, M.A., Pentland, A.P.: Face recognition using eigenfaces. In: CVPR (1991) 61. Van De Sande, K., Gevers, T., Snoek, C.: Evaluating color descriptors for object  and scene recognition. TPAMI 32(9), 1582-1596 (2010)  62. Vincent, P., Larochelle, H., Lajoie, I., Bengio, Y., Manzagol, P.A.: Stacked denois- ing autoencoders: Learning useful representations in a deep network with a local denoising criterion. JMLR 11(Dec), 3371-3408 (2010)  63. Wang, X., Gupta, A.: Unsupervised learning of visual representations using videos.  In: ICCV (2015)  64. Wang, X., He, K., Gupta, A.: Transitive invariance for self-supervised visual rep-  resentation learning. arXiv preprint arXiv:1708.02901 (2017)  65. Weinzaepfel, P., Revaud, J., Harchaoui, Z., Schmid, C.: Deepﬂow: Large displace-  ment optical ﬂow with deep matching. In: ICCV (2013)  66. Xie, J., Girshick, R., Farhadi, A.: Unsupervised deep embedding for clustering  67. Xu, L., Neufeld, J., Larson, B., Schuurmans, D.: Maximum margin clustering. In:  analysis. In: ICML (2016)  NIPS (2005)  68. Yang, J., Parikh, D., Batra, D.: Joint unsupervised learning of deep representations  and image clusters. In: CVPR (2016)  69. Yosinski, J., Clune, J., Nguyen, A., Fuchs, T., Lipson, H.: Understanding neural networks through deep visualization. arXiv preprint arXiv:1506.06579 (2015) 70. Zeiler, M.D., Fergus, R.: Visualizing and understanding convolutional networks.  In: ECCV (2014)   18  Mathilde Caron et al .  71. Zhang, R., Isola, P., Efros, A.A.: Colorful image colorization. In: ECCV (2016) 72. Zhang, R., Isola, P., Efros, A.A.: Split-brain autoencoders: Unsupervised learning  by cross-channel prediction. arXiv preprint arXiv:1611.09842 (2016)  73. Zhou, B., Lapedriza, A., Xiao, J., Torralba, A., Oliva, A.: Learning deep features  for scene recognition using places database. In: NIPS (2014)"}