{"1": "1. Kay, W., Carreira, J., Simonyan, K., Zhang, B., Hillier, C., Vijayanarasimhan, S., Viola, F., Green, T., Back, T., Natsev, P., Suleyman, M., Zisserman, A.: The kinetics human action video dataset. arXiv preprint arXiv:1705.06950 (2017) 2. Pont-Tuset, J., Caelles, S., Perazzi, F., Montes, A., Maninis, K.K., Chen, Y., Van Gool, L.: The 2017 davis challenge on video object segmentation. arXiv preprint arXiv:1803.00557 (2017)  3. Jhuang, H., Gall, J., Zuﬃ, S., Schmid, C., Black, M.J.: Towards understanding action recognition. In: International Conf. on Computer Vision (ICCV). (December 2013) 3192-3199  4. Doersch, C., Gupta, A., Efros, A.A.: Unsupervised visual representation learning by context prediction. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 1422-1430  5. Owens, A., Wu, J., McDermott, J.H., Freeman, W.T., Torralba, A.: Ambient sound provides supervision for visual learning. In: European Conference on Computer Vision, Springer (2016) 801-816  6. Jayaraman, D., Grauman, K.: Learning image representations tied to ego-motion. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 1413-1421  7. Doersch, C., Zisserman, A.: Multi-task self-supervised visual learning. IEEE International Conference on Computer Vision (ICCV). (2017)  In: The  8. Wang, X., He, K., Gupta, A.: Transitive invariance for self-supervised visual rep-  resentation learning. arXiv preprint arXiv:1708.02901 (2017)  9. Zhang, R., Isola, P., Efros, A.A.: Split-brain autoencoders: Unsupervised learning  by cross-channel prediction  10. Larsson, G., Maire, M., Shakhnarovich, G.: Colorization as a proxy task for visual  understanding. In: CVPR. Volume 2. (2017) 8  11. Pathak, D., Krahenbuhl, P., Donahue, J., Darrell, T., Efros, A.A.: Context en- coders: Feature learning by inpainting. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 2536-2544  12. Wang, X., Gupta, A.: Unsupervised learning of visual representations using videos.  arXiv preprint arXiv:1505.00687 (2015)  13. Vondrick, C., Pirsiavash, H., Torralba, A.: Generating videos with scene dynamics.  In: Advances In Neural Information Processing Systems. (2016) 613-621  14. Noroozi, M., Favaro, P.: Unsupervised learning of visual representations by solving jigsaw puzzles. In: European Conference on Computer Vision, Springer (2016) 69- 84  15. Pathak, D., Girshick, R., Doll´ar, P., Darrell, T., Hariharan, B.: Learning features  by watching objects move. In: Proc. CVPR. Volume 2. (2017)  16. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con-  ditional adversarial networks. arXiv preprint (2017)  17. Pinto, L., Gandhi, D., Han, Y., Park, Y.L., Gupta, A.: The curious robot: Learn- ing visual representations via physical interactions. In: European Conference on Computer Vision, Springer (2016) 3-18  18. Agrawal, P., Nair, A.V., Abbeel, P., Malik, J., Levine, S.: Learning to poke by pok- ing: Experiential learning of intuitive physics. In: Advances in Neural Information Processing Systems. (2016) 5074-5082  19. Wu, J., Lim, J.J., Zhang, H., Tenenbaum, J.B., Freeman, W.T.: Physics 101: Learning physical object properties from unlabeled videos. In: BMVC. Volume 2. (2016) 7   Tracking Emerges by Colorizing VideosReferences  1. Kay, W., Carreira, J., Simonyan, K., Zhang, B., Hillier, C., Vijayanarasimhan, S., Viola, F., Green, T., Back, T., Natsev, P., Suleyman, M., Zisserman, A.: The kinetics human action video dataset. arXiv preprint arXiv:1705.06950 (2017) 2. Pont-Tuset, J., Caelles, S., Perazzi, F., Montes, A., Maninis, K.K., Chen, Y., Van Gool, L.: The 2017 davis challenge on video object segmentation. arXiv preprint arXiv:1803.00557 (2017)  3. Jhuang, H., Gall, J., Zuﬃ, S., Schmid, C., Black, M.J.: Towards understanding action recognition. In: International Conf. on Computer Vision (ICCV). (December 2013) 3192-3199  4. Doersch, C., Gupta, A., Efros, A.A.: Unsupervised visual representation learning by context prediction. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 1422-1430  5. Owens, A., Wu, J., McDermott, J.H., Freeman, W.T., Torralba, A.: Ambient sound provides supervision for visual learning. In: European Conference on Computer Vision, Springer (2016) 801-816  6. Jayaraman, D., Grauman, K.: Learning image representations tied to ego-motion. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 1413-1421  7. Doersch, C., Zisserman, A.: Multi-task self-supervised visual learning. IEEE International Conference on Computer Vision (ICCV). (2017)  In: The  8. Wang, X., He, K., Gupta, A.: Transitive invariance for self-supervised visual rep-  resentation learning. arXiv preprint arXiv:1708.02901 (2017)  9. Zhang, R., Isola, P., Efros, A.A.: Split-brain autoencoders: Unsupervised learning  by cross-channel prediction  10. Larsson, G., Maire, M., Shakhnarovich, G.: Colorization as a proxy task for visual  understanding. In: CVPR. Volume 2. (2017) 8  11. Pathak, D., Krahenbuhl, P., Donahue, J., Darrell, T., Efros, A.A.: Context en- coders: Feature learning by inpainting. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 2536-2544  12. Wang, X., Gupta, A.: Unsupervised learning of visual representations using videos.  arXiv preprint arXiv:1505.00687 (2015)  13. Vondrick, C., Pirsiavash, H., Torralba, A.: Generating videos with scene dynamics.  In: Advances In Neural Information Processing Systems. (2016) 613-621  14. Noroozi, M., Favaro, P.: Unsupervised learning of visual representations by solving jigsaw puzzles. In: European Conference on Computer Vision, Springer (2016) 69- 84  15. Pathak, D., Girshick, R., Doll´ar, P., Darrell, T., Hariharan, B.: Learning features  by watching objects move. In: Proc. CVPR. Volume 2. (2017)  16. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con-  ditional adversarial networks. arXiv preprint (2017)  17. Pinto, L., Gandhi, D., Han, Y., Park, Y.L., Gupta, A.: The curious robot: Learn- ing visual representations via physical interactions. In: European Conference on Computer Vision, Springer (2016) 3-18  18. Agrawal, P., Nair, A.V., Abbeel, P., Malik, J., Levine, S.: Learning to poke by pok- ing: Experiential learning of intuitive physics. In: Advances in Neural Information Processing Systems. (2016) 5074-5082  19. Wu, J., Lim, J.J., Zhang, H., Tenenbaum, J.B., Freeman, W.T.: Physics 101: Learning physical object properties from unlabeled videos. In: BMVC. Volume 2. (2016) 7   16  Vondrick, Shrivastava, Fathi, Guadarrama, Murphy  20. Tung, H.Y., Tung, H.W., Yumer, E., Fragkiadaki, K.: Self-supervised learning of motion capture. In: Advances in Neural Information Processing Systems. (2017) 5242-5252  21. Zhou, T., Brown, M., Snavely, N., Lowe, D.G.: Unsupervised learning of depth  and ego-motion from video. In: CVPR. Volume 2. (2017) 7  22. Zhou, T., Krahenbuhl, P., Aubry, M., Huang, Q., Efros, A.A.: Learning dense correspondence via 3d-guided cycle consistency. In: Proceedings of the IEEE Con- ference on Computer Vision and Pattern Recognition. (2016) 117-126  23. Ilg, E., Mayer, N., Saikia, T., Keuper, M., Dosovitskiy, A., Brox, T.: Flownet 2.0: Evolution of optical ﬂow estimation with deep networks. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). Volume 2. (2017)  24. Zhou, T., Tulsiani, S., Sun, W., Malik, J., Efros, A.A.: View synthesis by appear- ance ﬂow. In: European conference on computer vision, Springer (2016) 286-301 25. Welsh, T., Ashikhmin, M., Mueller, K.: Transferring color to greyscale images. In:  ACM Transactions on Graphics (TOG). Volume 21., ACM (2002) 277-280  26. Gupta, R.K., Chia, A.Y.S., Rajan, D., Ng, E.S., Zhiyong, H.: Image colorization using similar images. In: Proceedings of the 20th ACM international conference on Multimedia, ACM (2012) 369-378  27. Liu, X., Wan, L., Qu, Y., Wong, T.T., Lin, S., Leung, C.S., Heng, P.A.: Intrinsic colorization. In: ACM Transactions on Graphics (TOG). Volume 27., ACM (2008) 152  28. Chia, A.Y.S., Zhuo, S., Gupta, R.K., Tai, Y.W., Cho, S.Y., Tan, P., Lin, S.: Seman- tic colorization with internet images. In: ACM Transactions on Graphics (TOG). Volume 30., ACM (2011) 156  29. Deshpande, A., Rock, J., Forsyth, D.: Learning large-scale automatic image col- In: Proceedings of the IEEE International Conference on Computer  orization. Vision. (2015) 567-575  30. Zhang, R., Isola, P., Efros, A.A.: Colorful image colorization. In: European Con-  ference on Computer Vision, Springer (2016) 649-666  31. Larsson, G., Maire, M., Shakhnarovich, G.: Learning representations for automatic colorization. In: European Conference on Computer Vision, Springer (2016) 577- 593  32. Guadarrama, S., Dahl, R., Bieber, D., Norouzi, M., Shlens, J., Murphy, K.: Pix-  color: Pixel recursive colorization. arXiv preprint arXiv:1705.07208 (2017)  33. Iizuka, S., Simo-Serra, E., Ishikawa, H.: Let there be color!: joint end-to-end learn- ing of global and local image priors for automatic image colorization with simul- taneous classification. ACM Transactions on Graphics (TOG) 35(4) (2016) 110  34. Ironi, R., Cohen-Or, D., Lischinski, D.: Colorization by example. In: Rendering  Techniques, Citeseer (2005) 201-210  35. Yatziv, L., Sapiro, G.: Fast image and video colorization using chrominance blend-  ing. IEEE transactions on image processing 15(5) (2006) 1120-1129  36. Heu, J.H., Hyun, D.Y., Kim, C.S., Lee, S.U.: Image and video colorization based on prioritized source propagation. In: Image Processing (ICIP), 2009 16th IEEE International Conference on, IEEE (2009) 465-468  37. Liu, S., Zhong, G., De Mello, S., Gu, J., Yang, M.H., Kautz, J.: Switchable temporal  propagation network. arXiv preprint arXiv:1804.08758 (2018)  38. Badrinarayanan, V., Galasso, F., Cipolla, R.: Label propagation in video sequences. In: Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on, IEEE (2010) 3265-3272  39. Ramakanth, S.A., Babu, R.V.: Seamseg: Video object segmentation using patch  seams. In: CVPR. Volume 2. (2014) 5   Tracking Emerges by Colorizing Videos40. Vijayanarasimhan, S., Grauman, K.: Active frame selection for label propagation  in videos. In: European conference on computer vision, Springer (2012) 496-509  41. Perazzi, F., Wang, O., Gross, M., Sorkine-Hornung, A.: Fully connected object proposals for video segmentation. In: Proceedings of the IEEE international con- ference on computer vision. (2015) 3227-3234  42. Grundmann, M., Kwatra, V., Han, M., Essa, I.: Eﬃcient hierarchical graph-based video segmentation. In: Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on, IEEE (2010) 2141-2148  43. Xu, C., Corso, J.J.: Evaluation of super-voxel methods for early video processing. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 1202-1209  44. Brox, T., Malik, J.: Object segmentation by long term analysis of point trajectories.  In: European conference on computer vision, Springer (2010) 282-295  45. Fragkiadaki, K., Zhang, G., Shi, J.: Video segmentation by tracing discontinuities in a trajectory embedding. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 1846-1853  46. Yang, L., Wang, Y., Xiong, X., Yang, J., Katsaggelos, A.K.: Eﬃcient video object segmentation via network modulation. arXiv preprint arXiv:1802.01218 (2018) 47. Caelles, S., Maninis, K.K., Pont-Tuset, J., Leal-Taix´e, L., Cremers, D., Van Gool,  L.: One-shot video object segmentation. In: CVPR 2017, IEEE (2017)  48. Perazzi, F., Khoreva, A., Benenson, R., Schiele, B., Sorkine-Hornung, A.: Learning video object segmentation from static images. In: Computer Vision and Pattern Recognition. (2017)  49. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on, IEEE (2009) 248-255  50. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision, Springer (2014) 740-755  51. Faktor, A., Irani, M.: Video segmentation by non-local consensus voting.  In:  BMVC. Volume 2. (2014) 8  52. M¨arki, N., Perazzi, F., Wang, O., Sorkine-Hornung, A.: Bilateral space video segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 743-751  53. Khoreva, A., Benenson, R., Ilg, E., Brox, T., Schiele, B.: Lucid data dreaming for  multiple object tracking. arXiv preprint arXiv:1703.09554 (2017)  54. Bahdanau, D., Cho, K., Bengio, Y.: Neural machine translation by jointly learning  to align and translate. arXiv preprint arXiv:1409.0473 (2014)  55. Vinyals, O., Blundell, C., Lillicrap, T., Wierstra, D., et al.: Matching networks for one shot learning. In: Advances in Neural Information Processing Systems. (2016) 3630-3638  56. Vinyals, O., Fortunato, M., Jaitly, N.: Pointer networks. In: Advances in Neural  Information Processing Systems. (2015) 2692-2700  57. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2016) 770-778  58. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  59. Liu, C., et al.: Beyond pixels: exploring new representations and applications for  motion analysis. PhD thesis, Massachusetts Institute of Technology (2009)   18  Vondrick, Shrivastava, Fathi, Guadarrama, Murphy  60. Perazzi, F., Pont-Tuset, J., McWilliams, B., Van Gool, L., Gross, M., Sorkine- Hornung, A.: A benchmark dataset and evaluation methodology for video object segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 724-732  61. Yang, Y., Ramanan, D.: Articulated human detection with ﬂexible mixtures of IEEE transactions on pattern analysis and machine intelligence 35(12)  parts. (2013) 2878-2890"}