{"1": "1. Fasel, B., Luettin, J.: Automatic facial expression analysis: a survey. Pattern  recognition 36(1) (2003) 259-275 1  2. Zhao, W., Chellappa, R., Phillips, P.J., Rosenfeld, A.: Face recognition: A literature  survey. ACM computing surveys (CSUR) 35(4) (2003) 399-458 1  3. Xiong, X., De la Torre, F.: Supervised descent method and its applications to face alignment. In: Proceedings of the IEEE conference on computer vision and pattern recognition (CVPR). (2013) 532-539 1  4. Bulat, A., Tzimiropoulos, G.: How far are we from solving the 2d & 3d face align- ment problem? (and a dataset of 230,000 3d facial landmarks). In: International Conference on Computer Vision (ICCV). (2017) 1, 3, 5  5. Taigman, Y., Yang, M., Ranzato, M., Wolf, L.: Deepface: Closing the gap to human- level performance in face verification. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2014) 1701-1708 1  6. Zhu, S., Liu, S., Loy, C.C., Tang, X.: Deep cascaded bi-network for face hallu- cination. In: Proceedings of European Conference on Computer Vision (ECCV). (2016) 614-630 1, 2, 3, 5, 11, 12, 13  7. Yu, X., Porikli, F.: Hallucinating very low-resolution unaligned and noisy face images by transformative discriminative autoencoders. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 3760- 3768 1, 2, 3, 4, 5, 8, 9, 11, 12, 13  8. Baker, S., Kanade, T.: Hallucinating faces. In: Proceedings of 4th IEEE Interna- tional Conference on Automatic Face and Gesture Recognition, FG 2000. (2000) 83-88 1  9. Zhou, E., Fan, H.: Learning Face Hallucination in the Wild. In: Twenty-Ninth  AAAI Conference on Artificial Intelligence. (2015) 3871-3877 1  10. Yu, X., Porikli, F.: Ultra-resolving face images by discriminative generative net- In: Proceedings of European Conference on Computer Vision (ECCV).  works. (2016) 318-333 1, 4, 8, 9  11. Yu, X., Porikli, F.: Imagining the unimaginable faces by deconvolutional networks.  IEEE Transactions on Image Processing (2018) 1  12. Cao, Q., Lin, L., Shi, Y., Liang, X., Li, G.: Attention-aware face hallucination via deep reinforcement learning. In: Proceedings of the IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 690-698 1, 3  13. Dahl, R., Norouzi, M., Shlens, J.: Pixel recursive super resolution. In: International  Conference on Computer Vision (ICCV). (2017) 5439-5448 1, 3, 4, 5  14. Bulat, A., Tzimiropoulos, G.: Super-fan: Integrated facial landmark localization and super-resolution of real-world low resolution faces in arbitrary poses with gans. arXiv preprint arXiv:1712.02765 (2017) 1, 5  15. Chen, Y., Tai, Y., Liu, X., Shen, C., Yang, J.: Fsrnet: End-to-end learning face super-resolution with facial priors. arXiv preprint arXiv:1711.10703 (2017) 1, 5 16. Yu, X., Fernando, B., Hartley, R., Porikli, F.: Super-resolving very low-resolution face images with supplementary attributes. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2018) 908-917 1  17. Ziwei Liu, Ping Luo, X.W., Tang, X.: Deep learning face attributes in the wild. In: Proceedings of International Conference on Computer Vision (ICCV). (2015) 3730-3738 2, 11   Face Super-resolutionReferences  1. Fasel, B., Luettin, J.: Automatic facial expression analysis: a survey. Pattern  recognition 36(1) (2003) 259-275 1  2. Zhao, W., Chellappa, R., Phillips, P.J., Rosenfeld, A.: Face recognition: A literature  survey. ACM computing surveys (CSUR) 35(4) (2003) 399-458 1  3. Xiong, X., De la Torre, F.: Supervised descent method and its applications to face alignment. In: Proceedings of the IEEE conference on computer vision and pattern recognition (CVPR). (2013) 532-539 1  4. Bulat, A., Tzimiropoulos, G.: How far are we from solving the 2d & 3d face align- ment problem? (and a dataset of 230,000 3d facial landmarks). In: International Conference on Computer Vision (ICCV). (2017) 1, 3, 5  5. Taigman, Y., Yang, M., Ranzato, M., Wolf, L.: Deepface: Closing the gap to human- level performance in face verification. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2014) 1701-1708 1  6. Zhu, S., Liu, S., Loy, C.C., Tang, X.: Deep cascaded bi-network for face hallu- cination. In: Proceedings of European Conference on Computer Vision (ECCV). (2016) 614-630 1, 2, 3, 5, 11, 12, 13  7. Yu, X., Porikli, F.: Hallucinating very low-resolution unaligned and noisy face images by transformative discriminative autoencoders. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 3760- 3768 1, 2, 3, 4, 5, 8, 9, 11, 12, 13  8. Baker, S., Kanade, T.: Hallucinating faces. In: Proceedings of 4th IEEE Interna- tional Conference on Automatic Face and Gesture Recognition, FG 2000. (2000) 83-88 1  9. Zhou, E., Fan, H.: Learning Face Hallucination in the Wild. In: Twenty-Ninth  AAAI Conference on Artificial Intelligence. (2015) 3871-3877 1  10. Yu, X., Porikli, F.: Ultra-resolving face images by discriminative generative net- In: Proceedings of European Conference on Computer Vision (ECCV).  works. (2016) 318-333 1, 4, 8, 9  11. Yu, X., Porikli, F.: Imagining the unimaginable faces by deconvolutional networks.  IEEE Transactions on Image Processing (2018) 1  12. Cao, Q., Lin, L., Shi, Y., Liang, X., Li, G.: Attention-aware face hallucination via deep reinforcement learning. In: Proceedings of the IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 690-698 1, 3  13. Dahl, R., Norouzi, M., Shlens, J.: Pixel recursive super resolution. In: International  Conference on Computer Vision (ICCV). (2017) 5439-5448 1, 3, 4, 5  14. Bulat, A., Tzimiropoulos, G.: Super-fan: Integrated facial landmark localization and super-resolution of real-world low resolution faces in arbitrary poses with gans. arXiv preprint arXiv:1712.02765 (2017) 1, 5  15. Chen, Y., Tai, Y., Liu, X., Shen, C., Yang, J.: Fsrnet: End-to-end learning face super-resolution with facial priors. arXiv preprint arXiv:1711.10703 (2017) 1, 5 16. Yu, X., Fernando, B., Hartley, R., Porikli, F.: Super-resolving very low-resolution face images with supplementary attributes. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2018) 908-917 1  17. Ziwei Liu, Ping Luo, X.W., Tang, X.: Deep learning face attributes in the wild. In: Proceedings of International Conference on Computer Vision (ICCV). (2015) 3730-3738 2, 11   16  X. Yu, B. Fernando, B. Ghanem, F. Porikli and R. Hartley  18. Huang, G.B., Ramesh, M., Berg, T., Learned-Miller, E.: Labeled faces in the wild: A database for studying face recognition in unconstrained environments. Technical Report 07-49, University of Massachusetts, Amherst (2007) 2, 11  19. Zafeiriou, S., Trigeorgis, G., Chrysos, G., Deng, J., Shen, J.: The menpo facial landmark localisation challenge: A step towards the solution. In: Proceedings of the IEEE conference on computer vision and pattern recognition workshops (CVPRW). (2017) 2116-2125 2, 11  20. Yang, C.Y., Liu, S., Yang, M.H.: Structured face hallucination. In: Proceedings of the IEEE Computer Society Conference on Computer Vision and Pattern Recog- nition (CVPR). (2013) 1099-1106 2, 4  21. Jaderberg, M., Simonyan, K., Zisserman, A., et al.: Spatial transformer networks. In: Advances in Neural Information Processing Systems (NIPS). (2015) 2017-2025 3, 5  22. Xiang Ma, Junping Zhang, C.Q.: Hallucinating face by position-patch. Pattern  Recognition 43(6) (2010) 2224-2236 4, 11, 12, 13  23. Wang, X., Tang, X.: Hallucinating face by eigen transformation. IEEE Transactions on Systems, Man and Cybernetics Part C: Applications and Reviews 35(3) (2005) 425-434 4  24. Liu, C., Shum, H.Y., Freeman, W.T.: Face hallucination: Theory and practice.  International Journal of Computer Vision 75(1) (2007) 115-134 4  25. Kolouri, S., Rohde, G.K.: Transport-based single frame super resolution of very low resolution face images. In: Proceedings of the IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR). (2015) 4876-4884 4 26. Baker, S., Kanade, T.: Limits on super-resolution and how to break them. IEEE Transactions on Pattern Analysis and Machine Intelligence 24(9) (2002) 1167-1183 4  27. Yang, J., Wright, J., Huang, T.S., Ma, Y.:  Image super-resolution via sparse representation. IEEE transactions on image processing 19(11) (2010) 2861-73 4 28. Li, Y., Cai, C., Qiu, G., Lam, K.M.: Face hallucination based on sparse local-pixel  structure. Pattern Recognition 47(3) (2014) 1261-1270 4  29. Jin, Y., Bouganis, C.S.: Robust multi-image based blind face hallucination. In: Proceedings of the IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR). (2015) 5252-5260 4  30. Tappen, M.F., Liu, C.: A Bayesian Approach to Alignment-Based Image Hallu- cination. In: Proceedings of European Conference on Computer Vision (ECCV). Volume 7578. (2012) 236-249 4  31. Yu, X., Porikli, F.: Face hallucination with tiny unaligned images by transformative In: Thirty-First AAAI Conference on Artificial  discriminative neural networks. Intelligence. (2017) 5  32. Xu, X., Sun, D., Pan, J., Zhang, Y., Pfister, H., Yang, M.H.: Learning to super- resolve blurry face and text images. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (ICCV). (2017) 251-260 5, 8, 9  33. Goodfellow, I., Pouget-Abadie, J., Mirza, M.: Generative Adversarial Networks. In: Advances in Neural Information Processing Systems (NIPS). (2014) 2672-2680 5  34. Radford, A., Metz, L., Chintala, S.: Unsupervised Representation Learning with Deep Convolutional Generative Adversarial Networks. arXiv:1511.06434 (2015) 1-15 5, 8  35. Van Den Oord, A., Kalchbrenner, N., Kavukcuoglu, K.: Pixel recurrent neural networks. In: Proceedings of International Conference on International Conference on Machine Learning (ICML). (2016) 1747-1756 5   Face Super-resolution36. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti- mation. In: European Conference on Computer Vision (ECCV). (2016) 483-499 6, 7, 8  37. Ledig, C., Theis, L., Husz´ar, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A., Tejani, A., Totz, J., Wang, Z., et al.: Photo-realistic single image In: Proceedings of the super-resolution using a generative adversarial network. IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 4681-4690 8, 9, 11, 12, 13  38. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014) 9  39. Hinton, G.: Neural Networks for Machine Learning Lecture 6a: Overview of mini-  batch gradient descent Reminder: The error surface for a linear neuron 10  40. Kim, J., Kwon Lee, J., Mu Lee, K.: Accurate image super-resolution using very deep convolutional networks. In: Proceedings of the IEEE Computer Society Con- ference on Computer Vision and Pattern Recognition (CVPR). (2016) 1646-1654 11, 12, 13"}