{"1": "1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., Ghemawat, S., Goodfellow, I., Harp, A., Irving, G., Isard, M., Jia, Y., Jozefowicz, R., Kaiser, L., Kudlur, M., Levenberg, J., Man´e, D., Monga, R., Moore, S., Murray, D., Olah, C., Schuster, M., Shlens, J., Steiner, B., Sutskever, I., Talwar, K., Tucker, P., Vanhoucke, V., Vasudevan, V., Vi´egas, F., Vinyals, O., Warden, P., Wattenberg, M., Wicke, M., Yu, Y., Zheng, X.: TensorFlow: Large-scale machine learning on heterogeneous systems (2015), http://tensorﬂow.org/, software available from tensorﬂow.org  2. Alon, Y., Ferencz, A., Shashua, A.: Oﬀ-road path following using region classifica- tion and geometric projection constraints. In: 2006 IEEE Computer Society Confer- ence on Computer Vision and Pattern Recognition (CVPR 2006), 17-22 June 2006, New York, NY, USA. pp. 689-696 (2006), https://doi.org/10.1109/CVPR.2006.213 3. ´Alvarez, J.M., L´opez, A.M., Baldrich, R.: Shadow resistant road segmentation from a mobile monocular system. In: Pattern Recognition and Image Analysis, Third Iberian Conference, IbPRIA 2007, Girona, Spain, June 6-8, 2007, Proceedings, Part II. pp. 9-16 (2007)  4. Aly, M.: Real  time detection of abs/1411.7113 (2014), http://arxiv.org/abs/1411.7113  lane markers  in urban streets. CoRR  5. Badrinarayanan, V., Kendall, A., Cipolla, R.: Segnet: A deep convolutional encoder-decoder architecture for image segmentation. IEEE Transactions on Pat- tern Analysis and Machine Intelligence (2017)  6. Barnes, D., Maddern, W., Posner, I.: Find your own way: Weakly-supervised seg- mentation of path proposals for urban autonomy. In: 2017 IEEE International Conference on Robotics and Automation, ICRA 2017, Singapore, Singapore, May 29 - June 3, 2017. pp. 203-210 (2017), https://doi.org/10.1109/ICRA.2017.7989025 7. Bergasa, L.M., Almeria, D., Almaz´an, J., Torres, J.J.Y., Arroyo, R.: Drivesafe: An app for alerting inattentive drivers and scoring driving behaviors. In: 2014 IEEE Intelligent Vehicles Symposium Proceedings, Dearborn, MI, USA, June 8-11, 2014. pp. 240-245 (2014), https://doi.org/10.1109/IVS.2014.6856461  8. Chen, S., Zhang, S., Shang, J., Chen, B., Zheng, N.: Brain inspired cogni- tive model with attention for self-driving cars. CoRR abs/1702.05596 (2017), http://arxiv.org/abs/1702.05596  9. Fischler, M.A., Bolles, R.C.: Random sample consensus: A paradigm for model fitting with applications to image analysis and automated cartography. Commun. ACM 24(6), 381-395 (1981), http://doi.acm.org/10.1145/358669.358692  10. Gao, J., Wang, Q., Yuan, Y.: Embedding structured contour and loca- tion prior in siamesed fully convolutional networks for road detection. In: 2017 IEEE International Conference on Robotics and Automation, ICRA 2017, Singapore, Singapore, May 29 - June 3, 2017. pp. 219-224 (2017), https://doi.org/10.1109/ICRA.2017.7989027  11. Geiger, A., Lenz, P., Stiller, C., Urtasun, R.: Vision meets  The KITTI dataset. https://doi.org/10.1177/0278364913491297  I.  J. Robotics Res. 32(11),  1231-1237  robotics: (2013),  12. Haloi, M., Jayagopi, D.B.: Vehicle local position estimation system. CoRR  abs/1503.06648 (2015), http://arxiv.org/abs/1503.06648  13. Hinton, G.E., Srivastava, N., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.: Im- proving neural networks by preventing co-adaptation of feature detectors. CoRR abs/1207.0580 (2012), http://arxiv.org/abs/1207.0580   Geometric Constrained Lane Segmentation and Lane Boundary DetectionReferences  1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., Ghemawat, S., Goodfellow, I., Harp, A., Irving, G., Isard, M., Jia, Y., Jozefowicz, R., Kaiser, L., Kudlur, M., Levenberg, J., Man´e, D., Monga, R., Moore, S., Murray, D., Olah, C., Schuster, M., Shlens, J., Steiner, B., Sutskever, I., Talwar, K., Tucker, P., Vanhoucke, V., Vasudevan, V., Vi´egas, F., Vinyals, O., Warden, P., Wattenberg, M., Wicke, M., Yu, Y., Zheng, X.: TensorFlow: Large-scale machine learning on heterogeneous systems (2015), http://tensorﬂow.org/, software available from tensorﬂow.org  2. Alon, Y., Ferencz, A., Shashua, A.: Oﬀ-road path following using region classifica- tion and geometric projection constraints. In: 2006 IEEE Computer Society Confer- ence on Computer Vision and Pattern Recognition (CVPR 2006), 17-22 June 2006, New York, NY, USA. pp. 689-696 (2006), https://doi.org/10.1109/CVPR.2006.213 3. ´Alvarez, J.M., L´opez, A.M., Baldrich, R.: Shadow resistant road segmentation from a mobile monocular system. In: Pattern Recognition and Image Analysis, Third Iberian Conference, IbPRIA 2007, Girona, Spain, June 6-8, 2007, Proceedings, Part II. pp. 9-16 (2007)  4. Aly, M.: Real  time detection of abs/1411.7113 (2014), http://arxiv.org/abs/1411.7113  lane markers  in urban streets. CoRR  5. Badrinarayanan, V., Kendall, A., Cipolla, R.: Segnet: A deep convolutional encoder-decoder architecture for image segmentation. IEEE Transactions on Pat- tern Analysis and Machine Intelligence (2017)  6. Barnes, D., Maddern, W., Posner, I.: Find your own way: Weakly-supervised seg- mentation of path proposals for urban autonomy. In: 2017 IEEE International Conference on Robotics and Automation, ICRA 2017, Singapore, Singapore, May 29 - June 3, 2017. pp. 203-210 (2017), https://doi.org/10.1109/ICRA.2017.7989025 7. Bergasa, L.M., Almeria, D., Almaz´an, J., Torres, J.J.Y., Arroyo, R.: Drivesafe: An app for alerting inattentive drivers and scoring driving behaviors. In: 2014 IEEE Intelligent Vehicles Symposium Proceedings, Dearborn, MI, USA, June 8-11, 2014. pp. 240-245 (2014), https://doi.org/10.1109/IVS.2014.6856461  8. Chen, S., Zhang, S., Shang, J., Chen, B., Zheng, N.: Brain inspired cogni- tive model with attention for self-driving cars. CoRR abs/1702.05596 (2017), http://arxiv.org/abs/1702.05596  9. Fischler, M.A., Bolles, R.C.: Random sample consensus: A paradigm for model fitting with applications to image analysis and automated cartography. Commun. ACM 24(6), 381-395 (1981), http://doi.acm.org/10.1145/358669.358692  10. Gao, J., Wang, Q., Yuan, Y.: Embedding structured contour and loca- tion prior in siamesed fully convolutional networks for road detection. In: 2017 IEEE International Conference on Robotics and Automation, ICRA 2017, Singapore, Singapore, May 29 - June 3, 2017. pp. 219-224 (2017), https://doi.org/10.1109/ICRA.2017.7989027  11. Geiger, A., Lenz, P., Stiller, C., Urtasun, R.: Vision meets  The KITTI dataset. https://doi.org/10.1177/0278364913491297  I.  J. Robotics Res. 32(11),  1231-1237  robotics: (2013),  12. Haloi, M., Jayagopi, D.B.: Vehicle local position estimation system. CoRR  abs/1503.06648 (2015), http://arxiv.org/abs/1503.06648  13. Hinton, G.E., Srivastava, N., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.: Im- proving neural networks by preventing co-adaptation of feature detectors. CoRR abs/1207.0580 (2012), http://arxiv.org/abs/1207.0580   16  Jie Zhang et al.  14. Huval, B., Wang, T., Tandon, S., Kiske, J., Song, W., Pazhayampallil, J., An- driluka, M., Rajpurkar, P., Migimatsu, T., Cheng-Yue, R., Mujica, F., Coates, A., Ng, A.Y.: An empirical evaluation of deep learning on highway driving. CoRR abs/1504.01716 (2015), http://arxiv.org/abs/1504.01716  15. Katramados, I., Crumpler, S., Breckon, T.P.: Real-time traversable surface detec- tion by colour space fusion and temporal analysis. In: Computer Vision Systems, 7th International Conference on Computer Vision Systems, ICVS 2009, Li`ege, Bel- gium, October 13-15, 2009, Proceedings. pp. 265-274 (2009)  16. Kim, J., Park, C.: End-to-end ego lane estimation based on sequential transfer learning for self-driving cars. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition Workshops, CVPR Workshops, Honolulu, HI, USA, July 21- 26, 2017. pp. 1194-1202 (2017), https://doi.org/10.1109/CVPRW.2017.158  17. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. CoRR  abs/1412.6980 (2014), http://arxiv.org/abs/1412.6980  18. Kortli, Y., Marzougui, M., Bouallegue, B., Bose, J.S.C., Rodrigues, P., Atri, M.: A novel illumination-invariant lane detection system. In: 2017 2nd International Conference on Anti-Cyber Crimes (ICACC). pp. 166-171 (March 2017)  19. Kotikalapudi, R., contributors: keras-vis. https://github.com/raghakot/keras-vis  (2017)  20. Levinson, J., Askeland, J., Becker, J., Dolson, J., Held, D., Kammel, S., Kolter, J.Z., Langer, D., Pink, O., Pratt, V.R., Sokolsky, M., Stanek, G., Stavens, D.M., Teichman, A., Werling, M., Thrun, S.: Towards fully autonomous driving: Systems and algorithms. In: IEEE Intelligent Vehicles Symposium (IV), 2011, Baden-Baden, Germany, June 5-9, 2011. pp. 163-168 (2011)  21. Li, J., Mei, X., Prokhorov, D.V., Tao, D.: Deep neural network for structural prediction and lane detection in traﬃc scene. IEEE Trans. Neural Netw. Learning Syst. 28(3), 690-703 (2017), https://doi.org/10.1109/TNNLS.2016.2522428 22. Li, J., Jin, L., Fei, S., Ma, J.: Robust urban road image segmentation. In: Pro- ceeding of the 11th World Congress on Intelligent Control and Automation. pp. 2923-2928 (June 2014)  23. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. CoRR abs/1411.4038 (2014), http://arxiv.org/abs/1411.4038 24. Lu, K., Li, J., An, X., He, H.: A hierarchical approach for road detec- tion. In: 2014 IEEE International Conference on Robotics and Automation, ICRA 2014, Hong Kong, China, May 31 - June 7, 2014. pp. 517-522 (2014), https://doi.org/10.1109/ICRA.2014.6906904  25. Oliveira, G.L., Burgard, W., Brox, T.: Eﬃcient deep models for monocular road segmentation. In: 2016 IEEE/RSJ International Conference on Intelligent Robots and Systems, IROS 2016, Daejeon, South Korea, October 9-14, 2016. pp. 4885-4891 (2016), https://doi.org/10.1109/IROS.2016.7759717  26. Rahman, M.A., Wang, Y.: Optimizing intersection-over-union in deep neural net- works for image segmentation. In: Bebis, G., Boyle, R., Parvin, B., Koracin, D., Porikli, F., Skaﬀ, S., Entezari, A., Min, J., Iwai, D., Sadagic, A., Scheidegger, C., Isenberg, T. (eds.) Advances in Visual Computing. pp. 234-244. Springer Interna- tional Publishing, Cham (2016)  27. Ronneberger, O., P.Fischer, Brox, T.: U-net: Convolutional networks  for biomedical image segmentation. In: Medical Image Computing and Computer- Assisted Intervention (MICCAI). LNCS, vol. 9351, pp. 234-241. Springer (2015), http://lmb.informatik.uni-freiburg.de/Publications/2015/RFB15a, (available on arXiv:1505.04597 [cs.CV])   Geometric Constrained Lane Segmentation and Lane Boundary Detection28. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., Berg, A.C., Fei-Fei, L.: ImageNet Large Scale Visual Recognition Challenge. International Journal of Computer Vision (IJCV) 115(3), 211-252 (2015)  29. Sermanet, P., Eigen, D., Zhang, X., Mathieu, M., Fergus, R., LeCun, Y.: Overfeat: Integrated recognition, localization and detection using convolutional networks. CoRR abs/1312.6229 (2013), http://arxiv.org/abs/1312.6229  30. Simonyan, K., Vedaldi, A., Zisserman, A.: Deep inside convolutional networks: Visualising image classification models and saliency maps. CoRR abs/1312.6034 (2013), http://arxiv.org/abs/1312.6034  31. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale image recognition. CoRR abs/1409.1556 (2014), http://arxiv.org/abs/1409.1556 32. Teichmann, M., Weber, M., Z¨ollner, J.M., Cipolla, R., Urtasun, R.: Multinet: Real- time joint semantic reasoning for autonomous driving. CoRR abs/1612.07695 (2016), http://arxiv.org/abs/1612.07695  33. Valente, M., Stanciulescu, B.: Real-time method for general road segmentation. In: IEEE Intelligent Vehicles Symposium, IV 2017, Los Angeles, CA, USA, June 11-14, 2017. pp. 443-447 (2017), https://doi.org/10.1109/IVS.2017.7995758 34. Xingang Pan, Jianping Shi, P.L.X.W., Tang, X.: Spatial as deep: Spatial cnn for traﬃc scene understanding. In: AAAI Conference on Artificial Intelligence (AAAI) (February 2018)  35. Zhang, G., Zheng, N., Cui, C., Yang, G.: An eﬃcient road detection method in noisy urban environment. In: Intelligent Vehicles Symposium. pp. 556-561 (2009)"}