{"1": "1. Brachmann, E., Krull, A., Michel, F., Gumhold, S., Shotton, J., Rother, C.: Learn- ing 6D object pose estimation using 3D object coordinates. In: European Confer- ence on Computer Vision (ECCV) (2014)  2. Brachmann, E., Michel, F., Krull, A., Ying Yang, M., Gumhold, S., Rother, C.: Uncertainty-driven 6D pose estimation of objects and scenes from a single RGB im- age. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3364-3372 (2016)  3. Carreira, J., Agrawal, P., Fragkiadaki, K., Malik, J.: Human pose estimation with iterative error feedback. In: IEEE conference on Computer Vision and Pattern Recognition (CVPR) (2016)  4. Collet, A., Martinez, M., Srinivasa, S.S.: The MOPED framework: Object recog- nition and pose estimation for manipulation. International Journal of Robotics Research (IJRR) 30(10), 1284-1306 (2011)  5. Costante, G., Ciarfuglia, T.A.: LS-VO: Learning dense optical subspace for robust visual odometry estimation. IEEE Robotics and Automation Letters 3(3), 1735- 1742 (2018)  6. Dosovitskiy, A., Fischer, P., Ilg, E., Hausser, P., Hazirbas, C., Golkov, V., van der Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: IEEE International Conference on Computer Vision (ICCV). pp. 2758-2766 (2015)  7. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual object classes (voc) challenge. International Journal of Computer Vision (ICCV) 88(2), 303-338 (2010)  8. Girshick, R.: Fast R-CNN. In: IEEE International Conference on Computer Vision  (ICCV). pp. 1440-1448 (2015)  9. Hinterstoisser, S., Lepetit, V., Ilic, S., Holzer, S., Bradski, G., Konolige, K., , Navab, N.: Model based training, detection and pose estimation of texture-less 3D objects in heavily cluttered scenes. In: Asian Conference on Computer Vision (ACCV) (2012)  10. Hodan, T., Haluza, P., Obdrˇz´alek, ˇS., Matas, J., Lourakis, M., Zabulis, X.: T- less: An rgb-d dataset for 6d pose estimation of texture-less objects. In: IEEE Winter Conference on Applications of Computer Vision (WACV). pp. 880-888. IEEE (2017)  11. Kehl, W., Manhardt, F., Tombari, F., Ilic, S., Navab, N.: SSD-6D: Making rgb- based 3D detection and 6D pose estimation great again. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 1521-1529 (2017)  12. Kendall, A., Cipolla, R.: Geometric loss functions for camera pose regression with deep learning. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  13. Krull, A., Brachmann, E., Michel, F., Ying Yang, M., Gumhold, S., Rother, C.: Learning analysis-by-synthesis for 6D pose estimation in RGB-D images. In: IEEE International Conference on Computer Vision (ICCV). pp. 954-962 (2015)  14. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd: Single shot multibox detector. In: European Conference on Computer Vision (ECCV). pp. 21-37 (2016)  15. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3431-3440 (2015)   DeepIM: Deep Iterative Matching for 6D Pose EstimationReferences  1. Brachmann, E., Krull, A., Michel, F., Gumhold, S., Shotton, J., Rother, C.: Learn- ing 6D object pose estimation using 3D object coordinates. In: European Confer- ence on Computer Vision (ECCV) (2014)  2. Brachmann, E., Michel, F., Krull, A., Ying Yang, M., Gumhold, S., Rother, C.: Uncertainty-driven 6D pose estimation of objects and scenes from a single RGB im- age. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3364-3372 (2016)  3. Carreira, J., Agrawal, P., Fragkiadaki, K., Malik, J.: Human pose estimation with iterative error feedback. In: IEEE conference on Computer Vision and Pattern Recognition (CVPR) (2016)  4. Collet, A., Martinez, M., Srinivasa, S.S.: The MOPED framework: Object recog- nition and pose estimation for manipulation. International Journal of Robotics Research (IJRR) 30(10), 1284-1306 (2011)  5. Costante, G., Ciarfuglia, T.A.: LS-VO: Learning dense optical subspace for robust visual odometry estimation. IEEE Robotics and Automation Letters 3(3), 1735- 1742 (2018)  6. Dosovitskiy, A., Fischer, P., Ilg, E., Hausser, P., Hazirbas, C., Golkov, V., van der Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: IEEE International Conference on Computer Vision (ICCV). pp. 2758-2766 (2015)  7. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual object classes (voc) challenge. International Journal of Computer Vision (ICCV) 88(2), 303-338 (2010)  8. Girshick, R.: Fast R-CNN. In: IEEE International Conference on Computer Vision  (ICCV). pp. 1440-1448 (2015)  9. Hinterstoisser, S., Lepetit, V., Ilic, S., Holzer, S., Bradski, G., Konolige, K., , Navab, N.: Model based training, detection and pose estimation of texture-less 3D objects in heavily cluttered scenes. In: Asian Conference on Computer Vision (ACCV) (2012)  10. Hodan, T., Haluza, P., Obdrˇz´alek, ˇS., Matas, J., Lourakis, M., Zabulis, X.: T- less: An rgb-d dataset for 6d pose estimation of texture-less objects. In: IEEE Winter Conference on Applications of Computer Vision (WACV). pp. 880-888. IEEE (2017)  11. Kehl, W., Manhardt, F., Tombari, F., Ilic, S., Navab, N.: SSD-6D: Making rgb- based 3D detection and 6D pose estimation great again. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 1521-1529 (2017)  12. Kendall, A., Cipolla, R.: Geometric loss functions for camera pose regression with deep learning. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  13. Krull, A., Brachmann, E., Michel, F., Ying Yang, M., Gumhold, S., Rother, C.: Learning analysis-by-synthesis for 6D pose estimation in RGB-D images. In: IEEE International Conference on Computer Vision (ICCV). pp. 954-962 (2015)  14. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd: Single shot multibox detector. In: European Conference on Computer Vision (ECCV). pp. 21-37 (2016)  15. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3431-3440 (2015)   16  Yi Li, Gu Wang, Xiangyang Ji, Yu Xiang, Dieter Fox  16. Lowe, D.G.: Object recognition from local scale-invariant features. In: IEEE Inter- national Conference on Computer Vision (ICCV). vol. 2, pp. 1150-1157 (1999) 17. Michel, F., Kirillov, A., Brachmann, E., Krull, A., Gumhold, S., Savchynskyy, B., Rother, C.: Global hypothesis generation for 6D object pose estimation. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  18. Mousavian, A., Anguelov, D., Flynn, J., Koˇseck´a, J.: 3D bounding box estimation using deep learning and geometry. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 5632-5640 (2017)  19. Oberweger, M., Wohlhart, P., Lepetit, V.: Training a feedback loop for hand pose estimation. In: IEEE International Conference on Computer Vision (ICCV) (2015) 20. Rad, M., Lepetit, V.: BB8: A scalable, accurate, robust to partial occlusion method for predicting the 3D poses of challenging objects without using depth. In: IEEE International Conference on Computer Vision (ICCV) (2017)  21. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified, real-time object detection. In: IEEE conference on Computer Vision and Pattern Recognition (CVPR). pp. 779-788 (2016)  22. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: Towards real-time object detection with region proposal networks. In: Advances in Neural Information Pro- cessing Systems (NIPS) (2015)  23. Rothganger, F., Lazebnik, S., Schmid, C., Ponce, J.: 3D object modeling and recog- nition using local aﬃne-invariant image descriptors and multi-view spatial con- straints. International Journal of Computer Vision (IJCV) 66(3), 231-259 (2006) 24. Saxena, A., Pandya, H., Kumar, G., Gaud, A., Krishna, K.M.: Exploring convolu- tional networks for end-to-end visual servoing. In: IEEE International Conference on Robotics and Automation (ICRA). pp. 3817-3823 (2017)  25. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)  26. Tekin, B., Sinha, S.N., Fua, P.: Real-time seamless single shot 6D object pose  prediction. arXiv preprint arXiv:1711.08848 (2017)  27. Tjaden, H., Schwanecke, U., Sch¨omer, E.: Real-time monocular pose estimation of 3D objects using temporally consistent local color histograms. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 124-132 (2017) 28. Wu, Z., Song, S., Khosla, A., Yu, F., Zhang, L., Tang, X., Xiao, J.: 3D shapenets: A deep representation for volumetric shapes. In: IEEE conference on Computer Vision and Pattern Recognition (CVPR). pp. 1912-1920 (2015)  29. Xiang, Y., Schmidt, T., Narayanan, V., Fox, D.: PoseCNN: A convolutional neu- ral network for 6D object pose estimation in cluttered scenes. arXiv preprint arXiv:1711.00199 (2017)  30. Zeng, A., Yu, K.T., Song, S., Suo, D., Walker, E., Rodriguez, A., Xiao, J.: Multi- view self-supervised deep learning for 6D pose estimation in the amazon picking challenge. In: IEEE International Conference on Robotics and Automation (ICRA). pp. 1386-1383 (2017)"}