{"1": "1. E. Ahmed, M. Jones, and T. K. Marks. An improved deep learning architecture for person re-identification. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 3908-3916, 2015.  2. S. Bai, X. Bai, and Q. Tian. Scalable person re-identification on supervised  smoothed manifold. arXiv preprint arXiv:1703.08359, 2017.  3. S. Bak and P. Carr. Person re-identification using deformable patch metric learning. In Applications of Computer Vision (WACV), 2016 IEEE Winter Conference on, pages 1-9. IEEE, 2016.  4. S. Bak and P. Carr. One-shot metric learning for person re-identification. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR), July 2017.  5. M. Bianchini, M. Maggini, L. Sarti, and F. Scarselli. Recursive neural networks  learn to localize faces. Pattern recognition letters, 26(12):1885-1895, 2005.  6. J. Bruna, W. Zaremba, A. Szlam, and Y. LeCun. Spectral networks and locally  connected networks on graphs. arXiv preprint arXiv:1312.6203, 2013.  7. D. Chen, H. Li, T. Xiao, S. Yi, and X. Wang. Video person re-identification with competitive snippet-similarity aggregation and co-attentive snippet embedding. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 1169-1178, 2018.  8. D. Chen, D. Xu, H. Li, N. Sebe, and X. Wang. Group consistent similarity learning via deep crf for person re-identification. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 8649-8658, 2018.  9. W. Chen, X. Chen, J. Zhang, and K. Huang. Beyond triplet loss: A deep quadruplet network for person re-identification. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR), July 2017.  10. D. Cheng, Y. Gong, S. Zhou, J. Wang, and N. Zheng. Person re-identification by multi-channel parts-based cnn with improved triplet loss function. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 1335- 1344, 2016.  11. X. Chu, W. Ouyang, X. Wang, et al. Crf-cnn: Modeling structured information in human pose estimation. In Advances in Neural Information Processing Systems, pages 316-324, 2016.  12. X. Chu, W. Yang, W. Ouyang, C. Ma, A. L. Yuille, and X. Wang. Multi-context attention for human pose estimation. arXiv preprint arXiv:1702.07432, 1(2), 2017. 13. M. Deﬀerrard, X. Bresson, and P. Vandergheynst. Convolutional neural networks on graphs with fast localized spectral filtering. In Advances in Neural Information Processing Systems, pages 3844-3852, 2016.  14. J. Deng, W. Dong, R. Socher, L.-J. Li, K. Li, and L. Fei-Fei. Imagenet: A large- scale hierarchical image database. In Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on, pages 248-255. IEEE, 2009.  15. P. F. Felzenszwalb, R. B. Girshick, D. McAllester, and D. Ramanan. Object de- IEEE transactions on  tection with discriminatively trained part-based models. pattern analysis and machine intelligence, 32(9):1627-1645, 2010.  16. J. Garcia, N. Martinel, C. Micheloni, and A. Gardel. Person re-identification rank- ing optimisation by discriminant context information analysis. In Proceedings of the IEEE International Conference on Computer Vision, pages 1305-1313, 2015. 17. K. He, X. Zhang, S. Ren, and J. Sun. Deep residual learning for image recog- nition. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 770-778, 2016.   Person Re-ID with Deep Similarity-Guided Graph Neural NetworkReferences  1. E. Ahmed, M. Jones, and T. K. Marks. An improved deep learning architecture for person re-identification. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 3908-3916, 2015.  2. S. Bai, X. Bai, and Q. Tian. Scalable person re-identification on supervised  smoothed manifold. arXiv preprint arXiv:1703.08359, 2017.  3. S. Bak and P. Carr. Person re-identification using deformable patch metric learning. In Applications of Computer Vision (WACV), 2016 IEEE Winter Conference on, pages 1-9. IEEE, 2016.  4. S. Bak and P. Carr. One-shot metric learning for person re-identification. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR), July 2017.  5. M. Bianchini, M. Maggini, L. Sarti, and F. Scarselli. Recursive neural networks  learn to localize faces. Pattern recognition letters, 26(12):1885-1895, 2005.  6. J. Bruna, W. Zaremba, A. Szlam, and Y. LeCun. Spectral networks and locally  connected networks on graphs. arXiv preprint arXiv:1312.6203, 2013.  7. D. Chen, H. Li, T. Xiao, S. Yi, and X. Wang. Video person re-identification with competitive snippet-similarity aggregation and co-attentive snippet embedding. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 1169-1178, 2018.  8. D. Chen, D. Xu, H. Li, N. Sebe, and X. Wang. Group consistent similarity learning via deep crf for person re-identification. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 8649-8658, 2018.  9. W. Chen, X. Chen, J. Zhang, and K. Huang. Beyond triplet loss: A deep quadruplet network for person re-identification. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR), July 2017.  10. D. Cheng, Y. Gong, S. Zhou, J. Wang, and N. Zheng. Person re-identification by multi-channel parts-based cnn with improved triplet loss function. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 1335- 1344, 2016.  11. X. Chu, W. Ouyang, X. Wang, et al. Crf-cnn: Modeling structured information in human pose estimation. In Advances in Neural Information Processing Systems, pages 316-324, 2016.  12. X. Chu, W. Yang, W. Ouyang, C. Ma, A. L. Yuille, and X. Wang. Multi-context attention for human pose estimation. arXiv preprint arXiv:1702.07432, 1(2), 2017. 13. M. Deﬀerrard, X. Bresson, and P. Vandergheynst. Convolutional neural networks on graphs with fast localized spectral filtering. In Advances in Neural Information Processing Systems, pages 3844-3852, 2016.  14. J. Deng, W. Dong, R. Socher, L.-J. Li, K. Li, and L. Fei-Fei. Imagenet: A large- scale hierarchical image database. In Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on, pages 248-255. IEEE, 2009.  15. P. F. Felzenszwalb, R. B. Girshick, D. McAllester, and D. Ramanan. Object de- IEEE transactions on  tection with discriminatively trained part-based models. pattern analysis and machine intelligence, 32(9):1627-1645, 2010.  16. J. Garcia, N. Martinel, C. Micheloni, and A. Gardel. Person re-identification rank- ing optimisation by discriminant context information analysis. In Proceedings of the IEEE International Conference on Computer Vision, pages 1305-1313, 2015. 17. K. He, X. Zhang, S. Ren, and J. Sun. Deep residual learning for image recog- nition. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 770-778, 2016.   16  Y. Shen, H. Li, S. Yi, D. Chen and X. Wang  18. M. Henaﬀ, J. Bruna, and Y. LeCun. Deep convolutional networks on graph-  structured data. arXiv preprint arXiv:1506.05163, 2015.  19. S. Ioﬀe and C. Szegedy. Batch normalization: Accelerating deep network train- ing by reducing internal covariate shift. In International Conference on Machine Learning, pages 448-456, 2015.  20. K. Kang, H. Li, T. Xiao, W. Ouyang, J. Yan, X. Liu, and X. Wang. Object detection in videos with tubelet proposal networks. arXiv preprint arXiv:1702.06355, 2017. 21. S. Karaman, G. Lisanti, A. D. Bagdanov, and A. Del Bimbo. Leveraging local neighborhood topology for large scale person re-identification. Pattern Recognition, 47(12):3767-3778, 2014.  22. D. Kingma and J. Ba. Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980, 2014.  23. T. N. Kipf and M. Welling. Semi-supervised classification with graph convolutional  networks. arXiv preprint arXiv:1609.02907, 2016.  24. E. Kodirov, T. Xiang, Z. Fu, and S. Gong. Person re-identification by unsupervised \\ell 1 1 graph learning. In European Conference on Computer Vision, pages 178- 195. Springer, 2016.  25. A. Krizhevsky, I. Sutskever, and G. E. Hinton. Imagenet classification with deep convolutional neural networks. In Advances in neural information processing sys- tems, pages 1097-1105, 2012.  26. D. Li, X. Chen, Z. Zhang, and K. Huang. Learning deep context-aware features over body and latent parts for person re-identification. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR), July 2017.  27. D. Li, X. Chen, Z. Zhang, and K. Huang. Learning deep context-aware features over body and latent parts for person re-identification. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 384-393, 2017. 28. W. Li, R. Zhao, T. Xiao, and X. Wang. Deepreid: Deep filter pairing neural network for person re-identification. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 152-159, 2014.  29. W. Li, X. Zhu, and S. Gong. Person re-identification by deep joint learning of  multi-loss classification. arXiv preprint arXiv:1705.04724, 2017.  30. W. Li, X. Zhu, and S. Gong. Harmonious attention network for person re-  identification. arXiv preprint arXiv:1802.08122, 2018.  31. Y. Li, W. Ouyang, X. Wang, and X. Tang. Vip-cnn: Visual phrase guided convo- lutional neural network. In Computer Vision and Pattern Recognition (CVPR), 2017 IEEE Conference on, pages 7244-7253. IEEE, 2017.  32. Y. Li, W. Ouyang, B. Zhou, K. Wang, and X. Wang. Scene graph generation from  objects, phrases and region captions. In ICCV, 2017.  33. X. Liang, X. Shen, J. Feng, L. Lin, and S. Yan. Semantic object parsing with graph lstm. In European Conference on Computer Vision, pages 125-143. Springer, 2016. 34. S. Liao, Y. Hu, X. Zhu, and S. Z. Li. Person re-identification by local maximal occurrence representation and metric learning. In Proceedings of the IEEE Con- ference on Computer Vision and Pattern Recognition, pages 2197-2206, 2015. 35. J. Lin, L. Ren, J. Lu, J. Feng, and J. Zhou. Consistent-aware deep learning for per- son re-identification in a camera network. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR), July 2017.  36. F. Liu, G. Lin, and C. Shen. Crf learning with cnn features for image segmentation.  Pattern Recognition, 48(10):2983-2992, 2015.  37. J. Liu, Z.-J. Zha, Q. Tian, D. Liu, T. Yao, Q. Ling, and T. Mei. Multi-scale triplet cnn for person re-identification. In Proceedings of the 2016 ACM on Multimedia Conference, pages 192-196. ACM, 2016.   Person Re-ID with Deep Similarity-Guided Graph Neural Network38. X. Liu, H. Li, J. Shao, D. Chen, and X. Wang. Show, tell and discriminate: arXiv preprint  Image captioning by self-retrieval with partially labeled data. arXiv:1803.08314, 2018.  39. X. Liu, H. Zhao, M. Tian, L. Sheng, J. Shao, S. Yi, J. Yan, and X. Wang. Hydraplus-net: Attentive deep features for pedestrian analysis. In The IEEE In- ternational Conference on Computer Vision (ICCV), Oct 2017.  40. Y. Liu, J. Yan, and W. Ouyang. Quality aware network for set to set recognition.  In CVPR, volume 2, page 8, 2017.  41. Z. Liu, D. Wang, and H. Lu. Stepwise metric promotion for unsupervised video per- son re-identification. In The IEEE International Conference on Computer Vision (ICCV), Oct 2017.  42. C. C. Loy, C. Liu, and S. Gong. Person re-identification by manifold ranking. In Image Processing (ICIP), 2013 20th IEEE International Conference on, pages 3567-3571. IEEE, 2013.  43. C. Mao, Y. Li, Y. Zhang, Z. Zhang, and X. Li. Multi-channel pyramid person matching network for person re-identification. arXiv preprint arXiv:1803.02558, 2018.  44. M. T. Mills and N. G. Bourbakis. Graph-based methods for natural language pro- cessing and understandinga survey and analysis. IEEE Transactions on Systems, Man, and Cybernetics: Systems, 44(1):59-71, 2014.  45. M. Niepert, M. Ahmed, and K. Kutzkov. Learning convolutional neural networks In International conference on machine learning, pages 2014-2023,  for graphs. 2016.  46. A. v. d. Oord, N. Kalchbrenner, and K. Kavukcuoglu. Pixel recurrent neural  networks. arXiv preprint arXiv:1601.06759, 2016.  47. S. Paisitkriangkrai, C. Shen, and A. van den Hengel. Learning to rank in person re-identification with metric ensembles. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 1846-1855, 2015. 48. T. Pavlidis. Structural pattern recognition, volume 1. Springer, 2013. 49. X. Qian, Y. Fu, Y.-G. Jiang, T. Xiang, and X. Xue. Multi-scale deep learning architectures for person re-identification. arXiv preprint arXiv:1709.05165, 2017. 50. A. Quek, Z. Wang, J. Zhang, and D. Feng. Structural image classification with graph neural networks. In Digital Image Computing Techniques and Applications (DICTA), 2011 International Conference on, pages 416-421. IEEE, 2011.  51. S. Ren, K. He, R. Girshick, and J. Sun. Faster r-cnn: Towards real-time object detection with region proposal networks. In Advances in neural information pro- cessing systems, pages 91-99, 2015.  52. E. Ristani, F. Solera, R. Zou, R. Cucchiara, and C. Tomasi. Performance measures and a data set for multi-target, multi-camera tracking. In European Conference on Computer Vision workshop on Benchmarking Multi-Target Tracking, 2016.  53. F. Scarselli, M. Gori, A. C. Tsoi, M. Hagenbuchner, and G. Monfardini. The graph neural network model. IEEE Transactions on Neural Networks, 20(1):61-80, 2009. 54. A. Schumann and R. Stiefelhagen. Person re-identification by deep learning In Computer Vision and Pattern Recog- attribute-complementary information. nition Workshops (CVPRW), 2017 IEEE Conference on, pages 1435-1443. IEEE, 2017.  55. Y. Shen, H. Li, T. Xiao, S. Yi, D. Chen, and X. Wang. Deep group-shuﬄing random walk for person re-identification. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 2265-2274, 2018.  56. Y. Shen, T. Xiao, H. Li, S. Yi, and X. Wang. Learning deep neural networks for ve- hicle re-id with visual-spatio-temporal path proposals. In 2017 IEEE International Conference on Computer Vision (ICCV), pages 1918-1927. IEEE, 2017.   18  Y. Shen, H. Li, S. Yi, D. Chen and X. Wang  57. Y. Shen, T. Xiao, H. Li, S. Yi, and X. Wang. End-to-end deep kronecker-product matching for person re-identification. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 6886-6895, 2018.  58. G. Song, B. Leng, Y. Liu, C. Hetang, and S. Cai. Region-based quality estimation network for large-scale person re-identification. arXiv preprint arXiv:1711.08766, 2017.  59. N. Srivastava, G. E. Hinton, A. Krizhevsky, I. Sutskever, and R. Salakhutdinov. Dropout: a simple way to prevent neural networks from overfitting. Journal of machine learning research, 15(1):1929-1958, 2014.  60. C. Su, J. Li, S. Zhang, J. Xing, W. Gao, and Q. Tian. Pose-driven deep convolu- tional model for person re-identification. In The IEEE International Conference on Computer Vision (ICCV), Oct 2017.  61. Y. Sun, L. Zheng, W. Deng, and S. Wang. Svdnet for pedestrian retrieval. In The  IEEE International Conference on Computer Vision (ICCV), Oct 2017.  62. F. Wu, S. Li, T. Zhao, and K. N. Ngan. Model-based face reconstruction using sift ﬂow registration and spherical harmonics. In Pattern Recognition (ICPR), 2016 23rd International Conference on, pages 1774-1779. IEEE, 2016.  63. F. Wu, S. Li, T. Zhao, and K. N. Ngan. 3d facial expression reconstruction using  cascaded regression. arXiv preprint arXiv:1712.03491, 2017.  64. T. Xiao, H. Li, W. Ouyang, and X. Wang. Learning deep feature representations In Proceedings of the with domain guided dropout for person re-identification. IEEE Conference on Computer Vision and Pattern Recognition, pages 1249-1258, 2016.  65. T. Xiao, S. Li, B. Wang, L. Lin, and X. Wang. Joint detection and identification  feature learning for person search. In Proc. CVPR, 2017.  66. S. Yan, Y. Xiong, and D. Lin. Spatial temporal graph convolutional networks for  skeleton-based action recognition. arXiv preprint arXiv:1801.07455, 2018.  67. W. Yang, S. Li, W. Ouyang, H. Li, and X. Wang. Learning feature pyramids for human pose estimation. In The IEEE International Conference on Computer Vision (ICCV), volume 2, 2017.  68. W. Yang, W. Ouyang, H. Li, and X. Wang. End-to-end learning of deformable mixture of parts and deep convolutional neural networks for human pose estima- In Proceedings of the IEEE Conference on Computer Vision and Pattern tion. Recognition, pages 3073-3082, 2016.  69. M. Ye, C. Liang, Z. Wang, Q. Leng, and J. Chen. Ranking optimization for person re-identification via similarity and dissimilarity. In Proceedings of the 23rd ACM international conference on Multimedia, pages 1239-1242. ACM, 2015.  70. M. Ye, C. Liang, Y. Yu, Z. Wang, Q. Leng, C. Xiao, J. Chen, and R. Hu. Per- son reidentification via ranking aggregation of similarity pulling and dissimilarity pushing. IEEE Transactions on Multimedia, 18(12):2553-2566, 2016.  71. D. Yi, Z. Lei, S. Liao, and S. Z. Li. Deep metric learning for person re-identification. In Pattern Recognition (ICPR), 2014 22nd International Conference on, pages 34- 39. IEEE, 2014.  72. H.-X. Yu, A. Wu, and W.-S. Zheng. Cross-view asymmetric metric learning for unsupervised person re-identification. In The IEEE International Conference on Computer Vision (ICCV), Oct 2017.  73. H. Zhao, M. Tian, S. Sun, J. Shao, J. Yan, S. Yi, X. Wang, and X. Tang. Spindle net: Person re-identification with human body region guided feature decomposi- tion and fusion. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 1077-1085, 2017.  74. L. Zhao, X. Li, J. Wang, and Y. Zhuang. Deeply-learned part-aligned representa-  tions for person re-identification. arXiv preprint arXiv:1707.07256, 2017.   Person Re-ID with Deep Similarity-Guided Graph Neural Network75. L. Zheng, L. Shen, L. Tian, S. Wang, J. Wang, and Q. Tian. Scalable person re- identification: A benchmark. In Proceedings of the IEEE International Conference on Computer Vision, pages 1116-1124, 2015.  76. S. Zheng, S. Jayasumana, B. Romera-Paredes, V. Vineet, Z. Su, D. Du, C. Huang, and P. H. Torr. Conditional random fields as recurrent neural networks. In Proceed- ings of the IEEE International Conference on Computer Vision, pages 1529-1537, 2015.  77. Z. Zheng, L. Zheng, and Y. Yang. Unlabeled samples generated by gan improve the person re-identification baseline in vitro. In Proceedings of the IEEE International Conference on Computer Vision, 2017.  78. Z. Zhong, L. Zheng, D. Cao, and S. Li. Re-ranking person re-identification with k-reciprocal encoding. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR), July 2017.  79. Z. Zhong, L. Zheng, G. Kang, S. Li, and Y. Yang. Random erasing data augmen-  tation. arXiv preprint arXiv:1708.04896, 2017.  80. J. Zhou, P. Yu, W. Tang, and Y. Wu. Eﬃcient online local metric adaptation via negative samples for person re-identification. In The IEEE International Confer- ence on Computer Vision (ICCV), Oct 2017.  81. S. Zhou, J. Wang, J. Wang, Y. Gong, and N. Zheng. Point to set similarity based In The IEEE Conference on  deep feature learning for person re-identification. Computer Vision and Pattern Recognition (CVPR), July 2017."}