{"1": "1. Tateno, K., Tombari, F., Laina, I., Navab, N.: Cnn-slam: Real-time dense monoc- ular slam with learned depth prediction. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017) 6565-6574  2. Mo, K., Li, H., Lin, Z., Lee, J.Y.: The adobeindoornav dataset: Towards deep reinforcement learning based real-world indoor robot visual navigation. (2018) 3. Hedman, P., Alsisan, S., Szeliski, R., Kopf, J.: Casual 3d photography. ACM  Transactions on Graphics (TOG) 36(6) (2017) 234  4. Huang, J., Chen, Z., Ceylan, D., Jin, H.: 6-dof vr videos with a single 360-camera.  In: Virtual Reality (VR), 2017 IEEE, IEEE (2017) 37-44  5. Karsch, K., Sunkavalli, K., Hadap, S., Carr, N., Jin, H., Fonte, R., Sittig, M., Forsyth, D.: Automatic scene inference for 3d object compositing. ACM Transac- tions on Graphics (TOG) 33(3) (2014) 32  6. Eigen, D., Fergus, R.: Predicting depth, surface normals and semantic labels with In: Proceedings of the IEEE  a common multi-scale convolutional architecture. International Conference on Computer Vision. (2015) 2650-2658  7. Ren, X., Bo, L., Fox, D.: Rgb-(d) scene labeling: Features and algorithms.  In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 2759-2766  8. Hartley, R., Zisserman, A.: Multiple view geometry in computer vision second  edition. Cambridge University Press (2000)  9. Furukawa, Y., Hern´andez, C., et al.: Multi-view stereo: A tutorial. Foundations  and Trends R(cid:13) in Computer Graphics and Vision 9(1-2) (2015) 1-148  10. ¨Ozye¸sil, O., Voroninski, V., Basri, R., Singer, A.: A survey of structure from  motion*. Acta Numerica 26 (2017) 305-364  11. Li, S.: Binocular spherical stereo. IEEE Transactions on intelligent transportation  systems 9(4) (2008) 589-600  12. Ma, C., Shi, L., Huang, H., Yan, M.: 3d reconstruction from full-view fisheye  camera. arXiv preprint arXiv:1506.06273 (2015)  13. Pathak, S., Moro, A., Yamashita, A., Asama, H.: Dense 3d reconstruction from two spherical images via optical ﬂow-based equirectangular epipolar rectification. In: Imaging Systems and Techniques (IST), 2016 IEEE International Conference on, IEEE (2016) 140-145  14. Li, S., Fukumori, K.: Spherical stereo for the construction of immersive vr en- vironment. In: Virtual Reality, 2005. Proceedings. VR 2005. IEEE, IEEE (2005) 217-222  15. Kim, H., Hilton, A.: 3d scene reconstruction from multiple spherical stereo pairs.  International Journal of Computer Vision 104(1) (Aug 2013) 94-116  16. Zhang, Y., Song, S., Tan, P., Xiao, J.: Panocontext: A whole-room 3d context model for panoramic scene understanding. In: European Conference on Computer Vision, Springer (2014) 668-686  17. Yang, H., Zhang, H.: Eﬃcient 3d room shape recovery from a single panorama. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 5422-5430  18. Xu, J., Stenger, B., Kerola, T., Tung, T.: Pano2cad: Room layout from a single panorama image. In: Applications of Computer Vision (WACV), 2017 IEEE Winter Conference on, IEEE (2017) 354-362  19. Kim, H., de Campos, T., Hilton, A.: Room layout estimation with object and material attributes information using a spherical camera. In: 3D Vision (3DV), 2016 Fourth International Conference on, IEEE (2016) 519-527   OmniDepthReferences  1. Tateno, K., Tombari, F., Laina, I., Navab, N.: Cnn-slam: Real-time dense monoc- ular slam with learned depth prediction. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017) 6565-6574  2. Mo, K., Li, H., Lin, Z., Lee, J.Y.: The adobeindoornav dataset: Towards deep reinforcement learning based real-world indoor robot visual navigation. (2018) 3. Hedman, P., Alsisan, S., Szeliski, R., Kopf, J.: Casual 3d photography. ACM  Transactions on Graphics (TOG) 36(6) (2017) 234  4. Huang, J., Chen, Z., Ceylan, D., Jin, H.: 6-dof vr videos with a single 360-camera.  In: Virtual Reality (VR), 2017 IEEE, IEEE (2017) 37-44  5. Karsch, K., Sunkavalli, K., Hadap, S., Carr, N., Jin, H., Fonte, R., Sittig, M., Forsyth, D.: Automatic scene inference for 3d object compositing. ACM Transac- tions on Graphics (TOG) 33(3) (2014) 32  6. Eigen, D., Fergus, R.: Predicting depth, surface normals and semantic labels with In: Proceedings of the IEEE  a common multi-scale convolutional architecture. International Conference on Computer Vision. (2015) 2650-2658  7. Ren, X., Bo, L., Fox, D.: Rgb-(d) scene labeling: Features and algorithms.  In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 2759-2766  8. Hartley, R., Zisserman, A.: Multiple view geometry in computer vision second  edition. Cambridge University Press (2000)  9. Furukawa, Y., Hern´andez, C., et al.: Multi-view stereo: A tutorial. Foundations  and Trends R(cid:13) in Computer Graphics and Vision 9(1-2) (2015) 1-148  10. ¨Ozye¸sil, O., Voroninski, V., Basri, R., Singer, A.: A survey of structure from  motion*. Acta Numerica 26 (2017) 305-364  11. Li, S.: Binocular spherical stereo. IEEE Transactions on intelligent transportation  systems 9(4) (2008) 589-600  12. Ma, C., Shi, L., Huang, H., Yan, M.: 3d reconstruction from full-view fisheye  camera. arXiv preprint arXiv:1506.06273 (2015)  13. Pathak, S., Moro, A., Yamashita, A., Asama, H.: Dense 3d reconstruction from two spherical images via optical ﬂow-based equirectangular epipolar rectification. In: Imaging Systems and Techniques (IST), 2016 IEEE International Conference on, IEEE (2016) 140-145  14. Li, S., Fukumori, K.: Spherical stereo for the construction of immersive vr en- vironment. In: Virtual Reality, 2005. Proceedings. VR 2005. IEEE, IEEE (2005) 217-222  15. Kim, H., Hilton, A.: 3d scene reconstruction from multiple spherical stereo pairs.  International Journal of Computer Vision 104(1) (Aug 2013) 94-116  16. Zhang, Y., Song, S., Tan, P., Xiao, J.: Panocontext: A whole-room 3d context model for panoramic scene understanding. In: European Conference on Computer Vision, Springer (2014) 668-686  17. Yang, H., Zhang, H.: Eﬃcient 3d room shape recovery from a single panorama. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 5422-5430  18. Xu, J., Stenger, B., Kerola, T., Tung, T.: Pano2cad: Room layout from a single panorama image. In: Applications of Computer Vision (WACV), 2017 IEEE Winter Conference on, IEEE (2017) 354-362  19. Kim, H., de Campos, T., Hilton, A.: Room layout estimation with object and material attributes information using a spherical camera. In: 3D Vision (3DV), 2016 Fourth International Conference on, IEEE (2016) 519-527   16  Zioulis et al.  20. Plagemann, C., Stachniss, C., Hess, J., Endres, F., Franklin, N.: A nonparametric learning approach to range sensing from omnidirectional vision. Robotics and Autonomous Systems 58(6) (2010) 762-772  21. Ruder, M., Dosovitskiy, A., Brox, T.: Artistic style transfer for videos and spherical  images. International Journal of Computer Vision (Apr 2018)  22. Monroy, R., Lutz, S., Chalasani, T., Smolic, A.: Salnet360: Saliency maps for  omni-directional images with cnn. arXiv preprint arXiv:1709.06505 (2017)  23. Zhang, J., Lalonde, J.F.: Learning high dynamic range from outdoor panoramas. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recog- nition. (2017) 4519-4528  24. Frossard, P., Khasanova, R.: Graph-based classification of omnidirectional images. In: 2017 IEEE International Conference on Computer Vision Workshop (ICCVW), IEEE (2017) 860-869  25. Su, Y.C., Grauman, K.: Learning spherical convolution for fast features from 360 imagery. In: Advances in Neural Information Processing Systems. (2017) 529-539 26. Jeon, Y., Kim, J.: Active convolution: Learning the shape of convolution for im- In: 2017 IEEE Conference on Computer Vision and Pattern  age classification. Recognition (CVPR), IEEE (2017) 1846-1854  27. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo- lutional networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 764-773  28. Deng, L., Yang, M., Li, H., Li, T., Hu, B., Wang, C.: Restricted deformable convolution based road scene semantic segmentation using surround view cameras. arXiv preprint arXiv:1801.00708 (2018)  29. Cohen, T., Geiger, M., Welling, M.: Convolutional networks for spherical signals.  Principled Approaches to Deep Learning Workshop ICML 2017 (2017)  30. Cohen, T.S., Geiger, M., K¨ohler, J., Welling, M.: Spherical cnns. International  Conference on Learning Representations (ICLR) (2018)  31. Ranftl, R., Vineet, V., Chen, Q., Koltun, V.: Dense monocular depth estimation in complex dynamic scenes. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 4058-4066  32. Liu, M., Salzmann, M., He, X.: Discrete-continuous depth estimation from a sin- In: Computer Vision and Pattern Recognition (CVPR), 2014 IEEE  gle image. Conference on, IEEE (2014) 716-723  33. Karsch, K., Liu, C., Kang, S.B.: Depth transfer: Depth extraction from videos using nonparametric sampling. In: Dense Image Correspondences for Computer Vision. Springer (2016) 173-205  34. Eigen, D., Puhrsch, C., Fergus, R.: Depth map prediction from a single image using a multi-scale deep network. In: Advances in neural information processing systems. (2014) 2366-2374  35. Ren, Z., Lee, Y.J.: Cross-domain self-supervised multi-task feature learning using synthetic imagery. In: IEEE Conference on Computer Vision and Pattern Recog- nition (CVPR). (2018)  36. Laina, I., Rupprecht, C., Belagiannis, V., Tombari, F., Navab, N.: Deeper depth prediction with fully convolutional residual networks. In: 3D Vision (3DV), 2016 Fourth International Conference on, IEEE (2016) 239-248  37. Li, B., Shen, C., Dai, Y., van den Hengel, A., He, M.: Depth and surface normal estimation from monocular images using regression on deep features and hierarchi- cal crfs. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 1119-1127   OmniDepth38. Liu, F., Shen, C., Lin, G., Reid, I.: Learning depth from single monocular images using deep convolutional neural fields. IEEE transactions on pattern analysis and machine intelligence 38(10) (2016) 2024-2039  39. Xu, D., Ricci, E., Ouyang, W., Wang, X., Sebe, N.: Multi-scale continuous crfs as sequential deep networks for monocular depth estimation. In: Proceedings of CVPR. (2017)  40. Chakrabarti, A., Shao, J., Shakhnarovich, G.: Depth from a single image by harmo- nizing overcomplete local network predictions. In: Advances in Neural Information Processing Systems. (2016) 2658-2666  41. Li, B., Dai, Y., He, M.: Monocular depth estimation with hierarchical fusion of dilated cnns and soft-weighted-sum inference. Pattern Recognition 83 (2018) 328 - 339  42. Cao, Y., Wu, Z., Shen, C.: Estimating depth from monocular images as classi- fication using deep fully convolutional residual networks. IEEE Transactions on Circuits and Systems for Video Technology (2017)  43. Fu, H., Gong, M., Wang, C., Tao, D.: A compromise principle in deep monocular  depth estimation. arXiv preprint arXiv:1708.08267 (2017)  44. Garg, R., BG, V.K., Carneiro, G., Reid, I.: Unsupervised cnn for single view depth estimation: Geometry to the rescue. In: European Conference on Computer Vision, Springer (2016) 740-756  45. Godard, C., Mac Aodha, O., Brostow, G.J.: Unsupervised monocular depth esti-  mation with left-right consistency. In: CVPR. (2017)  46. Zhou, T., Brown, M., Snavely, N., Lowe, D.G.: Unsupervised learning of depth  and ego-motion from video. In: CVPR. Volume 2. (2017) 7  47. Wang, C., Buenaposada, J.M., Zhu, R., Lucey, S.: Learning depth from monocular videos using direct methods. IEEE Conference on Computer Vision and Pattern Recognition (2018)  48. Mahjourian, R., Wicke, M., Angelova, A.: Unsupervised learning of depth and ego-motion from monocular video using 3d geometric constraints. Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (2018)  49. Yang, Z., Wang, P., Xu, W., Zhao, L., Nevatia, R.: Unsupervised learning of geom- etry with edge-aware depth-normal consistency. arXiv preprint arXiv:1711.03665 (2017)  50. Yin, Z., Shi, J.: Geonet: Unsupervised learning of dense depth, optical ﬂow and camera pose. Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (2018)  51. Srinivasan, P.P., Garg, R., Wadhwa, N., Ng, R., Barron, J.T.: Aperture supervision  for monocular depth estimation. (2017)  52. Chen, W., Fu, Z., Yang, D., Deng, J.: Single-image depth perception in the wild.  In: Advances in Neural Information Processing Systems. (2016) 730-738  53. Silberman, N., Hoiem, D., Kohli, P., Fergus, R.: Indoor segmentation and sup- port inference from rgbd images. In: European Conference on Computer Vision, Springer (2012) 746-760  54. Saxena, A., Sun, M., Ng, A.Y.: Make3d: Learning 3d scene structure from a single still image. IEEE transactions on pattern analysis and machine intelligence 31(5) (2009) 824-840  55. Matzen, K., Cohen, M.F., Evans, B., Kopf, J., Szeliski, R.: Low-cost 360 stereo photography and video capture. ACM Transactions on Graphics (TOG) 36(4) (2017) 148   18  Zioulis et al.  56. Song, S., Yu, F., Zeng, A., Chang, A.X., Savva, M., Funkhouser, T.: Semantic scene completion from a single depth image. IEEE Conference on Computer Vision and Pattern Recognition (2017)  57. Handa, A., P˘atr˘aucean, V., Stent, S., Cipolla, R.: Scenenet: An annotated model generator for indoor scene understanding. In: Robotics and Automation (ICRA), 2016 IEEE International Conference on, IEEE (2016) 5737-5743  58. Armeni, I., Sax, S., Zamir, A.R., Savarese, S.: Joint 2d-3d-semantic data for indoor  scene understanding. arXiv preprint arXiv:1702.01105 (2017)  59. Armeni, I., Sener, O., Zamir, A.R., Jiang, H., Brilakis, I., Fischer, M., Savarese, S.: 3d semantic parsing of large-scale indoor spaces. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 1534-1543 60. Chang, A., Dai, A., Funkhouser, T., Halber, M., Niessner, M., Savva, M., Song, S., Zeng, A., Zhang, Y.: Matterport3D: Learning from RGB-D data in indoor environments. International Conference on 3D Vision (3DV) (2017)  61. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic In: Proceedings of the IEEE conference on computer vision and  segmentation. pattern recognition. (2015) 3431-3440  62. Clevert, D.A., Unterthiner, T., Hochreiter, S.: Fast and accurate deep network learning by exponential linear units (elus). arXiv preprint arXiv:1511.07289 (2015) 63. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International conference on machine learning. (2015) 448-456  64. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2016) 770-778  65. Yu, F., Koltun, V., Funkhouser, T.: Dilated residual networks.  In: Computer  Vision and Pattern Recognition. Volume 1. (2017)  66. van Noord, N., Postma, E.O.: Light-weight pixel context encoders for image in-  painting. CoRR abs/1801.05585 (2018)  67. Srivastava, N., Hinton, G., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.: Dropout: A simple way to prevent neural networks from overfitting. The Jour- nal of Machine Learning Research 15(1) (2014) 1929-1958  68. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: Proceedings of the 22Nd ACM International Conference on Multimedia. MM ’14, New York, NY, USA, ACM (2014) 675-678  69. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward neural networks. In: Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics. Volume 9 of Proceedings of Machine Learning Research., PMLR (13-15 May 2010) 249-256  70. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  71. Xiao, J., Ehinger, K.A., Oliva, A., Torralba, A.: Recognizing scene viewpoint using In: Computer Vision and Pattern Recognition  panoramic place representation. (CVPR), 2012 IEEE Conference on, IEEE (2012) 2695-2702  72. Rhee, T., Petikam, L., Allen, B., Chalmers, A.: Mr360: Mixed reality rendering for 360 panoramic videos. IEEE transactions on visualization and computer graphics 23(4) (2017) 1379-1388"}