{"1": "1. Botsch, M., Kobbelt, L.: High-quality Point-based Rendering on Modern GPUs. In: Proceedings of Pacific Conference on Computer Graphics and Applications. pp. 335-343 (2003) 2  2. Choi, S., Zhou, Q.Y., Koltun, V.: Robust Reconstruction of Indoor Scenes. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition (2015) 3  3. CloudCompare-project: CloudCompare. http://www.cloudcompare.org/ 11 4. Curless, B., Levoy, M.: A Volumetric Method for Building Complex Models from Range Images. In: Proceedings of ACM SIGGRAPH. pp. 303-312 (1996) 3, 4 5. Dai, A., Nießner, M., Zollh¨ofer, M., Izadi, S., Theobalt, C.: BundleFusion: Real- time Globally Consistent 3D Reconstruction using On-the-ﬂy Surface Reintegra- tion. ACM Transactions on Graphics 36(3), 24 (2017) 1, 3, 4  6. Dong, W., Shi, J., Tang, W., Wang, X., Zha, H.: An Eﬃcient Volumetric Mesh Representation for Real-time Scene Reconstruction using Spatial Hashing. In: Pro- ceedings of IEEE International Conference on Robotics and Automation (2018) 3, 4, 10  7. Dzitsiuk, M., Sturm, J., Maier, R., Ma, L., Cremers, D.: De-noising, Stabilizing and Completing 3D Reconstructions On-the-go using Plane Priors. In: Proceedings of IEEE International Conference on Robotics and Automation. pp. 3976-3983 (2017) 4  8. Forster, C., Pizzoli, M., Scaramuzza, D.: SVO: Fast Semi-direct Monocular Visual Odometry. In: Proceedings of IEEE International Conference on Robotics and Automation. pp. 15-22 (2014) 4  9. Handa, A., Whelan, T., Mcdonald, J., Davison, A.J.: A Benchmark for RGB-D Visual Odometry, 3D Reconstruction and SLAM. In: Proceedings of IEEE Inter- national Conference on Robotics and Automation. pp. 1524-1531 (2014) 9, 10, 11  10. Hornung, A., Wurm, K.M., Bennewitz, M., Stachniss, C., Burgard, W.: OctoMap: an Eﬃcient Probabilistic 3D Mapping Framework based on Octrees. Autonomous Robots 34(3), 189-206 (2013) 3  11. K¨ahler, O., Prisacariu, V., Valentin, J., Murray, D.: Hierarchical Voxel Block Hash- ing for Eﬃcient Integration of Depth Images. IEEE Robotics and Automation Letters 1(1), 192-197 (2016) 3  12. K¨ahler, O., Prisacariu, V.A., Ren, C.Y., Sun, X., Torr, P., Murray, D.: Very High Frame Rate Volumetric Integration of Depth Images on Mobile Devices. IEEE Transactions on Visualization & Computer Graphics 21(11), 1241-1250 (2015) 1, 3  13. Keller, M., Leﬂoch, D., Lambers, M., Weyrich, T., Kolb, A.: Real-time 3D Recon- struction in Dynamic Scenes using Point-based Fusion. In: Proceedings of Interna- tional Conference on 3DTV. pp. 1-8 (2013) 1, 3, 4  14. Klingensmith, M., Dryanovski, I., Srinivasa, S.S., Xiao, J.: CHISEL: Real Time Large Scale 3D Reconstruction Onboard a Mobile Device using Spatially-Hashed Signed Distance Fields. In: Prceedings of Robotics: Science and Systems. pp. 1-8 (2015) 2, 3, 4  15. Kolev, K., Tanskanen, P., Speciale, P., Pollefeys, M.: Turning Mobile Phones into 3D Scanners. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition. pp. 3946-3953 (2014) 1, 4, 8   PSDF FusionReferences  1. Botsch, M., Kobbelt, L.: High-quality Point-based Rendering on Modern GPUs. In: Proceedings of Pacific Conference on Computer Graphics and Applications. pp. 335-343 (2003) 2  2. Choi, S., Zhou, Q.Y., Koltun, V.: Robust Reconstruction of Indoor Scenes. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition (2015) 3  3. CloudCompare-project: CloudCompare. http://www.cloudcompare.org/ 11 4. Curless, B., Levoy, M.: A Volumetric Method for Building Complex Models from Range Images. In: Proceedings of ACM SIGGRAPH. pp. 303-312 (1996) 3, 4 5. Dai, A., Nießner, M., Zollh¨ofer, M., Izadi, S., Theobalt, C.: BundleFusion: Real- time Globally Consistent 3D Reconstruction using On-the-ﬂy Surface Reintegra- tion. ACM Transactions on Graphics 36(3), 24 (2017) 1, 3, 4  6. Dong, W., Shi, J., Tang, W., Wang, X., Zha, H.: An Eﬃcient Volumetric Mesh Representation for Real-time Scene Reconstruction using Spatial Hashing. In: Pro- ceedings of IEEE International Conference on Robotics and Automation (2018) 3, 4, 10  7. Dzitsiuk, M., Sturm, J., Maier, R., Ma, L., Cremers, D.: De-noising, Stabilizing and Completing 3D Reconstructions On-the-go using Plane Priors. In: Proceedings of IEEE International Conference on Robotics and Automation. pp. 3976-3983 (2017) 4  8. Forster, C., Pizzoli, M., Scaramuzza, D.: SVO: Fast Semi-direct Monocular Visual Odometry. In: Proceedings of IEEE International Conference on Robotics and Automation. pp. 15-22 (2014) 4  9. Handa, A., Whelan, T., Mcdonald, J., Davison, A.J.: A Benchmark for RGB-D Visual Odometry, 3D Reconstruction and SLAM. In: Proceedings of IEEE Inter- national Conference on Robotics and Automation. pp. 1524-1531 (2014) 9, 10, 11  10. Hornung, A., Wurm, K.M., Bennewitz, M., Stachniss, C., Burgard, W.: OctoMap: an Eﬃcient Probabilistic 3D Mapping Framework based on Octrees. Autonomous Robots 34(3), 189-206 (2013) 3  11. K¨ahler, O., Prisacariu, V., Valentin, J., Murray, D.: Hierarchical Voxel Block Hash- ing for Eﬃcient Integration of Depth Images. IEEE Robotics and Automation Letters 1(1), 192-197 (2016) 3  12. K¨ahler, O., Prisacariu, V.A., Ren, C.Y., Sun, X., Torr, P., Murray, D.: Very High Frame Rate Volumetric Integration of Depth Images on Mobile Devices. IEEE Transactions on Visualization & Computer Graphics 21(11), 1241-1250 (2015) 1, 3  13. Keller, M., Leﬂoch, D., Lambers, M., Weyrich, T., Kolb, A.: Real-time 3D Recon- struction in Dynamic Scenes using Point-based Fusion. In: Proceedings of Interna- tional Conference on 3DTV. pp. 1-8 (2013) 1, 3, 4  14. Klingensmith, M., Dryanovski, I., Srinivasa, S.S., Xiao, J.: CHISEL: Real Time Large Scale 3D Reconstruction Onboard a Mobile Device using Spatially-Hashed Signed Distance Fields. In: Prceedings of Robotics: Science and Systems. pp. 1-8 (2015) 2, 3, 4  15. Kolev, K., Tanskanen, P., Speciale, P., Pollefeys, M.: Turning Mobile Phones into 3D Scanners. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition. pp. 3946-3953 (2014) 1, 4, 8   16  Wei Dong, Qiuyuan Wang, Xin Wang, and Hongbin Zha  16. Leﬂoch, D., Kluge, M., Sarbolandi, H., Weyrich, T., Kolb, A.: Comprehensive Use of Curvature for Robust and Accurate Online Surface Reconstruction. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(12), 2349-2365 (Dec 2017) 3  17. Lorensen, W.E., Cline, H.E.: Marching Cubes : A High Resolution 3D Surface Construction Algorithm. In: Proceedings of ACM SIGGRAPH. vol. 6, pp. 7-9 (1987) 3, 9  18. Marton, Z.C., Rusu, R.B., Beetz, M.: On Fast Surface Reconstruction Methods for Large and Noisy Point Clouds. In: Proceedings of IEEE International Conference on Robotics and Automation. pp. 3218-3223 (2009) 2, 3  19. Newcombe, R.: Dense visual SLAM. Ph.D. thesis, Imperial College London, UK  (2012) 4, 5  20. Newcombe, R.A., Molyneaux, D., Kim, D., Davison, A.J., Shotton, J., Hodges, S., Fitzgibbon, A., Izadi, S., Hilliges, O., Molyneaux, D., Kim, D., Davison, A.J., Kohli, P., Shotton, J., Hodges, S., Fitzgibbon, A.: KinectFusion: Real-Time Dense Surface Mapping and Tracking. In: Proceedings of IEEE and ACM International Symposium on Mixed and Augmented Reality. pp. 127-136 (2011) 1, 2, 3, 4, 6, 9 21. Nguyen, C.V., Izadi, S., Lovell, D.: Modeling Kinect Sensor Noise for Improved 3D Reconstruction and Tracking. In: Proceedings of IEEE International Conference on 3D Imaging, Modeling, Processing, Visualization & Transmission. pp. 524-530 (2012) 7, 10  22. Nießner, M., Zollh¨ofer, M., Izadi, S., Stamminger, M.: Real-time 3D Reconstruction at Scale Using Voxel Hashing. ACM Transactions on Graphics 32(6), 169 (2013) 3, 4, 10  23. Prisacariu, V.A., K¨ahler, O., Golodetz, S., Sapienza, M., Cavallari, T., Torr, P.H., Murray, D.W.: InfiniTAM v3: A Framework for Large-Scale 3D Reconstruction with Loop Closure. ArXiv e-prints (Aug 2017) 2, 3, 4, 10  24. Steinbr¨ucker, F., Sturm, J., Cremers, D.: Volumetric 3D Mapping in Real-time on a CPU. In: Proceedings of IEEE International Conference on Robotics and Automation. pp. 2021-2028 (2014) 2, 3  25. Sturm, J., Engelhard, N., Endres, F., Burgard, W., Cremers, D.: A Benchmark for the Evaluation of RGB-D SLAM Systems. In: Procedings of International Confer- ence on Intelligent Robot Systems. pp. 573-580 (2012) 9, 10  26. Tanskanen, P., Kolev, K., Meier, L., Camposeco, F., Saurer, O., Pollefeys, M.: Live Metric 3D Reconstruction on Mobile Phones. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 65-72 (2013) 4  27. Ulusoy, A.O., Black, M.J., Geiger, A.: Patches, Planes and Probabilities: A Non- local Prior for Volumetric 3D Reconstruction. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition. pp. 3280-3289 (2016) 1, 2, 4, 9 28. Ulusoy, A.O., Geiger, A., Black, M.J.: Towards Probabilistic Volumetric Recon- struction Using Ray Potentials. In: Proceedings of International Conference on 3D Vision. pp. 10-18 (2015) 4, 9  29. Vogiatzis, G., Hern´andez, C.: Video-based, Real-time Multi-view Stereo. Image  and Vision Computing 29(7), 434-441 (2011) 1, 4, 5, 7, 8  30. Whelan, T., Kaess, M., Fallon, M., Johannsson, H., Leonard, J., Mcdonald, J.: Kintinuous: Spatially Extended KinectFusion. Robotics & Autonomous Systems 69(C), 3-14 (2012) 3  31. Whelan, T., Kaess, M., Johannsson, H., Fallon, M., Leonard, J.J., McDonald, J.: Real-time Large-scale Dense RGB-D SLAM with Volumetric Fusion. The Interna- tional Journal of Robotics Research 34(4-5), 598-626 (2015) 3   PSDF Fusion32. Woodford, O.J., Vogiatzis, G.: A Generative Model for Online Depth Fusion. In: Proceedings of European Conference on Computer Vision. pp. 144-157 (2012) 3, 9  33. Zeng, M., Zhao, F., Zheng, J., Liu, X.: Octree-based Fusion for Realtime 3D Re-  construction. Graphical Models 75(3), 126-136 (2013) 3  34. Zhou, Q., Koltun, V.: Dense Scene Reconstruction with Points of Interest. ACM  Transactions on Graphics 32(4), 112 (2013) 3, 9, 10, 11  35. Zienkiewicz, J., Tsiotsios, A., Davison, A., Leutenegger, S.: Monocular, Real-time Surface Reconstruction using Dynamic Level of Detail. In: Proceedings of Interna- tional Conference on 3D Vision. pp. 37-46 (2016) 1, 3"}