{"1": "1. Arandjelovic, R., Gronat, P., Torii, A., Pajdla, T., Sivic, J.: Netvlad: Cnn architecture for weakly supervised place recognition. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 5297-5307 (2016). https://doi.org/10.1109/CVPR.2016.572  2. Bay, H., Tuytelaars, T., Van Gool, L.: Surf: Speeded up robust features. In: Leonardis, A., Bischof, H., Pinz, A. (eds.) European Conference on Computer Vi- sion (ECCV). pp. 404-417. Springer Berlin Heidelberg, Berlin, Heidelberg (2006). https://doi.org/10.1007/11744023 32  3. Besl, P.J., McKay, N.D.: A method for registration of 3-d shapes. IEEE Trans- actions on Pattern Analysis and Machine Intelligence (TPAMI) 14(2), 239-256 (1992). https://doi.org/10.1109/34.121791  4. Bromley, J., Guyon, I., LeCun, Y., S¨ackinger, E., Shah, R.: Signature verification using a “siamese” time delay neural network. In: Advances in Neural Information Processing Systems. pp. 737-744 (1994)  5. Chen, H., Bhanu, B.: 3d free-form object recognition in range images using lo- cal surface patches. In: International Conference on Pattern Recognition (ICPR). vol. 3, pp. 136-139 (2004). https://doi.org/10.1109/ICPR.2004.1334487  6. Deng, H., Birdal, T., Ilic, S.: Ppfnet: Global context aware local features for ro- bust 3d point matching. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2018)  7. Dub´e, R., Dugas, D., Stumm, E., Nieto, J., Siegwart, R., Cadena, C.: Segmatch: Segment based loop-closure for 3d point clouds. arXiv preprint arXiv:1609.07720 (2016)  8. Elbaz, G., Avraham, T., Fischer, A.: 3d point cloud registration for local- ization using a deep neural network auto-encoder. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2472-2481 (2017). https://doi.org/10.1109/CVPR.2017.265  9. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driv- ing? the kitti vision benchmark suite. IEEE Conference on Com- puter Vision and Pattern Recognition (CVPR). pp. 3354-3361 (2012). https://doi.org/10.1109/CVPR.2012.6248074  In:  10. Gordo, A., Almaz´an, J., Revaud, J., Larlus, D.: Deep image retrieval: Learn- ing global representations for image search. In: Leibe, B., Matas, J., Sebe, N., Welling, M. (eds.) European Conference on Computer Vision (ECCV). pp. 241- 257. Springer International Publishing (2016). https://doi.org/10.1007/978-3-319- 46466-4 15  11. H¨ansch, R., Weber, T., Hellwich, O.: Comparison of 3d interest point detectors and descriptors for point cloud fusion. ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences 2(3), 57 (2014)  12. Holz, D.,  Ichim, A.E., Tombari, F., Rusu, R.B., Behnke, S.: Registra- framework for aligning IEEE Robotics Automation Magazine 22(4), 110-124 (Dec 2015).  cloud library: A modular  tion with the point in 3-d. https://doi.org/10.1109/MRA.2015.2432331  13. Johnson, A.E., Hebert, M.: Using spin images for eﬃcient object recognition in cluttered 3d scenes. IEEE Transactions on Pattern Analysis and Machine Intelli- gence (TPAMI) 21(5), 433-449 (1999). https://doi.org/10.1109/34.765655  14. Karpathy, A., Fei-Fei, L.: Deep visual-semantic alignments for generating image descriptions. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3128-3137 (2015). https://doi.org/10.1109/CVPR.2015.7298932   3DFeat-NetReferences  1. Arandjelovic, R., Gronat, P., Torii, A., Pajdla, T., Sivic, J.: Netvlad: Cnn architecture for weakly supervised place recognition. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 5297-5307 (2016). https://doi.org/10.1109/CVPR.2016.572  2. Bay, H., Tuytelaars, T., Van Gool, L.: Surf: Speeded up robust features. In: Leonardis, A., Bischof, H., Pinz, A. (eds.) European Conference on Computer Vi- sion (ECCV). pp. 404-417. Springer Berlin Heidelberg, Berlin, Heidelberg (2006). https://doi.org/10.1007/11744023 32  3. Besl, P.J., McKay, N.D.: A method for registration of 3-d shapes. IEEE Trans- actions on Pattern Analysis and Machine Intelligence (TPAMI) 14(2), 239-256 (1992). https://doi.org/10.1109/34.121791  4. Bromley, J., Guyon, I., LeCun, Y., S¨ackinger, E., Shah, R.: Signature verification using a “siamese” time delay neural network. In: Advances in Neural Information Processing Systems. pp. 737-744 (1994)  5. Chen, H., Bhanu, B.: 3d free-form object recognition in range images using lo- cal surface patches. In: International Conference on Pattern Recognition (ICPR). vol. 3, pp. 136-139 (2004). https://doi.org/10.1109/ICPR.2004.1334487  6. Deng, H., Birdal, T., Ilic, S.: Ppfnet: Global context aware local features for ro- bust 3d point matching. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2018)  7. Dub´e, R., Dugas, D., Stumm, E., Nieto, J., Siegwart, R., Cadena, C.: Segmatch: Segment based loop-closure for 3d point clouds. arXiv preprint arXiv:1609.07720 (2016)  8. Elbaz, G., Avraham, T., Fischer, A.: 3d point cloud registration for local- ization using a deep neural network auto-encoder. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2472-2481 (2017). https://doi.org/10.1109/CVPR.2017.265  9. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driv- ing? the kitti vision benchmark suite. IEEE Conference on Com- puter Vision and Pattern Recognition (CVPR). pp. 3354-3361 (2012). https://doi.org/10.1109/CVPR.2012.6248074  In:  10. Gordo, A., Almaz´an, J., Revaud, J., Larlus, D.: Deep image retrieval: Learn- ing global representations for image search. In: Leibe, B., Matas, J., Sebe, N., Welling, M. (eds.) European Conference on Computer Vision (ECCV). pp. 241- 257. Springer International Publishing (2016). https://doi.org/10.1007/978-3-319- 46466-4 15  11. H¨ansch, R., Weber, T., Hellwich, O.: Comparison of 3d interest point detectors and descriptors for point cloud fusion. ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences 2(3), 57 (2014)  12. Holz, D.,  Ichim, A.E., Tombari, F., Rusu, R.B., Behnke, S.: Registra- framework for aligning IEEE Robotics Automation Magazine 22(4), 110-124 (Dec 2015).  cloud library: A modular  tion with the point in 3-d. https://doi.org/10.1109/MRA.2015.2432331  13. Johnson, A.E., Hebert, M.: Using spin images for eﬃcient object recognition in cluttered 3d scenes. IEEE Transactions on Pattern Analysis and Machine Intelli- gence (TPAMI) 21(5), 433-449 (1999). https://doi.org/10.1109/34.765655  14. Karpathy, A., Fei-Fei, L.: Deep visual-semantic alignments for generating image descriptions. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3128-3137 (2015). https://doi.org/10.1109/CVPR.2015.7298932   16  Zi Jian Yew and Gim Hee Lee  15. Khoury, M., Zhou, Q.Y., Koltun, V.: Learning compact geometric features. In: International Conference on Computer Vision (ICCV). pp. 153-161 (2017). https://doi.org/10.1109/ICCV.2017.26  16. Lee, G.H., Li, B., Pollefeys, M., Fraundorfer, F.: Minimal solutions for the multi- camera pose estimation problem. In: International Journal of Robotics Research (IJRR). pp. 837-848 (2015). https://doi.org/10.1177/0278364914557969  17. Lowe, D.G.: Distinctive  image  points. https://doi.org/10.1023/B:VISI.0000029664.99615.94  International  journal of  features  key- computer vision 60(2), 91-110 (2004).  from scale-invariant  18. Ma, Y., Guo, Y., Zhao, J., Lu, M., Zhang, J., Wan, J.: Fast and accurate reg- istration of structured point clouds with small overlaps. In: IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW). pp. 643-651 (2016). https://doi.org/10.1109/CVPRW.2016.86  19. Maddern, W., Pascoe, G., Linegar, C., Newman, P.: 1 year, 1000km: The oxford robotcar dataset. The International Journal of Robotics Research (IJRR) 36(1), 3-15 (2017). https://doi.org/10.1177/0278364916679498  20. Noh, H., Araujo, A., Sim, J., Weyand, T., Han, B.: Large-scale image retrieval with attentive deep local features. In: IEEE International Conference on Computer Vision (ICCV). pp. 3476-3485 (2017). https://doi.org/10.1109/ICCV.2017.374 21. Pavel, F.A., Wang, Z., Feng, D.D.: Reliable object recognition using sift fea- tures. In: IEEE International Workshop on Multimedia Signal Processing (MMSP). pp. 1-6 (2009). https://doi.org/10.1109/MMSP.2009.5293282  22. Pomerleau, F., Liu, M., Colas, F., Siegwart, R.: Challenging data sets for point cloud registration algorithms. The International Journal of Robotics Research (IJRR) 31(14), 1705-1711 (Dec 2012)  23. Qi, C.R., Su, H., Mo, K., Guibas, L.J.: Pointnet: Deep learning on point IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 77-85 (2017). https://doi.org/10.1109/CVPR.2017.16  for 3d classification and segmentation.  sets  In:  24. Qi, C.R., Yi, L., Su, H., Guibas, L.J.: Pointnet++: Deep hierarchical feature learn- ing on point sets in a metric space. In: Advances in Neural Information Processing Systems. pp. 5105-5114 (2017)  25. Rusu, R.B., Blodow, N., Beetz, M.: Fast point feature histograms (fpfh) for 3d reg- istration. In: IEEE International Conference on Robotics and Automation (ICRA). pp. 3212-3217 (2009). https://doi.org/10.1109/ROBOT.2009.5152473  26. Rusu, R.B., Blodow, N., Marton, Z.C., Beetz, M.: Aligning point cloud views using persistent feature histograms. In: IEEE/RSJ International Con- ference on Intelligent Robots and Systems (IROS). pp. 3384-3391 (2008). https://doi.org/10.1109/IROS.2008.4650967  27. Salti, S., Tombari, F., Spezialetti, R., Stefano, L.D.: Learning a descriptor-specific 3d keypoint detector. In: IEEE International Conference on Computer Vision (ICCV). pp. 2318-2326 (2015). https://doi.org/10.1109/ICCV.2015.267  28. Salti, S., Tombari, F., Di Stefano, L.: Shot: Unique signatures of histograms for surface and texture description. Computer Vision and Image Understanding 125, 251-264 (2014)  29. Schroﬀ, F., Kalenichenko, D., Philbin, J.: Facenet: A unified embed- IEEE Conference on Com- (2015).  face recognition and clustering. ding for puter Vision recognition and Pattern https://doi.org/10.1109/CVPR.2015.7298682  In: (CVPR).  815-823  pp.   3DFeat-Net30. Tombari, F., Salti, S., Di Stefano, L.: Unique shape context for 3d data description. In: ACM Workshop on 3D Object Retrieval. pp. 57-62. 3DOR ’10, ACM (2010). https://doi.org/10.1145/1877808.1877821  31. Verdie, Y., Yi, K.M., Fua, P., Lepetit, V.: TILDE: A Temporally Invariant Learned DEtector. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 5279-5288 (2015). https://doi.org/10.1109/CVPR.2015.7299165 32. Yi, K.M., Trulls, E., Lepetit, V., Fua, P.: Lift: Learned invariant feature transform. In: Leibe, B., Matas, J., Sebe, N., Welling, M. (eds.) European Conference on Computer Vision (ECCV). pp. 467-483. Springer International Publishing (2016). https://doi.org/10.1007/978-3-319-46466-4 28  33. Yi, K.M., Verdie, Y., Fua, P., Lepetit, V.: Learning to assign orientations to fea- ture points. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 107-116 (2016). https://doi.org/10.1109/CVPR.2016.19  34. Zeng, A., Song, S., Nießner, M., Fisher, M., Xiao, J., Funkhouser, T.: 3dmatch: Learning local geometric descriptors from rgb-d reconstructions. In: IEEE Confer- ence on Computer Vision and Pattern Recognition (CVPR). pp. 199-208 (2017). https://doi.org/10.1109/CVPR.2017.29  35. Zhong, Y.: Intrinsic shape signatures: A shape descriptor for 3d object recognition. In: IEEE International Conference on Computer Vision Workshops, (ICCVW). pp. 689-696 (2009). https://doi.org/10.1109/ICCVW.2009.5457637"}