{"1": "1. FG-NET Aging Database,http://www.fgnet.rsunit.com/ 2. Ahonen, T., Hadid, A., Pietikainen, M.: Face description with local binary patterns: Appli- cation to face recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI) (2006)  3. Antipov, G., Baccouche, M., Dugelay, J.L.: Face Aging With Conditional Generative Adver-  sarial Networks. IEEE International Conference on Image Processing (ICIP) (2017)  4. Belhumeur, P., Hespanha, J.P., Kriegman, D.: Eigenfaces vs. fisherfaces: Recognition using class specific linear projection. IEEE Transactions on Pattern Analysis and Machine Intelli- gence (T-PAMI) (1997)  5. Chen, B.C., Chen, C.S., Hsu, W.H.: Cross-age reference coding for age-invariant face recog-  nition and retrieval. In: European Conference on Computer Vision (ECCV) (2014)  6. Chen, B.C., Chen, C.S., Hsu, W.H.: Face recognition and retrieval using cross-age reference coding with cross-age celebrity dataset. IEEE Transactions on Multimedia 17(6), 804-815 (2015)  7. Chen, D., Cao, X., Wen, F., Sun, J.: Blessing of dimensionality: High-dimensional feature and its efficient compression for face verification. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3025-3032 (2013)  8. Duong, C.N., Quach, K.G., Luu, K., Savvides, M., et al.: Temporal Non-Volume Preserving Approach to Facial Age-Progression and Age-Invariant Face Recognition. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  9. Geng, X., Zhou, Z.H., Smith-Miles, K.: Automatic age estimation based on facial aging patterns. IEEE Transactions on pattern analysis and machine intelligence (TPAMI) (2007)  10. Gong, D., Li, Z., Lin, D., Liu, J., Tang, X.: Hidden factor analysis for age invariant face  recognition. In: International Conference on Computer Vision (ICCV) (2013)  11. Gong, D., Li, Z., Tao, D., Liu, J., Li, X.: A maximum entropy feature descriptor for age invariant face recognition. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 5289-5297 (2015)  12. Huang, G.B., Ramesh, M., Berg, T., Learned-Miller, E.: Labeled faces in the wild: A database for studying face recognition in unconstrained environments. In: Technical Report 07-49, University of Massachusetts, Amherst (2007)  13. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadarrama, S., Darrell, T.: Caffe: Convolutional architecture for fast feature embedding. In: Proceedings of the 2016 ACM on Multimedia Conference (ACM MM) (2014)  14. K. Zhang, Z. Zhang, Z. Li and Y. Qiao: Joint Face Detection and Alignment using Multi-task Cascaded Convolutional Networks. Signal Processing Letters 23(10), 1499-1503 (2016) 15. Kemelmacher-Shlizerman, I., Seitz, S.M., Miller, D., Brossard, E.: The megaface bench- mark: 1 million faces for recognition at scale. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  16. Lanitis, A., Taylor, C.J., Cootes, T.F.: Toward automatic simulation of aging effects on face  images. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) (2002)  17. Li, Z., Gong, D., Li, X., Tao, D.: Aging face recognition: A hierarchical learning model based on local patterns selection. IEEE Transactions on Image Processing (TIP) 25(5), 2146-2154 (2016)  18. Li, Z., Lin, D., Tang, X.: Nonparametric discriminant analysis for face recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI) 31, 755-761 (2009) 19. Li, Z., Liu, W., Lin, D., Tang, X.: Nonparametric subspace analysis for face recognition. In:  Conference on Computer Vision and Pattern Recognition (CVPR) (2005)   14  Y. Wang et al.  References  1. FG-NET Aging Database,http://www.fgnet.rsunit.com/ 2. Ahonen, T., Hadid, A., Pietikainen, M.: Face description with local binary patterns: Appli- cation to face recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI) (2006)  3. Antipov, G., Baccouche, M., Dugelay, J.L.: Face Aging With Conditional Generative Adver-  sarial Networks. IEEE International Conference on Image Processing (ICIP) (2017)  4. Belhumeur, P., Hespanha, J.P., Kriegman, D.: Eigenfaces vs. fisherfaces: Recognition using class specific linear projection. IEEE Transactions on Pattern Analysis and Machine Intelli- gence (T-PAMI) (1997)  5. Chen, B.C., Chen, C.S., Hsu, W.H.: Cross-age reference coding for age-invariant face recog-  nition and retrieval. In: European Conference on Computer Vision (ECCV) (2014)  6. Chen, B.C., Chen, C.S., Hsu, W.H.: Face recognition and retrieval using cross-age reference coding with cross-age celebrity dataset. IEEE Transactions on Multimedia 17(6), 804-815 (2015)  7. Chen, D., Cao, X., Wen, F., Sun, J.: Blessing of dimensionality: High-dimensional feature and its efficient compression for face verification. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3025-3032 (2013)  8. Duong, C.N., Quach, K.G., Luu, K., Savvides, M., et al.: Temporal Non-Volume Preserving Approach to Facial Age-Progression and Age-Invariant Face Recognition. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  9. Geng, X., Zhou, Z.H., Smith-Miles, K.: Automatic age estimation based on facial aging patterns. IEEE Transactions on pattern analysis and machine intelligence (TPAMI) (2007)  10. Gong, D., Li, Z., Lin, D., Liu, J., Tang, X.: Hidden factor analysis for age invariant face  recognition. In: International Conference on Computer Vision (ICCV) (2013)  11. Gong, D., Li, Z., Tao, D., Liu, J., Li, X.: A maximum entropy feature descriptor for age invariant face recognition. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 5289-5297 (2015)  12. Huang, G.B., Ramesh, M., Berg, T., Learned-Miller, E.: Labeled faces in the wild: A database for studying face recognition in unconstrained environments. In: Technical Report 07-49, University of Massachusetts, Amherst (2007)  13. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadarrama, S., Darrell, T.: Caffe: Convolutional architecture for fast feature embedding. In: Proceedings of the 2016 ACM on Multimedia Conference (ACM MM) (2014)  14. K. Zhang, Z. Zhang, Z. Li and Y. Qiao: Joint Face Detection and Alignment using Multi-task Cascaded Convolutional Networks. Signal Processing Letters 23(10), 1499-1503 (2016) 15. Kemelmacher-Shlizerman, I., Seitz, S.M., Miller, D., Brossard, E.: The megaface bench- mark: 1 million faces for recognition at scale. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  16. Lanitis, A., Taylor, C.J., Cootes, T.F.: Toward automatic simulation of aging effects on face  images. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) (2002)  17. Li, Z., Gong, D., Li, X., Tao, D.: Aging face recognition: A hierarchical learning model based on local patterns selection. IEEE Transactions on Image Processing (TIP) 25(5), 2146-2154 (2016)  18. Li, Z., Lin, D., Tang, X.: Nonparametric discriminant analysis for face recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence (T-PAMI) 31, 755-761 (2009) 19. Li, Z., Liu, W., Lin, D., Tang, X.: Nonparametric subspace analysis for face recognition. In:  Conference on Computer Vision and Pattern Recognition (CVPR) (2005)   Orthogonal Deep Features Decomposition for Age-Invariant Face Recognition20. Li, Z., Park, U., Jain, A.K.: A discriminative model for age invariant face recognition. IEEE  transactions on Information Forensics and Security (TIFS) (2011)  21. Lin, L., Wang, G., Zuo, W., Feng, X., Zhang, L.: Cross-domain visual matching via gener- alized similarity measure and feature learning. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 39(6), 1089-1102 (2017)  22. Ling, H., Soatto, S., Ramanathan, N., Jacobs, D.W.: Face verification across age progres- sion using discriminative methods. IEEE transactions on Information Forensics and Security (TIFS) (2010)  23. Liu, W., Li, Z., Tang, X.: Spatio-temporal embedding for statistical face recognition from video. In: Leonardis, A., Bischof, H., Pinz, A. (eds.) European Conference on Computer Vision (ECCV) (2006)  24. Liu, W., Wen, Y., Yu, Z., Li, M., Raj, B., Song, L.: SphereFace: Deep Hypersphere Embed- ding for Face Recognition. In: IEEE Conference on Computer Vision and Pattern Recogni- tion (CVPR) (2017)  25. Liu, Z., Luo, P., Wang, X., Tang, X.: Deep learning face attributes in the wild. In: Interna-  tional Conference on Computer Vision (ICCV) (2015)  26. Moschoglou, S., Papaioannou, A., Sagonas, C., Deng, J., Kotsia, I., Zafeiriou, S.: Agedb: The first manually collected in-the-wild age database. In: IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW) (2017)  27. Nech, A., Kemelmacher-Shlizerman, I.: Level playing field for million scale face recogni- tion. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017) 28. Park, U., Tong, Y., Jain, A.K.: Age-invariant face recognition. IEEE Transactions on Pattern  Analysis and Machine Intelligence (TPAMI) (2010)  29. Parkhi, O.M., Vedaldi, A., Zisserman, A.: Deep face recognition. In: British Machine Vision  Conference (BMVC) (2015)  30. Ricanek, K., Tesafaye, T.: Morph: A longitudinal image database of normal adult age- progression. In: International Conference on Automatic Face and Gesture Recognition (2006)  31. Rothe, R., Timofte, R., Gool, L.V.: Dex: Deep expectation of apparent age from a single image. In: International Conference on Computer Vision Workshops (ICCVW) (December 2015)  32. Schroff, F., Kalenichenko, D., Philbin, J.: Facenet: A unified embedding for face recognition and clustering. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2015)  33. Sun, Y., Chen, Y., Wang, X., Tang, X.: Deep learning face representation by joint identification-verification. In: Advances in Neural Information Processing Systems (NIPS) (2014)  34. Sun, Y., Liang, D., Wang, X., Tang, X.: Deepid3: Face recognition with very deep neural  networks. In: arXiv preprint arXiv:1502.00873 (2015)  35. Sun, Y., Wang, X., Tang, X.: Deeply learned face representations are sparse, selective, and  robust. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2015)  36. Taigman, Y., Yang, M., Ranzato, M., Wolf, L.: Deepface: Closing the gap to human-level per- formance in face verification. In: IEEE Conference on Computer Vision and Pattern Recog- nition (CVPR) (2014)  37. Turk, M.A., Pentland, A.P.: Face recognition using eigenfaces. In: Conference on Computer  Vision and Pattern Recognition (CVPR) (1991)  38. Wang, F., Xiang, X., Cheng, J., Yuille, A.L.: NormFace: L 2 Hypersphere Embedding for Face Verification. In: Proceedings of the 2017 ACM on Multimedia Conference (ACM MM) (2017)   16  Y. Wang et al.  39. Wang, H., Wang, Y., Zhou, Z., Ji, X., Li, Z., Gong, D., Zhou, J., Liu, W.: Cosface: Large margin cosine loss for deep face recognition. Conference on Computer Vision and Pattern Recognition (CVPR) (2018)  40. Wang, X., Tang, X.: A unified framework for subspace face recognition. IEEE Transactions  on Pattern Analysis and Machine Intelligence (TPAMI) (2004)  41. Wang, Z., He, K., Fu, Y., Feng, R., Jiang, Y.G., Xue, X.: Multi-task Deep Neural Network for Joint Face Recognition and Facial Attribute Prediction. In: Proceedings of the 2017 ACM on International Conference on Multimedia Retrieval (ICMR) (2017)  42. Wen, Y., Li, Z., Qiao, Y.: Latent factor guided convolutional neural networks for age-invariant face recognition. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  43. Wen, Y., Zhang, K., Li, Z., Qiao, Y.: A discriminative feature learning approach for deep face recognition. In: European Conference on Computer Vision (ECCV). pp. 499-515 (2016) 44. Xiong, Y., Liu, W., Zhao, D., Tang, X.: Face recognition via archetype hull ranking. In:  International Conference on Computer Vision (ICCV) (2013)  45. Yi, D., Lei, Z., Liao, S., Li, S.Z.: Learning face representation from scratch. In: arXiv preprint  arXiv:1411.7923 (2014)  46. Zhang, Z., Song, Y., Qi, H.: Age Progression/Regression by Conditional Adversarial Autoen- coder. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017) 47. Zheng, T., Deng, W., Hu, J.: Age Estimation Guided Convolutional Neural Network for Age- Invariant Face Recognition. In: IEEE Conference on Computer Vision and Pattern Recogni- tion Workshops (CVPRW) (2017)"}