{"1": "1. Tompson, J., Stein, M., Lecun, Y., Perlin, K.: Real-time continuous pose recovery of human hands using convolutional networks. ACM TOG 33(5) (2014) 169:1- 169:10   14  X. Wu, D. Finnegan, E. O’Neill and Y.-L. Yang  high computational costs required while still sacrificing local geometric details due to limited voxel resolution.  4.3 Comparisons with state-of-the-art (STAR) methods  We have compared our best method (2D CR with Ωedt2) to both 2D [5] and 3D [30, 14] STAR methods, and achieved convincing better performance as shown in Figures 5c and 6c.  Improvement to STAR methods: Another advantage of our dense guidance map supervision method is that we can easily insert one or multiple of our mod- ules into existing learning pipelines, using intermediate feature space constraints to achieve better results. We applied Multi-View Coordinate Regression (MV- CR) variants on [5] in 2D, using detection output of [30] as supervision feature maps, as shown in Figures 5d and 6d. Notice that our MV-CR method with approximate geodesic distance achieved the minimal mean error across all of our experiments (5.90mm, see Table 1). We see the improvement as an positive ev- idence that certain hidden inter-joint constraints could be learned through our multi-stage dense guidance map supervision approach.  5 Conclusion  We present a general hand pose estimation framework via intermediate super- vision on dense guidance maps. Our method overcomes issues with high non- linearity of hand joint regression and the resolution restriction of detection-based methods. The dense guidance maps are designed to better incorporate the geo- metric and spatial information of hand joints. We demonstrate the eﬀectiveness of our framework and the choice of guidance maps by extensive comparisons with baseline methods in both 2D and 3D. Results show that our framework can robustly produce hand pose estimates with improved accuracy. Future work will explore temporal hand tracking using our framework, integrating hand detection to handle data in the wild, and optimizing computational performance.  Acknowledgements  We are grateful to the anonymous reviewers for their comments and suggestions. The work was supported by CAMERA, the RCUK Centre for the Analysis of Motion, Entertainment Research and Applications, EP/M023281/1.  References  1. Tompson, J., Stein, M., Lecun, Y., Perlin, K.: Real-time continuous pose recovery of human hands using convolutional networks. ACM TOG 33(5) (2014) 169:1- 169:10   Dense Guidance Hand Map2. Sun, X., Wei, Y., Liang, S., Tang, X., Sun, J.: Cascaded hand pose regression. In:  IEEE CVPR. (2015) 824-832  3. Yuan, S., Ye, Q., Stenger, B., Jain, S., Kim, T.K.: Bighand2.2m benchmark: Hand  pose dataset and state of the art analysis. IEEE CVPR (2017) 2605-2613  4. Yuan, S., Ye, Q., Garcia-Hernando, G., Kim, T.K.: The 2017 hands in the million challenge on 3d hand pose estimation. arXiv preprint arXiv:1707.02237 (2017) 5. Ge, L., Liang, H., Yuan, J., Thalmann, D.: Robust 3d hand pose estimation in single depth images: from single-view cnn to multi-view cnns. In: IEEE CVPR. (2016) 3593-3601  6. Sinha, A., Choi, C., Ramani, K.: Deephand: Robust hand pose estimation by completing a matrix imputed with deep features. In: CVPR. (2016) 4150-4158 7. Ye, Q., Yuan, S., Kim, T.K.: Spatial attention deep net with partial pso for  hierarchical hybrid hand pose estimation. In: ECCV. (2016) 346-361  8. Zhou, X., Wan, Q., Zhang, W., Xue, X., Wei, Y.: Model-based deep hand pose  estimation. In: IJCAI. (2016) 2421-2427  9. Guo, H., Wang, G., Chen, X., Zhang, C.: Towards good practices for deep 3d hand  pose estimation. CoRR abs/1707.07248 (2017)  10. Guo, H., Wang, G., Chen, X., Zhang, C., Qiao, F., Yang, H.: Region ensemble network: Improving convolutional network for hand pose estimation. In: 2017 IEEE International Conference on Image Processing (ICIP). (Sept 2017) 4512-4516 11. Madadi, M., Escalera, S., Bar´o, X., Gonz`alez, J.: End-to-end global to local CNN learning for hand pose recovery in depth data. CoRR abs/1705.09606 (2017) 12. Chen, X., Wang, G., Guo, H., Zhang, C.: Pose guided structured region ensemble network for cascaded hand pose estimation. CoRR abs/1708.03416 (2017) 13. Oberweger, M., Lepetit, V.: Deepprior++: Improving fast and accurate 3d hand  pose estimation. In: ICCV workshop. Volume 840. (2017) 2  14. Ge, L., Liang, H., Yuan, J., Thalmann, D.: 3d convolutional neural networks for In: IEEE  eﬃcient and robust hand pose estimation from single depth images. CVPR. (2017) 5679-5688  15. Keskin, C., Kıra¸c, F., Kara, Y.E., Akarun, L.: Hand pose estimation and hand In: ECCV.  shape classification using multi-layered randomized decision forests. (2012) 852-863  16. Xu, C., Cheng, L.: Eﬃcient hand pose estimation from a single depth image. In:  IEEE ICCV. (2013) 3456-3462  17. Tang, D., Chang, H.J., Tejani, A., Kim, T.K.: Latent regression forest: Structured estimation of 3d articulated hand posture. In: IEEE CVPR. (2014) 3786-3793 18. Tang, D., Taylor, J., Kohli, P., Keskin, C., Kim, T.K., Shotton, J.: Opening the black box: Hierarchical sampling optimization for estimating human hand pose. In: IEEE ICCV. (2015) 3325-3333  19. Yuan, S., Garcia-Hernando, G., Stenger, B., Moon, G., Yong Chang, J., Mu Lee, K., Molchanov, P., Kautz, J., Honari, S., Ge, L., Yuan, J., Chen, X., Wang, G., Yang, F., Akiyama, K., Wu, Y., Wan, Q., Madadi, M., Escalera, S., Li, S., Lee, D., Oikonomidis, I., Argyros, A., Kim, T.K.: Depth-based 3d hand pose estimation: From current achievements to future goals. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (June 2018)  20. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti-  mation. In: ECCV. (2016) 483-499  21. Ballan, L., Taneja, A., Gall, J., Van Gool, L., Pollefeys, M.: Motion capture of hands in action using discriminative salient points. In: ECCV. (2012) 640-653   16  X. Wu, D. Finnegan, E. O’Neill and Y.-L. Yang  22. Tzionas, D., Ballan, L., Srikantha, A., Aponte, P., Pollefeys, M., Gall, J.: Capturing Int. hands in action using discriminative salient points and physics simulation. Journal of Computer Vision 118(2) (2016) 172-193  23. Tagliasacchi, A., Schr¨oder, M., Tkach, A., Bouaziz, S., Botsch, M., Pauly, M.: Robust articulated-icp for real-time hand tracking. Computer Graphics Forum (Proc. SGP) 34(5) (2015) 101-114  24. Sridhar, S., Mueller, F., Oulasvirta, A., Theobalt, C.: Fast and robust hand track- ing using detection-guided optimization. In: IEEE CVPR. (2015) 3213-3221 25. Sridhar, S., Mueller, F., Zollh¨ofer, M., Casas, D., Oulasvirta, A., Theobalt, C.: Real-time joint tracking of a hand manipulating an object from rgb-d input. In: ECCV. (2016) 294-310  26. Taylor, J., Bordeaux, L., Cashman, T., Corish, B., Keskin, C., Sharp, T., Soto, E., Sweeney, D., Valentin, J., Luﬀ, B., Topalian, A., Wood, E., Khamis, S., Kohli, P., Izadi, S., Banks, R., Fitzgibbon, A., Shotton, J.: Eﬃcient and precise interactive hand tracking through joint, continuous optimization of pose and correspondences. ACM TOG (Siggraph) 35(4) (2016) 143:1-143:12  27. Tkach, A., Pauly, M., Tagliasacchi, A.: Sphere-meshes for real-time hand modeling  and tracking. ACM TOG (Siggraph) 35(6) (2016) 222:1-222:11  28. Iason Oikonomidis, N.K., Argyros, A.: Eﬃcient model-based 3d tracking of hand  articulations using kinect. In: BMVC. (2011) 101.1-101.11  29. Qian, C., Sun, X., Wei, Y., Tang, X., Sun, J.: Realtime and robust hand tracking  from depth. In: IEEE CVPR. (2014) 1106-1113  30. Moon, G., Yong Chang, J., Mu Lee, K.: V2v-posenet: Voxel-to-voxel prediction network for accurate 3d hand and human pose estimation from a single depth map. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (June 2018)  31. Lin, M., Lin, L., Liang, X., Wang, K., Chen, H.: Recurrent 3d pose sequence  machines. In: CVPR. (2017)  32. Popa, A.I., Zanfir, M., Sminchisescu, C.: Deep multitask architecture for integrated 2d and 3d human sensing. In: IEEE International Conference on Computer Vision and Pattern Recognition. (2017)  33. Zeiler, M.D., Fergus, R.: Visualizing and understanding convolutional networks.  In: European conference on computer vision, Springer (2014) 818-833  34. Sharp, T., Keskin, C., Robertson, D., Taylor, J., Shotton, J., Kim, D., Rhemann, C., Leichter, I., Vinnikov, A., Wei, Y., Freedman, D., Kohli, P., Krupka, E., Fitzgib- bon, A., Izadi, S.: Accurate, robust, and ﬂexible real-time hand tracking. In: SIGCHI Conf. on Human factors in Computing Systems. (2015) 3633-3642  35. Szegedy, C., Vanhoucke, V., Ioﬀe, S., Shlens, J., Wojna, Z.: Rethinking the incep- tion architecture for computer vision. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 2818-2826  36. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: IEEE CVPR. (2016) 770-778  37. Zhou, X., Huang, Q., Sun, X., Xue, X., Wei, Y.: Towards 3d human pose estimation  in the wild: a weakly-supervised approach. In: IEEE ICCV. (2017)  38. Tompson, J.J., Jain, A., LeCun, Y., Bregler, C.: Joint training of a convolutional network and a graphical model for human pose estimation. In: NIPS. (2014) 1799- 1807  39. Maurer, C.R., Qi, R., Raghavan, V.: A linear time algorithm for computing exact IEEE  euclidean distance transforms of binary images in arbitrary dimensions. Trans. Pattern Anal. Mach. Intell. 25(2) (2003) 265-270   Dense Guidance Hand Map40. Sethian, J.A.: A fast marching level set method for monotonically advancing fronts.  Proceedings of the National Academy of Sciences 93(4) (1996) 1591-1595  41. Girshick, R.: Fast r-cnn. In: Proceedings of the IEEE international conference on  computer vision. (2015) 1440-1448  42. Szegedy, C., Ioﬀe, S., Vanhoucke, V., Alemi, A.A.: Inception-v4, inception-resnet and the impact of residual connections on learning. In: AAAI. Volume 4. (2017) 12  43. Garcia-Hernando, G., Yuan, S., Baek, S., Kim, T.K.: First-person hand action benchmark with rgb-d videos and 3d hand pose annotations. In: The IEEE Con- ference on Computer Vision and Pattern Recognition (CVPR). (June 2018) 44. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: Towards real-time object  detection with region proposal networks. In: NIPS. (2015)  45. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., Ghemawat, S., Goodfellow, I., Harp, A., Irving, G., Isard, M., Jia, Y., Jozefowicz, R., Kaiser, L., Kudlur, M., Levenberg, J., Man´e, D., Monga, R., Moore, S., Murray, D., Olah, C., Schuster, M., Shlens, J., Steiner, B., Sutskever, I., Talwar, K., Tucker, P., Vanhoucke, V., Vasudevan, V., Vi´egas, F., Vinyals, O., Warden, P., Wattenberg, M., Wicke, M., Yu, Y., Zheng, X.: TensorFlow: Large-scale machine learning on heterogeneous systems (2015) Software available from tensorﬂow.org.  46. Kingma, D.P., Ba, J.: Adam: A Method for Stochastic Optimization. ArXiv e-  prints (December 2014)"}