{"1": "1. Caesar, H., Uijlings, J., Ferrari, V.: Region-based semantic segmentation with end-to-end training. In: European Conference on Computer Vision. pp. 381-397. Springer (2016)  2. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. IEEE Transactions on Pattern Analysis and Machine Intelli- gence (2017)  3. Chen, L.C., Papandreou, G., Schroﬀ, F., Adam, H.: Rethinking atrous convolution  for semantic image segmentation. CoRR (2017)  4. Dai, J., He, K., Sun, J.: Convolutional feature masking for joint object and stuﬀ segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3992-4000 (2015)  5. Gupta, S., Arbel´aez, P., Girshick, R., Malik, J.: Indoor scene understanding with rgb-d images: Bottom-up segmentation, object detection and semantic segmenta- tion. International Journal of Computer Vision 112(2), 133-149 (2015)  6. Gupta, S., Arbelaez, P., Malik, J.: Perceptual organization and recognition of in- door scenes from rgb-d images. In: Proceedings of the IEEE Conference on Com- puter Vision and Pattern Recognition. pp. 564-571 (2013)  7. Gupta, S., Girshick, R., Arbel´aez, P., Malik, J.: Learning rich features from rgb-d images for object detection and segmentation. In: European Conference on Com- puter Vision. pp. 345-360. Springer (2014)  8. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural computation  9(8), 1735-1780 (1997)  9. Hu, R., Rohrbach, M., Darrell, T.: Segmentation from natural language expres-  sions. European Conference on Computer Vision (2016)  10. Hu, R., Rohrbach, M., Venugopalan, S., Darrell, T.: Utilizing large scale vision and text datasets for image segmentation from referring expressions. CoRR (2016) 11. Hu, R., Xu, H., Rohrbach, M., Feng, J., Saenko, K., Darrell, T.: Natural lan- guage object retrieval. In: Computer Vision and Pattern Recognition. pp. 4555- 4564 (2016)  12. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: Proceedings of the 22nd ACM international conference on Multimedia. pp. 675-678. ACM (2014)  13. Kazemzadeh, S., Ordonez, V., Matten, M., Berg, T.: Referitgame: Referring to objects in photographs of natural scenes. In: Conference on Empirical Methods in Natural Language Processing. pp. 787-798 (2014)  14. Li, H., Meng, F., Wu, Q., Luo, B.: Unsupervised multiclass region cosegmentation via ensemble clustering and energy minimization. IEEE Transactions on Circuits and Systems for Video Technology 24(5), 789-801 (2014)  15. Li, Z., Gan, Y., Liang, X., Yu, Y., Cheng, H., Lin, L.: Lstm-cf: Unifying context modeling and fusion with lstms for rgb-d scene labeling. In: European Conference on Computer Vision. pp. 541-557. Springer (2016)  16. Liang, X., Shen, X., Feng, J., Lin, L., Yan, S.: Semantic object parsing with graph lstm. In: European Conference on Computer Vision. pp. 125-143. Springer (2016) 17. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision. pp. 740-755. Springer (2014)   Key-Word-Aware Network for Referring Expression Image SegmentationReferences  1. Caesar, H., Uijlings, J., Ferrari, V.: Region-based semantic segmentation with end-to-end training. In: European Conference on Computer Vision. pp. 381-397. Springer (2016)  2. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. IEEE Transactions on Pattern Analysis and Machine Intelli- gence (2017)  3. Chen, L.C., Papandreou, G., Schroﬀ, F., Adam, H.: Rethinking atrous convolution  for semantic image segmentation. CoRR (2017)  4. Dai, J., He, K., Sun, J.: Convolutional feature masking for joint object and stuﬀ segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3992-4000 (2015)  5. Gupta, S., Arbel´aez, P., Girshick, R., Malik, J.: Indoor scene understanding with rgb-d images: Bottom-up segmentation, object detection and semantic segmenta- tion. International Journal of Computer Vision 112(2), 133-149 (2015)  6. Gupta, S., Arbelaez, P., Malik, J.: Perceptual organization and recognition of in- door scenes from rgb-d images. In: Proceedings of the IEEE Conference on Com- puter Vision and Pattern Recognition. pp. 564-571 (2013)  7. Gupta, S., Girshick, R., Arbel´aez, P., Malik, J.: Learning rich features from rgb-d images for object detection and segmentation. In: European Conference on Com- puter Vision. pp. 345-360. Springer (2014)  8. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural computation  9(8), 1735-1780 (1997)  9. Hu, R., Rohrbach, M., Darrell, T.: Segmentation from natural language expres-  sions. European Conference on Computer Vision (2016)  10. Hu, R., Rohrbach, M., Venugopalan, S., Darrell, T.: Utilizing large scale vision and text datasets for image segmentation from referring expressions. CoRR (2016) 11. Hu, R., Xu, H., Rohrbach, M., Feng, J., Saenko, K., Darrell, T.: Natural lan- guage object retrieval. In: Computer Vision and Pattern Recognition. pp. 4555- 4564 (2016)  12. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: Proceedings of the 22nd ACM international conference on Multimedia. pp. 675-678. ACM (2014)  13. Kazemzadeh, S., Ordonez, V., Matten, M., Berg, T.: Referitgame: Referring to objects in photographs of natural scenes. In: Conference on Empirical Methods in Natural Language Processing. pp. 787-798 (2014)  14. Li, H., Meng, F., Wu, Q., Luo, B.: Unsupervised multiclass region cosegmentation via ensemble clustering and energy minimization. IEEE Transactions on Circuits and Systems for Video Technology 24(5), 789-801 (2014)  15. Li, Z., Gan, Y., Liang, X., Yu, Y., Cheng, H., Lin, L.: Lstm-cf: Unifying context modeling and fusion with lstms for rgb-d scene labeling. In: European Conference on Computer Vision. pp. 541-557. Springer (2016)  16. Liang, X., Shen, X., Feng, J., Lin, L., Yan, S.: Semantic object parsing with graph lstm. In: European Conference on Computer Vision. pp. 125-143. Springer (2016) 17. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision. pp. 740-755. Springer (2014)   16  H. Shi et al.  18. Liu, C., Lin, Z., Shen, X., Yang, J., Lu, X., Yuille, A.: Recurrent multimodal interaction for referring image segmentation. IEEE International Conference on Computer Vision (2017)  19. Liu, W., Rabinovich, A., Berg, A.C.: Parsenet: Looking wider to see better. CoRR  abs/1506.04579 (2015)  20. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3431-3440 (2015)  21. Lu, J., Xiong, C., Parikh, D., Socher, R.: Knowing when to look: Adaptive attention via a visual sentinel for image captioning. Proceedings of the IEEE conference on computer vision and pattern recognition (2016)  22. Lu, J., Yang, J., Batra, D., Parikh, D.: Hierarchical question-image co-attention  for visual question answering. NIPS (2016)  23. Luo, B., Li, H., Meng, F., Wu, Q., Huang, C.: Video object segmentation via global consistency aware query strategy. IEEE Transactions on Multimedia PP(99), 1-1 (2017)  24. Mao, J., Huang, J., Toshev, A., Camburu, O., Yuille, A., Murphy, K.: Generation  and comprehension of unambiguous object descriptions. In: CVPR (2016)  25. Meng, F., Li, H., Wu, Q., Luo, B., Huang, C., Ngan, K.: Globally measuring the similarity of superpixels by binary edge maps for superpixel clustering. IEEE Transactions on Circuits and Systems for Video Technology PP(99), 1-1 (2016)  26. Nagaraja, V.K., Morariu, V.I., Davis, L.S.: Modeling context between objects for referring expression understanding. European Conference on Computer Vision pp. 792-807 (2016)  27. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmen- tation. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 1520-1528 (2015)  28. Peng, Z., Zhang, R., Liang, X., Liu, X., Lin, L.: Geometric scene parsing with hier- archical lstm. In: Proceedings of the Twenty-Fifth International Joint Conference on Artificial Intelligence. pp. 3439-3445 (2016)  29. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recog- nition challenge. International Journal of Computer Vision 115(3), 211-252 (2015) 30. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. International Conference on Learning Representations (2015)  31. Wang, G., Luo, P., Lin, L., Wang, X.: Learning object interactions and descriptions  for semantic image segmentation. In: CVPR (2017)  32. Xu, K., Ba, J., Kiros, R., Cho, K., Courville, A., Salakhutdinov, R., Zemel, R., Bengio, Y.: Show, attend and tell: Neural image caption generation with visual attention. International Conference on Machine Learning pp. 2048-2057 (2015) 33. Yang, Z., He, X., Gao, J., Deng, L., Smola, A.: Stacked attention networks for image question answering. In: Proceedings of the IEEE conference on computer vision and pattern recognition (2016)  34. Yao, B.Z., Yang, X., Lin, L., Lee, M.W., Zhu, S.C.: I2t: Image parsing to text  description. Proceedings of the IEEE 98(8), 1485-1508 (2010)  35. Yu, D., Fu, J., Rui, Y., Mei, T.: Multi-level attention networks for visual question answering. In: Proceedings of the IEEE conference on computer vision and pattern recognition (July 2017)  36. Yu, F., Koltun, V.: Multi-scale context aggregation by dilated convolutions. In:  International Conference on Learning Representations (2016)   Key-Word-Aware Network for Referring Expression Image Segmentation37. Yu, L., Poirson, P., Yang, S., Berg, A.C., Berg, T.L.: Modeling context in referring  expressions. European Conference on Computer Vision (2016)  38. Zhang, Y., Yuan, L., Guo, Y., He, Z., Huang, I., Lee, H.: Discriminative bimodal networks for visual localization and detection with natural language queries. Pro- ceedings of the IEEE conference on computer vision and pattern recognition (2017) 39. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (2017)"}