{"1": "1. Wei, S.E., Ramakrishna, V., Kanade, T., Sheikh, Y.: Convolutional pose machines. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recog- nition. (2016) 4724-4732 1, 3, 6  2. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti- mation. In: European Conference on Computer Vision, Springer (2016) 483-499 1, 2, 3, 4, 8  3. Pishchulin, L., Insafutdinov, E., Tang, S., Andres, B., Andriluka, M., Gehler, P.V., Schiele, B.: Deepcut: Joint subset partition and labeling for multi person pose In: Proceedings of the IEEE Conference on Computer Vision and estimation. Pattern Recognition. (2016) 4929-4937 1, 4  4. Zhou, X., Zhu, M., Leonardos, S., Derpanis, K.G., Daniilidis, K.: Sparseness meets deepness: 3d human pose estimation from monocular video. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 4966-4975 1, 3, 4  5. Zhou, X., Sun, X., Zhang, W., Liang, S., Wei, Y.: Deep kinematic pose regression. In: Computer Vision-ECCV 2016 Workshops, Springer (2016) 186-201 1, 4, 9, 10 6. Popa, A.I., Zanfir, M., Sminchisescu, C.: Deep multitask architecture for inte- grated 2d and 3d human sensing. In: Conference on Computer Vision and Pattern Recognition. Volume 1. (2017) 5 1  7. Kim, J., Lee, I., Kim, J., Lee, S.: Implementation of an omnidirectional human motion capture system using multiple kinect sensors. IEICE TRANSACTIONS on Fundamentals of Electronics, Communications and Computer Sciences 98(9) (2015) 2004-2008 1  8. Kwon, B., Kim, D., Kim, J., Lee, I., Kim, J., Oh, H., Kim, H., Lee, S.: Imple- mentation of human action recognition system using multiple kinect sensors. In: Pacific Rim Conference on Multimedia, Springer (2015) 334-343 1  9. Kwon, B., Kim, J., Lee, K., Lee, Y.K., Park, S., Lee, S.: Implementation of a virtual training simulator based on 360 multi-view human action recognition. IEEE Access 5 (2017) 12496-12511 1  10. Meng, M., Fallavollita, P., Blum, T., Eck, U., Sandor, C., Weidert, S., Waschke, J., Navab, N.: Kinect for interactive ar anatomy learning. In: Mixed and Augmented Reality (ISMAR), 2013 IEEE International Symposium on, IEEE (2013) 277-278 1, 3  11. Gonz´alez-Ortega, D., D´ıaz-Pernas, F., Mart´ınez-Zarzuela, M., Ant´on-Rodr´ıguez, M.: A kinect-based system for cognitive rehabilitation exercises monitoring. Com- puter methods and programs in biomedicine 113(2) (2014) 620-631 1  12. Tong, J., Zhou, J., Liu, L., Pan, Z., Yan, H.: Scanning 3d full human bodies using kinects. IEEE transactions on visualization and computer graphics 18(4) (2012) 643-650 1  13. Agarwal, A., Triggs, B.: 3d human pose from silhouettes by relevance vector regres- sion. In: Computer Vision and Pattern Recognition, 2004. CVPR 2004. Proceedings of the 2004 IEEE Computer Society Conference on. Volume 2., IEEE (2004) II-II 1, 3  14. Mori, G., Malik, J.: Recovering 3d human body configurations using shape con- IEEE Transactions on Pattern Analysis and Machine Intelligence 28(7)  texts. (2006) 1052-1062 1, 3  15. Bo, L., Sminchisescu, C., Kanaujia, A., Metaxas, D.: Fast algorithms for large In: Computer Vision and Pattern Recognition,  scale conditional 3d prediction. 2008. CVPR 2008. IEEE Conference on, IEEE (2008) 1-8 1, 3   Propagating LSTM: 3D Pose Estimation based on Joint InterdependencyReferences  1. Wei, S.E., Ramakrishna, V., Kanade, T., Sheikh, Y.: Convolutional pose machines. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recog- nition. (2016) 4724-4732 1, 3, 6  2. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti- mation. In: European Conference on Computer Vision, Springer (2016) 483-499 1, 2, 3, 4, 8  3. Pishchulin, L., Insafutdinov, E., Tang, S., Andres, B., Andriluka, M., Gehler, P.V., Schiele, B.: Deepcut: Joint subset partition and labeling for multi person pose In: Proceedings of the IEEE Conference on Computer Vision and estimation. Pattern Recognition. (2016) 4929-4937 1, 4  4. Zhou, X., Zhu, M., Leonardos, S., Derpanis, K.G., Daniilidis, K.: Sparseness meets deepness: 3d human pose estimation from monocular video. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 4966-4975 1, 3, 4  5. Zhou, X., Sun, X., Zhang, W., Liang, S., Wei, Y.: Deep kinematic pose regression. In: Computer Vision-ECCV 2016 Workshops, Springer (2016) 186-201 1, 4, 9, 10 6. Popa, A.I., Zanfir, M., Sminchisescu, C.: Deep multitask architecture for inte- grated 2d and 3d human sensing. In: Conference on Computer Vision and Pattern Recognition. Volume 1. (2017) 5 1  7. Kim, J., Lee, I., Kim, J., Lee, S.: Implementation of an omnidirectional human motion capture system using multiple kinect sensors. IEICE TRANSACTIONS on Fundamentals of Electronics, Communications and Computer Sciences 98(9) (2015) 2004-2008 1  8. Kwon, B., Kim, D., Kim, J., Lee, I., Kim, J., Oh, H., Kim, H., Lee, S.: Imple- mentation of human action recognition system using multiple kinect sensors. In: Pacific Rim Conference on Multimedia, Springer (2015) 334-343 1  9. Kwon, B., Kim, J., Lee, K., Lee, Y.K., Park, S., Lee, S.: Implementation of a virtual training simulator based on 360 multi-view human action recognition. IEEE Access 5 (2017) 12496-12511 1  10. Meng, M., Fallavollita, P., Blum, T., Eck, U., Sandor, C., Weidert, S., Waschke, J., Navab, N.: Kinect for interactive ar anatomy learning. In: Mixed and Augmented Reality (ISMAR), 2013 IEEE International Symposium on, IEEE (2013) 277-278 1, 3  11. Gonz´alez-Ortega, D., D´ıaz-Pernas, F., Mart´ınez-Zarzuela, M., Ant´on-Rodr´ıguez, M.: A kinect-based system for cognitive rehabilitation exercises monitoring. Com- puter methods and programs in biomedicine 113(2) (2014) 620-631 1  12. Tong, J., Zhou, J., Liu, L., Pan, Z., Yan, H.: Scanning 3d full human bodies using kinects. IEEE transactions on visualization and computer graphics 18(4) (2012) 643-650 1  13. Agarwal, A., Triggs, B.: 3d human pose from silhouettes by relevance vector regres- sion. In: Computer Vision and Pattern Recognition, 2004. CVPR 2004. Proceedings of the 2004 IEEE Computer Society Conference on. Volume 2., IEEE (2004) II-II 1, 3  14. Mori, G., Malik, J.: Recovering 3d human body configurations using shape con- IEEE Transactions on Pattern Analysis and Machine Intelligence 28(7)  texts. (2006) 1052-1062 1, 3  15. Bo, L., Sminchisescu, C., Kanaujia, A., Metaxas, D.: Fast algorithms for large In: Computer Vision and Pattern Recognition,  scale conditional 3d prediction. 2008. CVPR 2008. IEEE Conference on, IEEE (2008) 1-8 1, 3   16  K. Lee et al.  16. Rogez, G., Rihan, J., Ramalingam, S., Orrite, C., Torr, P.H.: Randomized trees for human pose detection. In: Computer Vision and Pattern Recognition, 2008. CVPR 2008. IEEE Conference on, IEEE (2008) 1-8 1, 3  17. Li, S., Chan, A.B.: 3d human pose estimation from monocular images with deep convolutional neural network. In: Asian Conference on Computer Vision, Springer (2014) 332-347 1, 3  18. Grinciunaite, A., Gudi, A., Tasli, E., den Uyl, M.: Human pose estimation in space and time using 3d cnn. In: Computer Vision-ECCV 2016 Workshops, Springer (2016) 32-39 1, 3, 9, 10, 13  19. Pavlakos, G., Zhou, X., Derpanis, K.G., Daniilidis, K.: Coarse-to-fine volumetric In: Computer Vision and Pattern  prediction for single-image 3D human pose. Recognition (CVPR). (2017) 1, 3, 9, 10  20. Sigal, L., Balan, A.O., Black, M.J.: Humaneva: Synchronized video and motion capture dataset and baseline algorithm for evaluation of articulated human motion. International journal of computer vision 87(1) (2010) 4-27 1, 8, 9  21. Ionescu, C., Papava, D., Olaru, V., Sminchisescu, C.: Human3. 6m: Large scale datasets and predictive methods for 3d human sensing in natural environments. IEEE transactions on pattern analysis and machine intelligence 36(7) (2014) 1325- 1339 1, 2, 8, 9  22. Chen, C.H., Ramanan, D.: 3d human pose estimation= 2d pose estimation+  matching. In: CVPR. Volume 2. (2017) 6 1, 3, 4, 9, 10  23. Yasin, H., Iqbal, U., Kruger, B., Weber, A., Gall, J.: A dual-source approach for 3d pose estimation from a single image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 4948-4956 1, 3, 4, 9, 10, 11 24. Tome, D., Russell, C., Agapito, L.: Lifting from the deep: Convolutional 3d pose estimation from a single image. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017) 1, 3, 4, 6, 9, 10, 11  25. Bugra Tekin, Isinsu Katircioglu, M.S.V.L., Fua, P.: Structured prediction of 3d hu- man pose with deep neural networks. In Richard C. Wilson, E.R.H., Smith, W.A.P., eds.: Proceedings of the British Machine Vision Conference (BMVC), BMVA Press (September 2016) 130.1-130.11 1, 3, 4  26. Lin, M., Lin, L., Liang, X., Wang, K., Chen, H.: Recurrent 3d pose sequence  machines. In: CVPR. (2017) 1, 3, 4, 5, 6, 9, 10, 11, 13  27. Martinez, J., Hossain, R., Romero, J., Little, J.J.: A simple yet eﬀective baseline for 3d human pose estimation. In: IEEE International Conference on Computer Vision. Volume 206. (2017) 3 1, 3, 4, 9, 10, 11  28. Zhou, X., Huang, Q., Sun, X., Xue, X., Wei, Y.: Towards 3d human pose estimation in the wild: a weakly-supervised approach. In: IEEE International Conference on Computer Vision. (2017) 1, 9, 10  29. Moreno-Noguer, F.: 3d human pose estimation from a single image via distance In: 2017 IEEE Conference on Computer Vision and Pattern  matrix regression. Recognition (CVPR), IEEE (2017) 1561-1570 1, 3, 4, 6, 9, 10  30. Bogo, F., Kanazawa, A., Lassner, C., Gehler, P., Romero, J., Black, M.J.: Keep it smpl: Automatic estimation of 3d human pose and shape from a single image. In: European Conference on Computer Vision, Springer (2016) 561-578 1, 3, 4 31. Sun, X., Shang, J., Liang, S., Wei, Y.: Compositional human pose regression. In: The IEEE International Conference on Computer Vision (ICCV). Volume 2. (2017) 2, 4, 6, 9, 10, 11  32. Westoby, M., Brasington, J., Glasser, N., Hambrey, M., Reynolds, J.: structure- from-motionphotogrammetry: A low-cost, eﬀective tool for geoscience applications. Geomorphology 179 (2012) 300-314 3   Propagating LSTM: 3D Pose Estimation based on Joint Interdependency33. Lee, S.H., Kang, J., Lee, S.: Enhanced particle-filtering framework for vessel seg- mentation and tracking. Computer methods and programs in biomedicine 148 (2017) 99-112 3  34. Oh, H., Kim, J., Kim, J., Kim, T., Lee, S., Bovik, A.C.: Enhancement of visual comfort and sense of presence on stereoscopic 3d images. IEEE Transactions on Image Processing 26(8) (2017) 3789-3801 3  35. Lee, K., Lee, S.: A new framework for measuring 2d and 3d visual information in terms of entropy. IEEE Trans. Circuits Syst. Video Techn. 26(11) (2016) 2015- 2027 3  36. Oh, H., Lee, S., Bovik, A.C.: Stereoscopic 3d visual discomfort prediction: A dynamic accommodation and vergence interaction model. IEEE Transactions on Image Processing 25(2) (2016) 615-629 3  37. Loper, M., Mahmood, N., Romero, J., Pons-Moll, G., Black, M.J.: Smpl: A skinned multi-person linear model. ACM Transactions on Graphics (TOG) 34(6) (2015) 248 4  38. Lee, I., Kim, D., Kang, S., Lee, S.: Ensemble deep learning for skeleton-based action In: 2017 IEEE International  recognition using temporal sliding lstm networks. Conference on Computer Vision (ICCV), IEEE (2017) 1012-1020 5  39. Toshev, A., Szegedy, C.: Deeppose: Human pose estimation via deep neural net- works. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2014) 1653-1660 6  40. Duchi, J., Hazan, E., Singer, Y.: Adaptive subgradient methods for online learning and stochastic optimization. Journal of Machine Learning Research 12(Jul) (2011) 2121-2159 8  41. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., et al.: Tensorﬂow: A system for large-scale machine learning. In: OSDI. Volume 16. (2016) 265-283 8  42. Andriluka, M., Pishchulin, L., Gehler, P., Schiele, B.: 2d human pose estimation: New benchmark and state of the art analysis. In: Proceedings of the IEEE Con- ference on computer Vision and Pattern Recognition. (2014) 3686-3693 8  43. Rogez, G., Schmid, C.: Mocap-guided data augmentation for 3d pose estimation in the wild. In: Advances in Neural Information Processing Systems. (2016) 3108- 3116 9, 10, 11  44. Hossain, M.R.I.: Understanding the sources of error for 3D human pose estimation from monocular images and videos. PhD thesis, University of British Columbia (2017) 9, 10, 13  45. Gower, J.C.: Generalized procrustes analysis. Psychometrika 40(1) (1975) 33-5146. Radwan, I., Dhall, A., Goecke, R.: Monocular image 3d human pose estimation In: Proceedings of the IEEE International Conference on  under self-occlusion. Computer Vision. (2013) 1888-1895 9, 11  47. Simo-Serra, E., Quattoni, A., Torras, C., Moreno-Noguer, F.: A joint model for In: Proceedings of the IEEE 2d and 3d pose estimation from a single image. Conference on Computer Vision and Pattern Recognition. (2013) 3634-3641 9, 11 48. Kostrikov, I., Gall, J.: Depth sweep regression forests for estimating 3d human  pose from images. In: BMVC. Volume 1. (2014) 5 9, 11  49. Tekin, B., Rozantsev, A., Lepetit, V., Fua, P.: Direct prediction of 3d body poses from motion compensated sequences. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 991-1000 9, 11"}