{"1": "1. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein gan. ICLR (2017) 2. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Semantic im- age segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  3. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. pp. 3213-3223 (2016)  4. Dai, W., Doyle, J., Liang, X., Zhang, H., Dong, N., Li, Y., Xing, E.P.: Scan: Struc- ture correcting adversarial network for chest x-rays organ segmentation. arXiv preprint arXiv:1703.08770 (2017)  5. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierar-  chical image database. In: CVPR. pp. 248-255 (2009)  6. Deng, Z., Zhang, H., Liang, X., Yang, L., Xu, S., Zhu, J., Xing, E.P.: Structured generative adversarial networks. In: Advances in Neural Information Processing Systems. pp. 3899- 3909 (2017)  7. Donahue, J., Kr¨ahenb¨uhl, P., Darrell, T.: Adversarial feature learning. arXiv preprint  arXiv:1605.09782 (2016)  8. Dumoulin, V., Belghazi, I., Poole, B., Lamb, A., Arjovsky, M., Mastropietro, O., Courville,  A.: Adversarially learned inference. arXiv preprint arXiv:1606.00704 (2016)  9. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville,  A., Bengio, Y.: Generative adversarial nets. In: NIPS. pp. 2672-2680 (2014)  10. Gregor, K., Danihelka, I., Graves, A., Rezende, D.J., Wierstra, D.: Draw: A recurrent neural  network for image generation. arXiv preprint arXiv:1502.04623 (2015)  11. Hoffer, E., Hubara, I., Ailon, N.: Deep unsupervised learning through spatial contrasting.  arXiv preprint arXiv:1610.00243 (2016)  12. Hu, Z., Yang, Z., Liang, X., Salakhutdinov, R., Xing, E.P.: Controllable text generation. arxiv  preprint. arXiv preprint arXiv:1703.00955 7 (2017)  13. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with conditional ad-  versarial networks. arXiv preprint arXiv:1611.07004 (2016)  14. Jaderberg, M., Simonyan, K., Zisserman, A., et al.: Spatial transformer networks. In: NIPS.  15. Johnson, J., Alahi, A., Fei-Fei, L.: Perceptual losses for real-time style transfer and super-  16. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  pp. 2017-2025 (2015)  resolution. In: ECCV. pp. 694-711 (2016)  arXiv:1412.6980 (2014)  for small object detection. CVPR (2017)  paragraph generation. ICCV (2017)  17. Li, J., Liang, X., Wei, Y., Xu, T., Feng, J., Yan, S.: Perceptual generative adversarial networks  18. Liang, X., Hu, Z., Zhang, H., Gan, C., Xing, E.P.: Recurrent topic-transition gan for visual  19. Liang, X., Lee, L., Dai, W., Xing, E.P.: Dual motion gan for future-ﬂow embedded video prediction. In: IEEE International Conference on Computer Vision (ICCV). vol. 1 (2017)   14  X. Liang, T. Wang, L. Yang and E. Xing  attentive regions via attention modeling. This paper pushes forward the research of un- supervised setting by demonstrating the possibility of manipulating high-level object semantics rather than the low-level color and texture changes as previous works did. In addition, it would be more interesting to develop techniques that are able to manipulate object interactions and activities in images/videos.  References  1. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein gan. ICLR (2017) 2. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Semantic im- age segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  3. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. pp. 3213-3223 (2016)  4. Dai, W., Doyle, J., Liang, X., Zhang, H., Dong, N., Li, Y., Xing, E.P.: Scan: Struc- ture correcting adversarial network for chest x-rays organ segmentation. arXiv preprint arXiv:1703.08770 (2017)  5. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierar-  chical image database. In: CVPR. pp. 248-255 (2009)  6. Deng, Z., Zhang, H., Liang, X., Yang, L., Xu, S., Zhu, J., Xing, E.P.: Structured generative adversarial networks. In: Advances in Neural Information Processing Systems. pp. 3899- 3909 (2017)  7. Donahue, J., Kr¨ahenb¨uhl, P., Darrell, T.: Adversarial feature learning. arXiv preprint  arXiv:1605.09782 (2016)  8. Dumoulin, V., Belghazi, I., Poole, B., Lamb, A., Arjovsky, M., Mastropietro, O., Courville,  A.: Adversarially learned inference. arXiv preprint arXiv:1606.00704 (2016)  9. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville,  A., Bengio, Y.: Generative adversarial nets. In: NIPS. pp. 2672-2680 (2014)  10. Gregor, K., Danihelka, I., Graves, A., Rezende, D.J., Wierstra, D.: Draw: A recurrent neural  network for image generation. arXiv preprint arXiv:1502.04623 (2015)  11. Hoffer, E., Hubara, I., Ailon, N.: Deep unsupervised learning through spatial contrasting.  arXiv preprint arXiv:1610.00243 (2016)  12. Hu, Z., Yang, Z., Liang, X., Salakhutdinov, R., Xing, E.P.: Controllable text generation. arxiv  preprint. arXiv preprint arXiv:1703.00955 7 (2017)  13. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with conditional ad-  versarial networks. arXiv preprint arXiv:1611.07004 (2016)  14. Jaderberg, M., Simonyan, K., Zisserman, A., et al.: Spatial transformer networks. In: NIPS.  15. Johnson, J., Alahi, A., Fei-Fei, L.: Perceptual losses for real-time style transfer and super-  16. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  pp. 2017-2025 (2015)  resolution. In: ECCV. pp. 694-711 (2016)  arXiv:1412.6980 (2014)  for small object detection. CVPR (2017)  paragraph generation. ICCV (2017)  17. Li, J., Liang, X., Wei, Y., Xu, T., Feng, J., Yan, S.: Perceptual generative adversarial networks  18. Liang, X., Hu, Z., Zhang, H., Gan, C., Xing, E.P.: Recurrent topic-transition gan for visual  19. Liang, X., Lee, L., Dai, W., Xing, E.P.: Dual motion gan for future-ﬂow embedded video prediction. In: IEEE International Conference on Computer Vision (ICCV). vol. 1 (2017)   Generative Semantic Manipulation with Mask-Contrasting GANe20. Liang, X., Shen, X., Feng, J., Lin, L., Yan, S.: Semantic object parsing with graph lstm. In:  European Conference on Computer Vision. pp. 125-143. Springer (2016)  21. Liang, X., Wei, Y., Shen, X., Jie, Z., Feng, J., Lin, L., Yan, S.: Reversible recursive instance- level object segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 633-641 (2016)  22. Liang, X., Zhou, H., Xing, E.: Dynamic-structured semantic propagation network. In: Pro- ceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 752-761 (2018)  23. Lin, L., Wang, G., Zhang, R., Zhang, R., Liang, X., Zuo, W.: Deep structured scene parsing by learning with image descriptions. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2276-2284 (2016)  24. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick,  C.L.: Microsoft coco: Common objects in context. In: ECCV. pp. 740-755 (2014)  25. Liu, M.Y., Breuel, T., Kautz, J.: Unsupervised image-to-image translation networks. arXiv  preprint arXiv:1703.00848 (2017)  26. Liu, M.Y., Tuzel, O.: Coupled generative adversarial networks. In: NIPS. pp. 469-477 (2016) 27. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation.  In: CVPR. pp. 3431-3440 (2015)  28. Mao, X., Li, Q., Xie, H., Lau, R.Y., Wang, Z.: Multi-class generative adversarial networks  with the l2 loss function. arXiv preprint arXiv:1611.04076 (2016)  29. Mirza, M., Osindero, S.: Conditional generative adversarial nets. arXiv preprint  arXiv:1411.1784 (2014)  30. Pathak, D., Krahenbuhl, P., Donahue, J., Darrell, T., Efros, A.A.: Context encoders: Feature  learning by inpainting. In: CVPR. pp. 2536-2544 (2016)  31. Qi, G.J.: Loss-sensitive generative adversarial networks on lipschitz densities. arXiv preprint  arXiv:1701.06264 (2017)  32. Radford, A., Metz, L., Chintala, S.: Unsupervised representation learning with deep convo-  lutional generative adversarial networks. arXiv preprint arXiv:1511.06434 (2015)  33. Reed, S., Akata, Z., Yan, X., Logeswaran, L., Schiele, B., Lee, H.: Generative adversarial  34. Reed, S.E., Akata, Z., Mohan, S., Tenka, S., Schiele, B., Lee, H.: Learning what and where  text to image synthesis. In: ICML (2016)  to draw. In: NIPS. pp. 217-225 (2016)  35. Salimans, T., Goodfellow, I., Zaremba, W., Cheung, V., Radford, A., Chen, X.: Improved  techniques for training gans. arXiv preprint arXiv:1606.03498 (2016)  36. Sangkloy, P., Lu, J., Fang, C., Yu, F., Hays, J.: Scribbler: Controlling deep image synthesis  with sketch and color. In: CVPR (2017)  37. Schroff, F., Kalenichenko, D., Philbin, J.: Facenet: A unified embedding for face recognition  and clustering. In: CVPR. pp. 815-823 (2015)  38. Shrivastava, A., Pfister, T., Tuzel, O., Susskind, J., Wang, W., Webb, R.: Learning from sim-  ulated and unsupervised images through adversarial training. In: CVPR (2017)  39. Wang, H., Liang, X., Zhang, H., Yeung, D.Y., Xing, E.P.: Zm-net: Real-time zero-shot image  manipulation network. arXiv preprint arXiv:1703.07255 (2017)  40. Wei, Y., Feng, J., Liang, X., Cheng, M.M., Zhao, Y., Yan, S.: Object region mining with adversarial erasing: A simple classification to semantic segmentation approach. In: IEEE CVPR. vol. 1, p. 3 (2017)  41. Yan, X., Yang, J., Sohn, K., Lee, H.: Attribute2image: Conditional image generation from  visual attributes. In: ECCV. pp. 776-791 (2016)  42. Yang, L., Liang, X., Xing, E.: Unsupervised real-to-virtual domain unification for end-to-end  highway driving. arXiv preprint arXiv:1801.03458 (2018)  43. Yi, Z., Zhang, H., Gong, P.T., et al.: Dualgan: Unsupervised dual learning for image-to-image  translation. In: ICCV (2017)   16  X. Liang, T. Wang, L. Yang and E. Xing  44. Zhang, H., Xu, T., Li, H., Zhang, S., Huang, X., Wang, X., Metaxas, D.: Stackgan: Text to photo-realistic image synthesis with stacked generative adversarial networks. In: ICCV (2017)  45. Zhu, J.Y., Kr¨ahenb¨uhl, P., Shechtman, E., Efros, A.A.: Generative visual manipulation on the  natural image manifold. In: ECCV. pp. 597-613 (2016)  46. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation using cycle-  consistent adversarial networks. In: ICCV (2017)"}