{"1": "1. Yalin Xiong and Kenneth Turkowski. Creating image-based vr using a self- calibrating fisheye lens. In Computer Vision and Pattern Recognition, 1997. Pro- ceedings., 1997 IEEE Computer Society Conference on, pages 237-243. IEEE, 1997. 2. Jason Orlosky, Qifan Wu, Kiyoshi Kiyokawa, Haruo Takemura, and Christian Nitschke. Fisheye vision: peripheral spatial compression for improved field of view in head mounted displays. In Proceedings of the 2nd ACM symposium on Spatial user interaction, pages 54-61. ACM, 2014.   14  Yin et al.  Table 2. Run times of diﬀerent algorithms on our test dataset.  Methods  Average run time (seconds)  Bukhari [10]  62.53 (Intel i5-4200U CPU)  Zhang [15]  80.07 (Intel i5-4200U CPU)  Rong [18]  0.87 (K80 GPU)  Proposed method  1.26 (K80 GPU)  5 Conclusions  We devise a multi-context collaborative deep network for single fisheye image rec- tification. Unlike existing methods that mainly focus on extracting hand-crafted features from the input distorted images, which have limited expressive power and are often unreliable, our method learns both high-level semantic and low- level appearance information for distortion parameter estimation. Our network consists of three collaborative sub-networks and is end-to-end trainable. A dis- tortion rectification layer is designed to perform rectification on both the input fisheye image and corresponding scene parsing results. For training, we construct a synthesized dataset covering a wide range of scenes and distortion parameters. We demonstrate that our approach outperforms state of the art models on the synthesized and real fisheye images, both qualitatively and quantitatively.  In our further work, we will extend this framework to handle other distortion correction tasks like the general radial lens distortion correction. Also, we will explore to handle unseen semantic classes for rectification.  6 Acknowledgment  This work is partially supported by Australian Research Council Projects (FL- 170100117, DP-180103424 and LP-150100671), National Natural Science Foun- dation of China (Grant No. 61405252) and State Scholarship Fund of China (Grant No. 201503170310). .  References  1. Yalin Xiong and Kenneth Turkowski. Creating image-based vr using a self- calibrating fisheye lens. In Computer Vision and Pattern Recognition, 1997. Pro- ceedings., 1997 IEEE Computer Society Conference on, pages 237-243. IEEE, 1997. 2. Jason Orlosky, Qifan Wu, Kiyoshi Kiyokawa, Haruo Takemura, and Christian Nitschke. Fisheye vision: peripheral spatial compression for improved field of view in head mounted displays. In Proceedings of the 2nd ACM symposium on Spatial user interaction, pages 54-61. ACM, 2014.   Multi-Context Collaborative Deep Network for Fisheye Image Rectification3. Marius Drulea, Istvan Szakats, Andrei Vatavu, and Sergiu Nedevschi. Omnidirec- tional stereo vision using fisheye lenses. In Intelligent Computer Communication and Processing (ICCP), 2014 IEEE International Conference on, pages 251-258. IEEE, 2014.  4. Philip DeCamp, George Shaw, Rony Kubat, and Deb Roy. An immersive system for browsing and visualizing surveillance video. In Proceedings of the 18th ACM international conference on Multimedia, pages 371-380. ACM, 2010.  5. C Hughes, M Glavin, E Jones, and P Denny. Wide-angle camera technology for automotive applications: a review. IET Intelligent Transport Systems, 3(1):19-31, 2009.  6. Stefan K Gehrig. Large-field-of-view stereo for automotive applications. In Proc. of Workshop on Omnidirectional Vision, Camera Networks and Nonclassical cameras (OMNIVIS2005), 2005.  7. Shishir Shah and JK Aggarwal. Depth estimation using stereo fish-eye lenses. In Image Processing, 1994. Proceedings. ICIP-94., IEEE International Conference, volume 2, pages 740-744. IEEE, 1994.  8. Jie Sun and Jinhui Zhu. Calibration and correction for omnidirectional image with a fisheye lens. In Natural Computation, 2008. ICNC’08. Fourth International Conference on, volume 6, pages 133-137. IEEE, 2008.  9. Xiang Mei, Sen Yang, Jiangpeng Rong, Xianghua Ying, Shiyao Huang, and Hong- bin Zha. Radial lens distortion correction using cascaded one-parameter division model. In Image Processing (ICIP), 2015 IEEE International Conference on, pages 3615-3619. IEEE, 2015.  10. Faisal Bukhari and Matthew N Dailey. Automatic radial distortion estimation from a single image. Journal of mathematical imaging and vision, 45(1):31-45, 2013.  11. Rui Melo, Michel Antunes, Jo˜ao Pedro Barreto, Gabriel Falcao, and Nuno Goncalves. Unsupervised intrinsic calibration from a single frame using a. In Pro- ceedings of the IEEE International Conference on Computer Vision, pages 537-544, 2013.  12. Ciaran Hughes, Patrick Denny, Martin Glavin, and Edward Jones. Equidistant fish- eye calibration and rectification by vanishing point extraction. IEEE Transactions on Pattern Analysis and Machine Intelligence, 32(12):2289-2296, 2010.  13. Edward Rosten and Rohan Loveland. Camera distortion self-calibration using the plumb-line constraint and minimal hough entropy. Machine Vision and Applica- tions, 22(1):77-85, 2011.  14. Xianghua Ying and Zhanyi Hu. Can we consider central catadioptric cameras and fisheye cameras within a unified imaging model. Computer Vision-ECCV 2004, pages 442-455, 2004.  15. Mi Zhang, Jian Yao, Menghan Xia, Kai Li, Yi Zhang, and Yaping Liu. Line-based multi-label energy optimization for fisheye image rectification and calibration. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 4137-4145, 2015.  16. Bolei Zhou, Hang Zhao, Xavier Puig, Sanja Fidler, Adela Barriuso, and Antonio Torralba. Semantic understanding of scenes through the ade20k dataset. arXiv preprint arXiv:1608.05442, 2016.  17. P Brand, R Mohr, and P Bobet. Distorsions optiques: correction dans un mod le  projectif. 9dine congr˜ s AFCET RFIA, pages 87-98, 1993.  18. Jiangpeng Rong, Shiyao Huang, Zeyu Shang, and Xianghua Ying. Radial lens distortion correction using convolutional neural networks trained with synthesized images. In Asian Conference on Computer Vision, pages 35-49. Springer, 2016.   16  Yin et al.  19. Ding Liu, Bihan Wen, Xianming Liu, and Thomas S Huang. When image de- noising meets high-level vision tasks: A deep learning approach. arXiv preprint arXiv:1706.04284, 2017.  20. Yi-Hsuan Tsai, Xiaohui Shen, Zhe Lin, Kalyan Sunkavalli, Xin Lu, and Ming-Hsuan  Yang. Deep image harmonization. arXiv preprint arXiv:1703.00069, 2017.  21. Liangqiong Qu, Jiandong Tian, Shengfeng He, Yandong Tang, and Rynson WH Lau. Deshadownet: A multi-context embedding deep network for shadow removal. 22. Juho Kannala and Sami Brandt. A generic camera calibration method for fish- In Pattern Recognition, 2004. ICPR 2004. Proceedings of the 17th  eye lenses. International Conference on, volume 1, pages 10-13. IEEE, 2004.  23. Karen Simonyan and Andrew Zisserman. Very deep convolutional networks for  large-scale image recognition. arXiv preprint arXiv:1409.1556, 2014.  24. Sergey Ioﬀe and Christian Szegedy. Batch normalization: Accelerating deep net- work training by reducing internal covariate shift. In International Conference on Machine Learning, pages 448-456, 2015.  25. Nitish Srivastava, Geoﬀrey E Hinton, Alex Krizhevsky, Ilya Sutskever, and Ruslan Salakhutdinov. Dropout: a simple way to prevent neural networks from overfitting. Journal of machine learning research, 15(1):1929-1958, 2014.  26. Yangqing Jia, Evan Shelhamer, Jeﬀ Donahue, Sergey Karayev, Jonathan Long, Ross Girshick, Sergio Guadarrama, and Trevor Darrell. Caﬀe: Convolutional archi- tecture for fast feature embedding. In Proceedings of the 22nd ACM international conference on Multimedia, pages 675-678. ACM, 2014.  27. John Duchi, Elad Hazan, and Yoram Singer. Adaptive subgradient methods for online learning and stochastic optimization. Journal of Machine Learning Research, 12(Jul):2121-2159, 2011."}