{"1": "1. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale image recog-  nition. CoRR abs/1409.1556 (2014)  2. Shelhamer, E., Long, J., Darrell, T.: Fully convolutional networks for semantic segmentation.  3. Larsson, G., Maire, M., Shakhnarovich, G.: Colorization as a proxy task for visual under-  4. Zhang, R., Isola, P., Efros, A.A.: Colorful image colorization. In: ECCV. (2016) 5. Noroozi, M., Favaro, P.: Unsupervised learning of visual representations by solving jigsaw  TPAMI (2017)  standing. In: CVPR. (2017)  puzzles. In: ECCV. (2016)  ICCV. (2015)  6. Wang, X., Gupta, A.: Unsupervised learning of visual representations using videos.  In:  7. Agrawal, P., Carreira, J., Malik, J.: Learning to see by moving. In: CVPR. (2015) 8. Pathak, D., Girshick, R.B., Doll´ar, P., Darrell, T., Hariharan, B.: Learning features by watch-  9. Misra, I., Zitnick, C.L., Hebert, M.: Unsupervised learning using sequential verification for  ing objects move. In: CVPR. (2017)  action recognition. In: ECCV. (2016)  learning by inpainting. In: CVPR. (2016)  videos. In: ACCV. (2016) 248-263  10. Pathak, D., Kr¨ahenb¨uhl, P., Donahue, J., Darrell, T., Efros, A.: Context encoders: Feature  11. Gao, R., Jayaraman, D., Grauman, K.: Object-centric representation learning from unlabeled  12. Owens, A., Wu, J., McDermott, J.H., Freeman, W.T., Torralba, A.: Ambient sound provides  supervision for visual learning. In: ECCV. (2016)  13. Lee, H., Huang, J., Singh, M., Yang, M.: Unsupervised representation learning by sorting  sequences. In: ICCV. (2017)  14. Bideau, P., Learned-Miller, E.: It’s moving! A probabilistic model for causal motion seg-  mentation in moving camera videos. In: ECCV. (2016)  15. Jayaraman, D., Grauman, K.: Learning image representations tied to ego-motion. In: ICCV.  16. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the KITTI vision  (2015) 1413-1421  benchmark suite. In: CVPR. (2012)  17. Geiger, A., Lenz, P., Stiller, C., Urtasun, R.: Vision meets robotics: The KITTI dataset.  International Journal of Robotics Research (IJRR) (2013)  18. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. (2016)  19. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A large-scale hierar-  chical image database. CVPR (2009)  20. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: CVPR.  21. Larsson, G., Maire, M., Shakhnarovich, G.: Learning representations for automatic coloriza-  (2016)  tion. In: ECCV. (2016)  22. Ranzato, M., Szlam, A., Bruna, J., Mathieu, M., Collobert, R., Chopra, S.: Video (language) modeling: a baseline for generative models of natural videos. arXiv preprint arXiv:1412.6604 (2014)  23. Srivastava, N., Mansimov, E., Salakhutdinov, R.: Unsupervised learning of video represen-  tations using lstms. In: ICML. (2015)  24. Mathieu, M., Couprie, C., LeCun, Y.: Deep multi-scale video prediction beyond mean square  error. arXiv preprint arXiv:1511.05440 (2015)   Self-Supervised Relative Depth Learning for Urban Scene UnderstandingReferences  1. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale image recog-  nition. CoRR abs/1409.1556 (2014)  2. Shelhamer, E., Long, J., Darrell, T.: Fully convolutional networks for semantic segmentation.  3. Larsson, G., Maire, M., Shakhnarovich, G.: Colorization as a proxy task for visual under-  4. Zhang, R., Isola, P., Efros, A.A.: Colorful image colorization. In: ECCV. (2016) 5. Noroozi, M., Favaro, P.: Unsupervised learning of visual representations by solving jigsaw  TPAMI (2017)  standing. In: CVPR. (2017)  puzzles. In: ECCV. (2016)  ICCV. (2015)  6. Wang, X., Gupta, A.: Unsupervised learning of visual representations using videos.  In:  7. Agrawal, P., Carreira, J., Malik, J.: Learning to see by moving. In: CVPR. (2015) 8. Pathak, D., Girshick, R.B., Doll´ar, P., Darrell, T., Hariharan, B.: Learning features by watch-  9. Misra, I., Zitnick, C.L., Hebert, M.: Unsupervised learning using sequential verification for  ing objects move. In: CVPR. (2017)  action recognition. In: ECCV. (2016)  learning by inpainting. In: CVPR. (2016)  videos. In: ACCV. (2016) 248-263  10. Pathak, D., Kr¨ahenb¨uhl, P., Donahue, J., Darrell, T., Efros, A.: Context encoders: Feature  11. Gao, R., Jayaraman, D., Grauman, K.: Object-centric representation learning from unlabeled  12. Owens, A., Wu, J., McDermott, J.H., Freeman, W.T., Torralba, A.: Ambient sound provides  supervision for visual learning. In: ECCV. (2016)  13. Lee, H., Huang, J., Singh, M., Yang, M.: Unsupervised representation learning by sorting  sequences. In: ICCV. (2017)  14. Bideau, P., Learned-Miller, E.: It’s moving! A probabilistic model for causal motion seg-  mentation in moving camera videos. In: ECCV. (2016)  15. Jayaraman, D., Grauman, K.: Learning image representations tied to ego-motion. In: ICCV.  16. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the KITTI vision  (2015) 1413-1421  benchmark suite. In: CVPR. (2012)  17. Geiger, A., Lenz, P., Stiller, C., Urtasun, R.: Vision meets robotics: The KITTI dataset.  International Journal of Robotics Research (IJRR) (2013)  18. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. (2016)  19. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A large-scale hierar-  chical image database. CVPR (2009)  20. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: CVPR.  21. Larsson, G., Maire, M., Shakhnarovich, G.: Learning representations for automatic coloriza-  (2016)  tion. In: ECCV. (2016)  22. Ranzato, M., Szlam, A., Bruna, J., Mathieu, M., Collobert, R., Chopra, S.: Video (language) modeling: a baseline for generative models of natural videos. arXiv preprint arXiv:1412.6604 (2014)  23. Srivastava, N., Mansimov, E., Salakhutdinov, R.: Unsupervised learning of video represen-  tations using lstms. In: ICML. (2015)  24. Mathieu, M., Couprie, C., LeCun, Y.: Deep multi-scale video prediction beyond mean square  error. arXiv preprint arXiv:1511.05440 (2015)   16  Jiang, Larsson, Maire, Shakhnarovich and Learned-Miller  25. Vondrick, C., Pirsiavash, H., Torralba, A.: Generating videos with scene dynamics. In: NIPS.  (2016)  26. Xue, T., Wu, J., Bouman, K., Freeman, B.: Visual dynamics: Probabilistic future frame  synthesis via cross convolutional networks. In: NIPS. (2016)  27. Lotter, W., Kreiman, G., Cox, D.: Deep predictive coding networks for video prediction and  unsupervised learning. In: ICLR. (2017)  28. Radford, A., Metz, L., Chintala, S.: Unsupervised representation learning with deep convo-  lutional generative adversarial networks. (2016)  29. Springenberg, J.T.: Unsupervised and semi-supervised learning with categorical generative  adversarial networks. In: ICLR. (2016)  30. Donahue, J., Kr¨ahenb¨uhl, P., Darrell, T.: Adversarial feature learning. In: ICLR. (2017) 31. Doersch, C., Gupta, A., Efros, A.A.: Unsupervised visual representation learning by context  32. Mobahi, H., Collobert, R., Weston, J.: Deep learning from temporal coherence in video. In:  prediction. In: ICCV. (2015)  ICML. (2009)  33. Isola, P., Zoran, D., Krishnan, D., Adelson, E.H.:  Learning visual groups from co-  occurrences in space and time. arXiv preprint arXiv:1511.06811 (2015)  34. Jayaraman, D., Grauman, K.: Slow and steady feature analysis: higher order temporal co-  35. Wiskott, L., Sejnowski, T.J.: Slow feature analysis: Unsupervised learning of invariances.  herence in video. In: CVPR. (2016)  Neural computation 14(4) (2002) 715-770  36. Doersch, C., Zisserman, A.: Multi-task self-supervised visual learning. In: ICCV. (2017) 37. Wang, X., He, K., Gupta, A.: Transitive invariance for self-supervised visual representation  learning. In: ICCV. (2017)  38. Garg, R., Kumar, B.G.V., Carneiro, G., Reid, I.D.: Unsupervised CNN for single view depth  estimation: Geometry to the rescue. In: ECCV. (2016) 740-756  39. Godard, C., Mac Aodha, O., Brostow, G.J.: Unsupervised monocular depth estimation with  40. Zhou, T., Brown, M., Snavely, N., Lowe, D.G.: Unsupervised learning of depth and ego-  left-right consistency. In: CVPR. (2017)  motion from video. In: CVPR. (2017)  41. Vijayanarasimhan, S., Ricco, S., Schmid, C., Sukthankar, R., Fragkiadaki, K.: Sfm-net:  Learning of structure and motion from video. In: arXiv. (2017)  42. Li, Y., Paluri, M., Rehg, J.M., Doll´ar, P.: Unsupervised learning of edges. In: CVPR. (2016)  1619-1627  43. Horn, B.K.P.: Robot Vision. MIT Press, Cambridge, MA, USA (1986) 44. Hu, Y., Li, Y., Song, R.: Robust interpolation of correspondences for large displacement  optical ﬂow. In: CVPR. (2017)  45. Doll´ar, P., Zitnick, C.L.: Fast edge detection using structured forests. IEEE Trans. Pattern  46. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep convolutional  Anal. Mach. Intell. 37(8) (2015) 1558-1570  neural networks. In: NIPS. (2012) 1106-1114  47. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. In: ICLR. (2015) 48. Teichmann, M., Weber, M., Z¨ollner, J.M., Cipolla, R., Urtasun, R.: Multinet: Real-time joint  semantic reasoning for autonomous driving. In: CVPR. (2016)  49. Ros, G., Ramos, S., Granados, M., Bakhtiary, A., V´azquez, D., L´opez, A.M.: Vision-based  ofﬂine-online perception paradigm for autonomous driving. In: WACV. (2015)  50. Brostow, G.J., Shotton, J., Fauqueur, J., Cipolla, R.: Segmentation and recognition using  structure from motion point clouds. In: ECCV. (2008) 44-57  51. Brostow, G.J., Fauqueur, J., Cipolla, R.: Semantic object classes in video: A high-definition  ground truth database. Pattern Recognition Letters (2008)   Self-Supervised Relative Depth Learning for Urban Scene Understanding52. Zhang, R., Isola, P., Efros, A.A.: Split-brain autoencoders: Unsupervised learning by cross-  53. Kundu, A., Vineet, V., Koltun, V.: Feature space optimization for semantic video segmenta-  54. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomedical image  channel prediction. In: CVPR. (2017)  tion. In: CVPR. (2016)  segmentation. In: MICCAI. (2015)  scale deep network. In: NIPS. (2014)  55. Eigen, D., Puhrsch, C., Fergus, R.: Depth map prediction from a single image using a multi-  56. Liu, F., Shen, C., Lin, G., Reid, I.D.: Learning depth from single monocular images using  deep convolutional neural fields. IEEE TPAMI. 38(10) (2016) 2024-2039  57. Kuznietsov, Y., St¨uckler, J., Leibe, B.: Semi-supervised deep learning for monocular depth  map prediction. In: CVPR. (2017)"}