{"1": "(2016)  nition. In: ICLR. (2015)  1. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: CVPR.  2. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale image recog-  3. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: Towards real-time object detection  with region proposal networks. In: NIPS. (2015)  4. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recognition challenge. IJCV (2015)  5. Sun, C., Shrivastava, A., Singh, S., Gupta, A.: Revisiting unreasonable effectiveness of data  in deep learning era. In: ICCV, IEEE (2017) 843-852  6. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. (2016)  7. Papadopoulos, D.P., Uijlings, J.R., Keller, F., Ferrari, V.: Extreme clicking for efficient object  annotation. In: ICCV, IEEE (2017) 4940-4949  8. Papadopoulos, D.P., Clarke, A.D., Keller, F., Ferrari, V.: Training object class detectors from  eye tracking data. In: ECCV, Springer (2014) 361-376  9. Kolesnikov, A., Lampert, C.H.: Seed, expand and constrain: Three principles for weakly-  supervised image segmentation. In: ECCV. (2016)  10. Wei, Y., Feng, J., Liang, X., Cheng, M.M., Zhao, Y., Yan, S.: Object region mining with adversarial erasing: A simple classification to semantic segmentation approach. In: CVPR. (2017)  11. Papandreou, G., Chen, L., Murphy, K., Yuille, A.L.: Weakly- and semi-supervised learning  of a DCNN for semantic image segmentation. In: ICCV. (2015)  12. Dai, J., He, K., Sun, J.: Boxsup: Exploiting bounding boxes to supervise convolutional  networks for semantic segmentation. In: ICCV. (2015)  13. Bearman, A., Russakovsky, O., Ferrari, V., Fei-Fei, L.: What’s the point: Semantic segmen-  tation with point supervision. In: ECCV. (2016)  14. Forsyth, D.A., Malik, J., Fleck, M.M., Greenspan, H., Leung, T., Belongie, S., Carson, C., Bregler, C.: Finding pictures of objects in large collections of images. Springer (1996) 15. Adelson, E.H.: On seeing stuff: the perception of materials by humans and machines. In: Human vision and electronic imaging VI. Volume 4299., International Society for Optics and Photonics (2001) 1-13  16. Arnab, A., Torr, P.H.S.: Pixelwise instance segmentation with a dynamically instantiated  network. In: CVPR. (2017)  BMVC. (2016)  17. Arnab, A., Torr, P.H.S.: Bottom-up instance segmentation using deep higher-order crfs. In:  18. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual  object classes (voc) challenge. IJCV (2010)  19. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick,  C.L.: Microsoft coco: Common objects in context. In: ECCV. (2014)  20. Lin, D., Dai, J., Jia, J., He, K., Sun, J.: Scribblesup: Scribble-supervised convolutional net-  works for semantic segmentation. In: CVPR. (2016) 3159-3167  21. Kirillov, A., He, K., Girshick, R., Rother, C., Doll´ar, P.: Panoptic segmentation. In: arXiv  preprint arXiv:1801.00868. (2018)  22. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: ICCV. (2017)   Weakly- and Semi-Supervised Panoptic SegmentationReferences  (2016)  nition. In: ICLR. (2015)  1. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: CVPR.  2. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale image recog-  3. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: Towards real-time object detection  with region proposal networks. In: NIPS. (2015)  4. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recognition challenge. IJCV (2015)  5. Sun, C., Shrivastava, A., Singh, S., Gupta, A.: Revisiting unreasonable effectiveness of data  in deep learning era. In: ICCV, IEEE (2017) 843-852  6. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. (2016)  7. Papadopoulos, D.P., Uijlings, J.R., Keller, F., Ferrari, V.: Extreme clicking for efficient object  annotation. In: ICCV, IEEE (2017) 4940-4949  8. Papadopoulos, D.P., Clarke, A.D., Keller, F., Ferrari, V.: Training object class detectors from  eye tracking data. In: ECCV, Springer (2014) 361-376  9. Kolesnikov, A., Lampert, C.H.: Seed, expand and constrain: Three principles for weakly-  supervised image segmentation. In: ECCV. (2016)  10. Wei, Y., Feng, J., Liang, X., Cheng, M.M., Zhao, Y., Yan, S.: Object region mining with adversarial erasing: A simple classification to semantic segmentation approach. In: CVPR. (2017)  11. Papandreou, G., Chen, L., Murphy, K., Yuille, A.L.: Weakly- and semi-supervised learning  of a DCNN for semantic image segmentation. In: ICCV. (2015)  12. Dai, J., He, K., Sun, J.: Boxsup: Exploiting bounding boxes to supervise convolutional  networks for semantic segmentation. In: ICCV. (2015)  13. Bearman, A., Russakovsky, O., Ferrari, V., Fei-Fei, L.: What’s the point: Semantic segmen-  tation with point supervision. In: ECCV. (2016)  14. Forsyth, D.A., Malik, J., Fleck, M.M., Greenspan, H., Leung, T., Belongie, S., Carson, C., Bregler, C.: Finding pictures of objects in large collections of images. Springer (1996) 15. Adelson, E.H.: On seeing stuff: the perception of materials by humans and machines. In: Human vision and electronic imaging VI. Volume 4299., International Society for Optics and Photonics (2001) 1-13  16. Arnab, A., Torr, P.H.S.: Pixelwise instance segmentation with a dynamically instantiated  network. In: CVPR. (2017)  BMVC. (2016)  17. Arnab, A., Torr, P.H.S.: Bottom-up instance segmentation using deep higher-order crfs. In:  18. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual  object classes (voc) challenge. IJCV (2010)  19. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick,  C.L.: Microsoft coco: Common objects in context. In: ECCV. (2014)  20. Lin, D., Dai, J., Jia, J., He, K., Sun, J.: Scribblesup: Scribble-supervised convolutional net-  works for semantic segmentation. In: CVPR. (2016) 3159-3167  21. Kirillov, A., He, K., Girshick, R., Rother, C., Doll´ar, P.: Panoptic segmentation. In: arXiv  preprint arXiv:1801.00868. (2018)  22. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: ICCV. (2017)   16  Li⋆, Arnab⋆, and Torr  cades. In: CVPR. (2016)  tation. In: CVPR. (2017)  23. Dai, J., He, K., Sun, J.: Instance-aware semantic segmentation via multi-task network cas-  24. Li, Y., Qi, H., Dai, J., Ji, X., Wei, Y.: Fully convolutional instance-aware semantic segmen-  25. Liu, S., Qi, L., Qin, H., Shi, J., Jia, J.: Path aggregation network for instance segmentation.  In: arXiv preprint arXiv:1803.01534. (2018)  26. Liu, S., Qi, X., Shi, J., Zhang, H., Jia, J.: Multi-scale patch aggregation (mpa) for simultane-  ous detection and segmentation. In: CVPR. (2016)  27. Bai, M., Urtasun, R.: Deep watershed transform for instance segmentation. In: CVPR, IEEE  (2017) 2858-2866  28. De Brabandere, B., Neven, D., Van Gool, L.: Semantic instance segmentation with a dis-  criminative loss function. In: CVPR Workshop. (2017)  29. Kirillov, A., Levinkov, E., Andres, B., Savchynskyy, B., Rother, C.: Instancecut: from edges  to instances with multicut. In: CVPR. (2017)  30. Liu, S., Jia, J., Fidler, S., Urtasun, R.: Sgn: Sequential grouping networks for instance seg-  mentation. In: ICCV. (2017)  31. Wei, Y., Liang, X., Chen, Y., Shen, X., Cheng, M.M., Feng, J., Zhao, Y., Yan, S.: Stc: A simple to complex framework for weakly-supervised semantic segmentation. PAMI 39(11) (2017) 2314-2320  32. Oh, S.J., Benenson, R., Khoreva, A., Akata, Z., Fritz, M., Schiele, B.: Exploiting saliency  for object segmentation from image level labels. In: CVPR. (2017)  33. Chaudhry, A., Dokania, P.K., Torr, P.H.: Discovering class-specific pixels for weakly-  supervised semantic segmentation. In: BMVC. (2017)  34. Cheng, M.M., Mitra, N.J., Huang, X., Torr, P.H., Hu, S.M.: Global contrast based salient  region detection. PAMI 37(3) (2015) 569-582  35. Yang, C., Zhang, L., Lu, H., Ruan, X., Yang, M.H.: Saliency detection via graph-based  manifold ranking. In: CVPR, IEEE (2013) 3166-3173  36. Shi, J., Yan, Q., Xu, L., Jia, J.: Hierarchical image saliency detection on extended cssd.  37. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Simultaneous detection and segmenta-  38. Verbeek, J.J., Triggs, B.: Scene segmentation with crfs learned from partially labeled images.  39. He, X., Zemel, R.S.: Learning hybrid models for image annotation with partially labeled  40. Pinheiro, P.O., Collobert, R.: From image-level to pixel-level labeling with convolutional  PAMI 38(4) (2016) 717-729  tion. In: ECCV. (2014)  In: NIPS. (2008) 1553-1560  data. In: NIPS. (2009) 625-632  networks. In: CVPR. (2015)  41. Pathak, D., Krahenbuhl, P., Darrell, T.: Constrained convolutional neural networks for  weakly supervised segmentation. In: ICCV. (2015)  42. Khoreva, A., Benenson, R., Hosang, J., Hein, M., Schiele, B.: Simple does it: Weakly super-  vised instance and semantic segmentation. In: CVPR. (2017)  43. Scudder, H.: Probability of error of some adaptive pattern-recognition machines.  IEEE  Transactions on Information Theory 11(3) (1965) 363-371  44. Hu, R., Doll´ar, P., He, K., Darrell, T., Girshick, R.: Learning to segment every thing. In:  arXiv preprint arXiv:1711.10370. (2017)  45. Bansal, A., Chen, X., Russell, B., Gupta, A., Ramanan, D.: Pixelnet: Representation of the  pixels, by the pixels, and for the pixels. In: arXiv preprint arXiv:1702.06506. (2017)  46. Pohlen, T., Hermans, A., Mathias, M., Leibe, B.: Full-resolution residual networks for se-  mantic segmentation in street scenes. In: CVPR. (2017)  47. Li, Q., Arnab, A., Torr, P.H.: Holistic, instance-level human parsing. In: BMVC. (2017)   Weakly- and Semi-Supervised Panoptic Segmentation48. Rother, C., Kolmogorov, V., Blake, A.: Grabcut: Interactive foreground extraction using  49. Arbelaez, P., Pont-Tuset, J., Barron, J., Marques, F., Malik, J.: Multiscale combinatorial  iterated graph cuts. ACM TOG (2004)  grouping. In: CVPR. (2014)  50. Pont-Tuset, J., Arbelaez, P., Barron, J.T., Marques, F., Malik, J.: Multiscale combinatorial grouping for image segmentation and object proposal generation. PAMI 39(1) (2017) 128- 140  51. Zhou, B., Khosla, A., Lapedriza, A., Oliva, A., Torralba, A.: Learning deep features for  discriminative localization. In: CVPR, IEEE (2016) 2921-2929  52. Selvaraju, R.R., Cogswell, M., Das, A., Vedantam, R., Parikh, D., Batra, D.: Grad-cam:  Visual explanations from deep networks via gradient-based localization. In: ICCV. (2017)  53. Zhang, J., Lin, Z., Brandt, J., Shen, X., Sclaroff, S.: Top-down neural attention by excitation  backprop. In: ECCV, Springer (2016) 543-559  54. Kr¨ahenb¨uhl, P., Koltun, V.: Efficient inference in fully connected CRFs with Gaussian edge  potentials. In: NIPS. (2011)  55. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image seg-  mentation with deep convolutional nets and fully connected crfs. ICLR (2015)  56. Zheng, S., Jayasumana, S., Romera-Paredes, B., Vineet, V., Su, Z., Du, D., Huang, C., Torr,  P.: Conditional random fields as recurrent neural networks. In: ICCV. (2015)  57. Arnab, A., Zheng, S., Jayasumana, S., Romera-Paredes, B., Larsson, M., Kirillov, A., Savchynskyy, B., Rother, C., Kahl, F., Torr, P.H.S.: Conditional random fields meet deep neural networks for semantic segmentation: Combining probabilistic graphical models with deep learning for structured prediction. IEEE Signal Processing Magazine 35(1) (Jan 2018) 37-52  58. Hariharan, B., Arbel´aez, P., Bourdev, L., Maji, S., Malik, J.: Semantic contours from inverse  detectors. In: ICCV. (2011)  59. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In: CVPR. (2017) 60. Chen, L.C., Papandreou, G., Schroff, F., Adam, H.: Rethinking atrous convolution for se-  mantic image segmentation. In: arXiv preprint arXiv:1706.05587. (2017)  61. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Semantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915v2 (2016)  62. Huang, J., Rathod, V., Sun, C., Zhu, M., Korattikara, A., Fathi, A., Fischer, I., Wojna, Z., Song, Y., Guadarrama, S., et al.: Speed/accuracy trade-offs for modern convolutional object detectors. In: CVPR. (2017)  63. Yang, Y., Hallman, S., Ramanan, D., Fowlkes, C.C.: Layered object models for image seg-  mentation. PAMI (2012)  dling. In: CVPR. (2015)  64. Chen, Y.T., Liu, X., Yang, M.H.: Multi-instance object segmentation with occlusion han-  65. Liang, X., Wei, Y., Shen, X., Yang, J., Lin, L., Yan, S.: Proposal-free network for instance-  level object segmentation. arXiv preprint arXiv:1509.02636 (2015)  66. Arnab, A., Jayasumana, S., Zheng, S., Torr, P.H.S.: Higher order conditional random fields  in deep neural networks. In: ECCV. (2016)  67. Everingham, M., Eslami, S.A., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The  pascal visual object classes challenge: A retrospective. IJCV 111(1) (2015)  68. Uhrig, J., Cordts, M., Franke, U., Brox, T.: Pixel-level encoding and depth layering for  instance-level semantic labeling. In: GCPR. (2016)  69. Ren, M., Zemel, R.S.: End-to-end instance segmentation with recurrent attention. In: CVPR.  (2017)"}