{"1": "1. Andriluka, M., Roth, S., Schiele, B.: Monocular 3d pose estimation and tracking by detection. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 623-630 (2010)  2. Bogo, F., Kanazawa, A., Lassner, C., Gehler, P., Romero, J., Black, M.J.: Keep it SMPL: Automatic estimation of 3D human pose and shape from a single image. In: European Conference on Computer Vision (ECCV) (2016)  3. Bull, A.D.: Convergence rates of eﬃcient global optimization algorithms. Journal  of Machine Learning Research 12(Oct), 2879-2904 (2011)  4. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation using part aﬃnity fields. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  5. Gurobi Optimization, I.: Gurobi optimizer reference manual (2016) 6. Helten, T., Baak, A., Bharaj, G., Muller, M., Seidel, H.P., Theobalt, C.: Personal- ization and evaluation of a real-time depth-based full body tracker. In: 3D Vision (3DV) (2013)  7. Henschel, R., Leal-Taix´e, L., Cremers, D., Rosenhahn, B.: Fusion of head and full-body detectors for multi-object tracking. In: Computer Vision and Pattern Recognition Workshops (CVPRW) (2018)  8. Ionescu, C., Papava, D., Olaru, V., Sminchisescu, C.: Human3.6m: Large scale datasets and predictive methods for 3d human sensing in natural environments. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 36(7), 1325-1339 (2014)  9. Jahangiri, E., Yuille, A.L.: Generating multiple diverse hypotheses for human 3d pose consistent with 2d joint detections. In: IEEE International Conference on Computer Vision (ICCV) Workshops (PeopleCap) (2017)  10. Kanazawa, A., Black, M.J., Jacobs, D.W., Malik, J.: End-to-end recovery of hu- man shape and pose. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2018)  11. Lassner, C., Romero, J., Kiefel, M., Bogo, F., Black, M.J., Gehler, P.V.: Unite the people: Closing the loop between 3d and 2d human representations. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). vol. 2 (2017) 12. Levinkov, E., Uhrig, J., Tang, S., Omran, M., Insafutdinov, E., Kirillov, A., Rother, C., Brox, T., Schiele, B., Andres, B.: Joint graph decomposition & node labeling: Problem, algorithms, applications. In: CVPR. vol. 7. IEEE (2017)  13. Li, S., Zhang, W., Chan, A.B.: Maximum-margin structured learning with deep networks for 3d human pose estimation. In: IEEE International Conference on Computer Vision (ICCV). pp. 2848-2856 (2015)  14. Loper, M., Mahmood, N., Romero, J., Pons-Moll, G., Black, M.J.: SMPL: A skinned multi-person linear model. ACM Trans. Graphics 34(6), 248:1-248:16 (2015)  15. Loper, M.M., Mahmood, N., Black, M.J.: MoSh: Motion and shape capture from sparse markers. ACM Transactions on Graphics, (Proc. SIGGRAPH Asia) 33(6), 220:1-220:13 (2014)  16. Malleson, C., Volino, M., Gilbert, A., Trumble, M., Collomosse, J., Hilton, A.: Real- time full-body motion capture from video and imus. In: 2017 Fifth International Conference on 3D Vision (3DV) (2017)  17. von Marcard, T., Pons-Moll, G., Rosenhahn, B.: Human pose estimation from video and IMUs. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 38(8), 1533-1547 (2016)   Accurate 3D Human Pose Using IMUs and a Moving CameraReferences  1. Andriluka, M., Roth, S., Schiele, B.: Monocular 3d pose estimation and tracking by detection. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 623-630 (2010)  2. Bogo, F., Kanazawa, A., Lassner, C., Gehler, P., Romero, J., Black, M.J.: Keep it SMPL: Automatic estimation of 3D human pose and shape from a single image. In: European Conference on Computer Vision (ECCV) (2016)  3. Bull, A.D.: Convergence rates of eﬃcient global optimization algorithms. Journal  of Machine Learning Research 12(Oct), 2879-2904 (2011)  4. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation using part aﬃnity fields. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  5. Gurobi Optimization, I.: Gurobi optimizer reference manual (2016) 6. Helten, T., Baak, A., Bharaj, G., Muller, M., Seidel, H.P., Theobalt, C.: Personal- ization and evaluation of a real-time depth-based full body tracker. In: 3D Vision (3DV) (2013)  7. Henschel, R., Leal-Taix´e, L., Cremers, D., Rosenhahn, B.: Fusion of head and full-body detectors for multi-object tracking. In: Computer Vision and Pattern Recognition Workshops (CVPRW) (2018)  8. Ionescu, C., Papava, D., Olaru, V., Sminchisescu, C.: Human3.6m: Large scale datasets and predictive methods for 3d human sensing in natural environments. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 36(7), 1325-1339 (2014)  9. Jahangiri, E., Yuille, A.L.: Generating multiple diverse hypotheses for human 3d pose consistent with 2d joint detections. In: IEEE International Conference on Computer Vision (ICCV) Workshops (PeopleCap) (2017)  10. Kanazawa, A., Black, M.J., Jacobs, D.W., Malik, J.: End-to-end recovery of hu- man shape and pose. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2018)  11. Lassner, C., Romero, J., Kiefel, M., Bogo, F., Black, M.J., Gehler, P.V.: Unite the people: Closing the loop between 3d and 2d human representations. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). vol. 2 (2017) 12. Levinkov, E., Uhrig, J., Tang, S., Omran, M., Insafutdinov, E., Kirillov, A., Rother, C., Brox, T., Schiele, B., Andres, B.: Joint graph decomposition & node labeling: Problem, algorithms, applications. In: CVPR. vol. 7. IEEE (2017)  13. Li, S., Zhang, W., Chan, A.B.: Maximum-margin structured learning with deep networks for 3d human pose estimation. In: IEEE International Conference on Computer Vision (ICCV). pp. 2848-2856 (2015)  14. Loper, M., Mahmood, N., Romero, J., Pons-Moll, G., Black, M.J.: SMPL: A skinned multi-person linear model. ACM Trans. Graphics 34(6), 248:1-248:16 (2015)  15. Loper, M.M., Mahmood, N., Black, M.J.: MoSh: Motion and shape capture from sparse markers. ACM Transactions on Graphics, (Proc. SIGGRAPH Asia) 33(6), 220:1-220:13 (2014)  16. Malleson, C., Volino, M., Gilbert, A., Trumble, M., Collomosse, J., Hilton, A.: Real- time full-body motion capture from video and imus. In: 2017 Fifth International Conference on 3D Vision (3DV) (2017)  17. von Marcard, T., Pons-Moll, G., Rosenhahn, B.: Human pose estimation from video and IMUs. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 38(8), 1533-1547 (2016)   16  T. v. Marcard, R. Henschel, M. J. Black, B. Rosenhahn, G. Pons-Moll  18. Martinez, J., Hossain, R., Romero, J., Little, J.J.: A simple yet eﬀective baseline for 3d human pose estimation. In: IEEE International Conference on Computer Vision (ICCV) (2017)  19. Mehta, D., Rhodin, H., Casas, D., Fua, P., Sotnychenko, O., Xu, W., Theobalt, C.: Monocular 3d human pose estimation in the wild using improved cnn supervision. In: 3D Vision (3DV). IEEE (2017)  20. Mehta, D., Sotnychenko, O., Mueller, F., Xu, W., Sridhar, S., Pons-Moll, G., Theobalt, C.: Single-shot multi-person 3d body pose estimation from monocular rgb input. arXiv preprint arXiv:1712.03453 (2017)  21. Mehta, D., Sridhar, S., Sotnychenko, O., Rhodin, H., Shafiei, M., Seidel, H.P., Xu, W., Casas, D., Theobalt, C.: Vnect: Real-time 3d human pose estimation with a single rgb camera. ACM Transactions on Graphics (TOG) 36(4), 44 (2017) 22. Pavlakos, G., Zhu, L., Zhou, X., Daniilidis, K.: Learning to estimate 3D human pose and shape from a single color image. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (2018)  23. Pishchulin, L., Insafutdinov, E., Tang, S., Andres, B., Andriluka, M., Gehler, P., Schiele, B.: Deepcut: Joint subset partition and labeling for multi person pose estimation. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  24. Pons-Moll, G., Baak, A., Gall, J., Leal-Taix´e, L., Muller, M., Seidel, H.P., Rosen- hahn, B.: Outdoor human motion capture using inverse kinematics and von mises- fisher sampling. In: Proceedings of the 2011 International Conference on Computer Vision (ICCV). pp. 1243-1250 (2011)  25. Pons-Moll, G., Baak, A., Helten, T., M¨uller, M., Seidel, H.P., Rosenhahn, B.: Multisensor-fusion for 3d full-body human motion capture. In: The IEEE Confer- ence on Computer Vision and Pattern Recognition (CVPR). pp. 663-670 (2010)  26. Pons-Moll, G., Fleet, D.J., Rosenhahn, B.: Posebits for monocular human pose estimation. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2337-2344 (2014)  27. Pons-Moll, G., Pujades, S., Hu, S., Black, M.: ClothCap: Seamless 4D clothing cap- ture and retargeting. ACM Transactions on Graphics, (Proc. SIGGRAPH) 36(4) (2017)  28. Popa, A.I., Zanfir, M., Sminchisescu, C.: Deep multitask architecture for integrated 2d and 3d human sensing. The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  29. Rhodin, H., Sp¨orri, J., Katircioglu, I., Constantin, V., Meyer, F., M¨uller, E., Salz- mann, M., Fua, P.: Learning monocular 3d human pose estimation from multi-view images. In: CVPR (2018)  30. Roetenberg, D., Luinge, H., Slycke, P.: Moven: Full 6dof human motion tracking  using miniature inertial sensors. Xsen Technologies, December (2007)  31. Rogez, G., Weinzaepfel, P., Schmid, C.: Lcr-net++: Multi-person 2d and 3d pose  detection in natural images. arXiv preprint arXiv:1803.00455 (2018)  32. Sigal, L., Balan, A.O., Black, M.J.: Humaneva: Synchronized video and motion capture dataset and baseline algorithm for evaluation of articulated human motion. International Journal of Computer Vision (IJCV) 87(1-2) (2010)  33. Simo-Serra, E., Quattoni, A., Torras, C., Moreno-Noguer, F.: A joint model for 2d and 3d pose estimation from a single image. In: Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3634-3641 (2013)  34. Simo-Serra, E., Ramisa, A., Aleny`a, G., Torras, C., Moreno-Noguer, F.: Single image 3d human pose estimation from noisy observations. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2673-2680 (2012)   Accurate 3D Human Pose Using IMUs and a Moving Camera35. Sminchisescu, C., Triggs, B.: Kinematic jump processes for monocular 3d human tracking. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2003)  36. Sun, X., Shang, J., Liang, S., Wei, Y.: Compositional human pose regression. arXiv  preprint arXiv:1704.00159 (2017)  37. Tang, S., Andres, B., Andriluka, M., Schiele, B.: Subgraph decomposition for multi- target tracking. In: The IEEE Conference on Computer Vision and Pattern Recog- nition (CVPR). pp. 5033-5041 (2015)  38. Tome, D., Russell, C., Agapito, L.: Lifting from the deep: Convolutional 3d pose estimation from a single image. The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  39. Trumble, M., Gilbert, A., Malleson, C., Hilton, A., Collomosse, J.: Total capture: 3d human pose estimation fusing video and inertial sensors. In: Proceedings of 28th British Machine Vision Conference. pp. 1-13 (2017)  40. Tung, H.Y., Tung, H.W., Yumer, E., Fragkiadaki, K.: Self-supervised learning of  motion capture. In: NIPS (2017)  41. Vlasic, D., Adelsberger, R., Vannucci, G., Barnwell, J., Gross, M., Matusik, W., Popovi´c, J.: Practical motion capture in everyday surroundings. ACM Transactions on Graphics (TOG) 26(3), 35 (2007)  42. von Marcard, T., Rosenhahn, B., Black, M., Pons-Moll, G.: Sparse inertial poser: Automatic 3d human pose estimation from sparse imus. Computer Graphics Forum 36(2), Proceedings of the 38th Annual Conference of the European Association for Computer Graphics (Eurographics) pp. 349-360 (2017)  43. Wandt, B., Ackermann, H., Rosenhahn, B.: 3d reconstruction of human motion from monocular image sequences. Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 38(8), 1505-1516 (2016)  44. Wang, C., Wang, Y., Lin, Z., Yuille, A.L., Gao, W.: Robust estimation of 3d human poses from a single image. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2361-2368 (2014)  45. Zell, P., Wandt, B., Rosenhahn, B.: Joint 3d human motion capture and physical analysis from monocular videos. In: The IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW) (2017)  46. Zhang, C., Pujades, S., Black, M., Pons-Moll, G.: Detailed, accurate, human shape estimation from clothed 3D scan sequences. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  47. Zheng, Z., Yu, Tao, L.H., Guo, K., Dai, Q., Fang, L., Liu, Y.: Hybridfusion: Real- time performance capture using a single depth sensor and sparse imus. In: European Conference on Computer Vision (ECCV) (2018)  48. Zhou, F., De la Torre, F.: Spatio-temporal matching for human detection in video.  In: European Conference on Computer Vision (ECCV). pp. 62-77 (2014)  49. Zhou, X., Leonardos, S., Hu, X., Daniilidis, K.: 3D shape estimation from 2D land- marks: A convex relaxation approach. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 4447-4455 (2015)  50. Zhou, X., Huang, Q., Sun, X., Xue, X., Wei, Y.: Towards 3d human pose estimation in the wild: A weakly-supervised approach. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 398-407 (2017)"}