{"1": "1. Batra, D., Kowdle, A., Parikh, D., Luo, J., Chen, T.: icoseg: Interactive co- segmentation with intelligent scribble guidance. In: Computer Vision and Pattern Recognition (CVPR). pp. 3169-3176. IEEE (2010)  2. Bau, D., Zhou, B., Khosla, A., Oliva, A., Torralba, A.: Network dissection: Quan- tifying interpretability of deep visual representations. In: Computer Vision and Pattern Recognition (CVPR). pp. 3319-3327. IEEE (2017)  3. Bengio, Y., Courville, A., Vincent, P.: Representation learning: A review and new perspectives. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 35(8), 1798-1828 (2013)  4. Chen, X., Mottaghi, R., Liu, X., Fidler, S., Urtasun, R., Yuille, A.: Detect what you can: Detecting and representing objects using holistic models and body parts. In: Computer Vision and Pattern Recognition (CVPR). pp. 1971-1978 (2014) 5. Cho, M., Kwak, S., Schmid, C., Ponce, J.: Unsupervised object discovery and localization in the wild: Part-based matching with bottom-up region proposals. In: Computer Vision and Pattern Recognition (CVPR) (2015)  6. Cichocki, A., Zdunek, R.: Multilayer nonnegative matrix factorisation. Electronics  Letters 42(16), 1 (2006)  7. Deselaers, T., Alexe, B., Ferrari, V.: Weakly supervised localization and learning with generic knowledge. International Journal of Computer Vision (IJCV) 100(3), 275-293 (2012)  8. Ding, C., He, X., Simon, H.D.: On the equivalence of nonnegative matrix factor- ization and spectral clustering. In: Proceedings of the 2005 SIAM International Conference on Data Mining. pp. 606-610. SIAM (2005)  9. Dziugaite, G.K., Roy, D.M.: Neural network matrix factorization. arXiv preprint  arXiv:1511.06443 (2015)  10. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The PASCAL Visual Object Classes Challenge 2010 (VOC2010) Results. http://www.pascal-network.org/challenges/VOC/voc2010/workshop/index.html  11. Gonzalez-Garcia, A., Modolo, D., Ferrari, V.: Do semantic parts emerge in con- volutional neural networks? International Journal of Computer Vision (IJCV) pp. 1-19 (2017)  12. Grais, E.M., Erdogan, H.: Single channel speech music separation using nonnega- tive matrix factorization and spectral masks. In: Digital Signal Processing (DSP). pp. 1-6. IEEE (2011)  13. Guillamet, D., Vitria, J.: Non-negative matrix factorization for face recognition.  In: Topics in artificial intelligence, pp. 336-344. Springer (2002)  14. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Simultaneous detection and  segmentation. European Conference on Computer Vision (ECCV) (2014)  15. He, K., Sun, J., Tang, X.: Guided image filtering. IEEE Transactions on Pattern  Analysis and Machine Intelligence (TPAMI) 35(6), 1397-1409 (2013)  16. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Computer Vision and Pattern Recognition (CVPR). pp. 770-778 (2016) 17. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International Conference on Machine Learning (ICML). pp. 448-456 (2015)  18. Jolliﬀe, I.T.: Principal component analysis and factor analysis. In: Principal com-  ponent analysis, pp. 115-128. Springer (1986)   Deep Feature Factorization For Concept DiscoveryReferences  1. Batra, D., Kowdle, A., Parikh, D., Luo, J., Chen, T.: icoseg: Interactive co- segmentation with intelligent scribble guidance. In: Computer Vision and Pattern Recognition (CVPR). pp. 3169-3176. IEEE (2010)  2. Bau, D., Zhou, B., Khosla, A., Oliva, A., Torralba, A.: Network dissection: Quan- tifying interpretability of deep visual representations. In: Computer Vision and Pattern Recognition (CVPR). pp. 3319-3327. IEEE (2017)  3. Bengio, Y., Courville, A., Vincent, P.: Representation learning: A review and new perspectives. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 35(8), 1798-1828 (2013)  4. Chen, X., Mottaghi, R., Liu, X., Fidler, S., Urtasun, R., Yuille, A.: Detect what you can: Detecting and representing objects using holistic models and body parts. In: Computer Vision and Pattern Recognition (CVPR). pp. 1971-1978 (2014) 5. Cho, M., Kwak, S., Schmid, C., Ponce, J.: Unsupervised object discovery and localization in the wild: Part-based matching with bottom-up region proposals. In: Computer Vision and Pattern Recognition (CVPR) (2015)  6. Cichocki, A., Zdunek, R.: Multilayer nonnegative matrix factorisation. Electronics  Letters 42(16), 1 (2006)  7. Deselaers, T., Alexe, B., Ferrari, V.: Weakly supervised localization and learning with generic knowledge. International Journal of Computer Vision (IJCV) 100(3), 275-293 (2012)  8. Ding, C., He, X., Simon, H.D.: On the equivalence of nonnegative matrix factor- ization and spectral clustering. In: Proceedings of the 2005 SIAM International Conference on Data Mining. pp. 606-610. SIAM (2005)  9. Dziugaite, G.K., Roy, D.M.: Neural network matrix factorization. arXiv preprint  arXiv:1511.06443 (2015)  10. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The PASCAL Visual Object Classes Challenge 2010 (VOC2010) Results. http://www.pascal-network.org/challenges/VOC/voc2010/workshop/index.html  11. Gonzalez-Garcia, A., Modolo, D., Ferrari, V.: Do semantic parts emerge in con- volutional neural networks? International Journal of Computer Vision (IJCV) pp. 1-19 (2017)  12. Grais, E.M., Erdogan, H.: Single channel speech music separation using nonnega- tive matrix factorization and spectral masks. In: Digital Signal Processing (DSP). pp. 1-6. IEEE (2011)  13. Guillamet, D., Vitria, J.: Non-negative matrix factorization for face recognition.  In: Topics in artificial intelligence, pp. 336-344. Springer (2002)  14. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Simultaneous detection and  segmentation. European Conference on Computer Vision (ECCV) (2014)  15. He, K., Sun, J., Tang, X.: Guided image filtering. IEEE Transactions on Pattern  Analysis and Machine Intelligence (TPAMI) 35(6), 1397-1409 (2013)  16. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Computer Vision and Pattern Recognition (CVPR). pp. 770-778 (2016) 17. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International Conference on Machine Learning (ICML). pp. 448-456 (2015)  18. Jolliﬀe, I.T.: Principal component analysis and factor analysis. In: Principal com-  ponent analysis, pp. 115-128. Springer (1986)   16  E. Collins et al.  19. Joulin, A., Tang, K., Fei-Fei, L.: Eﬃcient image and video co-localization with frank-wolfe algorithm. In: European Conference on Computer Vision (ECCV). pp. 253-268. Springer (2014)  20. Kr¨ahenb¨uhl, P., Koltun, V.: Eﬃcient inference in fully connected crfs with gaussian edge potentials. In: Advances in Neural Information Processing Systems (NIPS). pp. 109-117 (2011)  21. Le, H., Yu, C.P., Zelinsky, G., Samaras, D.: Co-localization with category- consistent features and geodesic distance propagation. In: Computer Vision and Pattern Recognition (CVPR). pp. 1103-1112 (2017)  22. Lee, D.D., Seung, H.S.: Learning the parts of objects by non-negative matrix fac-  torization. Nature 401(6755), 788 (1999)  23. Lee, D.D., Seung, H.S.: Algorithms for non-negative matrix factorization. In: Ad-  vances in neural information processing systems. pp. 556-562 (2001)  24. Li, Y., Liu, L., Shen, C., van den Hengel, A.: Image co-localization by mimick- ing a good detectors confidence score distribution. In: European Conference on Computer Vision (ECCV). pp. 19-34. Springer (2016)  25. Montavon, G.,  Samek, W., M¨uller, K.: Methods  interpret- Signal Pro- https://doi.org/10.1016/j.dsp.2017.10.011,  networks. Digital  for  and  understanding  ing cessing 1-15 https://doi.org/10.1016/j.dsp.2017.10.011  deep (2018).  73,  neural  26. Paszke, A., Gross, S., Chintala, S., Chanan, G., Yang, E., DeVito, Z., Lin, Z., Desmaison, A., Antiga, L., Lerer, A.: Automatic diﬀerentiation in pytorch (2017) 27. Ribeiro, M.T., Singh, S., Guestrin, C.: Why should I trust you?: Explaining the predictions of any classifier. Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining pp. 1135-1144 (2016) 28. Rubinstein, M., Joulin, A., Kopf, J., Liu, C.: Unsupervised joint object discovery and segmentation in internet images. Computer Vision and Pattern Recognition (CVPR) (June 2013)  29. Rubio, J.C., Serrat, J., L´opez, A., Paragios, N.: Unsupervised co-segmentation through region matching. In: Computer Vision and Pattern Recognition (CVPR). pp. 749-756. IEEE (2012)  30. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., Berg, A.C., Fei-Fei, L.: ImageNet Large Scale Visual Recognition Challenge. International Journal of Computer Vision (IJCV) 115(3), 211-252 (2015). https://doi.org/10.1007/s11263-015-0816-y 31. Selvaraju, R.R., Cogswell, M., Das, A., Vedantam, R., Parikh, D., Batra, D.: Grad- cam: Visual explanations from deep networks via gradient-based localization. See https://arxiv. org/abs/1610.02391 v3 7(8) (2016)  32. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)  33. Vicente, S., Rother, C., Kolmogorov, V.: Object cosegmentation. In: Computer  Vision and Pattern Recognition (CVPR). pp. 2217-2224. IEEE (2011)  34. Vu, T.T., Bigot, B., Chng, E.S.: Combining non-negative matrix factorization and deep neural networks for speech enhancement and automatic speech recognition. In: Acoustics, Speech and Signal Processing (ICASSP). pp. 499-503. IEEE (2016) 35. Wang, J., Yuille, A.L.: Semantic part segmentation using compositional model  combining shape and appearance. CVPR (2015)  36. Xu, W., Liu, X., Gong, Y.: Document clustering based on non-negative matrix factorization. In: Proceedings of the 26th annual international ACM SIGIR con- ference on Research and development in informaion retrieval. pp. 267-273. ACM (2003)   Deep Feature Factorization For Concept Discovery37. Zhou, B., Khosla, A., Lapedriza, A., Oliva, A., Torralba, A.: Learning deep fea- tures for discriminative localization. In: Computer Vision and Pattern Recognition (CVPR). pp. 2921-2929. IEEE (2016)"}