{"1": "1. Izadi, S., Kim, D., Hilliges, O., Molyneaux, D., Newcombe, R., Kohli, P., Shotton, J., Hodges, S., Freeman, D., Davison, A., Fitzgibbon, A.: KinectFusion: Real-time 3D reconstruction and interaction using a moving depth camera. In: Proc. UIST. (2011) 559-568  2. Dai, A., Nießner, M., Zollh¨ofer, M., Izadi, S., Theobalt, C.: BundleFusion: Real- time globally consistent 3d reconstruction using on-the-ﬂy surface reintegration. ACM Trans. on Graph. 36(3) (2017) 24  3. Zhang, Y., Xu, W., Tong, Y., Zhou, K.: Online structure analysis for real-time indoor scene reconstruction. ACM Transactions on Graphics (TOG) 34(5) (2015) 159  4. Halber, M., Funkhouser, T.: Fine-to-coarse global registration of rgb-d scans. arXiv  preprint arXiv:1607.08539 (2016)  5. Lee, J.K., Yea, J.W., Park, M.G., Yoon, K.J.: Joint layout estimation and global multi-view registration for indoor reconstruction. arXiv preprint arXiv:1704.07632 (2017)  6. Ma, L., Kerl, C., St¨uckler, J., Cremers, D.: Cpa-slam: Consistent plane-model alignment for direct rgb-d slam. In: Robotics and Automation (ICRA), 2016 IEEE International Conference on, IEEE (2016) 1285-1291  7. Trevor, A.J., Rogers, J.G., Christensen, H.I.: Planar surface slam with 3d and 2d sensors. In: Robotics and Automation (ICRA), 2012 IEEE International Confer- ence on, IEEE (2012) 3041-3048  8. Zhang, E., Cohen, M.F., Curless, B.: Emptying, refurnishing, and relighting indoor  spaces. ACM Transactions on Graphics (TOG) 35(6) (2016) 174  9. Huang, J., Dai, A., Guibas, L., Nießner, M.: 3dlite: Towards commodity 3d scan- ning for content creation. ACM Transactions on Graphics 2017 (TOG) (2017) 10. Dai, A., Chang, A.X., Savva, M., Halber, M., Funkhouser, T., Nießner, M.: Scannet:  Richly-annotated 3d reconstructions of indoor scenes. In: CVPR. (2017)  11. Sturm, J., Engelhard, N., Endres, F., Burgard, W., Cremers, D.: A benchmark for  the evaluation of rgb-d slam systems. In: Proc. IROS. (Oct. 2012)  12. Choi, S., Zhou, Q.Y., Koltun, V.: Robust reconstruction of indoor scenes.  In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 5556-5565  13. Newcombe, R.A., Izadi, S., Hilliges, O., Molyneaux, D., Kim, D., Davison, A.J., Kohli, P., Shotton, J., Hodges, S., Fitzgibbon, A.: KinectFusion: Real-time dense surface mapping and tracking. In: Proc. ISMAR. (2011) 127-136  14. Nießner, M., Zollh¨ofer, M., Izadi, S., Stamminger, M.: Real-time 3d reconstruction  at scale using voxel hashing. ACM TOG (2013)  15. Chen, J., Bautembach, D., Izadi, S.: Scalable real-time volumetric surface recon-  struction. ACM TOG 32(4) (2013) 113  16. Keller, M., Leﬂoch, D., Lambers, M., Izadi, S., Weyrich, T., Kolb, A.: Real-time 3d reconstruction in dynamic scenes using point-based fusion. In: Proc. 3DV, IEEE (2013) 1-8  17. Steinbruecker, F., Sturm, J., Cremers, D.: Volumetric 3d mapping in real-time on a cpu. In: 2014 IEEE International Conference on Robotics and Automation (ICRA), Hongkong, China (2014)  18. Whelan, T., Leutenegger, S., Salas-Moreno, R.F., Glocker, B., Davison, A.J.: Elas- ticFusion: Dense SLAM without a pose graph. In: Proc. RSS, Rome, Italy (July 2015)   PlaneMatchReferences  1. Izadi, S., Kim, D., Hilliges, O., Molyneaux, D., Newcombe, R., Kohli, P., Shotton, J., Hodges, S., Freeman, D., Davison, A., Fitzgibbon, A.: KinectFusion: Real-time 3D reconstruction and interaction using a moving depth camera. In: Proc. UIST. (2011) 559-568  2. Dai, A., Nießner, M., Zollh¨ofer, M., Izadi, S., Theobalt, C.: BundleFusion: Real- time globally consistent 3d reconstruction using on-the-ﬂy surface reintegration. ACM Trans. on Graph. 36(3) (2017) 24  3. Zhang, Y., Xu, W., Tong, Y., Zhou, K.: Online structure analysis for real-time indoor scene reconstruction. ACM Transactions on Graphics (TOG) 34(5) (2015) 159  4. Halber, M., Funkhouser, T.: Fine-to-coarse global registration of rgb-d scans. arXiv  preprint arXiv:1607.08539 (2016)  5. Lee, J.K., Yea, J.W., Park, M.G., Yoon, K.J.: Joint layout estimation and global multi-view registration for indoor reconstruction. arXiv preprint arXiv:1704.07632 (2017)  6. Ma, L., Kerl, C., St¨uckler, J., Cremers, D.: Cpa-slam: Consistent plane-model alignment for direct rgb-d slam. In: Robotics and Automation (ICRA), 2016 IEEE International Conference on, IEEE (2016) 1285-1291  7. Trevor, A.J., Rogers, J.G., Christensen, H.I.: Planar surface slam with 3d and 2d sensors. In: Robotics and Automation (ICRA), 2012 IEEE International Confer- ence on, IEEE (2012) 3041-3048  8. Zhang, E., Cohen, M.F., Curless, B.: Emptying, refurnishing, and relighting indoor  spaces. ACM Transactions on Graphics (TOG) 35(6) (2016) 174  9. Huang, J., Dai, A., Guibas, L., Nießner, M.: 3dlite: Towards commodity 3d scan- ning for content creation. ACM Transactions on Graphics 2017 (TOG) (2017) 10. Dai, A., Chang, A.X., Savva, M., Halber, M., Funkhouser, T., Nießner, M.: Scannet:  Richly-annotated 3d reconstructions of indoor scenes. In: CVPR. (2017)  11. Sturm, J., Engelhard, N., Endres, F., Burgard, W., Cremers, D.: A benchmark for  the evaluation of rgb-d slam systems. In: Proc. IROS. (Oct. 2012)  12. Choi, S., Zhou, Q.Y., Koltun, V.: Robust reconstruction of indoor scenes.  In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 5556-5565  13. Newcombe, R.A., Izadi, S., Hilliges, O., Molyneaux, D., Kim, D., Davison, A.J., Kohli, P., Shotton, J., Hodges, S., Fitzgibbon, A.: KinectFusion: Real-time dense surface mapping and tracking. In: Proc. ISMAR. (2011) 127-136  14. Nießner, M., Zollh¨ofer, M., Izadi, S., Stamminger, M.: Real-time 3d reconstruction  at scale using voxel hashing. ACM TOG (2013)  15. Chen, J., Bautembach, D., Izadi, S.: Scalable real-time volumetric surface recon-  struction. ACM TOG 32(4) (2013) 113  16. Keller, M., Leﬂoch, D., Lambers, M., Izadi, S., Weyrich, T., Kolb, A.: Real-time 3d reconstruction in dynamic scenes using point-based fusion. In: Proc. 3DV, IEEE (2013) 1-8  17. Steinbruecker, F., Sturm, J., Cremers, D.: Volumetric 3d mapping in real-time on a cpu. In: 2014 IEEE International Conference on Robotics and Automation (ICRA), Hongkong, China (2014)  18. Whelan, T., Leutenegger, S., Salas-Moreno, R.F., Glocker, B., Davison, A.J.: Elas- ticFusion: Dense SLAM without a pose graph. In: Proc. RSS, Rome, Italy (July 2015)   16  Yifei Shi et al.  19. Wang, R., Schw¨orer, M., Cremers, D.: Stereo dso: Large-scale direct sparse visual  odometry with stereo cameras. arXiv preprint arXiv:1708.07878 (2017)  20. Park, J., Zhou, Q.Y., Koltun, V.: Colored point cloud registration revisited. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 143-152  21. Lowe, D.G.: Object recognition from local scale-invariant features. In: Computer vision, 1999. The proceedings of the seventh IEEE international conference on. Volume 2., Ieee (1999) 1150-1157  22. Bay, H., Tuytelaars, T., Van Gool, L.: Surf: Speeded up robust features. Computer  vision-ECCV 2006 (2006) 404-417  23. Rublee, E., Rabaud, V., Konolige, K., Bradski, G.: Orb: An eﬃcient alternative to sift or surf. In: Computer Vision (ICCV), 2011 IEEE international conference on, IEEE (2011) 2564-2571  24. Han, X., Leung, T., Jia, Y., Sukthankar, R., Berg, A.C.: Matchnet: Unifying feature and metric learning for patch-based matching. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 3279-3286 25. Yi, K.M., Trulls, E., Lepetit, V., Fua, P.: Lift: Learned invariant feature transform.  In: European Conference on Computer Vision, Springer (2016) 467-483  26. Byravan, A., Fox, D.: Se3-nets: Learning rigid body motion using deep neural net- works. In: Robotics and Automation (ICRA), 2017 IEEE International Conference on, IEEE (2017) 173-180  27. Zeng, A., Song, S., Niessner, M., Fisher, M., Xiao, J., Funkhouser, T.: 3DMatch: Learning local geometric descriptors from rgb-d reconstructions. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2017) 1802- 1811  28. Schmidt, T., Newcombe, R., Fox, D.: Self-supervised visual descriptor learning IEEE Robotics and Automation Letters 2(2) (2017)  for dense correspondence. 420-427  29. Concha, A., Civera, J.: Dpptam: Dense piecewise planar tracking and mapping In: Intelligent Robots and Systems (IROS), 2015  from a monocular sequence. IEEE/RSJ International Conference on, IEEE (2015) 5686-5693  30. Dou, M., Guan, L., Frahm, J.M., Fuchs, H.: Exploring high-level plane primitives for indoor 3d reconstruction with a hand-held rgb-d camera. In: Asian Conference on Computer Vision, Springer (2012) 94-108  31. Hsiao, M., Westman, E., Zhang, G., Kaess, M.: Keyframe-based dense planar slam. In: Proc. International Conference on Robotics and Automation (ICRA), IEEE. (2017)  32. Pietzsch, T.: Planar features for visual slam. KI 2008: Advances in Artificial  Intelligence (2008) 119-126  33. Proen¸ca, P.F., Gao, Y.: Probabilistic combination of noisy points and planes for  rgb-d odometry. arXiv preprint arXiv:1705.06516 (2017)  34. Salas-Moreno, R.F., Glocken, B., Kelly, P.H., Davison, A.J.: Dense planar slam. In: Mixed and Augmented Reality (ISMAR), 2014 IEEE International Symposium on, IEEE (2014) 157-164  35. Taguchi, Y., Jian, Y.D., Ramalingam, S., Feng, C.: Point-plane slam for hand- held 3d sensors. In: Robotics and Automation (ICRA), 2013 IEEE International Conference on, IEEE (2013) 5182-5189  36. Weingarten, J., Siegwart, R.: 3d slam using planar segments. In: Intelligent Robots and Systems, 2006 IEEE/RSJ International Conference on, IEEE (2006) 3062-3067   PlaneMatch37. Stuckler, J., Behnke, S.: Orthogonal wall correction for visual motion estimation. In: Robotics and Automation, 2008. ICRA 2008. IEEE International Conference on, IEEE (2008) 1-6  38. Grisetti, G., Kummerle, R., Stachniss, C., Burgard, W.: A tutorial on graph-based slam. IEEE Intelligent Transportation Systems Magazine 2(4) (2010) 31-43 39. Henry, P., Krainin, M., Herbst, E., Ren, X., Fox, D.: Rgb-d mapping: Using depth cameras for dense 3d modeling of indoor environments. In: In the 12th International Symposium on Experimental Robotics (ISER, Citeseer (2010)  40. Zhou, Q.Y., Koltun, V.: Dense scene reconstruction with points of interest. ACM  Transactions on Graphics (TOG) 32(4) (2013) 112  41. Zhou, Q.Y., Park, J., Koltun, V.: Fast global registration. In: European Conference  on Computer Vision, Springer (2016) 766-782  42. Schroﬀ, F., Kalenichenko, D., Philbin, J.: Facenet: A unified embedding for face recognition and clustering. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 815-823  43. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2016) 770-778  44. Lin, T.Y., Goyal, P., Girshick, R., He, K., Doll´ar, P.: Focal loss for dense object  detection. arXiv preprint arXiv:1708.02002 (2017)  45. Agarwal, S., Mierle, K.: Ceres solver: Tutorial & reference. Google Inc 2 (2012)46. Chang, A., Dai, A., Funkhouser, T., , Nießner, M., Savva, M., Song, S., Zeng, A., Zhang, Y.: Matterport3d: Learning from rgb-d data in indoor environments. In: Proceedings of the International Conference on 3D Vision (3DV). (2017)  47. Endres, F., Hess, J., Engelhard, N., Sturm, J., Cremers, D., Burgard, W.: An evaluation of the rgb-d slam system. In: Robotics and Automation (ICRA), 2012 IEEE International Conference on, IEEE (2012) 1691-1696"}