{"1": "1. Wang, J., Zhang, T., Sebe, N., Shen, H.T., et al.: A survey on learning to hash.  IEEE transactions on pattern analysis and machine intelligence (2017)  2. Smeulders, A.W., Worring, M., Santini, S., Gupta, A., Jain, R.: Content-based  image retrieval at the end of the early years. TPAMI 22 (2000)  3. Bronstein, M., Bronstein, A., Michel, F., Paragios, N.: Data fusion through cross- In: CVPR, IEEE  modality metric learning using similarity-sensitive hashing. (2010)  4. Kumar, S., Udupa, R.: Learning hash functions for cross-view similarity search.  5. Zhen, Y., Yeung, D.: Co-regularized hashing for multimodal data. In: NIPS. (2012)  In: IJCAI. (2011)  1385-1393  6. Zhen, Y., Yeung, D.Y.: A probabilistic model for multimodal hash function learn-  ing. In: SIGKDD, ACM (2012)  7. Song, J., Yang, Y., Yang, Y., Huang, Z., Shen, H.T.:  Inter-media hashing for large-scale retrieval from heterogeneous data sources. In: SIGMOD, ACM (2013) 8. Wang, W., Ooi, B.C., Yang, X., Zhang, D., Zhuang, Y.: Eﬀective multi-modal  retrieval based on stacked auto-encoders. In: VLDB, ACM (2014)  9. Yu, Z., Wu, F., Yang, Y., Tian, Q., Luo, J., Zhuang, Y.: Discriminative coupled  dictionary hashing for fast cross-media retrieval. In: SIGIR, ACM (2014)  10. Liu, X., He, J., Deng, C., Lang, B.: Collaborative hashing. In: CVPR, IEEE (2014) 11. Zhang, D., Li, W.: Large-scale supervised multimodal hashing with semantic cor-  relation maximization. In: AAAI. (2014)  12. Wu, B., Yang, Q., Zheng, W., Wang, Y., Wang, J.: Quantized correlation hashing for fast cross-modal search. In: Proceedings of the Twenty-Fourth International Joint Conference on Artificial Intelligence, IJCAI 2015, Buenos Aires, Argentina, July 25-31, 2015. (2015)  13. Long, M., Cao, Y., Wang, J., Yu, P.S.: Composite correlation quantization for  eﬃcient multimodal retrieval. In: SIGIR. (2016)  14. Xia, R., Pan, Y., Lai, H., Liu, C., Yan, S.: Supervised hashing for image retrieval In: Proceedings of the AAAI Conference on  via image representation learning. Artificial Intellignece (AAAI), AAAI (2014)  15. Lai, H., Pan, Y., Liu, Y., Yan, S.: Simultaneous feature learning and hash coding  with deep neural networks. In: CVPR. (2015)  16. Zhu, H., Long, M., Wang, J., Cao, Y.: Deep hashing network for eﬃcient similarity retrieval. In: Proceedings of the AAAI Conference on Artificial Intellignece (AAAI), AAAI (2016)  17. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep In: Advances in Neural Information Processing  convolutional neural networks. Systems (NIPS). (2012)  18. Lin, M., Chen, Q., Yan, S.: Network in network. In: International Conference on  Learning Representations (ICLR), 2014 (arXiv:1409.1556). (2014)  19. Masci, J., Bronstein, M.M., Bronstein, A.M., Schmidhuber, J.: Multimodal similarity-preserving hashing. IEEE Trans. Pattern Anal. Mach. Intell. 36 (2014) 20. Srivastava, N., Salakhutdinov, R.: Multimodal learning with deep boltzmann ma-  chines. JMLR 15 (2014)  21. Wan, J., Wang, D., Hoi, S.C.H., Wu, P., Zhu, J., Zhang, Y., Li, J.: Deep learning  for content-based image retrieval: A comprehensive study. In: MM, ACM (2014)   Cross-Modal Hamming HashingReferences  1. Wang, J., Zhang, T., Sebe, N., Shen, H.T., et al.: A survey on learning to hash.  IEEE transactions on pattern analysis and machine intelligence (2017)  2. Smeulders, A.W., Worring, M., Santini, S., Gupta, A., Jain, R.: Content-based  image retrieval at the end of the early years. TPAMI 22 (2000)  3. Bronstein, M., Bronstein, A., Michel, F., Paragios, N.: Data fusion through cross- In: CVPR, IEEE  modality metric learning using similarity-sensitive hashing. (2010)  4. Kumar, S., Udupa, R.: Learning hash functions for cross-view similarity search.  5. Zhen, Y., Yeung, D.: Co-regularized hashing for multimodal data. In: NIPS. (2012)  In: IJCAI. (2011)  1385-1393  6. Zhen, Y., Yeung, D.Y.: A probabilistic model for multimodal hash function learn-  ing. In: SIGKDD, ACM (2012)  7. Song, J., Yang, Y., Yang, Y., Huang, Z., Shen, H.T.:  Inter-media hashing for large-scale retrieval from heterogeneous data sources. In: SIGMOD, ACM (2013) 8. Wang, W., Ooi, B.C., Yang, X., Zhang, D., Zhuang, Y.: Eﬀective multi-modal  retrieval based on stacked auto-encoders. In: VLDB, ACM (2014)  9. Yu, Z., Wu, F., Yang, Y., Tian, Q., Luo, J., Zhuang, Y.: Discriminative coupled  dictionary hashing for fast cross-media retrieval. In: SIGIR, ACM (2014)  10. Liu, X., He, J., Deng, C., Lang, B.: Collaborative hashing. In: CVPR, IEEE (2014) 11. Zhang, D., Li, W.: Large-scale supervised multimodal hashing with semantic cor-  relation maximization. In: AAAI. (2014)  12. Wu, B., Yang, Q., Zheng, W., Wang, Y., Wang, J.: Quantized correlation hashing for fast cross-modal search. In: Proceedings of the Twenty-Fourth International Joint Conference on Artificial Intelligence, IJCAI 2015, Buenos Aires, Argentina, July 25-31, 2015. (2015)  13. Long, M., Cao, Y., Wang, J., Yu, P.S.: Composite correlation quantization for  eﬃcient multimodal retrieval. In: SIGIR. (2016)  14. Xia, R., Pan, Y., Lai, H., Liu, C., Yan, S.: Supervised hashing for image retrieval In: Proceedings of the AAAI Conference on  via image representation learning. Artificial Intellignece (AAAI), AAAI (2014)  15. Lai, H., Pan, Y., Liu, Y., Yan, S.: Simultaneous feature learning and hash coding  with deep neural networks. In: CVPR. (2015)  16. Zhu, H., Long, M., Wang, J., Cao, Y.: Deep hashing network for eﬃcient similarity retrieval. In: Proceedings of the AAAI Conference on Artificial Intellignece (AAAI), AAAI (2016)  17. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep In: Advances in Neural Information Processing  convolutional neural networks. Systems (NIPS). (2012)  18. Lin, M., Chen, Q., Yan, S.: Network in network. In: International Conference on  Learning Representations (ICLR), 2014 (arXiv:1409.1556). (2014)  19. Masci, J., Bronstein, M.M., Bronstein, A.M., Schmidhuber, J.: Multimodal similarity-preserving hashing. IEEE Trans. Pattern Anal. Mach. Intell. 36 (2014) 20. Srivastava, N., Salakhutdinov, R.: Multimodal learning with deep boltzmann ma-  chines. JMLR 15 (2014)  21. Wan, J., Wang, D., Hoi, S.C.H., Wu, P., Zhu, J., Zhang, Y., Li, J.: Deep learning  for content-based image retrieval: A comprehensive study. In: MM, ACM (2014)   16  Yue Cao, Bin Liu, Mingsheng Long, and Jianmin Wang  22. Cao, Y., Long, M., Wang, J., Yang, Q., Yu, P.S.: Deep visual-semantic hashing for  cross-modal retrieval. In: SIGKDD. (2016) 1445-1454  23. Jiang, Q., Li, W.: Deep cross-modal hashing. In: CVPR, 2017. (2017) 3270-3278 24. Cao, Y., Long, M., Wang, J.: Correlation hashing network for eﬃcient cross-modal  25. Bengio, Y., Courville, A., Vincent, P.: Representation learning: A review and new  retrieval. In: BMVC. (2017)  perspectives. TPAMI 35 (2013)  26. Mikolov, T., Sutskever, I., Chen, K., Corrado, G.S., Dean, J.: Distributed repre- sentations of words and phrases and their compositionality. In: Advances in neural information processing systems. (2013)  27. Le, Q.V., Mikolov, T.: Distributed representations of sentences and documents.  In: Advances in neural information processing systems. (2014)  28. Rumelhart, D.E., Hinton, G.E., Williams, R.J.: Parallel distributed processing:  Explorations in the microstructure of cognition, vol. 1. MIT Press (1986)  29. Graves, A., Jaitly, N.: Towards end-to-end speech recognition with recurrent neural  networks. In: ICML, ACM (2014) 1764-1772  30. Fleet, D.J., Punjani, A., Norouzi, M.: Fast search in hamming space with multi-  index hashing. In: CVPR, IEEE (2012)  31. Wu, F., Yu, Z., Yang, Y., Tang, S., Zhang, Y., Zhuang, Y.: Sparse multi-modal  hashing. IEEE Trans. Multimedia 16(2) (2014) 427-439  32. Ou, M., Cui, P., Wang, F., Wang, J., Zhu, W., Yang, S.: Comparing apples to oranges: a scalable solution with heterogeneous hashing. In: SIGKDD, ACM (2013) 33. Ding, G., Guo, Y., Zhou, J.: Collective matrix factorization hashing for multimodal  data. In: CVPR. (2014)  34. Wang, D., Gao, X., Wang, X., He, L.: Semantic topic multimodal hashing for cross-media retrieval. In: Proceedings of the Twenty-Fourth International Joint Conference on Artificial Intelligence, IJCAI 2015, Buenos Aires, Argentina, July 25-31, 2015. (2015)  35. Hu, Y., Jin, Z., Ren, H., Cai, D., He, X.: Iterative multi-view hashing for cross  36. Wei, Y., Song, Y., Zhen, Y., Liu, B., Yang, Q.: Scalable heterogeneous translated  media indexing. In: MM, ACM (2014)  hashing. In: SIGKDD, ACM (2014)  retrieval. In: CVPR. (2015)  37. Lin, Z., Ding, G., Hu, M., Wang, J.: Semantics-preserving hashing for cross-view  38. Donahue, J., Hendricks, L.A., Guadarrama, S., Rohrbach, M., Venugopalan, S., Saenko, K., Darrell, T.: Long-term recurrent convolutional networks for visual recognition and description. In: CVPR. (2015)  39. Frome, A., Corrado, G.S., Shlens, J., Bengio, S., Dean, J., Mikolov, T., et al.: Devise: A deep visual-semantic embedding model. In: NIPS. (2013) 2121-2129 40. Kiros, R., Salakhutdinov, R., Zemel, R.S.: Unifying visual-semantic embeddings  with multimodal neural language models. In: NIPS. (2014)  41. Gao, H., Mao, J., Zhou, J., Huang, Z., Wang, L., Xu, W.: Are you talking to a machine? dataset and methods for multilingual image question answering. In: NIPS. (2015)  42. Cao, Y., Long, M., Wang, J., Zhu, H., Wen, Q.: Deep quantization network for In: Proceedings of the AAAI Conference on Artificial  eﬃcient image retrieval. Intellignece (AAAI), AAAI (2016)  43. Cao, Z., Long, M., Wang, J., Yu, P.S.: Hashnet: Deep learning to hash by contin-  44. Liu, B., Cao, Y., Long, M., Wang, J., Wang, J.: Deep triplet quantization. In:  uation. In: ICCV 2017. (2017)  MM, ACM (2018)   Cross-Modal Hamming Hashing45. Dmochowski, J.P., Sajda, P., Parra, L.C.: Maximum likelihood in cost-sensitive learning: Model specification, approximations, and upper bounds. Journal of Ma- chine Learning Research (JMLR) 11(Dec) (2010) 3313-3332  46. Lin, T., Goyal, P., Girshick, R.B., He, K., Doll´ar, P.: Focal loss for dense object  detection. In: ICCV 2017. (2017)  47. Chua, T.S., Tang, J., Hong, R., Li, H., Luo, Z., Zheng, Y.T.: Nus-wide: A real- world web image database from national university of singapore. In: CIVR, ACM (2009)  48. Huiskes, M.J., Lew, M.S.: The mir ﬂickr retrieval evaluation. In: ICMR, ACM  (2008)  49. Grubinger, M., Clough, P., M¨uller, H., Deselaers, T.: The iapr tc-12 benchmark: A new evaluation resource for visual information systems. In: International Workshop OntoImage. (2006) 13-23  50. Zhu, X., Huang, Z., Shen, H.T., Zhao, X.: Linear cross-modal hashing for eﬃcient  multimedia search. In: MM, ACM (2013)"}