{"1": "1. Aodha, O.M., Humayun, A., Pollefeys, M., Brostow, G.J.: Learning a confidence measure for optical ﬂow. IEEE Transactions on Pattern Analysis and Machine In- telligence 35(5), 1107-1120 (May 2013). https://doi.org/10.1109/TPAMI.2012.171 2. Blundell, C., Cornebise, J., Kavukcuoglu, K., Wierstra, D.: Weight uncertainty in neural network. In: Proceedings of the 32nd International Conference on Machine Learning (ICML 2015). pp. 1613-1622  3. Bruhn, A., Weickert, J.: A Confidence Measure for Variational Optic ﬂow Methods, pp. 283-298. Springer Netherlands, Dordrecht (2006), https://doi.org/10.1007/ 1-4020-3858-8_15  4. Chen, Q., Koltun, V.: Photographic image synthesis with cascaded refinement  networks. In: IEEE Int. Conference on Computer Vision (ICCV) (2017)  5. Chen, T., Fox, E., Guestrin, C.: Stochastic gradient Hamiltonian Monte Carlo. In: Proceedings of the 31th International Conference on Machine Learning, (ICML’14) (2014)  6. Dosovitskiy, A., Fischer, P., Ilg, E., H¨ausser, P., Hazırba¸s, C., Golkov, V., v.d. Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: IEEE Int. Conference on Computer Vision (ICCV) (2015)  7. Gal, Y., Ghahramani, Z.: Dropout as a bayesian approximation: Representing model uncertainty in deep learning. In: Int. Conference on Machine Learning (ICML) (2016)  8. Graves, A.: Practical variational inference for neural networks. In: In Advances in  Neural Information Processing Systems (NIPS) 2011. p. 23482356 (2011)  9. Guzman-Rivera, A., Batra, D., Kohli, P.: Multiple choice learning: Learning to produce multiple structured outputs. In: Int. Conference on Neural Information Processing Systems (NIPS) (2012)  10. Hern´andez-Lobato, J., Adams, R.: Probabilistic backpropagation for scalable learn- ing of Bayesian neural networks. In: Proceedings of the 32nd International Confer- ence on Machine Learning (ICML’15) (2015)  11. Huang, G., Li, Y., Pleiss, G.: Snapshot ensembles: Train 1, get M for free. In: Int.  Conference on Learning Representations (ICLR) (2017)  12. Ilg, E., Mayer, N., Saikia, T., Keuper, M., Dosovitskiy, A., Brox, T.: Flownet 2.0: Evolution of optical ﬂow estimation with deep networks. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  13. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: Bach, F., Blei, D. (eds.) Proceedings of the 32nd International Conference on Machine Learning. Proceedings of Machine Learning Research, vol. 37, pp. 448-456. PMLR, Lille, France (07-09 Jul 2015), http://proceedings.mlr.press/v37/ioffe15.html  14. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: Proc. ACMMM. pp. 675-678 (2014)  15. Kendall, A., Gal, Y.: What Uncertainties Do We Need in Bayesian Deep Learn- ing for Computer Vision? In: Int. Conference on Neural Information Processing Systems (NIPS) (2017)  16. Kondermann, C., Kondermann, D., J¨ahne, B., Garbe, C.: An Adaptive Confidence Measure for Optical Flows Based on Linear Subspace Projections, pp. 132-141. Springer Berlin Heidelberg, Berlin, Heidelberg (2007), https://doi.org/10.1007/ 978-3-540-74936-3_14   Uncertainty Estimates and Multi-Hypotheses Networks for Optical FlowReferences  1. Aodha, O.M., Humayun, A., Pollefeys, M., Brostow, G.J.: Learning a confidence measure for optical ﬂow. IEEE Transactions on Pattern Analysis and Machine In- telligence 35(5), 1107-1120 (May 2013). https://doi.org/10.1109/TPAMI.2012.171 2. Blundell, C., Cornebise, J., Kavukcuoglu, K., Wierstra, D.: Weight uncertainty in neural network. In: Proceedings of the 32nd International Conference on Machine Learning (ICML 2015). pp. 1613-1622  3. Bruhn, A., Weickert, J.: A Confidence Measure for Variational Optic ﬂow Methods, pp. 283-298. Springer Netherlands, Dordrecht (2006), https://doi.org/10.1007/ 1-4020-3858-8_15  4. Chen, Q., Koltun, V.: Photographic image synthesis with cascaded refinement  networks. In: IEEE Int. Conference on Computer Vision (ICCV) (2017)  5. Chen, T., Fox, E., Guestrin, C.: Stochastic gradient Hamiltonian Monte Carlo. In: Proceedings of the 31th International Conference on Machine Learning, (ICML’14) (2014)  6. Dosovitskiy, A., Fischer, P., Ilg, E., H¨ausser, P., Hazırba¸s, C., Golkov, V., v.d. Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: IEEE Int. Conference on Computer Vision (ICCV) (2015)  7. Gal, Y., Ghahramani, Z.: Dropout as a bayesian approximation: Representing model uncertainty in deep learning. In: Int. Conference on Machine Learning (ICML) (2016)  8. Graves, A.: Practical variational inference for neural networks. In: In Advances in  Neural Information Processing Systems (NIPS) 2011. p. 23482356 (2011)  9. Guzman-Rivera, A., Batra, D., Kohli, P.: Multiple choice learning: Learning to produce multiple structured outputs. In: Int. Conference on Neural Information Processing Systems (NIPS) (2012)  10. Hern´andez-Lobato, J., Adams, R.: Probabilistic backpropagation for scalable learn- ing of Bayesian neural networks. In: Proceedings of the 32nd International Confer- ence on Machine Learning (ICML’15) (2015)  11. Huang, G., Li, Y., Pleiss, G.: Snapshot ensembles: Train 1, get M for free. In: Int.  Conference on Learning Representations (ICLR) (2017)  12. Ilg, E., Mayer, N., Saikia, T., Keuper, M., Dosovitskiy, A., Brox, T.: Flownet 2.0: Evolution of optical ﬂow estimation with deep networks. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  13. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: Bach, F., Blei, D. (eds.) Proceedings of the 32nd International Conference on Machine Learning. Proceedings of Machine Learning Research, vol. 37, pp. 448-456. PMLR, Lille, France (07-09 Jul 2015), http://proceedings.mlr.press/v37/ioffe15.html  14. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: Proc. ACMMM. pp. 675-678 (2014)  15. Kendall, A., Gal, Y.: What Uncertainties Do We Need in Bayesian Deep Learn- ing for Computer Vision? In: Int. Conference on Neural Information Processing Systems (NIPS) (2017)  16. Kondermann, C., Kondermann, D., J¨ahne, B., Garbe, C.: An Adaptive Confidence Measure for Optical Flows Based on Linear Subspace Projections, pp. 132-141. Springer Berlin Heidelberg, Berlin, Heidelberg (2007), https://doi.org/10.1007/ 978-3-540-74936-3_14   16  E. Ilg, ¨O. C¸ i¸cek, S. Galesso, A. Klein, O. Makansi, F. Hutter and T. Brox  17. Kondermann, C., Mester, R., Garbe, C.: A Statistical Confidence Measure for Optical Flows, pp. 290-301. Springer Berlin Heidelberg, Berlin, Heidelberg (2008), https://doi.org/10.1007/978-3-540-88690-7_22  18. Kybic, J., Nieuwenhuis, C.: Bootstrap optical ﬂow confidence and uncertainty measure. Computer Vision and Image Understanding 115(10), 1449 - 1462 (2011). https://doi.org/https://doi.org/10.1016/j.cviu.2011.06.008, http://www. sciencedirect.com/science/article/pii/S1077314211001536  19. Lakshminarayanan, B., Pritzel, A., Blundell, C.: Simple and scalable predictive  uncertainty estimation using deep ensembles. In: NIPS workshop (2016)  20. Lee, S., Purushwalkam, S., Cogswell, M., Ranjan, V., Crandall, D., Batra, D.: Stochastic multiple choice learning for training diverse deep ensembles. In: Int. Conference on Neural Information Processing Systems (NIPS) (2016)  21. Loshchilov, I., Hutter, F.: Sgdr: Stochastic gradient descent with warm restarts.  In: Int. Conference on Learning Representations (ICLR) (2017)  22. MacKay, D.J.C.: A practical bayesian framework for backpropagation networks.  Neural Computation 4(3), 448-472 (May 1992)  23. Mayer, N., Ilg, E., H¨ausser, P., Fischer, P., Cremers, D., Dosovitskiy, A., Brox, T.: A large dataset to train convolutional networks for disparity, op- tical ﬂow, and scene ﬂow estimation. In: 2016 IEEE Conference on Com- puter Vision and Pattern Recognition (CVPR). pp. 4040-4048 (June 2016). https://doi.org/10.1109/CVPR.2016.438  24. Neal, R.: Bayesian learning for neural networks. PhD thesis, University of Toronto  (1996)  25. Nix, D.A., Weigend, A.S.: Estimating the mean and variance of  the IEEE World target probability distribution. Congress on Computational Intelligence. vol. 1, pp. 55-60 vol.1 (June 1994). https://doi.org/10.1109/ICNN.1994.374138  In: Neural Networks, 1994.  26. Novotny, D., Larlus, D., Vedaldi, A.: Learning 3D object categories by looking around them. In: IEEE Int. Conference on Computer Vision (ICCV) (2017) 27. Pang, J., Sun, W., Ren, J.S.J., Yang, C., Yan, Q.: Cascade residual learning: A two- stage convolutional neural network for stereo matching. In: IEEE Int. Conference on Computer Vision (ICCV) Workshop (2017)  28. Ummenhofer, B., Zhou, H., Uhrig, J., Mayer, N., Ilg, E., Dosovitskiy, A., Brox, T.: Demon: Depth and motion network for learning monocular stereo. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017), http: //lmb.informatik.uni-freiburg.de//Publications/2017/UZUMIDB17  29. Wannenwetsch, A.S., Keuper, M., Roth, S.: Probﬂow: Joint optical ﬂow and un- certainty estimation. In: IEEE Int. Conference on Computer Vision (ICCV) (Oct 2017)  30. Welling, M., Teh, Y.: Bayesian learning via stochastic gradient Langevin dynam- ics. In: Proceedings of the 28th International Conference on Machine Learning (ICML’11) (2011)"}