{"1": "1. Hough, P.V.C.: Method and means for recognizing complex patterns (1962) 2. Illingworth, J., Kittler, J.: A survey of the hough transform. Computer Vision, Graphics, and  3. Guil, N., Zapata, E.L.: Lower order circle and ellipse hough transform. Pattern Recognition  Image Processing (1988)  (1997)  4. Matas, J., Galambos, C., Kittler, J.: Robust detection of lines using the progressive proba-  bilistic hough transform. Computer Vision and Image Understanding (2000)  5. Rosin, P.L.: Ellipse fitting by accumulating five-point fits. Pattern Recognition Letters (1993) 6. Xu, L., Oja, E., Kultanen, P.: A new curve detection method: randomized hough transform  (rht). Pattern Recognition Letters (1990)  7. Fischler, M.A., Bolles, R.C.: Random sample consensus: a paradigm for model fitting with applications to image analysis and automated cartography. Communications of the ACM (1981)  8. Vincent, E., Lagani´ere, R.: Detecting planar homographies in an image pair. In: International  Symposium on Image and Signal Processing and Analysis. (2001)  9. Kanazawa, Y., Kawakami, H.: Detection of planar regions with uncalibrated stereo using  distributions of feature points. In: British Machine Vision Conference. (2004)  10. Zuliani, M., Kenney, C.S., Manjunath, B.: The multiransac algorithm and its application to  detect planar homographies. In: ICIP, IEEE (2005)  11. Isack, H., Boykov, Y.: Energy-based geometric multi-model fitting. International Journal on  Computer Vision (2012)  12. Magri, L., Fusiello, A.: T-Linkage: A continuous relaxation of J-Linkage for multi-model  fitting. In: Conference on Computer Vision and Pattern Recognition. (2014)  13. Magri, L., Fusiello, A.: Robust multiple model fitting with preference analysis and low-rank  approximation. In: British Machine Vision Conference. (2015)  14. Magri, L., Fusiello, A.: Multiple model fitting as a set coverage problem. In: Conference on  Computer Vision and Pattern Recognition. (2016)  15. Toldo, R., Fusiello, A.: Robust multiple structures estimation with j-linkage. In: European  Conference on Computer Vision. (2008)  16. Delong, A., Gorelick, L., Veksler, O., Boykov, Y.: Minimizing energies with hierarchical  costs. International Journal of Computer Vision (2012)  17. Pham, T.T., Chin, T.J., Schindler, K., Suter, D.: Interacting geometric priors for robust multi-  model fitting. TIP (2014)  18. Pham, T.T., Chin, T.J., Yu, J., Suter, D.: The random cluster model for robust geometric  fitting. Pattern Analysis and Machine Intelligence (2014)  19. Barath, D., Matas, J., Hajder, L.: Multi-H: Efficient recovery of tangent planes in stereo  images. In: British Machine Vision Conference. (2016)  20. Boykov, Y., Kolmogorov, V.: An experimental comparison of min-cut/max-ﬂow algorithms  for energy minimization in vision. Pattern Analysis and Machine Intelligence (2004)  21. Zhang, W., Koseck´a, J.: Nonparametric estimation of multiple structures with outliers. In:  Dynamical Vision. (2007)  22. Stricker, M., Leonardis, A.: ExSel++: A general framework to extract parametric models.  In: International Conference on Computer Analysis of Images and Patterns. (1995)  23. Wang, H., Xiao, G., Yan, Y., Suter, D.: Mode-seeking on hypergraphs for robust geometric  model fitting. In: International Conference of Computer Vision. (2015)  24. Delong, A., Osokin, A., Isack, H.N., Boykov, Y.: Fast approximate energy minimization  with label costs. International journal of computer vision (2012)   Multi-XReferences  1. Hough, P.V.C.: Method and means for recognizing complex patterns (1962) 2. Illingworth, J., Kittler, J.: A survey of the hough transform. Computer Vision, Graphics, and  3. Guil, N., Zapata, E.L.: Lower order circle and ellipse hough transform. Pattern Recognition  Image Processing (1988)  (1997)  4. Matas, J., Galambos, C., Kittler, J.: Robust detection of lines using the progressive proba-  bilistic hough transform. Computer Vision and Image Understanding (2000)  5. Rosin, P.L.: Ellipse fitting by accumulating five-point fits. Pattern Recognition Letters (1993) 6. Xu, L., Oja, E., Kultanen, P.: A new curve detection method: randomized hough transform  (rht). Pattern Recognition Letters (1990)  7. Fischler, M.A., Bolles, R.C.: Random sample consensus: a paradigm for model fitting with applications to image analysis and automated cartography. Communications of the ACM (1981)  8. Vincent, E., Lagani´ere, R.: Detecting planar homographies in an image pair. In: International  Symposium on Image and Signal Processing and Analysis. (2001)  9. Kanazawa, Y., Kawakami, H.: Detection of planar regions with uncalibrated stereo using  distributions of feature points. In: British Machine Vision Conference. (2004)  10. Zuliani, M., Kenney, C.S., Manjunath, B.: The multiransac algorithm and its application to  detect planar homographies. In: ICIP, IEEE (2005)  11. Isack, H., Boykov, Y.: Energy-based geometric multi-model fitting. International Journal on  Computer Vision (2012)  12. Magri, L., Fusiello, A.: T-Linkage: A continuous relaxation of J-Linkage for multi-model  fitting. In: Conference on Computer Vision and Pattern Recognition. (2014)  13. Magri, L., Fusiello, A.: Robust multiple model fitting with preference analysis and low-rank  approximation. In: British Machine Vision Conference. (2015)  14. Magri, L., Fusiello, A.: Multiple model fitting as a set coverage problem. In: Conference on  Computer Vision and Pattern Recognition. (2016)  15. Toldo, R., Fusiello, A.: Robust multiple structures estimation with j-linkage. In: European  Conference on Computer Vision. (2008)  16. Delong, A., Gorelick, L., Veksler, O., Boykov, Y.: Minimizing energies with hierarchical  costs. International Journal of Computer Vision (2012)  17. Pham, T.T., Chin, T.J., Schindler, K., Suter, D.: Interacting geometric priors for robust multi-  model fitting. TIP (2014)  18. Pham, T.T., Chin, T.J., Yu, J., Suter, D.: The random cluster model for robust geometric  fitting. Pattern Analysis and Machine Intelligence (2014)  19. Barath, D., Matas, J., Hajder, L.: Multi-H: Efficient recovery of tangent planes in stereo  images. In: British Machine Vision Conference. (2016)  20. Boykov, Y., Kolmogorov, V.: An experimental comparison of min-cut/max-ﬂow algorithms  for energy minimization in vision. Pattern Analysis and Machine Intelligence (2004)  21. Zhang, W., Koseck´a, J.: Nonparametric estimation of multiple structures with outliers. In:  Dynamical Vision. (2007)  22. Stricker, M., Leonardis, A.: ExSel++: A general framework to extract parametric models.  In: International Conference on Computer Analysis of Images and Patterns. (1995)  23. Wang, H., Xiao, G., Yan, Y., Suter, D.: Mode-seeking on hypergraphs for robust geometric  model fitting. In: International Conference of Computer Vision. (2015)  24. Delong, A., Osokin, A., Isack, H.N., Boykov, Y.: Fast approximate energy minimization  with label costs. International journal of computer vision (2012)   16  Barath, Daniel and Matas, Jiri  25. Boykov, Y., Veksler, O., Zabih, R.: Fast approximate energy minimization via graph cuts.  Pattern Analysis and Machine Intelligence (2001)  26. Comaniciu, D., Meer, P.: Mean shift: A robust approach toward feature space analysis.  Pattern Analysis and Machine Intelligence (2002)  27. Nasuto, D., Craddock, J.M.B.R.: NAPSAC: High noise, high dimensional robust estimation  - its in the bag. (2002)  28. Chum, O., Matas, J.: Matching with PROSAC-progressive sample consensus. In: Conference  onComputer Vision and Pattern Recognition, IEEE (2005)  29. Shapira, L., Avidan, S., Shamir, A.: Mode-detection via median-shift.  In: International  30. Weiszfeld, E.: Sur le point pour lequel la somme des distances de n points donn´es est mini-  Conference on Computer Vision. (2009)  mum. Tohoku Mathematical Journal (1937)  31. Tukey, J.W.: Mathematics and the picturing of data. In: ICM. (1975) 32. Datar, M., Immorlica, N., Indyk, P., Mirrokni, V.S.: Locality-sensitive hashing scheme based  on p-stable distributions. In: SoCG. (2004)  33. Muja, M., Lowe, D.G.: Fast approximate nearest neighbors with automatic algorithm con- figuration. International Conference on Computer Vision Theory and Applications (2009) 34. Rockafellar, R.T., Wets, R.J.B.: Variational analysis. Springer Science & Business Media  35. Lebeda, K., Matas, J., Chum, O.: Fixing the locally optimized RANSAC. In: British Machine  (2009)  Vision Conference. (2012)  36. Georgescu, B., Shimshoni, I., Meer, P.: Mean shift based clustering in high dimensions: A texture classification example. In: International Conference on Computer Vision. (2003) 37. Wong, H.S., Chin, T.J., Yu, J., Suter, D.: Dynamic and hierarchical multi-structure geometric  model fitting. In: International Conference on Computer Vision. (2011)  38. Lazic, N., Givoni, I., Frey, B., Aarabi, P.: Floss: Facility location for subspace segmentation.  In: International Conference on Computer Vision. (2009)  39. Pham, T.T., Chin, T.J., Yu, J., Suter, D.: Simultaneous sampling and multi-structure fitting with adaptive reversible jump mcmc. In: Annual Conference on Neural Information Process- ing Systems. (2011)  40. Chin, T.J., Wang, H., Suter, D.: Robust fitting of multiple structures: The statistical learning  approach. In: International Conference on Computer Vision. (2009)  41. Liu, H., Yan, S.: Efficient structure detection via random consensus graph. In: Conference  on Computer Vision and Pattern Recognition. (2012)  42. Tardif, J.P.: Non-iterative approach for fast and accurate vanishing point detection.  In:  International Conference on Computer Vision. (2009)  43. Tron, R., Vidal, R.: A benchmark for the comparison of 3-d motion segmentation algorithms.  In: Conference on Computer Vision and Pattern Recognition. (2007)  44. Elhamifar, E., Vidal, R.: Sparse subspace clustering. In: Conference on Computer Vision  and Pattern Recognition. (2009)"}