{"1": "1. Van Horn, G., Mac Aodha, O., Song, Y., Shepard, A., Adam, H., Perona, P., Be- longie, S.: The inaturalist challenge 2017 dataset. arXiv preprint arXiv:1707.06642 (2017)  2. Norouzzadeh, M.S., Nguyen, A., Kosmala, M., Swanson, A., Packer, C., Clune, J.: Automatically identifying wild animals in camera trap images with deep learning. arXiv preprint arXiv:1703.05830 (2017)  3. van Horn, G., Barry, J., Belongie, S., Perona, P.: The Merlin Bird ID smartphone  app (http://merlin.allaboutbirds.org/download/).  4. Esteva, A., Kuprel, B., Novoa, R.A., Ko, J., Swetter, S.M., Blau, H.M., Thrun, S.: Dermatologist-level classification of skin cancer with deep neural networks. Nature 542(7639) (2017) 115  5. Poplin, R., Varadarajan, A.V., Blumer, K., Liu, Y., McConnell, M.V., Corrado, G.S., Peng, L., Webster, D.R.: Prediction of cardiovascular risk factors from retinal fundus photographs via deep learning. Nature Biomedical Engineering (2018) 1 6. Fukushima, K., Miyake, S.: Neocognitron: A self-organizing neural network model for a mechanism of visual pattern recognition. In: Competition and cooperation in neural nets. Springer (1982) 267-285  7. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. Proceedings of the IEEE 86(11) (1998) 2278-2324  8. Schaller, R.R.: Moore’s law: past, present and future. IEEE spectrum 34(6) (1997)  52-59  9. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A Large-  Scale Hierarchical Image Database. In: CVPR09. (2009)  10. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision, Springer (2014) 740-755  11. Van Horn, G., Perona, P.: The devil is in the tails: Fine-grained classification in  the wild. arXiv preprint arXiv:1709.01450 (2017)  12. Pan, S.J., Yang, Q.: A survey on transfer learning. IEEE Transactions on knowl-  edge and data engineering 22(10) (2010) 1345-1359  13. Torralba, A., Efros, A.A.: Unbiased look at dataset bias. In: Computer Vision and Pattern Recognition (CVPR), 2011 IEEE Conference on, IEEE (2011) 1521-1528 14. Welinder, P., Welling, M., Perona, P.: A lazy man’s approach to benchmarking: Semisupervised classifier evaluation and recalibration. In: Computer Vision and Pattern Recognition (CVPR), 2013 IEEE Conference on, IEEE (2013) 3262-3269  15. Murphy, G.: The big book of concepts. MIT press (2004) 16. Ren, X., Han, T.X., He, Z.: Ensemble video object cut in highly dynamic scenes. In: Computer Vision and Pattern Recognition (CVPR), 2013 IEEE Conference on, IEEE (2013) 1947-1954  17. Yu, X., Wang, J., Kays, R., Jansen, P.A., Wang, T., Huang, T.: Automated iden- tification of animal species in camera trap images. EURASIP Journal on Image and Video Processing 2013(1) (2013) 52  18. Wilber, M.J., Scheirer, W.J., Leitner, P., Heﬂin, B., Zott, J., Reinke, D., Delaney, D.K., Boult, T.E.: Animal recognition in the mojave desert: Vision tools for field biologists. In: Applications of Computer Vision (WACV), 2013 IEEE Workshop on, IEEE (2013) 206-213  19. Chen, G., Han, T.X., He, Z., Kays, R., Forrester, T.: Deep convolutional neural network based species recognition for wild animal monitoring. In: Image Processing (ICIP), 2014 IEEE International Conference on, IEEE (2014) 858-862   Recognition in Terra IncognitaReferences  1. Van Horn, G., Mac Aodha, O., Song, Y., Shepard, A., Adam, H., Perona, P., Be- longie, S.: The inaturalist challenge 2017 dataset. arXiv preprint arXiv:1707.06642 (2017)  2. Norouzzadeh, M.S., Nguyen, A., Kosmala, M., Swanson, A., Packer, C., Clune, J.: Automatically identifying wild animals in camera trap images with deep learning. arXiv preprint arXiv:1703.05830 (2017)  3. van Horn, G., Barry, J., Belongie, S., Perona, P.: The Merlin Bird ID smartphone  app (http://merlin.allaboutbirds.org/download/).  4. Esteva, A., Kuprel, B., Novoa, R.A., Ko, J., Swetter, S.M., Blau, H.M., Thrun, S.: Dermatologist-level classification of skin cancer with deep neural networks. Nature 542(7639) (2017) 115  5. Poplin, R., Varadarajan, A.V., Blumer, K., Liu, Y., McConnell, M.V., Corrado, G.S., Peng, L., Webster, D.R.: Prediction of cardiovascular risk factors from retinal fundus photographs via deep learning. Nature Biomedical Engineering (2018) 1 6. Fukushima, K., Miyake, S.: Neocognitron: A self-organizing neural network model for a mechanism of visual pattern recognition. In: Competition and cooperation in neural nets. Springer (1982) 267-285  7. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. Proceedings of the IEEE 86(11) (1998) 2278-2324  8. Schaller, R.R.: Moore’s law: past, present and future. IEEE spectrum 34(6) (1997)  52-59  9. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A Large-  Scale Hierarchical Image Database. In: CVPR09. (2009)  10. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision, Springer (2014) 740-755  11. Van Horn, G., Perona, P.: The devil is in the tails: Fine-grained classification in  the wild. arXiv preprint arXiv:1709.01450 (2017)  12. Pan, S.J., Yang, Q.: A survey on transfer learning. IEEE Transactions on knowl-  edge and data engineering 22(10) (2010) 1345-1359  13. Torralba, A., Efros, A.A.: Unbiased look at dataset bias. In: Computer Vision and Pattern Recognition (CVPR), 2011 IEEE Conference on, IEEE (2011) 1521-1528 14. Welinder, P., Welling, M., Perona, P.: A lazy man’s approach to benchmarking: Semisupervised classifier evaluation and recalibration. In: Computer Vision and Pattern Recognition (CVPR), 2013 IEEE Conference on, IEEE (2013) 3262-3269  15. Murphy, G.: The big book of concepts. MIT press (2004) 16. Ren, X., Han, T.X., He, Z.: Ensemble video object cut in highly dynamic scenes. In: Computer Vision and Pattern Recognition (CVPR), 2013 IEEE Conference on, IEEE (2013) 1947-1954  17. Yu, X., Wang, J., Kays, R., Jansen, P.A., Wang, T., Huang, T.: Automated iden- tification of animal species in camera trap images. EURASIP Journal on Image and Video Processing 2013(1) (2013) 52  18. Wilber, M.J., Scheirer, W.J., Leitner, P., Heﬂin, B., Zott, J., Reinke, D., Delaney, D.K., Boult, T.E.: Animal recognition in the mojave desert: Vision tools for field biologists. In: Applications of Computer Vision (WACV), 2013 IEEE Workshop on, IEEE (2013) 206-213  19. Chen, G., Han, T.X., He, Z., Kays, R., Forrester, T.: Deep convolutional neural network based species recognition for wild animal monitoring. In: Image Processing (ICIP), 2014 IEEE International Conference on, IEEE (2014) 858-862   16  S. Beery, G. Van Horn, and P. Perona  20. Lin, K.H., Khorrami, P., Wang, J., Hasegawa-Johnson, M., Huang, T.S.: Fore- ground object detection in highly dynamic scenes using saliency. In: Image Pro- cessing (ICIP), 2014 IEEE International Conference on, IEEE (2014) 1125-1129  21. Swanson, A., Kosmala, M., Lintott, C., Simpson, R., Smith, A., Packer, C.: Snap- shot serengeti, high-frequency annotated camera trap images of 40 mammalian species in an african savanna. Scientific data 2 (2015) 150026  22. Zhang, Z., Han, T.X., He, Z.: Coupled ensemble graph cuts and object verification for animal segmentation from highly cluttered videos. In: Image Processing (ICIP), 2015 IEEE International Conference on, IEEE (2015) 2830-2834  23. Zhang, Z., He, Z., Cao, G., Cao, W.: Animal detection from highly cluttered natural scenes using spatiotemporal object region proposals and patch verification. IEEE Transactions on Multimedia 18(10) (2016) 2079-2092  24. Miguel, A., Beery, S., Flores, E., Klemesrud, L., Bayrakcismith, R.: Finding ar- In: Image Processing (ICIP), 2016 IEEE  eas of motion in camera trap images. International Conference on, IEEE (2016) 1334-1338  25. Giraldo-Zuluaga, J.H., Salazar, A., Gomez, A., Diaz-Pulido, A.: Camera-trap im- ages segmentation using multi-layer robust principal component analysis. The Visual Computer (2017) 1-13  26. Yousif, H., Yuan, J., Kays, R., He, Z.: Fast human-animal detection from highly cluttered camera-trap images using joint background modeling and deep learning classification. In: Circuits and Systems (ISCAS), 2017 IEEE International Sympo- sium on, IEEE (2017) 1-4  27. Villa, A.G., Salazar, A., Vargas, F.: Towards automatic wild animal monitoring: Identification of animal species in camera-trap images using very deep convolu- tional neural networks. Ecological Informatics 41 (2017) 24-32  28. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The International journal of computer  pascal visual object classes (voc) challenge. vision 88(2) (2010) 303-338  29. Krasin, I., Duerig, T., Alldrin, N., Ferrari, V., Abu-El-Haija, S., Kuznetsova, A., Rom, H., Uijlings, J., Popov, S., Veit, A., Belongie, S., Gomes, V., Gupta, A., Sun, C., Chechik, G., Cai, D., Feng, Z., Narayanan, D., Murphy, K.: Openimages: A public dataset for large-scale multi-label and multi-class image classification. Dataset available from https://github.com/openimages (2017)  30. Ponce, J., Berg, T.L., Everingham, M., Forsyth, D.A., Hebert, M., Lazebnik, S., Marszalek, M., Schmid, C., Russell, B.C., Torralba, A., et al.: Dataset issues in object recognition. In: Toward category-level object recognition. Springer (2006) 29-48  31. Spain, M., Perona, P.: Some objects are more equal than others: Measuring and In: European Conference on Computer Vision (ECCV),  predicting importance. Springer (2008) 523-536  32. Wah, C., Branson, S., Welinder, P., Perona, P., Belongie, S.: The caltech-ucsd  birds-200-2011 dataset. (2011)  33. Nilsback, M.E., Zisserman, A.: A visual vocabulary for ﬂower classification. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Volume 2. (2006) 1447-1454  34. Kumar, N., Belhumeur, P.N., Biswas, A., Jacobs, D.W., Kress, W.J., Lopez, I., Soares, J.V.B.: Leafsnap: A computer vision system for automatic plant species identification. In: The 12th European Conference on Computer Vision (ECCV). (October 2012)   Recognition in Terra Incognita35. Van Horn, G., Branson, S., Farrell, R., Haber, S., Barry, J., Ipeirotis, P., Perona, P., Belongie, S.: Building a bird recognition app and large scale dataset with citizen scientists: The fine print in fine-grained dataset collection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 595-604  36. St-Charles, P.L., Bilodeau, G.A., Bergevin, R.: Subsense: A universal change de- tection method with local adaptive sensitivity. IEEE Transactions on Image Pro- cessing 24(1) (2015) 359-373  37. Babaee, M., Dinh, D.T., Rigoll, G.: A deep convolutional neural network for  background subtraction. arXiv preprint arXiv:1702.01731 (2017)  38. Zhan, Y., Fu, K., Yan, M., Sun, X., Wang, H., Qiu, X.: Change detection based on deep siamese convolutional network for optical aerial images. IEEE Geoscience and Remote Sensing Letters 14(10) (2017) 1845-1849  39. Benedek, C., Szir´anyi, T.: A mixed markov model for change detection in aerial photos with large time diﬀerences. In: Pattern Recognition, 2008. ICPR 2008. 19th International Conference on, IEEE (2008) 1-4  40. : emammal: a tool for collecting, archiving, and sharing camera trapping images  and data. https://emammal.si.edu/ Accessed: 2018-03-13.  41. Csurka, G.: Domain adaptation for visual applications: A comprehensive survey.  arXiv preprint arXiv:1702.05374 (2017)  42. Ganin, Y., Lempitsky, V.: Unsupervised domain adaptation by backpropagation.  In: International Conference on Machine Learning. (2015) 1180-1189  43. Gebru, T., Hoﬀman, J., Fei-Fei, L.: Fine-grained recognition in the wild: A multi- In: 2017 IEEE International Conference on  task domain adaptation approach. Computer Vision (ICCV), IEEE (2017) 1358-1367  44. Busto, P.P., Gall, J.: Open set domain adaptation. In: The IEEE International  Conference on Computer Vision (ICCV). Volume 1. (2017)  45. Hoﬀman, J., Wang, D., Yu, F., Darrell, T.: Fcns in the wild: Pixel-level adversarial  and constraint-based adaptation. arXiv preprint arXiv:1612.02649 (2016)  46. Chen, Y., Li, W., Van Gool, L.: Road: Reality oriented adaptation for semantic  segmentation of urban scenes. arXiv preprint arXiv:1711.11556 (2017)  47. Zhang, Y., David, P., Gong, B.: Curriculum domain adaptation for semantic seg- mentation of urban scenes. In: The IEEE International Conference on Computer Vision (ICCV). Volume 2. (2017) 6  48. Peng, X., Sun, B., Ali, K., Saenko, K.: Learning deep object detectors from 3d In: Computer Vision (ICCV), 2015 IEEE International Conference on,  models. IEEE (2015) 1278-1286  49. Tang, K., Ramanathan, V., Fei-Fei, L., Koller, D.: Shifting weights: Adapting ob- ject detectors from image to video. In: Advances in Neural Information Processing Systems. (2012) 638-646  50. Sun, B., Saenko, K.: From virtual to reality: Fast adaptation of virtual object  detectors to real domains. In: BMVC. Volume 1. (2014) 3  51. Hattori, H., Boddeti, V.N., Kitani, K., Kanade, T.: Learning scene-specific pedes- trian detectors without real data. In: Computer Vision and Pattern Recognition (CVPR), 2015 IEEE Conference on, IEEE (2015) 3819-3827  52. Xu, J., Ramos, S., V´azquez, D., L´opez, A.M.: Domain adaptation of deformable part-based models. IEEE transactions on pattern analysis and machine intelligence 36(12) (2014) 2367-2380  53. Raj, A., Namboodiri, V.P., Tuytelaars, T.: Subspace alignment based domain  adaptation for rcnn detector. arXiv preprint arXiv:1507.05578 (2015)  54. Grant Van Horn, Scott Laurie, S.B., Perona, P.: Lean multiclass crowdsourcing.  Computer Vision and Pattern Recognition (2018)   18  S. Beery, G. Van Horn, and P. Perona  55. Bengio, Y.: Practical recommendations for gradient-based training of deep archi-  tectures. In: Neural networks: Tricks of the trade. Springer (2012) 437-478  56. Szegedy, C., Vanhoucke, V., Ioﬀe, S., Shlens, J., Wojna, Z.: Rethinking the incep- tion architecture for computer vision. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 2818-2826  57. Huang, J., Rathod, V., Sun, C., Zhu, M., Korattikara, A., Fathi, A., Fischer, I., Wojna, Z., Song, Y., Guadarrama, S., et al.: Speed/accuracy trade-oﬀs for modern convolutional object detectors. In: IEEE CVPR. (2017)  58. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2016) 770-778"}