{"1": "1. Xin Li, Bahadir Gunturk, L.Z.: Image demosaicing: a systematic survey (2008) 2. Zhang, L., Wu, X., Buades, A., Li, X.: Color demosaicking by local directional interpolation and nonlocal adaptive thresholding. Journal of Electronic imaging 20(2) (2011) 023016  3. Duran, J., Buades, A.: Self-similarity and spectral correlation adaptive algorithm for color demosaicking. IEEE transactions on image processing 23(9) (2014) 4031- 4040  4. Buades, A., Coll, B., Morel, J.M., Sbert, C.: Self-similarity driven color demosaick-  ing. IEEE Transactions on Image Processing 18(6) (2009) 1192-1202  5. Heide, F., Steinberger, M., Tsai, Y.T., Rouf, M., Pajak, D., Reddy, D., Gallo, O., Liu, J., Heidrich, W., Egiazarian, K., et al.: Flexisp: A ﬂexible camera image processing framework. ACM Transactions on Graphics (TOG) 33(6) (2014) 231 6. Chang, K., Ding, P.L.K., Li, B.: Color image demosaicking using inter-channel correlation and nonlocal self-similarity. Signal Processing: Image Communication 39 (2015) 264-279  7. Hirakawa, K., Parks, T.W.: Adaptive homogeneity-directed demosaicing algorithm.  IEEE Transactions on Image Processing 14(3) (March 2005) 360-369  8. Alleysson, D., Susstrunk, S., Herault, J.: Linear demosaicing inspired by the human visual system. IEEE Transactions on Image Processing 14(4) (April 2005) 439-449 9. Dubois, E.: Frequency-domain methods for demosaicking of bayer-sampled color  images. IEEE Signal Processing Letters 12(12) (Dec 2005) 847-850  10. Dubois, E.: Filter design for adaptive frequency-domain bayer demosaicking. In:  2006 International Conference on Image Processing. (Oct 2006) 2705-2708  11. Dubois, E.: Color filter array sampling of color images: Frequency-domain analysis  and associated demosaicking algorithms. (01 2009) 183-212  12. Sun, J., Tappen, M.F.: Separable markov random field model and its applications IEEE Transactions on Image Processing 22(1) (Jan 2013)  in low level vision. 402-407  13. He, F.L., Wang, Y.C.F., Hua, K.L.: Self-learning approach to color demosaick- ing via support vector regression. In: Image Processing (ICIP), 2012 19th IEEE International Conference on, IEEE (2012) 2765-2768  14. Khashabi, D., Nowozin, S., Jancsary, J., Fitzgibbon, A.W.: Joint demosaicing and denoising via learned nonparametric random fields. IEEE Transactions on Image Processing 23(12) (Dec 2014) 4968-4981  15. Foi, A., Trimeche, M., Katkovnik, V., Egiazarian, K.: Practical poissonian-gaussian noise modeling and fitting for single-image raw-data. IEEE Transactions on Image Processing 17(10) (Oct 2008) 1737-1754  16. Ossi Kalevo, H.R.: Noise reduction techniques for bayer-matrix images (2002) 17. Menon, D., Calvagno, G.: Joint demosaicking and denoisingwith space-varying filters. In: 2009 16th IEEE International Conference on Image Processing (ICIP). (Nov 2009) 477-480  18. Zhang, L., Lukac, R., Wu, X., Zhang, D.: Pca-based spatially adaptive denois- ing of cfa images for single-sensor digital cameras. IEEE Transactions on Image Processing 18(4) (April 2009) 797-812  19. Klatzer, T., Hammernik, K., Knobelreiter, P., Pock, T.: Learning joint demosaicing and denoising based on sequential energy minimization. In: 2016 IEEE Interna- tional Conference on Computational Photography (ICCP). (May 2016) 1-11   Deep Image Demosaicking with Residual NetworksReferences  1. Xin Li, Bahadir Gunturk, L.Z.: Image demosaicing: a systematic survey (2008) 2. Zhang, L., Wu, X., Buades, A., Li, X.: Color demosaicking by local directional interpolation and nonlocal adaptive thresholding. Journal of Electronic imaging 20(2) (2011) 023016  3. Duran, J., Buades, A.: Self-similarity and spectral correlation adaptive algorithm for color demosaicking. IEEE transactions on image processing 23(9) (2014) 4031- 4040  4. Buades, A., Coll, B., Morel, J.M., Sbert, C.: Self-similarity driven color demosaick-  ing. IEEE Transactions on Image Processing 18(6) (2009) 1192-1202  5. Heide, F., Steinberger, M., Tsai, Y.T., Rouf, M., Pajak, D., Reddy, D., Gallo, O., Liu, J., Heidrich, W., Egiazarian, K., et al.: Flexisp: A ﬂexible camera image processing framework. ACM Transactions on Graphics (TOG) 33(6) (2014) 231 6. Chang, K., Ding, P.L.K., Li, B.: Color image demosaicking using inter-channel correlation and nonlocal self-similarity. Signal Processing: Image Communication 39 (2015) 264-279  7. Hirakawa, K., Parks, T.W.: Adaptive homogeneity-directed demosaicing algorithm.  IEEE Transactions on Image Processing 14(3) (March 2005) 360-369  8. Alleysson, D., Susstrunk, S., Herault, J.: Linear demosaicing inspired by the human visual system. IEEE Transactions on Image Processing 14(4) (April 2005) 439-449 9. Dubois, E.: Frequency-domain methods for demosaicking of bayer-sampled color  images. IEEE Signal Processing Letters 12(12) (Dec 2005) 847-850  10. Dubois, E.: Filter design for adaptive frequency-domain bayer demosaicking. In:  2006 International Conference on Image Processing. (Oct 2006) 2705-2708  11. Dubois, E.: Color filter array sampling of color images: Frequency-domain analysis  and associated demosaicking algorithms. (01 2009) 183-212  12. Sun, J., Tappen, M.F.: Separable markov random field model and its applications IEEE Transactions on Image Processing 22(1) (Jan 2013)  in low level vision. 402-407  13. He, F.L., Wang, Y.C.F., Hua, K.L.: Self-learning approach to color demosaick- ing via support vector regression. In: Image Processing (ICIP), 2012 19th IEEE International Conference on, IEEE (2012) 2765-2768  14. Khashabi, D., Nowozin, S., Jancsary, J., Fitzgibbon, A.W.: Joint demosaicing and denoising via learned nonparametric random fields. IEEE Transactions on Image Processing 23(12) (Dec 2014) 4968-4981  15. Foi, A., Trimeche, M., Katkovnik, V., Egiazarian, K.: Practical poissonian-gaussian noise modeling and fitting for single-image raw-data. IEEE Transactions on Image Processing 17(10) (Oct 2008) 1737-1754  16. Ossi Kalevo, H.R.: Noise reduction techniques for bayer-matrix images (2002) 17. Menon, D., Calvagno, G.: Joint demosaicking and denoisingwith space-varying filters. In: 2009 16th IEEE International Conference on Image Processing (ICIP). (Nov 2009) 477-480  18. Zhang, L., Lukac, R., Wu, X., Zhang, D.: Pca-based spatially adaptive denois- ing of cfa images for single-sensor digital cameras. IEEE Transactions on Image Processing 18(4) (April 2009) 797-812  19. Klatzer, T., Hammernik, K., Knobelreiter, P., Pock, T.: Learning joint demosaicing and denoising based on sequential energy minimization. In: 2016 IEEE Interna- tional Conference on Computational Photography (ICCP). (May 2016) 1-11   16  F. Kokkinos and S. Lefkimmiatis  20. Gharbi, M., Chaurasia, G., Paris, S., Durand, F.: Deep joint demosaicking and  denoising. ACM Trans. Graph. 35(6) (November 2016) 191:1-191:12  21. Boyd, S., Parikh, N., Chu, E., Peleato, B., Eckstein, J., et al.: Distributed opti- mization and statistical learning via the alternating direction method of multipliers. Foundations and Trends R(cid:13) in Machine Learning 3(1) (2011) 1-122  22. Goldstein, T., Osher, S.: The split bregman method for l1-regularized problems.  SIAM journal on imaging sciences 2(2) (2009) 323-343  23. Hunter, D.R., Lange, K.: A tutorial on mm algorithms. The American Statistician  58(1) (2004) 30-37  24. Figueiredo, M.A., Bioucas-Dias, J.M., Nowak, R.D.: Majorization-minimization algorithms for wavelet-based image restoration. IEEE Transactions on Image pro- cessing 16(12) (2007) 2980-2991  25. Romano, Y., Elad, M., Milanfar, P.: The little engine that could: Regularization by denoising (red). SIAM Journal on Imaging Sciences 10(4) (2017) 1804-1844 26. Venkatakrishnan, S.V., Bouman, C.A., Wohlberg, B.: Plug-and-play priors for model based reconstruction. In: 2013 IEEE Global Conference on Signal and In- formation Processing. (Dec 2013) 945-948  27. Zhang, K., Zuo, W., Chen, Y., Meng, D., Zhang, L.: Beyond a gaussian denoiser: Residual learning of deep cnn for image denoising. IEEE Transactions on Image Processing 26(7) (July 2017) 3142-3155  28. Lefkimmiatis, S.: Universal denoising networks: A novel cnn architecture for im- age denoising. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2018) 3204-3213  29. Zhang, K., Zuo, W., Gu, S., Zhang, L.: Learning deep cnn denoiser prior for image  restoration. arXiv preprint (2017)  30. Foi, A.: Clipped noisy images: Heteroskedastic modeling and practical denoising.  Signal Processing 89(12) (2009) 2609-2629  31. Liu, X., Tanaka, M., Okutomi, M.: Single-image noise level estimation for blind denoising. IEEE transactions on image processing 22(12) (2013) 5226-5237 32. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2016) 770-778  33. Beck, A., Teboulle, M.: A fast iterative shrinkage-thresholding algorithm for linear  inverse problems. SIAM Journal on Imaging Sciences 2(1) (2009) 183-202  34. Lin, Q., Xiao, L.: An adaptive accelerated proximal gradient method and its homotopy continuation for sparse optimization. Computational Optimization and Applications 60(3) (Apr 2015) 633-674  35. Buades, A., Coll, B., Morel, J.M.: A non-local algorithm for image denoising. In: Computer Vision and Pattern Recognition, 2005. CVPR 2005. IEEE Computer Society Conference on. Volume 2., IEEE (2005) 60-65  36. Dabov, K., Foi, A., Katkovnik, V., Egiazarian, K.: Image denoising by sparse 3-d transform-domain collaborative filtering. IEEE Transactions on image processing 16(8) (2007) 2080-2095  37. Martin, D., Fowlkes, C., Tal, D., Malik, J.: A database of human segmented natural images and its application to evaluating segmentation algorithms and measuring ecological statistics. In: Proceedings Eighth IEEE International Conference on Computer Vision. ICCV 2001. Volume 2. (2001) 416-423 vol.2  38. He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpassing human- level performance on imagenet classification. In: Proceedings of the IEEE interna- tional conference on computer vision. (2015) 1026-1034   Deep Image Demosaicking with Residual Networks39. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  40. Robinson, A.J., Fallside, F.: The utility driven dynamic error propagation network. Technical Report CUED/F-INFENG/TR.1, Engineering Department, Cambridge University, Cambridge, UK (1987)  41. Getreuer, P.: Color demosaicing with contour stencils. In: 2011 17th International  Conference on Digital Signal Processing (DSP). (July 2011) 1-6  42. Bigdeli, S.A., Zwicker, M., Favaro, P., Jin, M.: Deep mean-shift priors for image restoration. In: Advances in Neural Information Processing Systems. (2017) 763- 772"}