{"1": "2011) 52-68  (2007) 395-416  1. Vidal, R.: Subspace clustering. IEEE Signal Processing Magazine 28(3) (March  2. von Luxburg, U.: A tutorial on spectral clustering. Statistics and Computing 17(4)  3. Elhamifar, E., Vidal, R.: Sparse subspace clustering.  In: IEEE Conference on  Computer Vision and Pattern Recognition. (2009) 2790-2797  4. Elhamifar, E., Vidal, R.: Sparse subspace clustering: Algorithm, theory, and appli- cations. IEEE Transactions on Pattern Analysis and Machine Intelligence 35(11) (2013) 2765-2781  5. Soltanolkotabi, M., Cand`es, E.J.: A geometric analysis of subspace clustering with  outliers. Annals of Statistics 40(4) (2012) 2195-2238  6. You, C., Vidal, R.: Geometric conditions for subspace-sparse recovery. In: Inter-  national Conference on Machine learning. (2015) 1585-1593  7. Wang, Y.X., Xu, H.: Noisy sparse subspace clustering. Journal of Machine Learning  Research 17(12) (2016) 1-41  8. You, C., Robinson, D., Vidal, R.: Provable self-representation based outlier de- tection in a union of subspaces. In: IEEE Conference on Computer Vision and Pattern Recognition. (2017)  9. Liu, G., Lin, Z., Yu, Y.: Robust subspace segmentation by low-rank representation.  In: International Conference on Machine Learning. (2010) 663-670  10. Lu, C.Y., Min, H., Zhao, Z.Q., Zhu, L., Huang, D.S., Yan, S.: Robust and eﬃcient subspace segmentation via least squares regression. In: European Conference on Computer Vision. (2012) 347-360  11. Dyer, E.L., Sankaranarayanan, A.C., Baraniuk, R.G.: Greedy feature selection for subspace clustering. Journal of Machine Learning Research 14(1) (2013) 2487-2517 12. You, C., Li, C.G., Robinson, D., Vidal, R.: Oracle based active set algorithm for scalable elastic net subspace clustering. In: IEEE Conference on Computer Vision and Pattern Recognition. (2016) 3928-3937  13. Yang, Y., Feng, J., Jojic, N., Yang, J., Huang, T.S.: ℓ0-sparse subspace clustering.  In: European Conference on Computer Vision. (2016) 731-747  14. Xin, B., Wang, Y., Gao, W., Wipf, D.: Building invariances into sparse subspace  clustering. IEEE Transactions on Signal Processing 66(2) (2018) 449-462  15. You, C., Donnat, C., Robinson, D., Vidal, R.: A divide-and-conquer framework for large-scale subspace clustering. In: Asilomar Conference on Signals, Systems and Computers. (2016)  16. You, C., Li, C., Robinson, D., Vidal, R.: A scalable exemplar-based subspace  clustering algorithm for class-imbalanced data. (2018)  17. Aharon, M., Elad, M., Bruckstein, A.M.: K-SVD: an algorithm for designing over- complete dictionaries for sparse representation. IEEE Transactions on Signal Pro- cessing 54(11) (2006) 4311-4322  18. Bach, F., Jenatton, R., Mairal, J., Obozinski, G.: Optimization with sparsity- inducing penalties. Journal Foundations and Trends in Machine Learning 4(1) (2012) 1-106  19. Adler, A., Elad, M., Hel-Or, Y.: Linear-time subspace clustering via bipartite graph modeling. IEEE Transactions on Neural Networks and Learning Systems 26(10) (2015) 2234 - 2246  20. Traganitis, P.A., Giannakis, G.B.: Sketched subspace clustering. IEEE Transac-  tions on Signal Processing (2017)   Exemplar-based Subspace Clustering for Class-Imbalanced DataReferences  2011) 52-68  (2007) 395-416  1. Vidal, R.: Subspace clustering. IEEE Signal Processing Magazine 28(3) (March  2. von Luxburg, U.: A tutorial on spectral clustering. Statistics and Computing 17(4)  3. Elhamifar, E., Vidal, R.: Sparse subspace clustering.  In: IEEE Conference on  Computer Vision and Pattern Recognition. (2009) 2790-2797  4. Elhamifar, E., Vidal, R.: Sparse subspace clustering: Algorithm, theory, and appli- cations. IEEE Transactions on Pattern Analysis and Machine Intelligence 35(11) (2013) 2765-2781  5. Soltanolkotabi, M., Cand`es, E.J.: A geometric analysis of subspace clustering with  outliers. Annals of Statistics 40(4) (2012) 2195-2238  6. You, C., Vidal, R.: Geometric conditions for subspace-sparse recovery. In: Inter-  national Conference on Machine learning. (2015) 1585-1593  7. Wang, Y.X., Xu, H.: Noisy sparse subspace clustering. Journal of Machine Learning  Research 17(12) (2016) 1-41  8. You, C., Robinson, D., Vidal, R.: Provable self-representation based outlier de- tection in a union of subspaces. In: IEEE Conference on Computer Vision and Pattern Recognition. (2017)  9. Liu, G., Lin, Z., Yu, Y.: Robust subspace segmentation by low-rank representation.  In: International Conference on Machine Learning. (2010) 663-670  10. Lu, C.Y., Min, H., Zhao, Z.Q., Zhu, L., Huang, D.S., Yan, S.: Robust and eﬃcient subspace segmentation via least squares regression. In: European Conference on Computer Vision. (2012) 347-360  11. Dyer, E.L., Sankaranarayanan, A.C., Baraniuk, R.G.: Greedy feature selection for subspace clustering. Journal of Machine Learning Research 14(1) (2013) 2487-2517 12. You, C., Li, C.G., Robinson, D., Vidal, R.: Oracle based active set algorithm for scalable elastic net subspace clustering. In: IEEE Conference on Computer Vision and Pattern Recognition. (2016) 3928-3937  13. Yang, Y., Feng, J., Jojic, N., Yang, J., Huang, T.S.: ℓ0-sparse subspace clustering.  In: European Conference on Computer Vision. (2016) 731-747  14. Xin, B., Wang, Y., Gao, W., Wipf, D.: Building invariances into sparse subspace  clustering. IEEE Transactions on Signal Processing 66(2) (2018) 449-462  15. You, C., Donnat, C., Robinson, D., Vidal, R.: A divide-and-conquer framework for large-scale subspace clustering. In: Asilomar Conference on Signals, Systems and Computers. (2016)  16. You, C., Li, C., Robinson, D., Vidal, R.: A scalable exemplar-based subspace  clustering algorithm for class-imbalanced data. (2018)  17. Aharon, M., Elad, M., Bruckstein, A.M.: K-SVD: an algorithm for designing over- complete dictionaries for sparse representation. IEEE Transactions on Signal Pro- cessing 54(11) (2006) 4311-4322  18. Bach, F., Jenatton, R., Mairal, J., Obozinski, G.: Optimization with sparsity- inducing penalties. Journal Foundations and Trends in Machine Learning 4(1) (2012) 1-106  19. Adler, A., Elad, M., Hel-Or, Y.: Linear-time subspace clustering via bipartite graph modeling. IEEE Transactions on Neural Networks and Learning Systems 26(10) (2015) 2234 - 2246  20. Traganitis, P.A., Giannakis, G.B.: Sketched subspace clustering. IEEE Transac-  tions on Signal Processing (2017)   16  C. You, C. Li, D. Robinson, R. Vidal  21. Tropp, J.A., Gilbert, A.C., Strauss, M.J.: Algorithms for simultaneous sparse approximation. part i: Greedy pursuit. Signal Processing 86(3) (2006) 572-588 22. Cevher, V., Krause, A.: Greedy dictionary selection for sparse representation.  IEEE Journal of Selected Topics in Signal Processing 5(5) (2011) 979-988  23. Das, A., Kempe, D.: Submodular meets spectral: Greedy algorithms for sub- arXiv preprint  set selection, sparse approximation and dictionary selection. arXiv:1102.3975 (2011)  24. Tropp, J.A.: Algorithms for simultaneous sparse approximation. part ii: Convex relaxation. Signal Processing, Special Issue on Sparse approximations in signal and image processing 86 (2006) 589-602  25. Cong, Y., Yuan, J., Liu, J.: Sparse reconstruction cost for abnormal event detec- tion. In: The 24th IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2011, Colorado Springs, CO, USA, 20-25 June 2011. (2011) 3449-3456 26. Elhamifar, E., Sapiro, G., Vidal, R.: See all by looking at a few: Sparse modeling for finding representative objects. In: IEEE Conference on Computer Vision and Pattern Recognition. (2012)  27. Meng, J., Wang, H., Yuan, J., Tan, Y.P.: From keyframes to key objects: Video summarization by representative object proposal selection. In: CVPR. (2016) 1039- 1048  28. Wang, H., Kawahara, Y., Weng, C., Yuan, J.: Representative selection with struc-  tured sparsity. Pattern Recognition 63 (2017) 268-278  29. Cong, Y., Yuan, J., Luo, J.: Towards scalable summarization of consumer videos via sparse dictionary selection. IEEE Transactions on Multimedia 14(1) (2012) 66-75  30. Borodin, A.: Determinantal point processes. arXiv preprint arXiv:0911.1153 (2009) 31. Gillenwater, J.A., Kulesza, A., Fox, E., Taskar, B.: Expectation-maximization for  learning determinantal point processes. In: NIPS. (2014) 3149-3157  32. Kulesza, A., Taskar, B.: k-dpps: Fixed-size determinantal point processes.  In:  33. Chan, T.: Rank revealing qr factorizations. Lin. Alg. and its Appl. 88-89 (1987)  ICML. (2011) 1193-1200  67-82  34. Boutsidis, C., Mahoney, M.W., Drineas, P.: An improved approximation algorithm for the column subset selection problem. In: Proceedings of SODA. (2009) 968-977 35. Altschuler, J., Bhaskara, A., Fu, G., Mirrokni, V., Rostamizadeh, A., Zadimoghad- dam, M.: Greedy column subset selection: New bounds and distributed algorithms. In: International Conference on Machine Learning. (2016) 2539-2548  36. Arora, S., Ge, R., Kannan, R., Moitra, A.: Computing a nonnegative matrix factorization-provably. In: Proceedings of the forty-fourth annual ACM symposium on Theory of computing, ACM (2012) 145-162  37. Kumar, A., Sindhwani, V., Kambadur, P.: Fast conical hull algorithms for near- separable non-negative matrix factorization. In: Proceedings of the 30th Interna- tional Conference on Machine Learning (ICML). (2013) 231-239  38. Elhamifar, E., Sapiro, G., Vidal, R.: Finding exemplars from pairwise dissimi- larities via simultaneous sparse recovery. In: Neural Information Processing and Systems. (2012)  39. Aldroubi, A., Sekmen, A., Koku, A.B., Cakmak, A.F.: Similarity matrix framework for data from union of subspaces. Applied and Computational Harmonic Analysis (2017)  40. Aldroubi, A., Hamm, K., Koku, A.B., Sekmen, A.: Cur decompositions, similarity  matrices, and subspace clustering. arXiv preprint arXiv:1711.04178 (2017)   Exemplar-based Subspace Clustering for Class-Imbalanced Data41. Abdolali, M., Gillis, N., Rahmati, M.:  clustering using randomized clustering and multilayer graphs. arXiv:1802.07648 (2018)  Scalable and robust sparse subspace arXiv preprint  42. Williamson, D.P., Shmoys, D.B.: The design of approximation algorithms. Cam-  bridge university press (2011)  43. Vershynin, R.: Lectures in geometric functional analysis. (2009) 44. Donoho, D.L.: Neighborly polytopes and sparse solution of underdetermined linear  equations. Technical Report, Stanford University (2005)  45. Toth, L.F.: On covering a spherical surface with equal spherical caps (in hungar-  ian). Matematikai Fiz. Lapok (50) (1943) 40-46  46. Croft, H.T., Guy, R.K., Falconer, K.J.: Unsolved problems in geometry. Springer  (1991)  47. Vidal, R., Tron, R., Hartley, R.: Multiframe motion segmentation with missing International Journal of Computer  data using PowerFactorization, and GPCA. Vision 79(1) (2008) 85-105  48. You, C., Robinson, D., Vidal, R.: Scalable sparse subspace clustering by orthog- In: IEEE Conference on Computer Vision and Pattern  onal matching pursuit. Recognition. (2016) 3918-3927  49. Efron, B., Hastie, T., Johnstone, I., Tibshirani, R.: Least angle regression. Annals  of Statistics 32(2) (2004) 407-499  50. Mairal, J., Bach, F., Ponce, J., Sapiro, G.: Online learning for matrix factorization and sparse coding. The Journal of Machine Learning Research 11 (2010) 19-60 51. Vedaldi, A., Fulkerson, B.: VLFeat: An open and portable library of computer  vision algorithms. http://www.vlfeat.org/ (2008)  52. Cohen, G., Afshar, S., Tapson, J., van Schaik, A.: Emnist: an extension of mnist  to handwritten letters. arXiv preprint arXiv:1702.05373 (2017)  53. Bruna, J., Mallat, S.: Invariant scattering convolution networks. IEEE Transac- tions on Pattern Analysis and Machine Intelligence 35(8) (2013) 1872-1886 54. Stallkamp, J., Schlipsing, M., Salmen, J., Igel, C.: Man vs. computer: Benchmark- ing machine learning algorithms for traﬃc sign recognition. Neural Networks (0) (2012) -  55. Dalal, N., Triggs, B.: Histograms of oriented gradients for human detection. In:  IEEE Conference on Computer Vision and Pattern Recognition. (2005)  56. Basri, R., Jacobs, D.: Lambertian reﬂection and linear subspaces. IEEE Transac-  tions on Pattern Analysis and Machine Intelligence 25(2) (2003) 218-233  57. Heckel, R., B¨olcskei, H.: Robust subspace clustering via thresholding. IEEE Trans-  actions on Information Theory 61(11) (2015) 6320-6342  58. Shen, J., Li, P., Xu, H.: Online low-rank subspace clustering by basis dictionary pursuit. In: Proceedings of the 33rd International Conference on Machine Learning. (2016) 622-631  59. Brodersen, K.H., Ong, C.S., Stephan, K.E., Buhmann, J.M.: The balanced ac- curacy and its posterior distribution. In: Pattern recognition (ICPR), 2010 20th international conference on, IEEE (2010) 3121-3124  60. Wright, S.J., Nowak, R.D., Figueiredo, M.A.T.: Sparse reconstruction by separable approximation. IEEE Transactions on Signal Processing 57 (2009) 2479-2493 61. Park, H.S., Jun, C.H.: A simple and fast algorithm for k-medoids clustering. Expert  systems with applications 36(2) (2009) 3336-3341"}