{"1": "1. Liu, Z., Luo, P., Wang, X., Tang, X.: Deep learning face attributes in the wild. In: Proc. International Conference on Computer Vision, Santiago, Chile (Dec. 13-16 2015)  2. Olah, C., Satyanarayan, A., Johnson, I., Carter, S., Schubert, L., Ye, K., Mordv-  intsev, A.: The building blocks of interpretability. Distill (2018)  3. Chawla, N.V., Bowyer, K.W., Hall, L.O., Kegelmeyer, W.P.: Smote: synthetic minority over-sampling technique. Journal of Artificial Intelligence Research (2002) 4. Maciejewski, T., Stefanowski, J.: Local neighbourhood extension of smote for mining imbalanced data. In: Proc. Computational Intelligence and Data Mining, Paris, France (Apr. 11-15 2011)  5. Drummond, C., Holte, R.C., et al.: Class imbalance, and cost sensitivity: why under-sampling beats over-sampling. In: Proc. Workshop on Learning from Imbal- anced Datasets II, Washington, DC (Aug. 21 2003)  6. Khan, S.H., Hayat, M., Bennamoun, M., Sohel, F.A., Togneri, R.: Cost-sensitive learning of deep feature representations from imbalanced data. Transactions on Neural Networks and Learning Systems (2017)  7. Huang, C., Li, Y., Change Loy, C., Tang, X.: Learning deep representation for imbalanced classification. In: Proc. Conference on Computer Vision and Pattern Recognition, Las Vegas, NV (June 26 - July 1 2016)  8. Huang, C., Li, Y., Loy, C.C., Tang, X.: Deep imbalanced learning for face recog-  nition and attribute prediction. arXiv preprint arXiv:1806.00194 (2018)  9. Dong, Q., Gong, S., Zhu, X.: Class rectification hard mining for imbalanced deep In: Proc. International Conference on Computer Vision, Venice, Italy  learning. (Oct. 22-29 2017)  10. Li, Y., Huang, C., Loy, C.C., Tang, X.: Human attribute recognition by deep hierar- chical contexts. In: Proc. European Conference on Computer Vision, Amsterdam, The Netherlands (Oct. 8-16 2016)  11. Gkioxari, G., Girshick, R., Malik, J.: Actions and attributes from wholes and In: Proc. International Conference on Computer Vision, Santiago, Chile  parts. (Dec. 13-16 2015)  12. Sarfraz, M.S., Schumann, A., Wang, Y., Stiefelhagen, R.: Deep view-sensitive pedestrian attribute inference in an end-to-end model. In: Proc. British Machine Vision Conference, London, UK (Sep. 4-7 2017)  13. Sarafianos, N., Giannakopoulos, T., Nikou, C., Kakadiaris, I.A.: Curriculum learn- ing of visual attribute clusters for multi-task classification. Pattern Recognition (2018)  14. Zhu, F., Li, H., Ouyang, W., Yu, N., Wang, X.: Learning spatial regularization with image-level supervisions for multi-label image classification. In: Proc. Conference on Computer Vision and Pattern Recognition, Honolulu, HI (July 21-26 2017) 15. Deng, Y., Luo, P., Loy, C.C., Tang, X.: Pedestrian attribute recognition at far  distance. In: Proc. ACM Multimedia, Orlando, FL (Nov. 3-7 2014)  16. Martinez, J., Hossain, R., Romero, J., Little, J.J.: A simple yet eﬀective baseline for 3D human pose estimation. In: Proc. International Conference on Computer Vision, Venice, Italy (Oct. 22-29 2017)  17. Chan, T.H., Jia, K., Gao, S., Lu, J., Zeng, Z., Ma, Y.: PCANet: A simple deep learning baseline for image classification? Transactions on Image Processing (2015) 18. Zheng, Z., Zheng, L., Yang, Y.: Unlabeled samples generated by gan improve the person re-identification baseline in vitro. In: Proc. Conference on Computer Vision and Pattern Recognition, Honolulu, HI (July 21-26 2017)   Deep Imbalanced Attribute Classification using Attention AggregationReferences  1. Liu, Z., Luo, P., Wang, X., Tang, X.: Deep learning face attributes in the wild. In: Proc. International Conference on Computer Vision, Santiago, Chile (Dec. 13-16 2015)  2. Olah, C., Satyanarayan, A., Johnson, I., Carter, S., Schubert, L., Ye, K., Mordv-  intsev, A.: The building blocks of interpretability. Distill (2018)  3. Chawla, N.V., Bowyer, K.W., Hall, L.O., Kegelmeyer, W.P.: Smote: synthetic minority over-sampling technique. Journal of Artificial Intelligence Research (2002) 4. Maciejewski, T., Stefanowski, J.: Local neighbourhood extension of smote for mining imbalanced data. In: Proc. Computational Intelligence and Data Mining, Paris, France (Apr. 11-15 2011)  5. Drummond, C., Holte, R.C., et al.: Class imbalance, and cost sensitivity: why under-sampling beats over-sampling. In: Proc. Workshop on Learning from Imbal- anced Datasets II, Washington, DC (Aug. 21 2003)  6. Khan, S.H., Hayat, M., Bennamoun, M., Sohel, F.A., Togneri, R.: Cost-sensitive learning of deep feature representations from imbalanced data. Transactions on Neural Networks and Learning Systems (2017)  7. Huang, C., Li, Y., Change Loy, C., Tang, X.: Learning deep representation for imbalanced classification. In: Proc. Conference on Computer Vision and Pattern Recognition, Las Vegas, NV (June 26 - July 1 2016)  8. Huang, C., Li, Y., Loy, C.C., Tang, X.: Deep imbalanced learning for face recog-  nition and attribute prediction. arXiv preprint arXiv:1806.00194 (2018)  9. Dong, Q., Gong, S., Zhu, X.: Class rectification hard mining for imbalanced deep In: Proc. International Conference on Computer Vision, Venice, Italy  learning. (Oct. 22-29 2017)  10. Li, Y., Huang, C., Loy, C.C., Tang, X.: Human attribute recognition by deep hierar- chical contexts. In: Proc. European Conference on Computer Vision, Amsterdam, The Netherlands (Oct. 8-16 2016)  11. Gkioxari, G., Girshick, R., Malik, J.: Actions and attributes from wholes and In: Proc. International Conference on Computer Vision, Santiago, Chile  parts. (Dec. 13-16 2015)  12. Sarfraz, M.S., Schumann, A., Wang, Y., Stiefelhagen, R.: Deep view-sensitive pedestrian attribute inference in an end-to-end model. In: Proc. British Machine Vision Conference, London, UK (Sep. 4-7 2017)  13. Sarafianos, N., Giannakopoulos, T., Nikou, C., Kakadiaris, I.A.: Curriculum learn- ing of visual attribute clusters for multi-task classification. Pattern Recognition (2018)  14. Zhu, F., Li, H., Ouyang, W., Yu, N., Wang, X.: Learning spatial regularization with image-level supervisions for multi-label image classification. In: Proc. Conference on Computer Vision and Pattern Recognition, Honolulu, HI (July 21-26 2017) 15. Deng, Y., Luo, P., Loy, C.C., Tang, X.: Pedestrian attribute recognition at far  distance. In: Proc. ACM Multimedia, Orlando, FL (Nov. 3-7 2014)  16. Martinez, J., Hossain, R., Romero, J., Little, J.J.: A simple yet eﬀective baseline for 3D human pose estimation. In: Proc. International Conference on Computer Vision, Venice, Italy (Oct. 22-29 2017)  17. Chan, T.H., Jia, K., Gao, S., Lu, J., Zeng, Z., Ma, Y.: PCANet: A simple deep learning baseline for image classification? Transactions on Image Processing (2015) 18. Zheng, Z., Zheng, L., Yang, Y.: Unlabeled samples generated by gan improve the person re-identification baseline in vitro. In: Proc. Conference on Computer Vision and Pattern Recognition, Honolulu, HI (July 21-26 2017)   16  Nikolaos Sarafianos, Xiang Xu, and Ioannis A. Kakadiaris  19. Ferrari, V., Zisserman, A.: Learning visual attributes. In: Proc. Advances in Neural  Information Processing Systems, Vancouver, Canada (Dec. 3-6 2007)  20. Kumar, N., Berg, A., Belhumeur, P.N., Nayar, S.: Describable visual attributes for face verification and image search. Transactions on Pattern Analysis and Machine Intelligence (2011)  21. Chen, H., Gallagher, A., Girod, B.: Describing clothing by semantic attributes. In: Proc. European Conference on Computer Vision, Florence, Italy (Oct. 7-13 2012) 22. Sarafianos, N., Giannakopoulos, T., Nikou, C., Kakadiaris, I.A.: Curriculum learn- ing for multi-task classification of visual attributes. In: Proc. International Con- ference on Computer Vision Workshops, Venice, Italy (Oct. 22-29 2017)  23. Zhang, N., Paluri, M., Ranzato, M., Darrell, T., Bourdev, L.: PANDA: Pose aligned networks for deep attribute modeling. In: Proc. Conference on Computer Vision and Pattern Recognition, Columbus, OH (June 23-28 2014)  24. Dong, Q., Gong, S., Zhu, X.: Multi-task curriculum transfer deep learning of In: Proc. Winter Conference on Applications of Computer  clothing attributes. Vision, Santa Rosa, CA (March 27-29 2017)  25. Sarafianos, N., Vrigkas, M., Kakadiaris, I.A.: Adaptive SVM+: Learning with privileged information for domain adaptation. In: Proc. International Conference on Computer Vision Workshops, Venice, Italy (Oct. 22-29 2017)  26. Chen, Q., Huang, J., Feris, R., Brown, L.M., Dong, J., Yan, S.: Deep domain adaptation for describing people based on fine-grained clothing attributes. In: Proc. Conference on Computer Vision and Pattern Recognition, Boston, MA (June 8-10 2015)  27. Liu, Z., Luo, P., Qiu, S., Wang, X., Tang, X.: Deepfashion: Powering robust clothes recognition and retrieval with rich annotations. In: Proc. Conference on Computer Vision and Pattern Recognition, Las Vegas, NV (June 26 - July 1 2016)  28. Al-Halah, Z., Stiefelhagen, R., Grauman, K.: Fashion forward: Forecasting visual style in fashion. In: Proc. International Conference on Computer Vision, Venice, Italy (Oct. 22-29 2017)  29. Zhu, J., Liao, S., Lei, Z., Li, S.Z.: Multi-label convolutional neural network based  pedestrian attribute classification. Image and Vision Computing (2016)  30. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proc. Conference on Computer Vision and Pattern Recognition, Las Vegas, NV (June 26 - July 1 2016)  31. Wang, J., Yuan, Y., Yu, G.: Face attention network: An eﬀective face detector for  the occluded faces. arXiv preprint arXiv:1711.07246 (2017)  32. Liu, X., Xia, T., Wang, J., Yang, Y., Zhou, F., Lin, Y.: Fully convolutional attention networks for fine-grained recognition. arXiv preprint arXiv:1603.06765 (2016) 33. Li, W., Zhu, X., Gong, S.: Harmonious attention network for person re- identification. In: Proc. Conference on Computer Vision and Pattern Recognition, Salt Lake City, UT (June 18-22 2018)  34. Wang, F., Jiang, M., Qian, C., Yang, S., Li, C., Zhang, H., Wang, X., Tang, X.: Residual attention network for image classification. In: Proc. Conference on Com- puter Vision and Pattern Recognition, Honolulu, HI (July 21-26 2017)  35. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks.  arXiv preprint  arXiv:1709.01507 (2017)  36. Chu, X., Yang, W., Ouyang, W., Ma, C., Yuille, A.L., Wang, X.: Multi-context attention for human pose estimation. In: Proc. Conference on Computer Vision and Pattern Recognition, Honolulu, HI (July 21-26 2017)   Deep Imbalanced Attribute Classification using Attention Aggregation37. Chen, S.F., Chen, Y.C., Yeh, C.K., Wang, Y.C.F.: Order-free rnn with visual In: Proc. AAAI Conference on Artificial  attention for multi-label classification. Intelligence, New Orleans, LA (Feb. 2-7 2018)  38. Das, A., Agrawal, H., Zitnick, L., Parikh, D., Batra, D.: Human attention in visual question answering: Do humans and deep networks look at the same regions? Computer Vision and Image Understanding (2017)  39. Rodrguez, P., Gonfaus, J.M., Cucurull, G., Roca, X., Gonzlez, J.: Attend and rectify: a gated attention mechanism for fine-grained recovery. In: Proc. European Conference on Computer Vision, Munich, Germany (Sept. 8-14 2018)  40. Lin, T.Y., Goyal, P., Girshick, R., He, K., Doll´ar, P.: Focal loss for dense object detection. In: Proc. International Conference on Computer Vision, Venice, Italy (Oct. 22-29 2017)  41. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected In: Proc. Conference on Computer Vision and Pattern  convolutional networks. Recognition, Honolulu, HI (July 21-26 2017)  42. Wang, W., Shen, J.: Deep visual attention prediction. Transactions on Image  Processing (2018)  43. Chang, H.S., Learned-Miller, E., McCallum, A.: Active bias: Training more ac- curate neural networks by emphasizing high variance samples. In: Proc. Neural Information Processing Systems, Long Beach, CA (Dec. 4-9 2017)  44. Girshick, R.: Fast R-CNN. In: Proc. International Conference on Computer Vision,  Santiago, Chile (Dec. 13-16 2015)  45. Gkioxari, G., Girshick, R., Malik, J.: Contextual action recognition with R*CNN. In: Proc. International Conference on Computer Vision, Santiago, Chile (Dec. 13- 16 2015)  46. Guo, H., Fan, X., Wang, S.: Human attribute recognition by refining attention  heat map. Pattern Recognition Letters (2017)  47. Sudowe, P., Spitzer, H., Leibe, B.: Person attribute recognition with a jointly- In: Proc. International Conference on Computer  trained holistic CNN model. Vision Workshops, Santiago, Chile (Dec. 13-16 2015)  48. Yu, K., Leng, B., Zhang, Z., Li, D., Huang, K.: Weakly-supervised learning of mid- level features for pedestrian attribute recognition and localization. arXiv preprint arXiv:1611.05603 (2016)  49. Li, D., Chen, X., Huang, K.: Multi-attribute learning for pedestrian attribute recog- nition in surveillance scenarios. In: Proc. Asian Conference on Pattern Recognition, Kuala Lumpur, Malaysia (Nov. 3-6 2015)  50. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Van- houcke, V., Rabinovich, A.: Going deeper with convolutions. In: Proc. Conference on Computer Vision and Pattern Recognition, Boston, MA (June 7-12 2015) 51. Li, D., Zhang, Z., Chen, X., Ling, H., Huang, K.: A richly annotated dataset for  pedestrian attribute recognition. arXiv preprint arXiv:1603.07054 (2016)  52. Jaderberg, M., Simonyan, K., Zisserman, A., et al.: Spatial transformer networks. In: Proc. Neural Information Processing Systems, Montreal, Canada (Dec. 7-12 2015)  53. Peng, X., Feris, R.S., Wang, X., Metaxas, D.N.: A recurrent encoder-decoder network for sequential face alignment. In: Proc. European Conference on Computer Vision, Amsterdam, The Netherlands (Oct. 8-16 2016)  54. Tuzel, O., Marks, T.K., Tambe, S.: Robust face alignment using a mixture of in- variant experts. In: Proc. European Conference on Computer Vision, Amsterdam, The Netherlands (Oct. 8-16 2016)   18  Nikolaos Sarafianos, Xiang Xu, and Ioannis A. Kakadiaris  55. Jeni, L.A., Cohn, J.F., Kanade, T.: Dense 3D face alignment from 2D video for  real-time use. Image and Vision Computing (2017)  56. Kim, J., Kwon Lee, J., Mu Lee, K.: Accurate image super-resolution using very deep convolutional networks. In: Proc. Conference on Computer Vision and Pattern Recognition, Las Vegas, NV (June 26 - July 1 2016)  57. Dahl, R., Norouzi, M., Shlens, J.: Pixel recursive super resolution.  In: Proc.  International Conference on Computer Vision, Venice, Italy (Oct. 22-29 2017) 58. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature pyramid networks for object detection. In: Proc. Conference on Computer Vision and Pattern Recognition, Honolulu, HI (July 21-26 2017)  59. Liang, J., Jiang, L., Cao, L., Li, L.J., Hauptmann, A.: Focal visual-text atten- tion for visual question answering. In: Proc. Conference on Computer Vision and Pattern Recognition, Salt Lake City, UT (June 18-22 2018)"}