{"1": "1. Badrinarayanan, V., Kendall, A., Cipolla, R.: Segnet: A deep convolutional  encoder-decoder architecture for image segmentation. TPAMI (2017)  2. Chandra, S., Kokkinos, I.: Fast, exact and multi-scale inference for semantic image  segmentation with deep gaussian crfs. In: ECCV (2016)  3. Chandra, S., Usunier, N., Kokkinos, I.: Dense and low-rank gaussian crfs using  deep embeddings. In: ICCV (2017)  4. Chen, L., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. ICLR (2015) 5. Chen, L., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. TPAMI (2018)  6. Chen, L.C., Papandreou, G., Schroﬀ, F., Adam, H.: Rethinking atrous convolution  for semantic image segmentation. arXiv:1706.05587 (2017)  7. Chen, L., Yang, Y., Wang, J., Xu, W., Yuille, A.L.: Attention to scale: Scale-aware  semantic image segmentation. In: CVPR (2016)  8. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR (2016)  9. Everingham, M., Gool, L.J.V., Williams, C.K.I., Winn, J.M., Zisserman, A.: The  pascal visual object classes VOC challenge. IJCV (2010)  10. Gadde, R., Jampani, V., Gehler, P.V.: Semantic video cnns through representation  warping. In: ICCV (2017)  11. Ghiasi, G., Fowlkes, C.C.: Laplacian pyramid reconstruction and refinement for  12. Hariharan, B., Arbelaez, P., Bourdev, L.D., Maji, S., Malik, J.: Semantic contours  semantic segmentation. In: ECCV (2016)  from inverse detectors. In: ICCV (2011)  13. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  14. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected  convolutional networks. In: CVPR (2017)  15. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R.B., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM MM (2014)  16. Jin, X., Li, X., Xiao, H., Shen, X., Lin, Z., Yang, J., Chen, Y., Dong, J., Liu, L., Jie, Z., et al.: Video scene parsing with predictive feature learning. In: ICCV (2017) 17. Kendall, A., Gal, Y., Cipolla, R.: Multi-task learning using uncertainty to weigh  losses for scene geometry and semantics. In: CVPR (2018)  18. Kr¨ahenb¨uhl, P., Koltun, V.: Eﬃcient inference in fully connected crfs with gaussian  edge potentials. In: NIPS (2011)  19. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS (2012)  20. Li, X., Liu, Z., Luo, P., Loy, C.C., Tang, X.: Not all pixels are equal: diﬃculty-aware  semantic segmentation via deep layer cascade. In: CVPR (2017)  21. Lin, G., Milan, A., Shen, C., Reid, I.D.: Refinenet: Multi-path refinement networks  for high-resolution semantic segmentation. In: CVPR (2017)  22. Lin, G., Shen, C., Reid, I.D., van den Hengel, A.: Eﬃcient piecewise training of  deep structured models for semantic segmentation. In: CVPR (2016)   Point-wise Spatial Attention NetworkReferences  1. Badrinarayanan, V., Kendall, A., Cipolla, R.: Segnet: A deep convolutional  encoder-decoder architecture for image segmentation. TPAMI (2017)  2. Chandra, S., Kokkinos, I.: Fast, exact and multi-scale inference for semantic image  segmentation with deep gaussian crfs. In: ECCV (2016)  3. Chandra, S., Usunier, N., Kokkinos, I.: Dense and low-rank gaussian crfs using  deep embeddings. In: ICCV (2017)  4. Chen, L., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. ICLR (2015) 5. Chen, L., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. TPAMI (2018)  6. Chen, L.C., Papandreou, G., Schroﬀ, F., Adam, H.: Rethinking atrous convolution  for semantic image segmentation. arXiv:1706.05587 (2017)  7. Chen, L., Yang, Y., Wang, J., Xu, W., Yuille, A.L.: Attention to scale: Scale-aware  semantic image segmentation. In: CVPR (2016)  8. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR (2016)  9. Everingham, M., Gool, L.J.V., Williams, C.K.I., Winn, J.M., Zisserman, A.: The  pascal visual object classes VOC challenge. IJCV (2010)  10. Gadde, R., Jampani, V., Gehler, P.V.: Semantic video cnns through representation  warping. In: ICCV (2017)  11. Ghiasi, G., Fowlkes, C.C.: Laplacian pyramid reconstruction and refinement for  12. Hariharan, B., Arbelaez, P., Bourdev, L.D., Maji, S., Malik, J.: Semantic contours  semantic segmentation. In: ECCV (2016)  from inverse detectors. In: ICCV (2011)  13. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  14. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected  convolutional networks. In: CVPR (2017)  15. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R.B., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM MM (2014)  16. Jin, X., Li, X., Xiao, H., Shen, X., Lin, Z., Yang, J., Chen, Y., Dong, J., Liu, L., Jie, Z., et al.: Video scene parsing with predictive feature learning. In: ICCV (2017) 17. Kendall, A., Gal, Y., Cipolla, R.: Multi-task learning using uncertainty to weigh  losses for scene geometry and semantics. In: CVPR (2018)  18. Kr¨ahenb¨uhl, P., Koltun, V.: Eﬃcient inference in fully connected crfs with gaussian  edge potentials. In: NIPS (2011)  19. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS (2012)  20. Li, X., Liu, Z., Luo, P., Loy, C.C., Tang, X.: Not all pixels are equal: diﬃculty-aware  semantic segmentation via deep layer cascade. In: CVPR (2017)  21. Lin, G., Milan, A., Shen, C., Reid, I.D.: Refinenet: Multi-path refinement networks  for high-resolution semantic segmentation. In: CVPR (2017)  22. Lin, G., Shen, C., Reid, I.D., van den Hengel, A.: Eﬃcient piecewise training of  deep structured models for semantic segmentation. In: CVPR (2016)   16  H. Zhao, Y. Zhang, S. Liu, J. Shi, C.C. Loy, D. Lin, J. Jia  23. Lin, T., Maire, M., Belongie, S.J., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: ECCV (2014) 24. Liu, W., Rabinovich, A., Berg, A.C.: Parsenet: Looking wider to see better.  25. Liu, Z., Li, X., Luo, P., Loy, C.C., Tang, X.: Semantic image segmentation via deep  arXiv:1506.04579 (2015)  parsing network. In: ICCV (2015)  segmentation. In: CVPR (2015)  26. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  27. Luo, W., Li, Y., Urtasun, R., Zemel, R.: Understanding the eﬀective receptive field  in deep convolutional neural networks. In: NIPS (2016)  28. Mnih, V., Heess, N., Graves, A., et al.: Recurrent models of visual attention. In:  29. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmen-  NIPS (2014)  tation. In: ICCV (2015)  30. Paszke, A., Chaurasia, A., Kim, S., Culurciello, E.: Enet: A deep neural network  architecture for real-time semantic segmentation. arXiv:1606.02147 (2016)  31. Peng, C., Zhang, X., Yu, G., Luo, G., Sun, J.: Large kernel matters-improve se-  mantic segmentation by global convolutional network. In: CVPR (2017)  32. Pohlen, T., Hermans, A., Mathias, M., Leibe, B.: Full-resolution residual networks  for semantic segmentation in street scenes. In: CVPR (2017)  33. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomed-  ical image segmentation. In: MICCAI (2015)  34. Shen, F., Gan, R., Yan, S., Zeng, G.: Semantic segmentation via structured patch  prediction, context crf and guidance crf. In: CVPR (2017)  35. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. In: ICLR (2015)  36. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S.E., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A.: Going deeper with convolutions. In: CVPR (2015) 37. Vaswani, A., Shazeer, N., Parmar, N., Uszkoreit, J., Jones, L., Gomez, A.N., Kaiser,   L., Polosukhin, I.: Attention is all you need. In: NIPS (2017)  38. Visin, F., Romero, A., Cho, K., Matteucci, M., Ciccone, M., Kastner, K., Bengio, Y., Courville, A.: Reseg: A recurrent neural network-based model for semantic segmentation. In: CVPR Workshop (2016)  39. Wang, P., Chen, P., Yuan, Y., Liu, D., Huang, Z., Hou, X., Cottrell, G.W.: Under-  standing convolution for semantic segmentation. In: WACV (2018)  40. Wang, X., Girshick, R., Gupta, A., He, K.: Non-local neural networks. In: CVPR  41. Wu, Z., Shen, C., van den Hengel, A.: Wider or deeper: Revisiting the resnet model  for visual recognition. arXiv:1611.10080 (2016)  42. Yu, F., Koltun, V.: Multi-scale context aggregation by dilated convolutions. ICLR  (2018)  (2016)  43. Zhang, R., Tang, S., Zhang, Y., Li, J., Yan, S.: Scale-adaptive convolutions for  scene parsing. In: ICCV (2017)  44. Zhao, H., Qi, X., Shen, X., Shi, J., Jia, J.: ICNet for real-time semantic segmenta-  tion on high-resolution images. In: ECCV (2018)  45. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In:  CVPR (2017)  46. Zheng, S., Jayasumana, S., Romera-Paredes, B., Vineet, V., Su, Z., Du, D., Huang, C., Torr, P.H.S.: Conditional random fields as recurrent neural networks. In: ICCV (2015)   Point-wise Spatial Attention Network47. Zhou, B., Khosla, A., Lapedriza, `A., Oliva, A., Torralba, A.: Object detectors  emerge in deep scene cnns. ICLR (2015)  48. Zhou, B., Zhao, H., Puig, X., Fidler, S., Barriuso, A., Torralba, A.: Scene parsing  through ADE20K dataset. In: CVPR (2017)"}