{"1": "1. Cheng, D., Chang, X., Liu, L., Hauptmann, A.G., Gong, Y., Zheng, N.: Discrimina- tive dictionary learning with ranking metric embedded for person re-identification. In: IJCAI. (2017)  2. Cheng, D., Gong, Y., Zhou, S., Wang, J., Zheng, N.: Person re-identification by multi-channel parts-based CNN with improved triplet loss function. In: CVPR. (2016)  3. Zheng, W., Gong, S., Xiang, T.: Person re-identification by probabilistic relative  distance comparison. In: CVPR. (2011)  4. Zheng, L., Bie, Z., Sun, Y., Wang, J., Su, C., Wang, S., Tian, Q.: MARS: A video  benchmark for large-scale person re-identification. In: ECCV. (2016)  5. Zheng, L., Zhang, H., Sun, S., Chandraker, M., Tian, Q.: Person re-identification  in the wild. CoRR abs/1604.02531 (2016)  6. Yu, S., Yang, Y., Hauptmann, A.G.: Harry potter’s marauder’s map: Localizing and tracking multiple persons-of-interest by nonnegative discretization. In: CVPR. (2013)  7. Li, W., Wang, X.: Locally aligned feature transforms across views. In: CVPR.  (2013)  8. Li, W., Zhao, R., Xiao, T., Wang, X.: Deepreid: Deep filter pairing neural network  for person re-identification. In: CVPR. (2014)  9. Zheng, W., Gong, S., Xiang, T.: Associating groups of people. In: BMVC. (2009) 10. Xu, Y., Ma, B., Huang, R., Lin, L.: Person search in a scene by jointly modeling  people commonness and person uniqueness. In: ACM MM. (2014)  11. Xiao, T., Li, S., Wang, B., Lin, L., Wang, X.: End-to-end deep learning for person  search. CoRR abs/1604.01850 (2016)  12. Xiao, T., Li, S., Wang, B., Lin, L., Wang, X.: Joint detection and identification  feature learning for person search. In: CVPR. (2017)  13. Santoro, A., Raposo, D., Barrett, D.G.T., Malinowski, M., Pascanu, R., Battaglia, P., Lillicrap, T.P.: A simple neural network module for relational reasoning. CoRR abs/1706.01427 (2017)  14. Caicedo, J.C., Lazebnik, S.: Active object localization with deep reinforcement  15. Wang, X., Doretto, G., Sebastian, T., Rittscher, J., Tu, P.H.: Shape and appearance  learning. In: ICCV. (2015)  context modeling. In: ICCV. (2007)  identification. In: CVPR. (2013)  16. Zhao, R., Ouyang, W., Wang, X.: Unsupervised salience learning for person re-  17. Khamis, S., Kuo, C., Singh, V.K., Shet, V.D., Davis, L.S.: Joint learning for  attribute-consistent person re-identification. In: ECCV 2014 Workshops. (2014)  18. Liao, S., Li, S.Z.: Eﬃcient PSD constrained asymmetric metric learning for person  re-identification. In: ICCV. (2015)  19. Pedagadi, S., Orwell, J., Velastin, S.A., Boghossian, B.A.: Local fisher discriminant  analysis for pedestrian re-identification. In: CVPR. (2013)  20. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep  convolutional neural networks. In: NIPS. (2012)  21. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. In: ICLR. (2015)  22. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. (2016)   RCAA: Relational Context-Aware Agents for Person SearchReferences  1. Cheng, D., Chang, X., Liu, L., Hauptmann, A.G., Gong, Y., Zheng, N.: Discrimina- tive dictionary learning with ranking metric embedded for person re-identification. In: IJCAI. (2017)  2. Cheng, D., Gong, Y., Zhou, S., Wang, J., Zheng, N.: Person re-identification by multi-channel parts-based CNN with improved triplet loss function. In: CVPR. (2016)  3. Zheng, W., Gong, S., Xiang, T.: Person re-identification by probabilistic relative  distance comparison. In: CVPR. (2011)  4. Zheng, L., Bie, Z., Sun, Y., Wang, J., Su, C., Wang, S., Tian, Q.: MARS: A video  benchmark for large-scale person re-identification. In: ECCV. (2016)  5. Zheng, L., Zhang, H., Sun, S., Chandraker, M., Tian, Q.: Person re-identification  in the wild. CoRR abs/1604.02531 (2016)  6. Yu, S., Yang, Y., Hauptmann, A.G.: Harry potter’s marauder’s map: Localizing and tracking multiple persons-of-interest by nonnegative discretization. In: CVPR. (2013)  7. Li, W., Wang, X.: Locally aligned feature transforms across views. In: CVPR.  (2013)  8. Li, W., Zhao, R., Xiao, T., Wang, X.: Deepreid: Deep filter pairing neural network  for person re-identification. In: CVPR. (2014)  9. Zheng, W., Gong, S., Xiang, T.: Associating groups of people. In: BMVC. (2009) 10. Xu, Y., Ma, B., Huang, R., Lin, L.: Person search in a scene by jointly modeling  people commonness and person uniqueness. In: ACM MM. (2014)  11. Xiao, T., Li, S., Wang, B., Lin, L., Wang, X.: End-to-end deep learning for person  search. CoRR abs/1604.01850 (2016)  12. Xiao, T., Li, S., Wang, B., Lin, L., Wang, X.: Joint detection and identification  feature learning for person search. In: CVPR. (2017)  13. Santoro, A., Raposo, D., Barrett, D.G.T., Malinowski, M., Pascanu, R., Battaglia, P., Lillicrap, T.P.: A simple neural network module for relational reasoning. CoRR abs/1706.01427 (2017)  14. Caicedo, J.C., Lazebnik, S.: Active object localization with deep reinforcement  15. Wang, X., Doretto, G., Sebastian, T., Rittscher, J., Tu, P.H.: Shape and appearance  learning. In: ICCV. (2015)  context modeling. In: ICCV. (2007)  identification. In: CVPR. (2013)  16. Zhao, R., Ouyang, W., Wang, X.: Unsupervised salience learning for person re-  17. Khamis, S., Kuo, C., Singh, V.K., Shet, V.D., Davis, L.S.: Joint learning for  attribute-consistent person re-identification. In: ECCV 2014 Workshops. (2014)  18. Liao, S., Li, S.Z.: Eﬃcient PSD constrained asymmetric metric learning for person  re-identification. In: ICCV. (2015)  19. Pedagadi, S., Orwell, J., Velastin, S.A., Boghossian, B.A.: Local fisher discriminant  analysis for pedestrian re-identification. In: CVPR. (2013)  20. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep  convolutional neural networks. In: NIPS. (2012)  21. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. In: ICLR. (2015)  22. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. (2016)   16  X. Chang et al.  In: ICPR. (2014)  23. Yi, D., Lei, Z., Liao, S., Li, S.Z.: Deep metric learning for person re-identification.  24. Ahmed, E., Jones, M.J., Marks, T.K.: An improved deep learning architecture for  person re-identification. In: CVPR. (2015)  25. Ding, S., Lin, L., Wang, G., Chao, H.: Deep feature learning with relative distance comparison for person re-identification. Pattern Recognition 48(10) (2015) 2993- 3003  26. Felzenszwalb, P.F., Girshick, R.B., McAllester, D.A., Ramanan, D.: Object detec- tion with discriminatively trained part-based models. IEEE Trans. Pattern Anal. Mach. Intell. 32(9) (2010) 1627-1645  27. Doll´ar, P., Appel, R., Belongie, S.J., Perona, P.: Fast feature pyramids for object detection. IEEE Trans. Pattern Anal. Mach. Intell. 36(8) (2014) 1532-1545 28. Zhang, S., Benenson, R., Schiele, B.: Filtered channel features for pedestrian de-  tection. In: CVPR. (2015)  29. Cai, Z., Saberian, M.J., Vasconcelos, N.: Learning complexity-aware cascades for  deep pedestrian detection. In: ICCV. (2015)  30. Tian, Y., Luo, P., Wang, X., Tang, X.: Pedestrian detection aided by deep learning  31. Ouyang, W., Wang, X.: A discriminative deep model for pedestrian detection with  32. Luo, P., Tian, Y., Wang, X., Tang, X.: Switchable deep network for pedestrian  semantic tasks. In: CVPR. (2015)  occlusion handling. In: CVPR  detection. In: CVPR. (2014)  33. Sutton, R.S.: Introduction to reinforcement learning. Volume 135. 34. Mnih, V., Kavukcuoglu, K., Silver, D., Graves, A., Antonoglou, I., Wierstra, D.,  Riedmiller, M.A.: Playing atari with deep reinforcement learning. CoRR (2013)  35. Silver, D., Huang, A., Maddison, C.J., Guez, A., Sifre, L., van den Driessche, G., etal.: Mastering the game of go with deep neural networks and tree search. Nature 529(7587) (2016) 484-489  36. Jayaraman, D., Grauman, K.: Look-ahead before you leap: End-to-end active  recognition by forecasting the eﬀect of motion. In: ECCV. (2016)  37. Yun, S., Choi, J., Yoo, Y., Yun, K., Choi, J.Y.: Action-decision networks for visual  tracking with deep reinforcement learning. In: ICCV. (2017)  38. van Hasselt, H., Guez, A., Silver, D.: Deep reinforcement learning with double  q-learning. In: AAAI. (2016)  39. Wang, Z., Schaul, T., Hessel, M., van Hasselt, H., Lanctot, M., de Freitas, N.: Dueling network architectures for deep reinforcement learning. In: ICML. (2016) 40. Williams, R.J.: Simple statistical gradient-following algorithms for connectionist  reinforcement learning. Machine Learning 8 (1992) 229-256  41. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., etal.: Imagenet large scale visual recognition challenge. International Journal of Computer Vision 115(3) (2015) 211-252  42. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional networks for visual recognition. IEEE Trans. Pattern Anal. Mach. Intell. 37(9) (2015) 1904-1916  43. Jie, Z., Liang, X., Feng, J., Jin, X., Lu, W., Yan, S.: Tree-structured reinforcement  learning for sequential object localization. In: NIPS. (2016)  44. Ng, A.Y., Harada, D., Russell, S.J.: Policy invariance under reward transforma- tions: Theory and application to reward shaping. In: Proceedings of the Sixteenth International Conference on Machine Learning (ICML 1999), Bled, Slovenia, June 27 - 30, 1999. (1999) 278-287   RCAA: Relational Context-Aware Agents for Person Search45. Mnih, V., Badia, A.P., Mirza, M., Graves, A., Lillicrap, T.P., Harley, T., Silver, D., Kavukcuoglu, K.: Asynchronous methods for deep reinforcement learning. In: ICML. (2016)  46. Geng, M., Wang, Y., Xiang, T., Tian, Y.: Deep transfer learning for person re-  identification. CoRR abs/1611.05244 (2016)  47. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. In: ICLR.  (2015)  (2015)  48. Yang, B., Yan, J., Lei, Z., Li, S.Z.: Convolutional channel features.  In: ICCV.  49. Ren, S., He, K., Girshick, R.B., Sun, J.: Faster R-CNN: towards real-time object  detection with region proposal networks. In: NIPS. (2015)  50. Zheng, L., Shen, L., Tian, L., Wang, S., Wang, J., Tian, Q.: Scalable person  re-identification: A benchmark. In: ICCV. (2015)  51. Liao, S., Hu, Y., Zhu, X., Li, S.Z.: Person re-identification by local maximal  occurrence representation and metric learning. In: CVPR. (2015)  52. K¨ostinger, M., Hirzer, M., Wohlhart, P., Roth, P.M., Bischof, H.: Large scale metric  learning from equivalence constraints. In: CVPR. (2012)  53. Wang, Z., Li, H., Ouyang, W., Wang, X.: Learning deep representations for scene labeling with semantic context guided supervision. CoRR abs/1706.02493 (2017) 54. Potter, M.A., Jong, K.A.D.: A cooperative coevolutionary approach to function  optimization. In: ICEC. (1994)"}