{"1": "1. Boscaini, D., Masci, J., Rodol`a, E., Bronstein, M.: Learning shape correspondence  with anisotropic convolutional neural networks. In: NIPS (2016)  2. Bronstein, M.M., Bruna, J., LeCun, Y., Szlam, A., Vandergheynst, P.: Geometric deep learning: going beyond euclidean data. IEEE Signal Processing Magazine (2017)  3. Chen, X., Kundu, K., Zhang, Z., Ma, H., Fidler, S., Urtasun, R.: Monocular 3d  object detection for autonomous driving. In: CVPR (2016)  4. Chen, X., Kundu, K., Zhu, Y., Berneshawi, A.G., Ma, H., Fidler, S., Urtasun, R.:  3d object proposals for accurate object class detection. In: NIPS (2015)  5. Chen, X., Kundu, K., Zhu, Y., Ma, H., Fidler, S., Urtasun, R.: 3d object proposals  using stereo imagery for accurate object class detection. TPAMI (2017)  6. Chen, X., Ma, H., Wan, J., Li, B., Xia, T.: Multi-view 3d object detection network  for autonomous driving. In: CVPR (2017)  7. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully  convolutional networks. In: NIPS (2016)  8. Du, X., Ang Jr, M.H., Karaman, S., Rus, D.: A general pipeline for 3d detection  of vehicles. arXiv preprint arXiv:1803.00387 (2018)  9. Eitel, A., Springenberg, J.T., Spinello, L., Riedmiller, M., Burgard, W.: Multimodal  deep learning for robust rgb-d object recognition. In: IROS (2015)  10. Engelcke, M., Rao, D., Wang, D.Z., Tong, C.H., Posner, I.: Vote3deep: Fast object detection in 3d point clouds using eﬃcient convolutional neural networks. In: ICRA (2017)  11. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the kitti  vision benchmark suite. In: CVPR (2012) 12. Girshick, R.: Fast r-cnn. In: ICCV (2015) 13. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accu-  rate object detection and semantic segmentation. In: CVPR (2014)  14. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward  neural networks. In: AISTATS (2010)  15. Gupta, S., Girshick, R., Arbel´aez, P., Malik, J.: Learning rich features from rgb-d  images for object detection and segmentation. In: ECCV (2014)  16. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. ICLR (2015) 17. Kipf, T.N., Welling, M.: Semi-supervised classification with graph convolutional  networks. ICLR (2017)  18. Ku, J., Mozifian, M., Lee, J., Harakeh, A., Waslander, S.: Joint 3d proposal gener- ation and object detection from view aggregation. arXiv preprint arXiv:1712.02294 (2017)  19. Li, B.: 3d fully convolutional network for vehicle detection in point cloud. In: IROS  20. Li, B., Zhang, T., Xia, T.: Vehicle detection from 3d lidar using fully convolutional  (2017)  network. In: RSS (2016)  21. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature  pyramid networks for object detection. In: CVPR (2017)  22. Lin, T.Y., Goyal, P., Girshick, R., He, K., Doll´ar, P.: Focal loss for dense object  detection. In: ICCV (2017)  23. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  Single shot multibox detector. In: ECCV (2016)   Deep Continuous FusionReferences  1. Boscaini, D., Masci, J., Rodol`a, E., Bronstein, M.: Learning shape correspondence  with anisotropic convolutional neural networks. In: NIPS (2016)  2. Bronstein, M.M., Bruna, J., LeCun, Y., Szlam, A., Vandergheynst, P.: Geometric deep learning: going beyond euclidean data. IEEE Signal Processing Magazine (2017)  3. Chen, X., Kundu, K., Zhang, Z., Ma, H., Fidler, S., Urtasun, R.: Monocular 3d  object detection for autonomous driving. In: CVPR (2016)  4. Chen, X., Kundu, K., Zhu, Y., Berneshawi, A.G., Ma, H., Fidler, S., Urtasun, R.:  3d object proposals for accurate object class detection. In: NIPS (2015)  5. Chen, X., Kundu, K., Zhu, Y., Ma, H., Fidler, S., Urtasun, R.: 3d object proposals  using stereo imagery for accurate object class detection. TPAMI (2017)  6. Chen, X., Ma, H., Wan, J., Li, B., Xia, T.: Multi-view 3d object detection network  for autonomous driving. In: CVPR (2017)  7. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully  convolutional networks. In: NIPS (2016)  8. Du, X., Ang Jr, M.H., Karaman, S., Rus, D.: A general pipeline for 3d detection  of vehicles. arXiv preprint arXiv:1803.00387 (2018)  9. Eitel, A., Springenberg, J.T., Spinello, L., Riedmiller, M., Burgard, W.: Multimodal  deep learning for robust rgb-d object recognition. In: IROS (2015)  10. Engelcke, M., Rao, D., Wang, D.Z., Tong, C.H., Posner, I.: Vote3deep: Fast object detection in 3d point clouds using eﬃcient convolutional neural networks. In: ICRA (2017)  11. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the kitti  vision benchmark suite. In: CVPR (2012) 12. Girshick, R.: Fast r-cnn. In: ICCV (2015) 13. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accu-  rate object detection and semantic segmentation. In: CVPR (2014)  14. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward  neural networks. In: AISTATS (2010)  15. Gupta, S., Girshick, R., Arbel´aez, P., Malik, J.: Learning rich features from rgb-d  images for object detection and segmentation. In: ECCV (2014)  16. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. ICLR (2015) 17. Kipf, T.N., Welling, M.: Semi-supervised classification with graph convolutional  networks. ICLR (2017)  18. Ku, J., Mozifian, M., Lee, J., Harakeh, A., Waslander, S.: Joint 3d proposal gener- ation and object detection from view aggregation. arXiv preprint arXiv:1712.02294 (2017)  19. Li, B.: 3d fully convolutional network for vehicle detection in point cloud. In: IROS  20. Li, B., Zhang, T., Xia, T.: Vehicle detection from 3d lidar using fully convolutional  (2017)  network. In: RSS (2016)  21. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature  pyramid networks for object detection. In: CVPR (2017)  22. Lin, T.Y., Goyal, P., Girshick, R., He, K., Doll´ar, P.: Focal loss for dense object  detection. In: ICCV (2017)  23. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  Single shot multibox detector. In: ECCV (2016)   16  M. Liang, B. Yang, S. Wang and R. Urtasun  24. Luo, W., Yang, B., Urtasun, R.: Fast and furious: Real time end-to-end 3d detec- tion, tracking and motion forecasting with a single convolutional net. In: CVPR (2018)  25. Monti, F., Boscaini, D., Masci, J., Rodol`a, E., Svoboda, J., Bronstein, M.M.: Ge- ometric deep learning on graphs and manifolds using mixture model cnns. CVPR (2017)  26. Qi, C.R., Liu, W., Wu, C., Su, H., Guibas, L.J.: Frustum pointnets for 3d object  detection from rgb-d data. CVPR (2018)  27. Qi, C.R., Su, H., Mo, K., Guibas, L.J.: Pointnet: Deep learning on point sets for  3d classification and segmentation. In: CVPR (2017)  28. Qi, C.R., Yi, L., Su, H., Guibas, L.J.: Pointnet++: Deep hierarchical feature learn-  ing on point sets in a metric space (2017)  29. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified,  real-time object detection. In: CVPR (2016)  30. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de-  tection with region proposal networks. In: NIPS (2015)  31. Scarselli, F., Gori, M., Tsoi, A.C., Hagenbuchner, M., Monfardini, G.: The graph  neural network model. TNN (2009)  32. Silberman, N., Hoiem, D., Kohli, P., Fergus, R.: Indoor segmentation and support  inference from rgbd images. In: ECCV (2012)  33. Simonovsky, M., Komodakis, N.: Dynamic edge-conditioned filters in convolutional  neural networks on graphs. CVPR (2017)  34. Song, S., Xiao, J.: Sliding shapes for 3d object detection in depth images. In: ECCV  (2014)  images. In: CVPR (2016)  networks. In: CVPR (2018)  clouds. In: CVPR (2018)  35. Song, S., Xiao, J.: Deep sliding shapes for amodal 3d object detection in rgb-d  36. Wang, S., Suo, S., Ma, W.C., Urtasun, R.: Deep parameteric convolutional neural  37. Yang, B., Luo, W., Urtasun, R.: Pixor: Real-time 3d object detection from point  38. Yu, S.L., Westfechtel, T., Hamada, R., Ohno, K., Tadokoro, S.: Vehicle detection and localization on bird’s eye view elevation images using convolutional neural network. In: SSRR (2017)  39. Zhou, Y., Tuzel, O.: Voxelnet: End-to-end learning for point cloud based 3d object  detection. CVPR (2018)"}