{"1": "1. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., Kudlur, M., Levenberg, J., Monga, R., Moore, S., Murray, D., Steiner, B., Tucker, P., Vasudevan, V., Warden, P., Wicke, M., Yu, Y., Zheng, X.: Tensorﬂow: A System for Large-Scale Machine Learning. In: USENIX Conference on Operating Systems Design and Implementation. pp. 265-283 (2016) 2. Bian, J., Lin, W., Matsushita, Y., Yeung, S., Nguyen, T., Cheng, M.: GMS: Grid- Based Motion Statistics for Fast, Ultra-Robust Feature Correspondence. In: CVPR (2017)  3. Brachmann, E., Krull, A., Nowozin, S., Shotton, J., Michel, F., Gumhold, S., Rother, C.: DSAC - Diﬀerentiable RANSAC for Camera Localization. ARXIV (2016)  4. Cantzler, H.: Random Sample Consensus (RANSAC) (2005), cVonline 5. Crivellaro, A., Rad, M., Verdie, Y., Yi, K.M., Fua, P., Lepetit, V.: Robust 3D  Object Tracking from Monocular Images Using Stable Parts. PAMI (2018)  6. Ferraz, L., Binefa, X., Moreno-noguer, F.: Very Fast Solution to the PnP Problem  with Algebraic Outlier Rejection. In: CVPR. pp. 501-508 (2014)  7. Fischler, M., Bolles, R.: Random Sample Consensus: A Paradigm for Model Fitting with Applications to Image Analysis and Automated Cartography. Communica- tions ACM 24(6), 381-395 (1981)  8. Garro, V., Crosilla, F., Fusiello, A.: Solving the PnP Problem with Anisotropic  Orthogonal Procrustes Analysis. In: 3DPVT. pp. 262-269 (2012)  9. Giles, M.: Collected Matrix Derivative Results for Forward and Reverse Mode Algorithmic Diﬀerentiation. In: Advances in Automatic Diﬀerentiation. pp. 35-44 (2008)  10. Handa, A., Bloesch, M., Patraucean, V., Stent, S., McCormac, J., Davison, A.: Gvnn: Neural Network Library for Geometric Computer Vision. In: ECCV (2016) 11. Hartley, R., Zisserman, A.: Multiple View Geometry in Computer Vision. Cam-  12. Hartley, R.: In Defense of the Eight-Point Algorithm. PAMI 19(6), 580-593 (June  13. Heinly, J., Schoenberger, J., Dunn, E., Frahm, J.M.: Reconstructing the World in  14. Huang, G., Liu, Z., Weinberger, K., van der Maaten, L.: Densely Connected Con-  volutional Networks. In: CVPR (2017)  15. Huang, Z., Wan, C., Probst, T., Gool, L.V.: Deep learning on lie groups for  skeleton-based action recognition. In: CVPR. pp. 6099-6108 (2017)  16. Ionescu, C., Vantzos, O., Sminchisescu, C.: Matrix backpropagation for Deep Net-  works with Structured Layers (2015)  17. Jaderberg, M., Simonyan, K., Zisserman, A., Kavukcuoglu, K.: Spatial Transformer  Networks. In: NIPS. pp. 2017-2025 (2015)  18. Kingma, D., Ba, J.: Adam: A Method for Stochastic Optimisation. In: ICLR (2015) 19. Kneip, L., Scaramuzza, D., Siegwart, R.: A Novel Parametrization of the Perspective-Three-Point Problem for a Direct Computation of Absolute Camera Position and Orientation. In: CVPR. pp. 2969-2976 (2011)  20. Law, M., Urtasun, R., Zemel, R.S.: Deep spectral clustering learning. In: ICML.  21. Lepetit, V., Moreno-noguer, F., Fua, P.: EPnP: An Accurate o(n) Solution to the  pp. 1985-1994 (2017)  PnP Problem. IJCV (2009)  bridge University Press (2000)  1997)  Six Days. In: CVPR (2015)   Eigendecomposition-free LossesReferences  1. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., Kudlur, M., Levenberg, J., Monga, R., Moore, S., Murray, D., Steiner, B., Tucker, P., Vasudevan, V., Warden, P., Wicke, M., Yu, Y., Zheng, X.: Tensorﬂow: A System for Large-Scale Machine Learning. In: USENIX Conference on Operating Systems Design and Implementation. pp. 265-283 (2016) 2. Bian, J., Lin, W., Matsushita, Y., Yeung, S., Nguyen, T., Cheng, M.: GMS: Grid- Based Motion Statistics for Fast, Ultra-Robust Feature Correspondence. In: CVPR (2017)  3. Brachmann, E., Krull, A., Nowozin, S., Shotton, J., Michel, F., Gumhold, S., Rother, C.: DSAC - Diﬀerentiable RANSAC for Camera Localization. ARXIV (2016)  4. Cantzler, H.: Random Sample Consensus (RANSAC) (2005), cVonline 5. Crivellaro, A., Rad, M., Verdie, Y., Yi, K.M., Fua, P., Lepetit, V.: Robust 3D  Object Tracking from Monocular Images Using Stable Parts. PAMI (2018)  6. Ferraz, L., Binefa, X., Moreno-noguer, F.: Very Fast Solution to the PnP Problem  with Algebraic Outlier Rejection. In: CVPR. pp. 501-508 (2014)  7. Fischler, M., Bolles, R.: Random Sample Consensus: A Paradigm for Model Fitting with Applications to Image Analysis and Automated Cartography. Communica- tions ACM 24(6), 381-395 (1981)  8. Garro, V., Crosilla, F., Fusiello, A.: Solving the PnP Problem with Anisotropic  Orthogonal Procrustes Analysis. In: 3DPVT. pp. 262-269 (2012)  9. Giles, M.: Collected Matrix Derivative Results for Forward and Reverse Mode Algorithmic Diﬀerentiation. In: Advances in Automatic Diﬀerentiation. pp. 35-44 (2008)  10. Handa, A., Bloesch, M., Patraucean, V., Stent, S., McCormac, J., Davison, A.: Gvnn: Neural Network Library for Geometric Computer Vision. In: ECCV (2016) 11. Hartley, R., Zisserman, A.: Multiple View Geometry in Computer Vision. Cam-  12. Hartley, R.: In Defense of the Eight-Point Algorithm. PAMI 19(6), 580-593 (June  13. Heinly, J., Schoenberger, J., Dunn, E., Frahm, J.M.: Reconstructing the World in  14. Huang, G., Liu, Z., Weinberger, K., van der Maaten, L.: Densely Connected Con-  volutional Networks. In: CVPR (2017)  15. Huang, Z., Wan, C., Probst, T., Gool, L.V.: Deep learning on lie groups for  skeleton-based action recognition. In: CVPR. pp. 6099-6108 (2017)  16. Ionescu, C., Vantzos, O., Sminchisescu, C.: Matrix backpropagation for Deep Net-  works with Structured Layers (2015)  17. Jaderberg, M., Simonyan, K., Zisserman, A., Kavukcuoglu, K.: Spatial Transformer  Networks. In: NIPS. pp. 2017-2025 (2015)  18. Kingma, D., Ba, J.: Adam: A Method for Stochastic Optimisation. In: ICLR (2015) 19. Kneip, L., Scaramuzza, D., Siegwart, R.: A Novel Parametrization of the Perspective-Three-Point Problem for a Direct Computation of Absolute Camera Position and Orientation. In: CVPR. pp. 2969-2976 (2011)  20. Law, M., Urtasun, R., Zemel, R.S.: Deep spectral clustering learning. In: ICML.  21. Lepetit, V., Moreno-noguer, F., Fua, P.: EPnP: An Accurate o(n) Solution to the  pp. 1985-1994 (2017)  PnP Problem. IJCV (2009)  bridge University Press (2000)  1997)  Six Days. In: CVPR (2015)   16  Z. Dang, K. Yi, Y. Hu, F. Wang, P. Fua, M. Salzmann  22. Li, S., Xu, C., Xie, M.: A Robust O(n) Solution to the Perspective-N-Point Prob-  lem. PAMI pp. 1444-1450 (2012)  23. Longuet-Higgins, H.: A Computer Algorithm for Reconstructing a Scene from Two  Projections. Nature 293, 133-135 (1981)  24. Murray, I.: Diﬀerentiation of the Cholesky Decomposition. arXiv Preprint (2016) 25. Nister, D.: An Eﬃcient Solution to the Five-Point Relative Pose Problem. In:  CVPR (June 2003)  26. Papadopoulo, T., Lourakis, M.: Estimating the jacobian of the singular value de-  composition: Theory and applications. In: ECCV. pp. 554-570 (2000)  27. Paszke, A., Gross, S., Chintala, S., Chanan, G., Yang, E., DeVito, Z., Lin, Z., Desmaison, A., Antiga, L., Lerer, A.: Automatic diﬀerentiation in PyTorch. In: NIPS Autodiﬀ Workshop (2017)  28. Raguram, R., Chum, O., Pollefeys, M., Matas, J., Frahm, J.M.: USAC: A Universal Framework for Random Sample Consensus. PAMI 35(8), 2022-2038 (2013) 29. Rousseeuw, P., Leroy, A.: Robust Regression and Outlier Detection. Wiley (1987) 30. Sch¨onemann, P.: A Generalized Solution of the Orthogonal Procrustes Problem.  Psychometrika 31(1), 1-10 (1966)  31. Simpson, D.: Introduction to Rousseeuw (1984) Least Median of Squares Regres-  sion. In: Breakthroughs in Statistics, pp. 433-461. Springer (1997)  32. Strecha, C., Hansen, W., Van Gool, L., Fua, P., Thoennessen, U.: On Benchmarking Camera Calibration and Multi-View Stereo for High Resolution Imagery. In: CVPR (2008)  33. Torr, P., Zisserman, A.: MLESAC: A New Robust Estimator with Application to  Estimating Image Geometry. CVIU 78, 138-156 (2000)  34. Ummenhofer, B., Zhou, H., Uhrig, J., Mayer, N., Ilg, E., Dosovitskiy, A., Brox, T.: Demon: Depth and Motion Network for Learning Monocular Stereo. In: CVPR (2017)  35. Wu, C.: Towards Linear-Time Incremental Structure from Motion. In: 3DV (2013) 36. Xiao, J., Owens, A., Torralba, A.: SUN3D: A Database of Big Spaces Reconstructed  Using SfM and Object Labels. In: ICCV (2013)  37. Yi, K.M., Trulls, E., Ono, Y., Lepetit, V., Salzmann, M., Fua, P.: Learning to Find  Good Correspondences. In: CVPR (2018)  38. Zamir, A.R., Wekel, T., Agrawal, P., Malik, J., Savarese, S.: Generic 3D Represen-  tation via Pose Estimation and Matching. In: ECCV (2016)  39. Zhang, Z.: Determining the Epipolar Geometry and Its Uncertainty: A Review.  IJCV 27(2), 161-195 (1998)  40. Zheng, Y., Kuang, Y., Sugimoto, S., Astrom, K., Okutomi, M.: Revisiting the PnP  Problem: A Fast, General and Optimal Solution. In: ICCV (2013)"}