{"1": "1. Arjovsky, M., Bottou, L.: Towards principled methods for training generative ad-  2. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein generative adversarial networks.  versarial networks. In: ICLR (2017)  In: ICML. pp. 214-223 (2017)  3. Azizpour, H., Razavian, A.S., Sullivan, J., Maki, A., Carlsson, S.: Factors of trans- ferability for a generic convnet representation. IEEE Trans. on PAMI 38(9), 1790- 1802 (2016)  4. Borji, A.: Pros and cons of gan evaluation measures. arXiv preprint  arXiv:1802.03446 (2018)  5. Chen, X., Duan, Y., Houthooft, R., Schulman, J., Sutskever, I., Abbeel, P.: Info- gan: Interpretable representation learning by information maximizing generative adversarial nets. In: NIPS (2016)  6. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. pp. 3213-3223 (2016)  7. Danihelka, I., Lakshminarayanan, B., Uria, B., Wierstra, D., Dayan, P.: Compar- ison of maximum likelihood and gan-based training of real nvps. arXiv preprint arXiv:1705.05263 (2017)  8. Denton, E.L., Chintala, S., Fergus, R., et al.: Deep generative image models using a laplacian pyramid of adversarial networks. In: NIPS. pp. 1486-1494 (2015) 9. Donahue, J., Jia, Y., Vinyals, O., Hoﬀman, J., Zhang, N., Tzeng, E., Darrell, T.: Decaf: A deep convolutional activation feature for generic visual recognition. In: ICML. pp. 647-655 (2014)  10. Dumoulin, V., Belghazi, I., Poole, B., Lamb, A., Arjovsky, M., Mastropietro, O.,  Courville, A.: Adversarially learned inference. In: ICLR (2017)  11. Dumoulin, V., Shlens, J., Kudlur, M.: A learned representation for artistic style.  In: ICLR (2017)  12. Ganin, Y., Ustinova, E., Ajakan, H., Germain, P., Larochelle, H., Laviolette, F., Marchand, M., Lempitsky, V.: Domain-adversarial training of neural networks. JMLR 17(1), 2096-2030 (2016)  13. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS. pp. 2672-2680 (2014)  14. Grinblat, G.L., Uzal, L.C., Granitto, P.M.: Class-splitting generative adversarial  networks. arXiv preprint arXiv:1709.07359 (2017)  15. Gulrajani, I., Ahmed, F., Arjovsky, M., Dumoulin, V., Courville, A.C.: Improved  training of wasserstein gans. In: NIPS. pp. 5769-5779 (2017)  16. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. pp. 770-778 (2016)  17. Heusel, M., Ramsauer, H., Unterthiner, T., Nessler, B., Klambauer, G., Hochreiter, S.: Gans trained by a two time-scale update rule converge to a nash equilibrium. In: NIPS (2017)  18. Hu, J., Lu, J., Tan, Y.P.: Deep transfer metric learning. In: CVPR. pp. 325-333.  IEEE (2015)  19. Huang, G.B., Mattar, M., Berg, T., Learned-Miller, E.: Labeled faces in the wild: A database forstudying face recognition in unconstrained environments. In: Workshop on faces in’Real-Life’Images: detection, alignment, and recognition (2008)   Transferring GANs: generating images from limited dataReferences  1. Arjovsky, M., Bottou, L.: Towards principled methods for training generative ad-  2. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein generative adversarial networks.  versarial networks. In: ICLR (2017)  In: ICML. pp. 214-223 (2017)  3. Azizpour, H., Razavian, A.S., Sullivan, J., Maki, A., Carlsson, S.: Factors of trans- ferability for a generic convnet representation. IEEE Trans. on PAMI 38(9), 1790- 1802 (2016)  4. Borji, A.: Pros and cons of gan evaluation measures. arXiv preprint  arXiv:1802.03446 (2018)  5. Chen, X., Duan, Y., Houthooft, R., Schulman, J., Sutskever, I., Abbeel, P.: Info- gan: Interpretable representation learning by information maximizing generative adversarial nets. In: NIPS (2016)  6. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. pp. 3213-3223 (2016)  7. Danihelka, I., Lakshminarayanan, B., Uria, B., Wierstra, D., Dayan, P.: Compar- ison of maximum likelihood and gan-based training of real nvps. arXiv preprint arXiv:1705.05263 (2017)  8. Denton, E.L., Chintala, S., Fergus, R., et al.: Deep generative image models using a laplacian pyramid of adversarial networks. In: NIPS. pp. 1486-1494 (2015) 9. Donahue, J., Jia, Y., Vinyals, O., Hoﬀman, J., Zhang, N., Tzeng, E., Darrell, T.: Decaf: A deep convolutional activation feature for generic visual recognition. In: ICML. pp. 647-655 (2014)  10. Dumoulin, V., Belghazi, I., Poole, B., Lamb, A., Arjovsky, M., Mastropietro, O.,  Courville, A.: Adversarially learned inference. In: ICLR (2017)  11. Dumoulin, V., Shlens, J., Kudlur, M.: A learned representation for artistic style.  In: ICLR (2017)  12. Ganin, Y., Ustinova, E., Ajakan, H., Germain, P., Larochelle, H., Laviolette, F., Marchand, M., Lempitsky, V.: Domain-adversarial training of neural networks. JMLR 17(1), 2096-2030 (2016)  13. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS. pp. 2672-2680 (2014)  14. Grinblat, G.L., Uzal, L.C., Granitto, P.M.: Class-splitting generative adversarial  networks. arXiv preprint arXiv:1709.07359 (2017)  15. Gulrajani, I., Ahmed, F., Arjovsky, M., Dumoulin, V., Courville, A.C.: Improved  training of wasserstein gans. In: NIPS. pp. 5769-5779 (2017)  16. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. pp. 770-778 (2016)  17. Heusel, M., Ramsauer, H., Unterthiner, T., Nessler, B., Klambauer, G., Hochreiter, S.: Gans trained by a two time-scale update rule converge to a nash equilibrium. In: NIPS (2017)  18. Hu, J., Lu, J., Tan, Y.P.: Deep transfer metric learning. In: CVPR. pp. 325-333.  IEEE (2015)  19. Huang, G.B., Mattar, M., Berg, T., Learned-Miller, E.: Labeled faces in the wild: A database forstudying face recognition in unconstrained environments. In: Workshop on faces in’Real-Life’Images: detection, alignment, and recognition (2008)   16  Wang et al.  20. Huang, X., Li, Y., Poursaeed, O., Hopcroft, J., Belongie, S.: Stacked generative  adversarial networks. In: CVPR. vol. 2, p. 4 (2017)  21. Im, D.J., Ma, H., Taylor, G., Branson, K.: Quantitatively evaluating gans with  divergences proposed for training. In: ICLR (2018)  22. Karras, T., Aila, T., Laine, S., Lehtinen, J.: Progressive growing of gans for im-  proved quality, stability, and variation. In: ICLR (2018)  23. Kim, T., Cha, M., Kim, H., Lee, J., Kim, J.: Learning to discover cross-domain relations with generative adversarial networks. In: ICML. pp. 1857-1865 (2017) 24. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. In: ICLR  (2014)  25. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS. pp. 1097-1105 (2012)  26. Ledig, C., Theis, L., Husz´ar, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A., Tejani, A., Totz, J., Wang, Z., et al.: Photo-realistic single image super- resolution using a generative adversarial network. In: CVPR (2016)  27. Liu, Z., Luo, P., Wang, X., Tang, X.: Deep learning face attributes in the wild. In:  ICCV. pp. 3730-3738 (2015)  28. Ma, L., Jia, X., Sun, Q., Schiele, B., Tuytelaars, T., Van Gool, L.: Pose guided  person image generation. In: NIPS. pp. 405-415 (2017)  29. Mirza, M., Osindero, S.: Conditional generative adversarial nets. arXiv preprint  arXiv:1411.1784 (2014)  30. Miyato, T., Koyama, M.: Cgans with projection discriminator. In: ICLR (2018) 31. Nilsback, M.E., Zisserman, A.: Automated ﬂower classification over a large number  of classes. In: ICVGIP. pp. 722-729. IEEE (2008)  32. Odena, A., Olah, C., Shlens, J.: Conditional image synthesis with auxiliary classifier  gans. In: ICML (2016)  33. Oquab, M., Bottou, L., Laptev, I., Sivic, J.: Learning and transferring mid-level image representations using convolutional neural networks. In: CVPR. pp. 1717- 1724. IEEE (2014)  34. Pan, S.J., Yang, Q.: A survey on transfer learning. IEEE Transactions on knowledge  and data engineering 22(10), 1345-1359 (2010)  35. Perarnau, G., van de Weijer, J., Raducanu, B., ´Alvarez, J.M.: Invertible conditional gans for image editing. In: NIPS 2016 Workshop on Adversarial Training (2016)  36. Radford, A., Metz, L., Chintala, S.: Unsupervised representation learning with  deep convolutional generative adversarial networks. In: ICLR (2015)  37. Reed, S., Akata, Z., Yan, X., Logeswaran, L., Schiele, B., Lee, H.: Generative  adversarial text to image synthesis. In: ICML. pp. 1060-1069 (2016)  38. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recog- nition challenge. IJCV 115(3), 211-252 (2015)  39. Salimans, T., Goodfellow, I., Zaremba, W., Cheung, V., Radford, A., Chen, X.:  Improved techniques for training gans. In: NIPS. pp. 2234-2242 (2016)  40. Smith, E., Meger, D.: Improved adversarial systems for 3d object generation and  reconstruction. arXiv preprint arXiv:1707.09557 (2017)  41. Sricharan, K., Bala, R., Shreve, M., Ding, H., Saketh, K., Sun, J.: Semi-supervised  conditional gans. arXiv preprint arXiv:1708.05789 (2017)  42. Theis, L., Oord, A.v.d., Bethge, M.: A note on the evaluation of generative models.  In: ICLR (2015)  43. Tzeng, E., Hoﬀman, J., Darrell, T., Saenko, K.: Simultaneous deep transfer across  domains and tasks. In: CVPR. pp. 4068-4076 (2015)   Transferring GANs: generating images from limited data44. Wang, Y., Zhang, L., van de Weijer, J.: Ensembles of generative adversarial net-  works. In: NIPS 2016 Workshop on Adversarial Training (2016)  45. Yu, F., Zhang, Y., Song, S., Seﬀ, A., Xiao, J.: Construction of a large-scale image dataset using deep learning with humans in the loop. arXiv preprint arXiv:1506.03365 (2015)  46. Zhang, H., Xu, T., Li, H., Zhang, S., Huang, X., Wang, X., Metaxas, D.: Stack- gan: Text to photo-realistic image synthesis with stacked generative adversarial networks. In: ICCV. pp. 5908-5916 (2017)  47. Zhang, Z., Song, Y., Qi, H.: Age progression/regression by conditional adversarial  autoencoder. In: CVPR. vol. 2 (2017)  48. Zhou, B., Lapedriza, A., Xiao, J., Torralba, A., Oliva, A.: Learning deep features  for scene recognition using places database. In: NIPS. pp. 487-495 (2014)  49. Zhou, Z., Cai, H., Rong, S., Song, Y., Ren, K., Zhang, W., Yu, Y., Wang, J.:  Activation maximization generative adversarial nets. In: ICLR (2018)  50. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation using cycle-consistent adversarial networks. In: ICCV. pp. 2242-2251 (2017)"}