{"1": "1. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., et al.: Tensorﬂow: A system for large-scale machine learning. In: OSDI. vol. 16, pp. 265-283 (2016)  2. Ahmed, E., Jones, M., Marks, T.K.: An improved deep learning architecture for  person re-identification. In: CVPR (2015)  3. Bai, S., Bai, X., Tian, Q.: Scalable person re-identification on supervised smoothed  manifold. In: CVPR. vol. 6, p. 7 (2017)  4. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR (2017)  5. Chatfield, K., Simonyan, K., Vedaldi, A., Zisserman, A.: Return of the devil in the  details: Delving deep into convolutional nets. In: BMVC (2014)  6. Chen, D., Yuan, Z., Chen, B., Zheng, N.: Similarity learning with spatial con-  straints for person re-identification. In: CVPR (2016)  7. Chen, S.Z., Guo, C.C., Lai, J.H.: Deep ranking for person re-identification via joint  representation learning. In: IEEE TIP (2016)  8. Chen, W., Chen, X., Zhang, J., Huang, K.: Beyond triplet loss: a deep quadruplet  network for person re-identification. In: CVPR (2017)  9. Cheng, D., Gong, Y., Zhou, S., JinjunWang, Zheng, N.: Person re-identification by multi-channel parts-based cnn with improved triplet loss function. In: CVPR (2016)  10. Cheng, D., Gong, Y., Zhou, S., Wang, J., Zheng, N.: Person re-identification by multi-channel parts-based cnn with improved triplet loss function. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1335- 1344 (2016)  11. Deng, Y., Luo, P., Loy, C.C., Tang, X.: Learning to recognize pedestrian attribute.  12. Geng, M., Wang, Y., Xiang, T., Tian, Y.: Deep transfer learning for person re-  arXiv preprint arXiv:1501.00901 (2015)  identification. In: arXiv:1611.0524 (2016)  13. Geng, M., Wang, Y., Xiang, T., Tian, Y.: Deep transfer learning for person re-  identification. arXiv preprint arXiv:1611.05244 (2016)  14. Gong, S., Xiang, T.: Person re-identification. In: Visual Analysis of Behaviour, pp.  301-313. Springer (2011)  15. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial nets. In: Advances in neural information processing systems. pp. 2672-2680 (2014)  16. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  17. Hinton, G.E., Salakhutdinov, R.R.: reducing the dimensionality of data with neural  In: CVPR (2015)  networks. In: Science (2006)  18. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with condi-  tional adversarial networks. In: CVPR (2017)  19. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Gir-shick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. arXiv (2014)  20. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  21. Larsen, A.B.L., Sønderby, S.K., Larochelle, H., Winther, O.: Autoencoding beyond  pixels using a learned similarity metric. arXiv preprint arXiv:1512.09300 (2015)   Pose-Normalized Image Generation for Person Re-idReferences  1. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., et al.: Tensorﬂow: A system for large-scale machine learning. In: OSDI. vol. 16, pp. 265-283 (2016)  2. Ahmed, E., Jones, M., Marks, T.K.: An improved deep learning architecture for  person re-identification. In: CVPR (2015)  3. Bai, S., Bai, X., Tian, Q.: Scalable person re-identification on supervised smoothed  manifold. In: CVPR. vol. 6, p. 7 (2017)  4. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR (2017)  5. Chatfield, K., Simonyan, K., Vedaldi, A., Zisserman, A.: Return of the devil in the  details: Delving deep into convolutional nets. In: BMVC (2014)  6. Chen, D., Yuan, Z., Chen, B., Zheng, N.: Similarity learning with spatial con-  straints for person re-identification. In: CVPR (2016)  7. Chen, S.Z., Guo, C.C., Lai, J.H.: Deep ranking for person re-identification via joint  representation learning. In: IEEE TIP (2016)  8. Chen, W., Chen, X., Zhang, J., Huang, K.: Beyond triplet loss: a deep quadruplet  network for person re-identification. In: CVPR (2017)  9. Cheng, D., Gong, Y., Zhou, S., JinjunWang, Zheng, N.: Person re-identification by multi-channel parts-based cnn with improved triplet loss function. In: CVPR (2016)  10. Cheng, D., Gong, Y., Zhou, S., Wang, J., Zheng, N.: Person re-identification by multi-channel parts-based cnn with improved triplet loss function. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1335- 1344 (2016)  11. Deng, Y., Luo, P., Loy, C.C., Tang, X.: Learning to recognize pedestrian attribute.  12. Geng, M., Wang, Y., Xiang, T., Tian, Y.: Deep transfer learning for person re-  arXiv preprint arXiv:1501.00901 (2015)  identification. In: arXiv:1611.0524 (2016)  13. Geng, M., Wang, Y., Xiang, T., Tian, Y.: Deep transfer learning for person re-  identification. arXiv preprint arXiv:1611.05244 (2016)  14. Gong, S., Xiang, T.: Person re-identification. In: Visual Analysis of Behaviour, pp.  301-313. Springer (2011)  15. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial nets. In: Advances in neural information processing systems. pp. 2672-2680 (2014)  16. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  17. Hinton, G.E., Salakhutdinov, R.R.: reducing the dimensionality of data with neural  In: CVPR (2015)  networks. In: Science (2006)  18. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with condi-  tional adversarial networks. In: CVPR (2017)  19. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Gir-shick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. arXiv (2014)  20. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  21. Larsen, A.B.L., Sønderby, S.K., Larochelle, H., Winther, O.: Autoencoding beyond  pixels using a learned similarity metric. arXiv preprint arXiv:1512.09300 (2015)   16  X. Qian, Y. Fu, T. Xiang, W. Wang, J. Qiu, Y. Wu, Y. Jiang, X. Xue  22. Lassner, C., Pons-Moll, G., Gehler, P.V.: A generative model of people in clothing. In: Proceedings of the IEEE International Conference on Computer Vision. vol. 6 (2017)  23. Li, D., Chen, X., Zhang, Z., Huang, K.: Learning deep context-aware features over body and latent parts for person re-identification. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 384-393 (2017) 24. Li, W., Zhao, R., X.Wang: Human re-identification with transferred metric learn-  ing. In: ACCV (2012)  25. Li, W., Zhao, R., Xiao, T., Wang, X.: Deepreid: Deep filter pairing neural network  for person re-identification. In: CVPR (2014)  26. Li, W., Zhu, X., Gong, S.: Person re-identification by deep joint learning of multi-  loss classification. IJCAI (2017)  27. Liao, S., Hu, Y., Zhu, X., Li., S.Z.: Person re-identification by local maximal oc-  currence representation and metric learning. In: CVPR (2015)  28. Lin, Y., Zheng, L., Zheng, Z., Wu, Y., Yang, Y.: Improving person re-identification  by attribute and identity learning. arXiv preprint arXiv:1703.07220 (2017)  29. Liu, X., Zhao, H., Tian, M., Sheng, L., Shao, J., Yi, S., Yan, J., Wang, X.:  Hydraplus-net: Attentive deep features for pedestrian analysis. In: ICCV (2017)  30. Ma, L., Sun, Q., Jia, X., Schiele, B., Tuytelaars, T., Gool, L.V.: Pose guided person  image generation. In: NIPS (2017)  31. Martinel, N., Das, A., Micheloni, C., Roy-Chowdhury, A.K.: Temporal model adap-  tation for person reidentification. In: ECCV (2016)  32. Matsukawa, T., Okabe, T., Suzuki, E., Sato, Y.: Hierarchical gaussian descriptor for person re-identification. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1363-1372 (2016)  33. Paisitkriangkrai, S., Shen, C., van den Hengel, A.: Learning to rank in person re- identification with metric ensembles. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1846-1855 (2015)  34. Qian, X., Fu, Y., Jiang, Y.G., Xiang, T., Xue, X.: Multi-scale deep learning archi-  tecture for person re-identification. In: ICCV (2017)  35. Radford, A., Metz, L., Chintala, S.: Unsupervised representation learning with  deep convolutional generative adversarial networks. In: ICLR (2016)  36. Ristani, E., Solera, F., Zou, R., Cucchiara, R., Tomasi, C.: Performance measures and a data set for multi-target, multi-camera tracking. In: ECCV Workshop on Benchmarking Multi-Target Tracking (2016)  37. Sarfraz, M.S., Schumann, A., Wang, Y., Stiefelhagen, R.: Deep view- sensitive pedestrian attribute inference in an end-to-end model. arXiv preprint arXiv:1707.06089 (2017)  38. Shi, H., Yang, Y., Zhu, X., Liao, S., Lei1, Z., Zheng, W., Li, S.Z.: Embedding deep metric for person re-identification: A study against large variations. In: ECCV (2016)  39. Su, C., Li, J., Zhang, S., Xing, J., Gao, W., Tian, Q.: Pose-driven deep convolu-  tional model for person re-identification. In: ICCV (2017)  40. Sun, Y., Zheng, L., Weijian, D., Shengjin, W.: Svdnet for pedestrian retrieval. In:  ICCV (2017)  41. Varior, R.R., Shuai, B., Lu, J., Xu, D., Wang., G.: A siamese long short-term  memory architecture for human re-identification. In: ECCV (2016)  42. Varior, R.R., Haloi, M., Wang, G.: Gated siamese convolutional neural network  architecture for human re-identification. In: ECCV (2016)  43. Wang, F., Zuo, W., Lin, L., Zhang, D., Zhang, L.: Joint learning of single-image and cross-image representations for person re-identification. In: CVPR (2016)   Pose-Normalized Image Generation for Person Re-id44. Wang, J., Zhu, X., Gong, S., Li, W.: Attribute recognition by joint recurrent learn-  ing of context and correlation. In: ICCV (2017)  45. Wei, L., Zhang, S., Yao, H., Gao, W., Tian, Q.: Glad: Global-local-alignment de-  scriptor for pedestrian retrieval. arXiv preprint arXiv:1709.04329 (2017)  46. Xiao, T., Li, H., Ouyang, W., Wang, X.: Learning deep feature representations with domain guided dropout for person re-identification. In: Computer Vision and Pattern Recognition (CVPR), 2016 IEEE Conference on. pp. 1249-1258. IEEE (2016)  47. Xiao, T., Li, S., Wang, B., Lin, L., Wang, X.: Joint detection and identification  feature learning for person search. In: CVPR (2017)  48. Xiao, T., Li, S., Wang, B., Lin, L., Wang, X.: Joint detection and identification feature learning for person search. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3376-3385. IEEE (2017)  49. Xiong, F., Gou, M., Camps, O., Sznaier, M.: Person re-identification using kernel- based metric learning methods. In: European conference on computer vision. pp. 1-16. Springer (2014)  50. Yao, H., Zhang, S., Zhang, Y., Li, J., Tian, Q.: Deep representation learning with part loss for person re-identification. arXiv preprint arXiv:1707.00798 (2017) 51. Yu, H.X., Wu, A., Zheng, W.S.: Cross-view asymmetric metric learning for unsu-  pervised person re-identification. In: ICCV (2017)  52. Yu, K., Leng, B., Zhang, Z., Li, D., Huang, K.: Weakly-supervised learning of mid- level features for pedestrian attribute recognition and localization. arXiv preprint arXiv:1611.05603 (2016)  53. Zhang, H., Xu, T., Li, H., Zhang, S., Huang, X., Wang, X., Metaxas, D.: Stack- gan: Text to photo-realistic image synthesis with stacked generative adversarial networks. In: ICCV (2017)  54. Zhang, L., Gong, T.X.S.: Learning a discriminative null space for person re-  identificatio. In: CVPR (2016)  55. Zhang, L., Xiang, T., Gong, S.: Learning a discriminative null space for person re-identification. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1239-1248 (2016)  56. Zhang, Y., Xiang, T., Hospedales, T.M., Lu, H.: Deep mutual learning. arXiv  preprint arXiv:1706.00384 (2017)  57. Zhao, H., Tian, M., Sun, S., Shao, J., Yan, J., Yi, S., Wang, X., Tang, X.: Spindle net: Person re-identification with human body region guided feature decomposi- tion and fusion. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1077-1085 (2017)  58. Zhao, L., Li, X., Wang, J., Zhuang, Y.: Deeply-learned part-aligned representations  for person re-identification. In: ICCV (2017)  59. Zhao, R., Ouyang, W., Wang, X.: Unsupervised salience learning for person re-  identification. In: CVPR (2013)  60. Zhao, R., Ouyang, W., Wang, X.: Learning mid-level filters for person re- identification. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 144-151 (2014)  61. Zheng, L., Shen, L., Tian, L., S.Wang, J.Wang, Tian, Q.: Scalable person re-  identification: A benchmark. In: ICCV (2015)  62. Zheng, L., Huang, Y., Lu, H., Yang, Y.: Pose invariant embedding for deep person  re-identification. arXiv preprint arXiv:1701.07732 (2017)  63. Zheng, L., Zhang, H., Sun, S., Chandraker, M., Tian, Q.: Person re-identification  in the wild. arXiv preprint arXiv:1604.02531 (2016)   18  X. Qian, Y. Fu, T. Xiang, W. Wang, J. Qiu, Y. Wu, Y. Jiang, X. Xue  64. Zheng, Z., Zheng, L., , Yang, Y.: A discriminatively learned cnn embedding for  person re-identification. In: arXiv:1611.05666 (2016)  65. Zheng, Z., Zheng, L., Yang, Y.: Unlabeled samples generated by gan improve the  person re-identification baseline in vitro. In: ICCV (2017)"}