{"1": "1. Fu, H., Xu, D., Zhang, B., Lin, S., Ward, R.: Object-based multiple foreground  video co-segmentation via multi-state selection graph. TIP (2015)  2. Fu, H., Xu, D., Lin, S., Liu, J.: Object-based rgbd image co-segmentation with  mutex constraint. In: CVPR. (2015)  3. Jerripothula, K., Cai, J., Yuan, J.: Image co-segmentation via saliency co-fusion.  TMM (2016)  4. Jerripothula, K., Cai, J., Yuan, J.: CATS: Co-saliency activated tracklet selection  for video co-localization. In: ECCV. (2016)  5. Xue, J., Li, C., Zheng, N.: Proto-object based rate control for jpeg2000: An ap-  proach to content-based scalability. (2011)  6. Lowe, D.: Distinctive image features from scale-invariant keypoints. IJCV (2004) 7. Fu, H., Cao, X., Tu, Z.: Cluster-based co-saliency detection. TIP (2013) 8. Liu, Z., Zou, W., Li, L., Shen, L., Meur, O.L.: Co-saliency detection based on  9. Tsai, C.C., Qian, X., Lin, Y.Y.: Segmentation guided local proposal fusion for  hierarchical segmentation. SPL (2014)  co-saliency detection. In: ICME. (2017)  saliency map fusion. In: ICASSP. (2017)  10. Tsai, C.C., Qian, X., Lin, Y.Y.: Image co-saliency detection via locally adaptive  11. Zhang, D., Meng, D., Han, J.: Co-saliency detection via a self-paced multiple-  instance learning framework. TPAMI (2017)  12. Zhang, D., Han, J., Li, C., Wang, J., Li, X.: Detection of co-salient objects by  looking deep and wide. IJCV (2016)  13. Han, J., Cheng, G., Li, Z., Zhang, D.: A unified metric learning-based framework  for co-saliency detection. TCSVT (2017)  14. Wei, L., Zhao, S., Bourahla, O., Li, X., Wu, F.: Group-wise deep co-saliency  detection. In: IJCAI. (2017)  15. Hsu, K.J., Lin, Y.Y., Chuang, Y.Y.: Augmented multiple instance regression for  inferring object contours in bounding boxes. TIP (2014)  16. Hsu, K.J., Lin, Y.Y., Chuang, Y.Y.: Weakly supervised saliency detection with a  category-driven map generator. In: BMVC. (2017)  17. Zhang, D., Han, J., Han, J., Shao, L.: Cosaliency detection based on intrasaliency  prior transfer and deep intersaliency mining. TNNLS (2016)  18. Winn, J., Criminisi, A., T. Minka, T.. 19. Batra, D., Kowdle, A., Parikh, D., Luo, J., Chen, T.:  segmentation with intelligent scribble guidance. In: CVPR. (2010)  iCoseg: Interactive co-  20. Yang, C., Zhang, L., Lu, H., Ruan, X., Yang, M.M.: Saliency detection via graph-  based manifold ranking. In: CVPR. (2013)  21. Huan, C.R., Chang, Y.J., Yang, Z.X., Lin, Y.Y.: Video saliency map detection by  dominant camera motion removal. TCSVT (2014)  22. Jiang, P., Vasconcelos, N., Peng, J.: Generic promotion of diﬀusion-based salient  object detection. In: ICCV. (2015)  23. Zhang, J., Sclaroﬀ, S., Lin, Z., Shen, X., Price, B., Mech, R.: Minimum barrier  salient object detection at 80 fps. In: ICCV. (2015)  24. Tu, W.C., He, S., Yang, Q., Chien, S.Y.: Real-time salient object detection with a  minimum spanning tree. In: CVPR. (2016)  25. Huang, F., Qi, J., Lu, H., Zhang, L., Ruan, X.: Salient object detection via multiple  instance learning. TIP (2017)   UCCDGOReferences  1. Fu, H., Xu, D., Zhang, B., Lin, S., Ward, R.: Object-based multiple foreground  video co-segmentation via multi-state selection graph. TIP (2015)  2. Fu, H., Xu, D., Lin, S., Liu, J.: Object-based rgbd image co-segmentation with  mutex constraint. In: CVPR. (2015)  3. Jerripothula, K., Cai, J., Yuan, J.: Image co-segmentation via saliency co-fusion.  TMM (2016)  4. Jerripothula, K., Cai, J., Yuan, J.: CATS: Co-saliency activated tracklet selection  for video co-localization. In: ECCV. (2016)  5. Xue, J., Li, C., Zheng, N.: Proto-object based rate control for jpeg2000: An ap-  proach to content-based scalability. (2011)  6. Lowe, D.: Distinctive image features from scale-invariant keypoints. IJCV (2004) 7. Fu, H., Cao, X., Tu, Z.: Cluster-based co-saliency detection. TIP (2013) 8. Liu, Z., Zou, W., Li, L., Shen, L., Meur, O.L.: Co-saliency detection based on  9. Tsai, C.C., Qian, X., Lin, Y.Y.: Segmentation guided local proposal fusion for  hierarchical segmentation. SPL (2014)  co-saliency detection. In: ICME. (2017)  saliency map fusion. In: ICASSP. (2017)  10. Tsai, C.C., Qian, X., Lin, Y.Y.: Image co-saliency detection via locally adaptive  11. Zhang, D., Meng, D., Han, J.: Co-saliency detection via a self-paced multiple-  instance learning framework. TPAMI (2017)  12. Zhang, D., Han, J., Li, C., Wang, J., Li, X.: Detection of co-salient objects by  looking deep and wide. IJCV (2016)  13. Han, J., Cheng, G., Li, Z., Zhang, D.: A unified metric learning-based framework  for co-saliency detection. TCSVT (2017)  14. Wei, L., Zhao, S., Bourahla, O., Li, X., Wu, F.: Group-wise deep co-saliency  detection. In: IJCAI. (2017)  15. Hsu, K.J., Lin, Y.Y., Chuang, Y.Y.: Augmented multiple instance regression for  inferring object contours in bounding boxes. TIP (2014)  16. Hsu, K.J., Lin, Y.Y., Chuang, Y.Y.: Weakly supervised saliency detection with a  category-driven map generator. In: BMVC. (2017)  17. Zhang, D., Han, J., Han, J., Shao, L.: Cosaliency detection based on intrasaliency  prior transfer and deep intersaliency mining. TNNLS (2016)  18. Winn, J., Criminisi, A., T. Minka, T.. 19. Batra, D., Kowdle, A., Parikh, D., Luo, J., Chen, T.:  segmentation with intelligent scribble guidance. In: CVPR. (2010)  iCoseg: Interactive co-  20. Yang, C., Zhang, L., Lu, H., Ruan, X., Yang, M.M.: Saliency detection via graph-  based manifold ranking. In: CVPR. (2013)  21. Huan, C.R., Chang, Y.J., Yang, Z.X., Lin, Y.Y.: Video saliency map detection by  dominant camera motion removal. TCSVT (2014)  22. Jiang, P., Vasconcelos, N., Peng, J.: Generic promotion of diﬀusion-based salient  object detection. In: ICCV. (2015)  23. Zhang, J., Sclaroﬀ, S., Lin, Z., Shen, X., Price, B., Mech, R.: Minimum barrier  salient object detection at 80 fps. In: ICCV. (2015)  24. Tu, W.C., He, S., Yang, Q., Chien, S.Y.: Real-time salient object detection with a  minimum spanning tree. In: CVPR. (2016)  25. Huang, F., Qi, J., Lu, H., Zhang, L., Ruan, X.: Salient object detection via multiple  instance learning. TIP (2017)   16  Hsu et al.  26. Wang, L., Lu, H., Ruan, X., M.-M.-Yang: Deep networks for saliency detection via  local estimation and global search. In: CVPR. (2015)  27. Liu, N., Han, J.: DHSNet: Deep hierarchical saliency network for salient object  detection. In: CVPR. (2016)  28. Hou, Q., M.-M.-Cheng, Hu, X., Borji, A., Tu, Z., Torr, P.: Deeply supervised  salient object detection with short connections. In: CVPR. (2017)  29. Zhang, P., Wang, D., Lu, H., Wang, H., Yin, B.: Learning uncertain convolutional  features for accurate saliency detection. In: ICCV. (2017)  30. Zhang, P., Wang, D., Lu, H., Wang, H., Ruan, X.: Amulet: Aggregating multi-level  convolutional features for salient object detection. In: ICCV. (2017)  31. Cao, X., Tao, Z., Zhang, B., Fu, H., Feng, W.: Self-adaptively weighted co-saliency  detection via rank constraint. TIP (2014)  32. Li, Y., Fu, K., Liu, Z., Yang, J.: Eﬃcient saliency-model-guided visual co-saliency  detection. SPL (2015)  33. Liu, F., Shen, C., Lin, G.: Deep convolutional neural fields for depth estimation  from a single image. In: CVPR. (2015)  34. Knobelreiter, P., Reinbacher, C., Shekhovtsov, A., Pock, T.: End-to-end training  of hybrid cnn-crf models for stereo. In: CVPR. (2017)  35. Chandra, S., Usunier, N., Kokkinos, I.: Dense and low-rank gaussian crfs using  deep embeddings. In: ICCV. (2017)  36. Shen, F., Gan, R., Yan, S., Zeng, G.: Semantic segmentation via structured patch  prediction, context crf and guidance crfs. In: ICCV. (2017)  37. Zheng, S., Jayasumana, S., Romera-Paredes, B., Vineety, V., Su, Z., Du, D., Huang, C., Torr, P.H.S.: Conditional random fields as recurrent neural networks. In: ICCV. (2015)  38. Wang, S., Fidler, S., Urtasun, R.: Proximal deep structured models. In: NIPS.  (2016)  39. Hayder, Z., He, X., Salzmann, M.: Learning to co-generate object proposals with  a deep structured network. In: CVPR. (2016)  40. Yuan, Z., Lu, T., Wu, Y.: Deep-dense conditional random fields for object co-  41. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional models for semantic seg-  segmentation. In: IJCAI. (2017)  mentation. In: CVPR. (2015)  42. Zhang, D., Han, J., Zhang, Y.: Supervision by fusion: Towards unsupervised learn-  ing of deep salient object detector. In: ICCV. (2017)  43. Krizhevsky, A., Sutskever, I., Hinton, G.: Imagenet classification with deep convo-  lutional neural networks. In: NIPS. (2012)  44. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  45. Krahenbuhl, P., Koltun, V.: Eﬃcient inference in fully connected CRFs with gaus-  46. Jiang, B., Zhang, L., Lu, H., Yang, C., Yang, M.M.: Saliency detection via absorb-  image recognition. In: ICLR. (2015)  sian edge potentials. In: NIPS. (2011)  ing markov chain. In: ICCV. (2013)  47. Li, G., Yu, Y.: Deep contrast learning for salient object detection.  In: CVPR.  48. Sutton, C., McCallum, A.: Piecewise training for structured prediction. (2009) 49. Kingma, D., Ba, J.: ADAM: A method for stochastic optimization.  In: ICLR.  (2016)  (2014)  50. Vedaldi, A., Lenc, K.: MatConvNet - convolutional neural networks for matlab.  In: ACMMM. (2015)   UCCDGO51. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR. (2016)  52. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A large-scale  hierarchical image database. In: CVPR. (2009)  53. Achanta, R., Shaji, A., Smith, K., Lucchi, A., Fua, P., S¨usstrunk, S.: SLIC super-  pixels compared to state-of-the-art superpixel methods. TPAMI (2012)  54. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., Berg, A., Li, F.F.: Imagenet large scale visual recognition challenge. IJCV (2015)  55. Yao, X., Han, J., Zhang, D., Nie, F.: Revisiting co-saliency detection: A novel approach based on two-stage multiview spectral rotation co-clustering. TIP (2017) 56. Borji, A., Cheng, M.M., Jiang, H., Li, J.: Salient object detection: A benchmark.  TIP (2015)  57. Fan, D.P., Cheng, M.M., Liu, Y., Li, T., Borji, A.: Structure-measure: A new way  to evaluate foreground maps. In: ICCV. (2017)  58. Zhao, R., Ouyang, W., Li, H., Wang, X.: Saliency detection by multi-context deep  learning. In: CVPR. (2015)  59. Hsu, K.J., Lin, Y.Y., Chuang, Y.Y.: Robust image alignment with multiple feature  descriptors and matching-guided neighborhoods. In: CVPR. (2015)  60. Hsu, K.J., Lin, Y.Y., Chuang, Y.Y.: Co-attention cnns for unsupervised object  co-segmentation. In: IJCAI. (2018)"}