{"1": "1. Starck, J., Kilner, J., Hilton, A.: A free-viewpoint video renderer. Journal of  Graphics, GPU, and Game Tools 14(3) (2009) 57-72  2. Tsiminaki, V., Franco, J., Boyer, E.: High resolution 3d shape texture from multiple  videos. In: Proc. Comp. Vision and Pattern Recognition (CVPR). (2014)  3. Volino, M., Casas, D., Collomosse, J., Hilton, A.: 4d for interactive character appear- ance. In: Computer Graphics Forum (Proceedings of Eurographics 2014). (2014) 4. Collet, A., Chuang, M., Sweeney, P., Gillett, D., Evseev, D., Calabrese, D., Hoppe, H., Kirk, A., Sullivan, S.: High-quality streamable free-viewpoint video. ACM Transactions on Graphics (TOG) 34(4) (2015) 69  5. Grauman, K., Shakhnarovich, G., Darrell, T.: A bayesian approach to image-based  visual hull reconstruction. In: Proc. CVPR. (2003)  6. Guillemaut, J.Y., Hilton, A.: Joint multi-layer segmentation and reconstruction for free-viewpoint video applications. International journal of computer vision 93(1) (2011) 73-100  7. Casas, D., Huang, P., Hilton, A.: Surface-based Character Animation. In Magnor, M., Grau, O., Sorkine-Hornung, O., Theobalt, C., eds.: Digital Representations of the Real World: How to Capture, Model, and Render Visual Reality. CRC Press (April 2015) 239-252  8. Laurentini, A.: The visual hull concept for silhouette-based image understanding.  IEEE Trans. Pattern Anal. Machine Intelligence 16(2) (1994)  9. Franco, J., Boyer, E.: Exact polyhedral visual hulls. In: Proc. British Machine  Vision Conf. (BMVC). (2003)  10. Volino, M., Casas, D., Collomosse, J., Hilton, A.: Optimal Representation of Multiple View Video. In: Proceedings of the British Machine Vision Conference, BMVA Press (2014)  11. C.Budd, Huang, P., Klaudinay, M., Hilton, A.: Global non-rigid alignment of surface  sequences. Intl. Jnrl. Computer Vision (IJCV) 102(1-3) (2013) 256-270  12. Han, X., Li, Z., Huang, H., Kalogerakis, E., Yu, Y.: High-resolution shape completion using deep neural networks for global structure and local geometry inference. Proc. Intl. Conf. Computer Vision (ICCV’17) (2017)  13. Wu, Z., Song, S., Khosla, A., Yu, F., Zhang, L., Tang, X., Xiao, J.: 3d shapenets: A deep representation for volumetric shapes. In: IEEE conference on computer vision and pattern recognition (CVPR’15). (2015)  14. Sharma, A., Grau, O., Fritz, M.: Vconv-dae: Deep volumetric shape learning without object labels. In: European Conference on Computer Vision. (2016) 236-250 15. Fattal, R.: Image upsampling via imposed edge statistics. In: Proc. ACM SIG-  GRAPH. (2007)  16. Rudin, L.I., Osher, S., Fatemi, E.: Non-linear total variation based noise removal  algorithms. Physics D 60(1-4) (1992) 259-268  17. Abrahamsson, S., Blom, H., Jans, D.: Multifocus structured illumination microscopy for fast volumetric super-resolution imaging. Biomedical Optics Express 8(9) (2017) 4135-4140  18. Aydin, V., Foroosh, H.: Volumetric super-resolution of multispectral data. In: Corr.  arXiv:1705.05745v1. (2017)  19. Xie, J., Xu, L., Chen, E.: Image denoising and inpainting with deep neural networks.  In: Proc. Neural Inf. Processing Systems (NIPS). (2012) 350-358  20. Wang, Z., Liu, D., Yang, J., Han, W., Huang, T.S.: Deep networks for image super- resolution with sparse prior. In: Proc. Intl. Conf. Computer Vision (ICCV). (2015) 370-378   Volumetric performance capture from minimal camera viewpointsReferences  1. Starck, J., Kilner, J., Hilton, A.: A free-viewpoint video renderer. Journal of  Graphics, GPU, and Game Tools 14(3) (2009) 57-72  2. Tsiminaki, V., Franco, J., Boyer, E.: High resolution 3d shape texture from multiple  videos. In: Proc. Comp. Vision and Pattern Recognition (CVPR). (2014)  3. Volino, M., Casas, D., Collomosse, J., Hilton, A.: 4d for interactive character appear- ance. In: Computer Graphics Forum (Proceedings of Eurographics 2014). (2014) 4. Collet, A., Chuang, M., Sweeney, P., Gillett, D., Evseev, D., Calabrese, D., Hoppe, H., Kirk, A., Sullivan, S.: High-quality streamable free-viewpoint video. ACM Transactions on Graphics (TOG) 34(4) (2015) 69  5. Grauman, K., Shakhnarovich, G., Darrell, T.: A bayesian approach to image-based  visual hull reconstruction. In: Proc. CVPR. (2003)  6. Guillemaut, J.Y., Hilton, A.: Joint multi-layer segmentation and reconstruction for free-viewpoint video applications. International journal of computer vision 93(1) (2011) 73-100  7. Casas, D., Huang, P., Hilton, A.: Surface-based Character Animation. In Magnor, M., Grau, O., Sorkine-Hornung, O., Theobalt, C., eds.: Digital Representations of the Real World: How to Capture, Model, and Render Visual Reality. CRC Press (April 2015) 239-252  8. Laurentini, A.: The visual hull concept for silhouette-based image understanding.  IEEE Trans. Pattern Anal. Machine Intelligence 16(2) (1994)  9. Franco, J., Boyer, E.: Exact polyhedral visual hulls. In: Proc. British Machine  Vision Conf. (BMVC). (2003)  10. Volino, M., Casas, D., Collomosse, J., Hilton, A.: Optimal Representation of Multiple View Video. In: Proceedings of the British Machine Vision Conference, BMVA Press (2014)  11. C.Budd, Huang, P., Klaudinay, M., Hilton, A.: Global non-rigid alignment of surface  sequences. Intl. Jnrl. Computer Vision (IJCV) 102(1-3) (2013) 256-270  12. Han, X., Li, Z., Huang, H., Kalogerakis, E., Yu, Y.: High-resolution shape completion using deep neural networks for global structure and local geometry inference. Proc. Intl. Conf. Computer Vision (ICCV’17) (2017)  13. Wu, Z., Song, S., Khosla, A., Yu, F., Zhang, L., Tang, X., Xiao, J.: 3d shapenets: A deep representation for volumetric shapes. In: IEEE conference on computer vision and pattern recognition (CVPR’15). (2015)  14. Sharma, A., Grau, O., Fritz, M.: Vconv-dae: Deep volumetric shape learning without object labels. In: European Conference on Computer Vision. (2016) 236-250 15. Fattal, R.: Image upsampling via imposed edge statistics. In: Proc. ACM SIG-  GRAPH. (2007)  16. Rudin, L.I., Osher, S., Fatemi, E.: Non-linear total variation based noise removal  algorithms. Physics D 60(1-4) (1992) 259-268  17. Abrahamsson, S., Blom, H., Jans, D.: Multifocus structured illumination microscopy for fast volumetric super-resolution imaging. Biomedical Optics Express 8(9) (2017) 4135-4140  18. Aydin, V., Foroosh, H.: Volumetric super-resolution of multispectral data. In: Corr.  arXiv:1705.05745v1. (2017)  19. Xie, J., Xu, L., Chen, E.: Image denoising and inpainting with deep neural networks.  In: Proc. Neural Inf. Processing Systems (NIPS). (2012) 350-358  20. Wang, Z., Liu, D., Yang, J., Han, W., Huang, T.S.: Deep networks for image super- resolution with sparse prior. In: Proc. Intl. Conf. Computer Vision (ICCV). (2015) 370-378   16  A. Gilbert, M.Volino, J. Collomosse & A. Hilton  21. Shi, W., Caballero, J., Huszar, F., Totz, J., Aitken, A., Bishop, R., Rueckert, D., Wang, Z.: Real-time single image and video super-resolution using an eﬃcient sub- pixel convolutional neural network. In: Proc. Comp. Vision and Pattern Recognition (CVPR). (2016)  22. Jain, V., Seung, H.: Natural image denoising with convolutional networks. In: Proc.  Neural Inf. Processing Systems (NIPS). (2008) 769-776  23. Dong, C., Loy, C.C., He, K., Tang, X.: Image super-resolution using deep convo- lutional networks. IEEE Trans. Pattern Anal. Machine Intelligence 38(2) (2016) 295-307  24. Zeiler, M.D.: Adadelta: an adaptive learning rate method.  arXiv preprint  arXiv:1212.5701 (2012)  25. Srivastava, R.K., Greﬀ, K., Schmidhuber, J.: Training very deep networks.  In:  Advances in neural information processing systems. (2015) 2377-2385  26. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2016) 770-778  27. Lorensen, W., Cline, H.: Marching cubes: A high resolution 3d surface construction  algorithm. ACM Transactions on Graphics (TOG) 21(4) (1987) 163-169  28. Trumble, M., Gilbert, A., Malleson, C., Hilton, A., Collomosse, J.: Total capture: 3d human pose estimation fusing video and inertial sensors. In: Proceedings of 28th British Machine Vision Conference. 1-13  29. Ionescu, C., Papava, D., Olaru, V., Sminchisescu, C.: Human3.6m: Large scale datasets and predictive methods for 3d human sensing in natural environments. IEEE Transactions on Pattern Analysis and Machine Intelligence 36(7) (jul 2014) 1325-1339  30. Starck, J., Hilton, A.: Surface capture for performance-based animation. IEEE  computer graphics and applications 27(3) (2007)  31. Mustafa, A., Volino, M., Guillemaut, J.Y., Hilton, A.: 4d temporally coherent  light-field video. 3DV 2017 Proceedings (2017)  32. Wang, Z., Bovik, A.C., Sheikh, H.R., Simoncelli, E.P.: Image quality assessment: from error visibility to structural similarity. IEEE Tran. Image Processing (TIP) 13(4) (2004) 600-612"}