{"1": "1. Bartoli, A., G´erard, Y., Chadebecq, F., Collins, T., Pizarro, D.: Shape-from- template. IEEE Transactions on Pattern Analysis and Machine Intelligence 37(10), 2099-2118 (2015)  2. Bartoli, A., Pizarro, D., Collins, T.: A robust analytical solution to isometric shape-  from-template with focal length calibration. In: ICCV (2013)  3. Bregler, C., Hertzmann, A., Biermann, H.: Recovering non-rigid 3D shape from  image streams. In: CVPR (2000)  4. Chhatkuli, A., Pizarro, D., Bartoli, A.: Non-rigid shape-from-motion for isometric  surfaces using infinitesimal planarity. In: BMVC (2014)  5. Chhatkuli, A., Pizarro, D., Collins, T., Bartoli, A.: Inextensible non-rigid structure- from-motion by second-order cone programming. IEEE transactions on pattern analysis and machine intelligence pp. 1-1 (2017)  6. Dai, Y., Li, H., He, M.: A simple prior-free method for non-rigid structure-from- motion factorization. International Journal of Computer Vision 107(2), 101-122 (2014)  7. Del Bue, A., Smeraldi, F., Agapito, L.: Non-rigid structure from motion using  non-parametric tracking and non-linear optimization. In: CVPRW (2004)  8. Faugeras, O., Luong, Q.T., Maybank, S.J.: Camera self-calibration: Theory and  experiments. In: ECCV (1992)  9. Gotardo, P., Martinez, A.: Kernel non-rigid structure from motion. In: ICCV (2011) 10. Gurdjos, P., Sturm, P.: Methods and geometry for plane-based self-calibration. In:  11. Hartley, R.: Self-calibration from multiple views with a rotating camera. In: ECCV  CVPR (2003)  (1994)  12. Hartley, R.I., Zisserman, A.: Multiple View Geometry in Computer Vision. Cam-  bridge University Press, ISBN: 0521623049 (2000)  13. Henrion, D., Lasserre, J.B.: Gloptipoly: Global optimization over polynomials with matlab and sedumi. ACM Transactions on Mathematical Software 29(2), 165-194 (2003)  14. Heyden, A., Astrom, K.: Euclidean reconstruction from constant intrinsic param-  eters. In: ICPR (1996)  15. Kahl, F., Triggs, B., Astrom, A.: Critical motions for auto-calibration when some intrinsic parameters can vary. Journal of Mathematical Image and Vision 13(2), 131146 (2000)  16. Lee, J.: Riemannian manifolds : an introduction to curvature. Springer (1997) 17. Llad´o, X., Del Bue, A., Agapito, L.: Non-rigid metric reconstruction from perspec-  tive cameras. Image and Vision Computing 28(9), 1339-1353 (2010)  18. Parashar, S., Pizarro, D., Bartoli, A.: Isometric Non-Rigid Shape-from-Motion with Riemannian Geometry Solved in Linear Time. IEEE Transactions on Pattern Anal- ysis and Machine Intelligence (2017)  19. Pizarro, D., Khan, R., Bartoli, A.: Schwarps: Locally projective image warps based on 2D schwarzian derivatives. International Journal of Computer Vision 119(2), 93-109 (2016)  20. Pollefeys, M., Koch, R., Van Gool, L.: Self-calibration and metric reconstruction in spite of varying and unknown internal camera parameters. In: ICCV (1998) 21. Pollefeys, M., Van Gool, L.: Stratified self-calibration with the modulus constraint. IEEE Transactions on Pattern Analysis and Machine Intelligence 21(8), 707-724 (1999)   Self-Calibrating Isometric Non-Rigid Structure-from-MotionReferences  1. Bartoli, A., G´erard, Y., Chadebecq, F., Collins, T., Pizarro, D.: Shape-from- template. IEEE Transactions on Pattern Analysis and Machine Intelligence 37(10), 2099-2118 (2015)  2. Bartoli, A., Pizarro, D., Collins, T.: A robust analytical solution to isometric shape-  from-template with focal length calibration. In: ICCV (2013)  3. Bregler, C., Hertzmann, A., Biermann, H.: Recovering non-rigid 3D shape from  image streams. In: CVPR (2000)  4. Chhatkuli, A., Pizarro, D., Bartoli, A.: Non-rigid shape-from-motion for isometric  surfaces using infinitesimal planarity. In: BMVC (2014)  5. Chhatkuli, A., Pizarro, D., Collins, T., Bartoli, A.: Inextensible non-rigid structure- from-motion by second-order cone programming. IEEE transactions on pattern analysis and machine intelligence pp. 1-1 (2017)  6. Dai, Y., Li, H., He, M.: A simple prior-free method for non-rigid structure-from- motion factorization. International Journal of Computer Vision 107(2), 101-122 (2014)  7. Del Bue, A., Smeraldi, F., Agapito, L.: Non-rigid structure from motion using  non-parametric tracking and non-linear optimization. In: CVPRW (2004)  8. Faugeras, O., Luong, Q.T., Maybank, S.J.: Camera self-calibration: Theory and  experiments. In: ECCV (1992)  9. Gotardo, P., Martinez, A.: Kernel non-rigid structure from motion. In: ICCV (2011) 10. Gurdjos, P., Sturm, P.: Methods and geometry for plane-based self-calibration. In:  11. Hartley, R.: Self-calibration from multiple views with a rotating camera. In: ECCV  CVPR (2003)  (1994)  12. Hartley, R.I., Zisserman, A.: Multiple View Geometry in Computer Vision. Cam-  bridge University Press, ISBN: 0521623049 (2000)  13. Henrion, D., Lasserre, J.B.: Gloptipoly: Global optimization over polynomials with matlab and sedumi. ACM Transactions on Mathematical Software 29(2), 165-194 (2003)  14. Heyden, A., Astrom, K.: Euclidean reconstruction from constant intrinsic param-  eters. In: ICPR (1996)  15. Kahl, F., Triggs, B., Astrom, A.: Critical motions for auto-calibration when some intrinsic parameters can vary. Journal of Mathematical Image and Vision 13(2), 131146 (2000)  16. Lee, J.: Riemannian manifolds : an introduction to curvature. Springer (1997) 17. Llad´o, X., Del Bue, A., Agapito, L.: Non-rigid metric reconstruction from perspec-  tive cameras. Image and Vision Computing 28(9), 1339-1353 (2010)  18. Parashar, S., Pizarro, D., Bartoli, A.: Isometric Non-Rigid Shape-from-Motion with Riemannian Geometry Solved in Linear Time. IEEE Transactions on Pattern Anal- ysis and Machine Intelligence (2017)  19. Pizarro, D., Khan, R., Bartoli, A.: Schwarps: Locally projective image warps based on 2D schwarzian derivatives. International Journal of Computer Vision 119(2), 93-109 (2016)  20. Pollefeys, M., Koch, R., Van Gool, L.: Self-calibration and metric reconstruction in spite of varying and unknown internal camera parameters. In: ICCV (1998) 21. Pollefeys, M., Van Gool, L.: Stratified self-calibration with the modulus constraint. IEEE Transactions on Pattern Analysis and Machine Intelligence 21(8), 707-724 (1999)   16  S. Parashar and A. Bartoli and D. Pizarro  22. Ramachandran, M., Veeraraghavan, A., Chellappa, R.: A fast bilinear structure from motion algorithm using a video sequence and inertial sensors. IEEE Trans- actions on Pattern Analysis and Machine Intelligence 33(1), 186-193 (2011) 23. Ramalingam, S., Lodha, S., Sturm, P.: A generic structure-from-motion framework.  Computer Vision and Image Understanding 103(1), 218-228 (2006)  24. Russell, C., Yu, R., Agapito, L.: Video pop-up: Monocular 3d reconstruction of  dynamic scenes. In: ECCV (2014)  25. Salzmann, M., Fua, P.: Linear local models for monocular reconstruction of de- formable surfaces. IEEE Transactions on Pattern Analysis and Machine Intelli- gence 33(5), 931-944 (2011)  26. Snavely, N., Seitz, S.M., Szeliski, R.: Modeling the world from internet photo col-  lections. International Journal of Computer Vision 80(1), 189-210 (2008)  27. Sturm, P.: Critical motion sequences for monocular self- calibration and uncali-  brated euclidean reconstruction. In: CVPR (1997)  28. Taylor, J., Jepson, A.D., Kutulakos, K.N.: Non-rigid structure from locally-rigid  motion. In: CVPR (2010)  29. Tomasi, C., Kanade, T.: Shape and motion from image streams under orthography: a factorization method. International Journal of Computer Vision 9(2), 137-154 (1992)  30. Torresani, L., Hertzmann, A., Bregler, C.: Nonrigid structure-from-motion: Esti- mating shape and motion with hierarchical priors. IEEE Transactions on Pattern Analysis and Machine Intelligence 30(5), 878-892 (2008)  31. Triggs, B.: Autocalibration and the absolute quadric. In: CVPR (1997) 32. Varol, A., Salzmann, M., Fua, P., Urtasun, R.: A constrained latent variable model.  In: CVPR (2012)  33. Varol, A., Salzmann, M., Tola, E., Fua, P.: Template-free monocular reconstruction  of deformable surfaces. In: ICCV (2009)  34. Vicente, S., Agapito, L.: Soft inextensibility constraints for template-free non-rigid  reconstruction. In: ECCV (2012)  35. Van der Waerden, B.L.: Modern Algebra. Springer (2003)"}