{"1": "1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., et al.: Tensorﬂow: Large-scale machine learning on heterogeneous distributed systems. arXiv preprint arXiv:1603.04467 (2016)  2. Arnab, A., Torr, P.H.S.: Pixelwise In:  segmentation with a dy- namically on Com- puter Vision and Pattern Recognition (CVPR). pp. 879-888 (July 2017). https://doi.org/10.1109/CVPR.2017.100  instantiated network.  IEEE Conference  instance 2017  3. Bai, M., Urtasun, R.: Deep watershed transform for instance segmentation. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2858-2866 (July 2017). https://doi.org/10.1109/CVPR.2017.305  4. Brabandere, B.D., Neven, D., Gool, L.V.: Semantic instance segmentation for autonomous driving. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW). pp. 478-480 (July 2017). https://doi.org/10.1109/CVPRW.2017.66  5. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. IEEE Transactions on Pattern Analysis and Machine Intelli- gence 40(4), 834-848 (April 2018). https://doi.org/10.1109/TPAMI.2017.2699184 6. Chen, L.C., Hermans, A., Papandreou, G., Schroﬀ, F., Wang, P., Adam, H.: Masklab: Instance segmentation by refining object detection with semantic and direction features. arXiv preprint arXiv:1712.04837 (2017)  7. Chen, L.C., Papandreou, G., Schroﬀ, F., Adam, H.: Rethinking atrous convolution  for semantic image segmentation. arXiv preprint arXiv:1706.05587 (2017)  8. Chen, L.C., Zhu, Y., Papandreou, G., Schroﬀ, F., Adam, H.: Encoder-decoder with atrous separable convolution for semantic image segmentation. arXiv preprint arXiv:1802.02611 (2018)  9. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benen- son, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for se- mantic urban scene understanding. In: 2016 IEEE Conference on Com- puter Vision and Pattern Recognition (CVPR). pp. 3213-3223 (June 2016). https://doi.org/10.1109/CVPR.2016.350  10. Dai, J., He, K., Sun, J.: Instance-aware semantic segmentation via multi- on Computer Vi- 2016).  IEEE Conference pp.  task network cascades. sion and Pattern Recognition https://doi.org/10.1109/CVPR.2016.343  3150-3158  (CVPR).  (June  2016  In:  11. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable con- volutional networks. In: 2017 IEEE International Conference on Computer Vision (ICCV). pp. 764-773 (Oct 2017). https://doi.org/10.1109/ICCV.2017.89  12. Dai, J., He, K., Li, Y., Ren, S., Sun, J.: Instance-sensitive fully convolutional networks. In: Leibe, B., Matas, J., Sebe, N., Welling, M. (eds.) Computer Vision - ECCV 2016. pp. 534-549. Springer International Publishing, Cham (2016) 13. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully convolutional networks. In: Advances in neural information processing systems. pp. 379-387 (2016)  14. Erhan, D., Szegedy, C., Toshev, A., Anguelov, D.: Scalable object detection using deep neural networks. In: 2014 IEEE Conference on Computer Vision and Pattern Recognition. pp. 2155-2162 (June 2014). https://doi.org/10.1109/CVPR.2014.276   Aﬃnity Derivation and Graph Merge for Instance SegmentationReferences  1. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., et al.: Tensorﬂow: Large-scale machine learning on heterogeneous distributed systems. arXiv preprint arXiv:1603.04467 (2016)  2. Arnab, A., Torr, P.H.S.: Pixelwise In:  segmentation with a dy- namically on Com- puter Vision and Pattern Recognition (CVPR). pp. 879-888 (July 2017). https://doi.org/10.1109/CVPR.2017.100  instantiated network.  IEEE Conference  instance 2017  3. Bai, M., Urtasun, R.: Deep watershed transform for instance segmentation. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2858-2866 (July 2017). https://doi.org/10.1109/CVPR.2017.305  4. Brabandere, B.D., Neven, D., Gool, L.V.: Semantic instance segmentation for autonomous driving. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW). pp. 478-480 (July 2017). https://doi.org/10.1109/CVPRW.2017.66  5. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. IEEE Transactions on Pattern Analysis and Machine Intelli- gence 40(4), 834-848 (April 2018). https://doi.org/10.1109/TPAMI.2017.2699184 6. Chen, L.C., Hermans, A., Papandreou, G., Schroﬀ, F., Wang, P., Adam, H.: Masklab: Instance segmentation by refining object detection with semantic and direction features. arXiv preprint arXiv:1712.04837 (2017)  7. Chen, L.C., Papandreou, G., Schroﬀ, F., Adam, H.: Rethinking atrous convolution  for semantic image segmentation. arXiv preprint arXiv:1706.05587 (2017)  8. Chen, L.C., Zhu, Y., Papandreou, G., Schroﬀ, F., Adam, H.: Encoder-decoder with atrous separable convolution for semantic image segmentation. arXiv preprint arXiv:1802.02611 (2018)  9. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benen- son, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for se- mantic urban scene understanding. In: 2016 IEEE Conference on Com- puter Vision and Pattern Recognition (CVPR). pp. 3213-3223 (June 2016). https://doi.org/10.1109/CVPR.2016.350  10. Dai, J., He, K., Sun, J.: Instance-aware semantic segmentation via multi- on Computer Vi- 2016).  IEEE Conference pp.  task network cascades. sion and Pattern Recognition https://doi.org/10.1109/CVPR.2016.343  3150-3158  (CVPR).  (JuneIn:  11. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable con- volutional networks. In: 2017 IEEE International Conference on Computer Vision (ICCV). pp. 764-773 (Oct 2017). https://doi.org/10.1109/ICCV.2017.89  12. Dai, J., He, K., Li, Y., Ren, S., Sun, J.: Instance-sensitive fully convolutional networks. In: Leibe, B., Matas, J., Sebe, N., Welling, M. (eds.) Computer Vision - ECCV 2016. pp. 534-549. Springer International Publishing, Cham (2016) 13. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully convolutional networks. In: Advances in neural information processing systems. pp. 379-387 (2016)  14. Erhan, D., Szegedy, C., Toshev, A., Anguelov, D.: Scalable object detection using deep neural networks. In: 2014 IEEE Conference on Computer Vision and Pattern Recognition. pp. 2155-2162 (June 2014). https://doi.org/10.1109/CVPR.2014.276   16  Y. Liu, S. Yang, B. Li, W. Zhou, J. Xu, H. Li and Y. Lu  15. Fathi, A., Wojna, Z., Rathod, V., Wang, P., Song, H.O., Guadarrama, S., Murphy, K.P.: Semantic instance segmentation via deep metric learning. arXiv preprint arXiv:1703.10277 (2017)  16. Fu, J., Liu, J., Wang, Y., Lu, H.: Stacked deconvolutional network for semantic  segmentation. arXiv preprint arXiv:1708.04943 (2017)  17. Garcia-Garcia, A., Orts-Escolano, S., Oprea, S., Villena-Martinez, V., Garcia- Rodriguez, J.: A review on deep learning techniques applied to semantic segmen- tation. arXiv preprint arXiv:1704.06857 (2017)  18. Girshick, R.: Fast r-cnn. In: 2015 IEEE International Conference on Computer Vi- sion (ICCV). pp. 1440-1448 (Dec 2015). https://doi.org/10.1109/ICCV.2015.169 19. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accurate object detection and semantic segmentation. In: 2014 IEEE Confer- ence on Computer Vision and Pattern Recognition. pp. 580-587 (June 2014). https://doi.org/10.1109/CVPR.2014.81  20. Grauman, K., Darrell, T.: The pyramid match kernel: discriminative classifica- tion with sets of image features. In: Tenth IEEE International Conference on Computer Vision (ICCV’05) Volume 1. vol. 2, pp. 1458-1465 Vol. 2 (Oct 2005). https://doi.org/10.1109/ICCV.2005.239  21. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Simultaneous detection and segmentation. In: Fleet, D., Pajdla, T., Schiele, B., Tuytelaars, T. (eds.) Computer Vision - ECCV 2014. pp. 297-312. Springer International Publishing, Cham (2014) 22. Hayder, Z., He, X., Salzmann, M.: Shape-aware instance segmentation. arXiv  preprint arXiv:1612.03129 (2016)  23. He, K., Gkioxari, G., Dollr, P., Girshick, R.: Mask r-cnn. In: 2017 IEEE In- ternational Conference on Computer Vision (ICCV). pp. 2980-2988 (Oct 2017). https://doi.org/10.1109/ICCV.2017.322  24. He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpass- ing human-level performance on imagenet classification. In: 2015 IEEE Inter- national Conference on Computer Vision (ICCV). pp. 1026-1034 (Dec 2015). https://doi.org/10.1109/ICCV.2015.123  25. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: 2016 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 770-778 (June 2016). https://doi.org/10.1109/CVPR.2016.90  26. Huang, J., Rathod, V., Sun, C., Zhu, M., Korattikara, A., Fathi, A., Fischer, I., Wojna, Z., Song, Y., Guadarrama, S., Murphy, K.: Speed/accuracy trade- oﬀs for modern convolutional object detectors. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3296-3297 (July 2017). https://doi.org/10.1109/CVPR.2017.351  27. Islam, M.A., Rochan, M., Bruce, N.D.B., Wang, Y.: Gated feedback refine- ment network for dense image labeling. In: 2017 IEEE Conference on Com- puter Vision and Pattern Recognition (CVPR). pp. 4877-4885 (July 2017). https://doi.org/10.1109/CVPR.2017.518  28. Jin, L., Chen, Z., Tu, Z.: Object detection free instance segmentation with labeling  transformations. arXiv preprint arXiv:1611.08991 (2016)  29. Kirillov, A., Levinkov, E., Andres, B., Savchynskyy, B., Rother, C.: Instance- cut: From edges to instances with multicut. In: 2017 IEEE Conference on Com- puter Vision and Pattern Recognition (CVPR). pp. 7322-7331 (July 2017). https://doi.org/10.1109/CVPR.2017.774  30. Lazebnik, S., Schmid, C., Ponce, J.: Beyond bags of features: Spatial pyramid matching for recognizing natural scene categories. In: 2006 IEEE Computer Society   Aﬃnity Derivation and Graph Merge for Instance SegmentationConference on Computer Vision and Pattern Recognition (CVPR’06). vol. 2, pp. 2169-2178 (2006). https://doi.org/10.1109/CVPR.2006.68  31. LeCun, Y., Boser, B., Denker, J.S., Henderson, D., Howard, R.E., Hubbard, W., Jackel, L.D.: Backpropagation applied to handwritten zip code recognition. Neural Computation 1(4), 541-551 (Dec 1989). https://doi.org/10.1162/neco.1989.1.4.541 32. Levinkov, E., Uhrig, J., Tang, S., Omran, M., Insafutdinov, E., Kirillov, A., Rother, C., Brox, T., Schiele, B., Andres, B.: Joint graph decomposition & node labeling: Problem, algorithms, applications. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  33. Li, Y., Qi, H., Dai, J., Ji, X., Wei, Y.: Fully convolutional instance-aware semantic segmentation. In: 2017 IEEE Conference on Computer Vision and Pattern Recogni- tion (CVPR). pp. 4438-4446 (July 2017). https://doi.org/10.1109/CVPR.2017.472 34. Liang, X., Wei, Y., Shen, X., Yang, J., Lin, L., Yan, S.: Proposal-free network for  instance-level object segmentation. arXiv preprint arXiv:1509.02636 (2015)  35. Lin, G., Shen, C., v. d. Hengel, A., Reid, I.: Eﬃcient piecewise training of deep structured models for semantic segmentation. In: 2016 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3194-3203 (June 2016). https://doi.org/10.1109/CVPR.2016.348  36. Lin, T.Y., Dollr, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Fea- ture pyramid networks for object detection. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 936-944 (July 2017). https://doi.org/10.1109/CVPR.2017.106  37. Liu, S., Jia, J., Fidler, S., Urtasun, R.: Sgn: Sequential grouping networks for in- stance segmentation. In: 2017 IEEE International Conference on Computer Vision (ICCV). pp. 3516-3524 (Oct 2017). https://doi.org/10.1109/ICCV.2017.378 38. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd: Single shot multibox detector. In: Leibe, B., Matas, J., Sebe, N., Welling, M. (eds.) Computer Vision - ECCV 2016. pp. 21-37. Springer International Publishing, Cham (2016)  39. Liu, W., Rabinovich, A., Berg, A.C.: Parsenet: Looking wider to see better. arXiv  preprint arXiv:1506.04579 (2015)  40. Liu, Z., Li, X., Luo, P., Loy, C.C., Tang, X.: Semantic image segmentation via deep parsing network. In: 2015 IEEE International Conference on Computer Vision (ICCV). pp. 1377-1385 (Dec 2015). https://doi.org/10.1109/ICCV.2015.162 41. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti- mation. In: Leibe, B., Matas, J., Sebe, N., Welling, M. (eds.) Computer Vision - ECCV 2016. pp. 483-499. Springer International Publishing, Cham (2016)  42. Pinheiro, P.O., Collobert, R., Doll´ar, P.: Learning to segment object candidates. In: Advances in Neural Information Processing Systems. pp. 1990-1998 (2015) 43. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified, In: 2016 IEEE Conference on Com- puter Vision and Pattern Recognition (CVPR). pp. 779-788 (June 2016). https://doi.org/10.1109/CVPR.2016.91  real-time object detection.  44. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time ob- IEEE Transactions on Pat- Intelligence 39(6), 1137-1149 (June 2017).  ject detection with region proposal networks. tern Analysis and Machine https://doi.org/10.1109/TPAMI.2016.2577031  45. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., Berg, A.C., Fei-Fei, L.: Ima- genet large scale visual recognition challenge. International Journal of Computer   18  Y. Liu, S. Yang, B. Li, W. Zhou, J. Xu, H. Li and Y. Lu  Vision 115(3), 211-252 (Dec 2015). https://doi.org/10.1007/s11263-015-0816-y, https://doi.org/10.1007/s11263-015-0816-y  46. Shelhamer, E., Long, J., Darrell, T.: Fully convolutional networks for semantic segmentation. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(4), 640-651 (April 2017). https://doi.org/10.1109/TPAMI.2016.2572683 47. Yu, F., Koltun, V.: Multi-scale context aggregation by dilated convolutions. arXiv  preprint arXiv:1511.07122 (2015)  48. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 6230-6239 (July 2017). https://doi.org/10.1109/CVPR.2017.660"}