{"1": "1. Amazon Mechanical Turk: www.mturk.com 2. Beautiful word clouds: www.wordle.net 3. Carreira, J., Zisserman, A.: Quo vadis, action recognition? a new model and the  kinetics dataset. In: CVPR (2017)  4. Chetverikov, D., Peteri, R.: A brief survey of dynamic texture description and  5. Cimpoi, M., Maji, S., Kokkinos, I., Mohamed, S., , Vedaldi, A.: Describing textures  6. Cimpoi, M., Maji, S., Vedaldi, A.: Deep filter banks for texture recognition and  7. Dai, D., Riemenschneider, H., Gool, L.: The synthesizability of texture examples.  recognition. In: CORES (2005)  in the wild. In: CVPR (2014)  segmentation. In: CVPR (2015)  In: CVPR (2014)  8. Derpanis, K., Wildes, R.P.: Spacetime texture representation and recognition based  on spatiotemporal orientation analysis. PAMI 34, 1193-1205 (2012)  9. Derpanis, K.G., Wildes, R.P.: Dynamic texture recognition based on distributions of spacetime oriented structure. In: Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on. pp. 191-198 (June 2010)  10. Doretto, G., Chiuso, A., Wu, Y., Soatto, S.: Dynamic textures. IJCV 51, 91-109  (2003)  11. Dubois, S., Peteri, R., Michel, M.: Characterization and recognition of dynamic textures based on the 2D+T curvelet. Sig. Im. & Vid. Proc. 9, 819-830 (2013) 12. Feichtenhofer, C., Pinz, A., Wildes., R.P.: Spatiotemporal residual networks for  video action recognition. In: NIPS (2016)  13. Feichtenhofer, C., Pinz, A., Wildes., R.P.: Temporal residual networks for dynamic  scene recognition. In: CVPR (2017)  14. Ghanem, B., Narendra, A.: Max margin distance learning for dynamic texture. In:  15. Hadji, I., Wildes, R.P.: A spatiotemporal oriented energy network for dynamic  texture recognition. In: ICCV (2017)  16. He, K., Zhang, X., Ren, S., Sun., J.: Deep residual learning for image recognition.  ECCV (2010)  In: CVPR (2016)  17. Ji, S., Xu, W., Yang, M., Yu, K.: 3D convolutional neural networks for human  action recognition. PAMI 35, 1915-1929 (2013)  18. Karpathy, A., Toderici, G., Shetty, S., Leung, T., Sukthankar, R., Fei-Fei, L.: Large- scale video classification with convolutional neural networks. In: CVPR (2014) 19. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS (2012)  20. Langer, M., Mann, R.: Optical snow. IJCV 55, 55-71 (2003) 21. Lin, T.Y., Maji, S.: Visualizing and understanding deep texture representations.  22. Ng, J., Hausknecht, M., Vijayanarasimhan, S., Vinyals, O., Monga, R., Toderici., G.: Beyond short snippets: Deep networks for video classification. In: CVPR (2015) 23. Oxholm, G., Bariya, P., Nishino, K.: The scale of geometric texture. In: ECCV  In: CVPR (2016)  (2012)  24. Peteri, R., Sandor, F., Huiskes, M.: DynTex: A comprehensive database of dynamic  textures. PRL 31, 1627-1632 (2010)  25. Pond5: www.pond5.com   DTDB for ConvNet UnderstandingReferences  1. Amazon Mechanical Turk: www.mturk.com 2. Beautiful word clouds: www.wordle.net 3. Carreira, J., Zisserman, A.: Quo vadis, action recognition? a new model and the  kinetics dataset. In: CVPR (2017)  4. Chetverikov, D., Peteri, R.: A brief survey of dynamic texture description and  5. Cimpoi, M., Maji, S., Kokkinos, I., Mohamed, S., , Vedaldi, A.: Describing textures  6. Cimpoi, M., Maji, S., Vedaldi, A.: Deep filter banks for texture recognition and  7. Dai, D., Riemenschneider, H., Gool, L.: The synthesizability of texture examples.  recognition. In: CORES (2005)  in the wild. In: CVPR (2014)  segmentation. In: CVPR (2015)  In: CVPR (2014)  8. Derpanis, K., Wildes, R.P.: Spacetime texture representation and recognition based  on spatiotemporal orientation analysis. PAMI 34, 1193-1205 (2012)  9. Derpanis, K.G., Wildes, R.P.: Dynamic texture recognition based on distributions of spacetime oriented structure. In: Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on. pp. 191-198 (June 2010)  10. Doretto, G., Chiuso, A., Wu, Y., Soatto, S.: Dynamic textures. IJCV 51, 91-109  (2003)  11. Dubois, S., Peteri, R., Michel, M.: Characterization and recognition of dynamic textures based on the 2D+T curvelet. Sig. Im. & Vid. Proc. 9, 819-830 (2013) 12. Feichtenhofer, C., Pinz, A., Wildes., R.P.: Spatiotemporal residual networks for  video action recognition. In: NIPS (2016)  13. Feichtenhofer, C., Pinz, A., Wildes., R.P.: Temporal residual networks for dynamic  scene recognition. In: CVPR (2017)  14. Ghanem, B., Narendra, A.: Max margin distance learning for dynamic texture. In:  15. Hadji, I., Wildes, R.P.: A spatiotemporal oriented energy network for dynamic  texture recognition. In: ICCV (2017)  16. He, K., Zhang, X., Ren, S., Sun., J.: Deep residual learning for image recognition.  ECCV (2010)  In: CVPR (2016)  17. Ji, S., Xu, W., Yang, M., Yu, K.: 3D convolutional neural networks for human  action recognition. PAMI 35, 1915-1929 (2013)  18. Karpathy, A., Toderici, G., Shetty, S., Leung, T., Sukthankar, R., Fei-Fei, L.: Large- scale video classification with convolutional neural networks. In: CVPR (2014) 19. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS (2012)  20. Langer, M., Mann, R.: Optical snow. IJCV 55, 55-71 (2003) 21. Lin, T.Y., Maji, S.: Visualizing and understanding deep texture representations.  22. Ng, J., Hausknecht, M., Vijayanarasimhan, S., Vinyals, O., Monga, R., Toderici., G.: Beyond short snippets: Deep networks for video classification. In: CVPR (2015) 23. Oxholm, G., Bariya, P., Nishino, K.: The scale of geometric texture. In: ECCV  In: CVPR (2016)  (2012)  24. Peteri, R., Sandor, F., Huiskes, M.: DynTex: A comprehensive database of dynamic  textures. PRL 31, 1627-1632 (2010)  25. Pond5: www.pond5.com   16  I. Hadji and R. P. Wildes  26. Quan, Y., Bao, C., Ji, H.: Equiangular kernel dicitionary learning with applications  to dynamic textures analysis. In: CVPR (2016)  27. Quan, Y., Huang, Y., Ji, H.: Dynamic texture recognition via orthogonal tensor  dictionary learning. In: ICCV (2015)  28. Ravichandran, A., Chaudhry, R., R. Vidal, R.: View-invariant dynamic texture  recognition using a bag of dynamical systems. In: CVPR (2009)  29. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., Berg, A.C., Fei-Fei, L.: Imagenet large scale visual recognition challenge. IJCV 115(3), 211-252 (2015)  30. Saisan, P., Doretto, G., Wu, Y., Soatto, S.: Dynamic texture recognition. In: CVPR  31. Simonyan, K., Zisserman, A.: Two-stream convolutional networks for action recog-  32. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  (2001)  nition in videos. In: NIPS (2014)  image recognition. In: ICLR (2015)  33. Soomro, K., Zamir, A.R., Shah, M.: UCF101: A dataset of 101 human actions classes from videos in the wild. Tech. Rep. CRCV-TR-12-01, University of Central Florida (2012)  34. Tran, D., Bourdev, L., Fergus, R., Torresani, L., Paluri, M.: Learning spatiotem-  poral features with 3D convolutional networks. In: ICCV (2015)  35. Varma, M., Zisserman, A.: Texture classification: Are filter banks necessary? In:  CVPR (2003)  36. Varma, M., Zisserman, A.: A statistical approach to texture classification from  single images. IJCV 62, 61-81 (2005)  37. VideoHive: www.videohive.net 38. Yang, F., Xia, G., Liu, G., Zhang, L., Huang, X.: Dynamic texture recognition by aggregating spatial and temporal features via SVMs. Neurocomp. 173, 1310 - 1321 (2016)  39. YouTube: www.youtube.com 40. Zhao, G., Pietikainen, M.: Dynamic texture recognition using volume local binary  patterns. In: ECCV (2006)  41. Zhou, B., Lapedriza, A., Xiao, J., Torralba, A., Oliva, A.: Learning deep features  for scene recognition using places database. In: NIPS (2014)"}