{"1": "1. Woodham, R.J.: Photometric method for determining surface orientation from  multiple images. Optical engineering (1980)  2. Silver, W.M.: Determining shape and reﬂectance using multiple images. PhD  thesis, Massachusetts Institute of Technology (1980)  3. Georghiades, A.S.: Incorporating the torrance and sparrow model of reﬂectance in  uncalibrated photometric stereo. In: ICCV. (2003)  4. Chung, H.S., Jia, J.: Eﬃcient photometric stereo on glossy surfaces with wide  specular lobes. In: CVPR. (2008)  5. Ruiters, R., Klein, R.: Heightfield and spatially varying brdf reconstruction for  materials with interreﬂections. In: Computer Graphics Forum. (2009)  6. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep  convolutional neural networks. In: NIPS. (2012)  7. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. Proceedings of the IEEE (1998)  8. Santo, H., Samejima, M., Sugano, Y., Shi, B., Matsushita, Y.: Deep photometric  stereo network. In: ICCV Workshops. (2017)  9. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  10. Johnson, M.K., Adelson, E.H.: Shape estimation in natural illumination.  In:  11. Wiles, O., Zisserman, A.: Silnet: Single-and multi-view reconstruction by learning  segmentation. In: CVPR. (2015)  CVPR. (2011)  from silhouettes. In: BMVC. (2017)  model. In: SIGGRAPH. (2003)  12. Matusik, W., Pfister, H., Brand, M., McMillan, L.: A data-driven reﬂectance  13. Shi, B., Wu, Z., Mo, Z., Duan, D., Yeung, S.K., Tan, P.: A benchmark dataset and evaluation for non-lambertian and uncalibrated photometric stereo. IEEE TPAMI (2018)  14. Alldrin, N., Zickler, T., Kriegman, D.: Photometric stereo with non-parametric  and spatially-varying reﬂectance. In: CVPR. (2008)  15. Einarsson, P., Chabert, C.F., Jones, A., Ma, W.C., Lamond, B., Hawkins, T., Bolas, M., Sylwan, S., Debevec, P.: Relighting human locomotion with ﬂowed reﬂectance fields. In: EGSR. (2006)  16. Herbort, S., W¨ohler, C.: An introduction to image-based 3d surface reconstruction  and a survey of photometric stereo methods. 3D Research (2011)  17. Wu, L., Ganesh, A., Shi, B., Matsushita, Y., Wang, Y., Ma, Y.: Robust photometric  stereo via low-rank matrix completion and recovery. In: ACCV. (2010)  18. Mukaigawa, Y., Ishii, Y., Shakunaga, T.: Analysis of photometric factors based on  photometric linearization. JOSA A (2007)  19. Miyazaki, D., Hara, K., Ikeuchi, K.: Median photometric stereo as applied to the  segonko tumulus and museum objects. IJCV (2010)   PS-FCN: A Flexible Learning Framework for Photometric StereoAcknowledgments We thank Hiroaki Santo for his help with the comparison to DPSN. We also thank Boxin Shi and Zhipeng Mo for their help with the evaluation on the DiLiGenT benchmark. We gratefully acknowledge the support of NVIDIA Corporation with the donation of the Titan X Pascal GPU used for this research. Kai Han is supported by EPSRC Programme Grant Seebibyte EP/M013774/1.  References  1. Woodham, R.J.: Photometric method for determining surface orientation from  multiple images. Optical engineering (1980)  2. Silver, W.M.: Determining shape and reﬂectance using multiple images. PhD  thesis, Massachusetts Institute of Technology (1980)  3. Georghiades, A.S.: Incorporating the torrance and sparrow model of reﬂectance in  uncalibrated photometric stereo. In: ICCV. (2003)  4. Chung, H.S., Jia, J.: Eﬃcient photometric stereo on glossy surfaces with wide  specular lobes. In: CVPR. (2008)  5. Ruiters, R., Klein, R.: Heightfield and spatially varying brdf reconstruction for  materials with interreﬂections. In: Computer Graphics Forum. (2009)  6. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep  convolutional neural networks. In: NIPS. (2012)  7. LeCun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based learning applied to  document recognition. Proceedings of the IEEE (1998)  8. Santo, H., Samejima, M., Sugano, Y., Shi, B., Matsushita, Y.: Deep photometric  stereo network. In: ICCV Workshops. (2017)  9. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  10. Johnson, M.K., Adelson, E.H.: Shape estimation in natural illumination.  In:  11. Wiles, O., Zisserman, A.: Silnet: Single-and multi-view reconstruction by learning  segmentation. In: CVPR. (2015)  CVPR. (2011)  from silhouettes. In: BMVC. (2017)  model. In: SIGGRAPH. (2003)  12. Matusik, W., Pfister, H., Brand, M., McMillan, L.: A data-driven reﬂectance  13. Shi, B., Wu, Z., Mo, Z., Duan, D., Yeung, S.K., Tan, P.: A benchmark dataset and evaluation for non-lambertian and uncalibrated photometric stereo. IEEE TPAMI (2018)  14. Alldrin, N., Zickler, T., Kriegman, D.: Photometric stereo with non-parametric  and spatially-varying reﬂectance. In: CVPR. (2008)  15. Einarsson, P., Chabert, C.F., Jones, A., Ma, W.C., Lamond, B., Hawkins, T., Bolas, M., Sylwan, S., Debevec, P.: Relighting human locomotion with ﬂowed reﬂectance fields. In: EGSR. (2006)  16. Herbort, S., W¨ohler, C.: An introduction to image-based 3d surface reconstruction  and a survey of photometric stereo methods. 3D Research (2011)  17. Wu, L., Ganesh, A., Shi, B., Matsushita, Y., Wang, Y., Ma, Y.: Robust photometric  stereo via low-rank matrix completion and recovery. In: ACCV. (2010)  18. Mukaigawa, Y., Ishii, Y., Shakunaga, T.: Analysis of photometric factors based on  photometric linearization. JOSA A (2007)  19. Miyazaki, D., Hara, K., Ikeuchi, K.: Median photometric stereo as applied to the  segonko tumulus and museum objects. IJCV (2010)   16  G. Chen, K. Han and K.-Y. K. Wong  20. Wu, T.P., Tang, C.K.: Photometric stereo via expectation maximization. IEEE  TPAMI (2010)  21. Ikehata, S., Wipf, D., Matsushita, Y., Aizawa, K.: Robust photometric stereo using  sparse regression. In: CVPR. (2012)  22. Shi, B., Tan, P., Matsushita, Y., Ikeuchi, K.: Bi-polynomial modeling of low-  frequency reﬂectances. IEEE TPAMI (2014)  23. Ikehata, S., Aizawa, K.: Photometric stereo using constrained bivariate regression  for general isotropic surfaces. In: CVPR. (2014)  24. Holroyd, M., Lawrence, J., Humphreys, G., Zickler, T.: A photometric approach  for estimating normals and tangents. In: ACM TOG. (2008)  25. Hertzmann, A., Seitz, S.M.: Example-based photometric stereo: Shape reconstruc-  tion with general, varying brdfs. IEEE TPAMI (2005)  26. Hui, Z., Sankaranarayanan, A.C.: A dictionary-based approach for estimating  shape and spatially-varying reﬂectance. In: ICCP. (2015)  27. Alldrin, N.G., Mallick, S.P., Kriegman, D.J.: Resolving the generalized bas-relief  ambiguity by entropy minimization. In: CVPR. (2007)  28. Shi, B., Matsushita, Y., Wei, Y., Xu, C., Tan, P.: Self-calibrating photometric  29. Wu, Z., Tan, P.: Calibrating photometric stereo by holistic reﬂectance symmetry  stereo. In: CVPR. (2010)  analysis. In: CVPR. (2013)  30. Papadhimitri, T., Favaro, P.: A closed-form, consistent and robust solution to uncalibrated photometric stereo via local diﬀuse reﬂectance maxima. IJCV (2014) 31. Lu, F., Matsushita, Y., Sato, I., Okabe, T., Sato, Y.: From intensity profile to surface normal: photometric stereo for unknown light sources and isotropic re- ﬂectances. IEEE TPAMI (2015)  32. Lu, F., Chen, X., Sato, I., Sato, Y.: Symps: Brdf symmetry guided photometric  stereo for shape and light source estimation. IEEE TPAMI (2018)  33. Eigen, D., Puhrsch, C., Fergus, R.: Depth map prediction from a single image  using a multi-scale deep network. In: NIPS. (2014)  34. Wang, X., Fouhey, D., Gupta, A.: Designing deep networks for surface normal  estimation. In: CVPR. (2015)  35. Choy, C.B., Xu, D., Gwak, J., Chen, K., Savarese, S.: 3d-r2n2: A unified approach  for single and multi-view 3d object reconstruction. In: ECCV. (2016)  36. Hartmann, W., Galliani, S., Havlena, M., Van Gool, L., Schindler, K.: Learned  multi-patch similarity. In: ICCV. (2017)  37. Bromley, J., Guyon, I., LeCun, Y., S¨ackinger, E., Shah, R.: Signature verification International Journal of Pattern  using a” siamese” time delay neural network. Recognition and Artificial Intelligence (1993)  38. Jakob, W.: Mitsuba renderer, 2010 (2010) 39. Paszke, A., Gross, S., Chintala, S., Chanan, G.: Pytorch: Tensors and dynamic  neural networks in python with strong gpu acceleration (2017)  40. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In: ICLR. (2015) 41. Frankot, R.T., Chellappa, R.: A method for enforcing integrability in shape from  shading algorithms. IEEE TPAMI (1988)"}