{"1": "1. https://3dwarehouse.sketchup.com/?hl=en 2. Bailey, T., Nieto, J., Guivant, J., Stevens, M., Nebot, E.: Consistency of the EKF- SLAM algorithm. In: Intelligent Robots and Systems (IROS), 2006 IEEE/RSJ International Conference on (2006)  3. Camposeco, F., Pollefeys, M.: Using vanishing points to improve visual-inertial odometry. In: Robotics and Automation (ICRA), 2015 IEEE International Con- ference on (2015)  4. Carlone, L., Tron, R., Daniilidis, K., Dellaert, F.: Initialization techniques for 3D SLAM: a survey on rotation estimation and its use in pose graph optimization. In: Robotics and Automation (ICRA), 2015 IEEE International Conference on (2015) 5. Coughlan, J.M., Yuille, A.L.: Manhattan world: Compass direction from a sin- gle image by bayesian inference. In: IEEE International Conference on Computer Vision (ICCV) (1999)  6. Davison, A.J., Reid, I.D., Molton, N.D., Stasse, O.: MonoSLAM: Real-time single camera SLAM. IEEE Transactions on Pattern Analysis & Machine Intelligence (2007)  7. Engel, J., Sch¨ops, T., Cremers, D.: LSD-SLAM: Large-scale direct monocular  SLAM. In: European Conference on Computer Vision (2014)  8. Gee, A.P., Chekhlov, D., Calway, A., Mayol-Cuevas, W.: Discovering higher level  structure in visual SLAM. IEEE Transactions on Robotics (2008)  9. Gee, A.P., Chekhlov, D., Mayol-Cuevas, W.W., Calway, A.: Discovering planes and collapsing the state space in visual SLAM. In: British Machine Vision Conference (2007)  10. Grisetti, G., Kummerle, R., Stachniss, C., Burgard, W.: A tutorial on graph-based  SLAM. IEEE Intelligent Transportation Systems Magazine (2010)  11. Handa, A., Whelan, T., McDonald, J., Davison, A.J.: A benchmark for RGB- D visual odometry, 3D reconstruction and SLAM. In: Robotics and Automation (ICRA), 2014 IEEE International Conference on (2014)  12. Hassner, T., Assif, L., Wolf, L.: When standard RANSAC is not enough: cross- media visual matching with hypothesis relevancy. Machine Vision and Applications (2014)  13. Hsiao, M., Westman, E., Zhang, G., Kaess, M.: Keyframe-based dense planar SLAM. In: Robotics and Automation (ICRA), 2017 IEEE International Confer- ence on (2017)  14. Joo, K., Oh, T.H., Kweon, I.S., Bazin, J.C.: Globally optimal inlier set maximiza- tion for Atlanta frame estimation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (2018)  15. Kaess, M.: Simultaneous localization and mapping with infinite planes. In: Robotics  and Automation (ICRA), 2015 IEEE International Conference on (2015)  16. Kaess, M., Ranganathan, A., Dellaert, F.: iSAM: Incremental smoothing and map-  ping. IEEE Transactions on Robotics (2008)  17. Kerl, C., Sturm, J., Cremers, D.: Dense visual SLAM for RGB-D cameras. In: Intelligent Robots and Systems (IROS), 2013 IEEE/RSJ International Conference on (2013)  18. Kim, P., Coltin, B., Kim, H.J.: Low-drift visual odometry in structured environ- ments by decoupling rotational and translational motion. In: Robotics and Au- tomation (ICRA), 2018 IEEE International Conference on (2018)   Linear RGB-D SLAM for Planar EnvironmentsReferences  1. https://3dwarehouse.sketchup.com/?hl=en 2. Bailey, T., Nieto, J., Guivant, J., Stevens, M., Nebot, E.: Consistency of the EKF- SLAM algorithm. In: Intelligent Robots and Systems (IROS), 2006 IEEE/RSJ International Conference on (2006)  3. Camposeco, F., Pollefeys, M.: Using vanishing points to improve visual-inertial odometry. In: Robotics and Automation (ICRA), 2015 IEEE International Con- ference on (2015)  4. Carlone, L., Tron, R., Daniilidis, K., Dellaert, F.: Initialization techniques for 3D SLAM: a survey on rotation estimation and its use in pose graph optimization. In: Robotics and Automation (ICRA), 2015 IEEE International Conference on (2015) 5. Coughlan, J.M., Yuille, A.L.: Manhattan world: Compass direction from a sin- gle image by bayesian inference. In: IEEE International Conference on Computer Vision (ICCV) (1999)  6. Davison, A.J., Reid, I.D., Molton, N.D., Stasse, O.: MonoSLAM: Real-time single camera SLAM. IEEE Transactions on Pattern Analysis & Machine Intelligence (2007)  7. Engel, J., Sch¨ops, T., Cremers, D.: LSD-SLAM: Large-scale direct monocular  SLAM. In: European Conference on Computer Vision (2014)  8. Gee, A.P., Chekhlov, D., Calway, A., Mayol-Cuevas, W.: Discovering higher level  structure in visual SLAM. IEEE Transactions on Robotics (2008)  9. Gee, A.P., Chekhlov, D., Mayol-Cuevas, W.W., Calway, A.: Discovering planes and collapsing the state space in visual SLAM. In: British Machine Vision Conference (2007)  10. Grisetti, G., Kummerle, R., Stachniss, C., Burgard, W.: A tutorial on graph-based  SLAM. IEEE Intelligent Transportation Systems Magazine (2010)  11. Handa, A., Whelan, T., McDonald, J., Davison, A.J.: A benchmark for RGB- D visual odometry, 3D reconstruction and SLAM. In: Robotics and Automation (ICRA), 2014 IEEE International Conference on (2014)  12. Hassner, T., Assif, L., Wolf, L.: When standard RANSAC is not enough: cross- media visual matching with hypothesis relevancy. Machine Vision and Applications (2014)  13. Hsiao, M., Westman, E., Zhang, G., Kaess, M.: Keyframe-based dense planar SLAM. In: Robotics and Automation (ICRA), 2017 IEEE International Confer- ence on (2017)  14. Joo, K., Oh, T.H., Kweon, I.S., Bazin, J.C.: Globally optimal inlier set maximiza- tion for Atlanta frame estimation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (2018)  15. Kaess, M.: Simultaneous localization and mapping with infinite planes. In: Robotics  and Automation (ICRA), 2015 IEEE International Conference on (2015)  16. Kaess, M., Ranganathan, A., Dellaert, F.: iSAM: Incremental smoothing and map-  ping. IEEE Transactions on Robotics (2008)  17. Kerl, C., Sturm, J., Cremers, D.: Dense visual SLAM for RGB-D cameras. In: Intelligent Robots and Systems (IROS), 2013 IEEE/RSJ International Conference on (2013)  18. Kim, P., Coltin, B., Kim, H.J.: Low-drift visual odometry in structured environ- ments by decoupling rotational and translational motion. In: Robotics and Au- tomation (ICRA), 2018 IEEE International Conference on (2018)   16  Pyojin Kim, Brian Coltin, and H. Jin Kim  19. K¨ummerle, R., Grisetti, G., Strasdat, H., Konolige, K., Burgard, W.: g2o: A general framework for graph optimization. In: Robotics and Automation (ICRA), 2011 IEEE International Conference on (2011)  20. Le, P.H., Koˇsecka, J.: Dense piecewise planar RGB-D SLAM for indoor environ- ments. In: Intelligent Robots and Systems (IROS), 2017 IEEE/RSJ International Conference on (2017)  21. Ma, L., Kerl, C., St¨uckler, J., Cremers, D.: CPA-SLAM: Consistent plane-model alignment for direct RGB-D SLAM. In: Robotics and Automation (ICRA), 2016 IEEE International Conference on (2016)  22. Mart´ınez-Carranza, J., Calway, A.: Unifying planar and point mapping in monoc-  ular SLAM. In: British Machine Vision Conference (2010)  23. Mur-Artal, R., Tard´os, J.D.: ORB-SLAM2: An open-source SLAM system for  monocular, stereo, and RGB-D cameras. IEEE Transactions on Robotics (2017)  24. Servant, F., Marchand, E., Houlier, P., Marchal, I.: Visual planes-based simulta- neous localization and model refinement for augmented reality. In: Pattern Recog- nition, 2008. ICPR 2008. 19th International Conference on. IEEE (2008)  25. Simon, D.: Optimal state estimation: Kalman, H infinity, and nonlinear approaches.  John Wiley & Sons (2006)  26. Strasdat, H., Montiel, J., Davison, A.J.: Real-time monocular SLAM: Why filter? In: Robotics and Automation (ICRA), 2010 IEEE International Conference on (2010)  27. Straub, J., Rosman, G., Freifeld, O., Leonard, J.J., Fisher, J.W.: A mixture of Manhattan frames: Beyond the Manhattan world. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (2014)  28. Sturm, J., Engelhard, N., Endres, F., Burgard, W., Cremers, D.: A benchmark for the evaluation of RGB-D SLAM systems. In: Intelligent Robots and Systems (IROS), 2012 IEEE/RSJ International Conference on (2012)  29. Taylor, C.J., Cowley, A.: Parsing indoor scenes using RGB-D imagery. In: Robotics:  Science and Systems (2013)  30. Wang, R., Schw¨orer, M., Cremers, D.: Stereo DSO: Large-scale direct sparse visual odometry with stereo cameras. In: IEEE International Conference on Computer Vision (ICCV) (2017)  31. Weingarten, J., Siegwart, R.: 3D SLAM using planar segments. In: Intelligent Robots and Systems (IROS), 2006 IEEE/RSJ International Conference on (2006) 32. Yang, M.Y., F¨orstner, W.: Plane detection in point cloud data. In: Proceedings of  the 2nd int conf on machine control guidance, Bonn (2010)  33. Yang, S., Song, Y., Kaess, M., Scherer, S.: Pop-up SLAM: semantic monocular plane SLAM for low-texture environments. In: Intelligent Robots and Systems (IROS), 2016 IEEE/RSJ International Conference on (2016)  34. Zhao, L., Huang, S., Dissanayake, G.: Linear SLAM: A linear solution to the feature-based and pose graph slam based on submap joining. In: Intelligent Robots and Systems (IROS), 2013 IEEE/RSJ International Conference on (2013)"}