{"1": "1. LeCun, Y., Kavukcuoglu, K., Farabet, C., et al.: Convolutional networks and ap- plications in vision. In: International Symposium on Circuits and Systems. (2010) 253-256  2. Williams, T., Li, R.: Wavelet pooling for convolutional neural networks. In: Inter-  national Conference on Learning Representations. (2018)  3. Rippel, O., Snoek, J., Adams, R.P.: Spectral representations for convolutional neural networks. In: Neural Information Processing Systems. (2015) 2449-2457 4. Le, Q.V.: Building high-level features using large scale unsupervised learning. In: International Conference on Acoustics, Speech and Signal Processing. (2013) 8595-8598  5. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  ImageNet classification with deep convolutional neural networks. In: Neural Information Processing Systems. (2012) 1097-1105  6. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv:1409.1556 (2014)  7. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  Computer Vision and Pattern Recognition (2016) 770-778  8. Forsyth, D.A., Ponce, J.: Computer vision: a modern approach. Prentice Hall  Professional Technical Reference (2002)  9. Mallat, S.: A wavelet tour of signal processing. Academic Press (1999)  10. Mallat, S., Hwang, W.L.: Singularity detection and processing with wavelets.  Transactions on Information Theory 38(2) (1992) 617-643  11. Skodras, A., Christopoulos, C., Ebrahimi, T.: The jpeg 2000 still image compres-  sion standard. Signal Processing Magazine 18(5) (2001) 36-58  12. Perronnin, F., Larlus, D.: Fisher vectors meet neural networks: A hybrid classifica- tion architecture. In: Computer Vision and Pattern Recognition. (2015) 3743-3752 13. Fujieda, S., Takayama, K., Hachisuka, T.: Wavelet convolutional neural networks  for texture classification. arXiv:1707.07394 (2017)  14. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected convolutional networks. In: Computer Vision and Pattern Recognition. (2017) 15. Levinskis, A.: Convolutional neural network feature reduction using wavelet trans-  form. Elektronika ir Elektrotechnika 19(3) (2013) 61-64  16. Gueguen, L., Sergeev, A., Liu, R., Yosinski, J.: Faster neural networks straight from JPEG. In: International Conference on Learning Representations Workshop. (2018)  17. Oyallon, E., Belilovsky, E., Zagoruyko, S.: Scaling the scattering transform: Deep  hybrid networks. In: International Conference on Computer Vision. (2017)  18. Bruna, J., Mallat, S.: Invariant scattering convolution networks. Transactions on  Pattern Analysis and Machine Intelligence 35(8) (2013) 1872-1886  19. S´anchez, J., Perronnin, F., Mensink, T., Verbeek, J.:  Image classification with the fisher vector: Theory and practice. International Journal of Computer Vision 105(3) (2013) 222-245  20. Morel, J.M., Yu, G.: ASIFT: A new framework for fully aﬃne invariant image  comparison. Journal on Imaging Sciences 2(2) (2009) 438-469  21. Olshausen, B.A., Field, D.J.: Emergence of simple-cell receptive field properties by learning a sparse code for natural images. Nature 381(6583) (1996) 607 22. Mallat, S.: Group invariant scattering. Communications on Pure and Applied  Mathematics 65(10) (2012) 1331-1398   Compressing the Input for CNNs with the First-Order Scattering TransformReferences  1. LeCun, Y., Kavukcuoglu, K., Farabet, C., et al.: Convolutional networks and ap- plications in vision. In: International Symposium on Circuits and Systems. (2010) 253-256  2. Williams, T., Li, R.: Wavelet pooling for convolutional neural networks. In: Inter-  national Conference on Learning Representations. (2018)  3. Rippel, O., Snoek, J., Adams, R.P.: Spectral representations for convolutional neural networks. In: Neural Information Processing Systems. (2015) 2449-2457 4. Le, Q.V.: Building high-level features using large scale unsupervised learning. In: International Conference on Acoustics, Speech and Signal Processing. (2013) 8595-8598  5. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  ImageNet classification with deep convolutional neural networks. In: Neural Information Processing Systems. (2012) 1097-1105  6. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv:1409.1556 (2014)  7. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  Computer Vision and Pattern Recognition (2016) 770-778  8. Forsyth, D.A., Ponce, J.: Computer vision: a modern approach. Prentice Hall  Professional Technical Reference (2002)  9. Mallat, S.: A wavelet tour of signal processing. Academic Press (1999)  10. Mallat, S., Hwang, W.L.: Singularity detection and processing with wavelets.  Transactions on Information Theory 38(2) (1992) 617-643  11. Skodras, A., Christopoulos, C., Ebrahimi, T.: The jpeg 2000 still image compres-  sion standard. Signal Processing Magazine 18(5) (2001) 36-58  12. Perronnin, F., Larlus, D.: Fisher vectors meet neural networks: A hybrid classifica- tion architecture. In: Computer Vision and Pattern Recognition. (2015) 3743-3752 13. Fujieda, S., Takayama, K., Hachisuka, T.: Wavelet convolutional neural networks  for texture classification. arXiv:1707.07394 (2017)  14. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected convolutional networks. In: Computer Vision and Pattern Recognition. (2017) 15. Levinskis, A.: Convolutional neural network feature reduction using wavelet trans-  form. Elektronika ir Elektrotechnika 19(3) (2013) 61-64  16. Gueguen, L., Sergeev, A., Liu, R., Yosinski, J.: Faster neural networks straight from JPEG. In: International Conference on Learning Representations Workshop. (2018)  17. Oyallon, E., Belilovsky, E., Zagoruyko, S.: Scaling the scattering transform: Deep  hybrid networks. In: International Conference on Computer Vision. (2017)  18. Bruna, J., Mallat, S.: Invariant scattering convolution networks. Transactions on  Pattern Analysis and Machine Intelligence 35(8) (2013) 1872-1886  19. S´anchez, J., Perronnin, F., Mensink, T., Verbeek, J.:  Image classification with the fisher vector: Theory and practice. International Journal of Computer Vision 105(3) (2013) 222-245  20. Morel, J.M., Yu, G.: ASIFT: A new framework for fully aﬃne invariant image  comparison. Journal on Imaging Sciences 2(2) (2009) 438-469  21. Olshausen, B.A., Field, D.J.: Emergence of simple-cell receptive field properties by learning a sparse code for natural images. Nature 381(6583) (1996) 607 22. Mallat, S.: Group invariant scattering. Communications on Pure and Applied  Mathematics 65(10) (2012) 1331-1398   16  E. Oyallon, E. Belilovsky, S. Zagoruyko, M. Valko  23. Mallat, S., Waldspurger, I.: Phase retrieval for the cauchy wavelet transform.  Journal of Fourier Analysis and Applications 21(6) (2015) 1251-1309  24. Waldspurger, I., d’Aspremont, A., Mallat, S.: Phase recovery, maxcut and complex semidefinite programming. Mathematical Programming 149(1-2) (2015) 47-81 25. Krajsek, K., Mester, R.: A unified theory for steerable and quadrature filters. In:  Advances in Computer Graphics and Computer Vision. (2007) 201-214  26. Soulard, R.: Ondelettes analytiques et monog`enes pour la repr´esentation des im-  ages couleur. PhD thesis, Universit´e de Poitiers (2012)  27. Delprat, N., Escudi´e, B., Guillemain, P., Kronland-Martinet, R., Tchamitchian, P., Torresani, B.: Asymptotic wavelet and gabor analysis: Extraction of instantaneous frequencies. Transactions on Information Theory 38(2) (1992) 644-664  Audio texture synthesis with scattering moments.  28. Bruna, J., Mallat, S.: arXiv:1311.0407 (2013)  29. Bruna, J.: Scattering representations for recognition. PhD thesis, ´Ecole Polytech-  nique (2013)  30. Lindeberg, T.: Feature detection with automatic scale selection.  International  Journal of Computer Vision 30(2) (1998) 79-116  31. Lowe, D.G.: Distinctive image features from scale-invariant keypoints. Interna-  tional Journal of Computer Vision 60(2) (2004) 91-110  32. Zagoruyko, S., Komodakis, N.: Wide residual networks. In: British Machine Vision  Conference. (2016)  33. Torfason, R., Mentzer, F., Agustsson, E., Tschannen, M., Timofte, R., Van Gool, L.: Towards image understanding from deep compression without decoding. arXiv:1803.06131 (2018)  34. Yang, J., Lu, J., Batra, D., Parikh, D.: A faster pytorch implementation of faster  R-CNN. https://github.com/jwyang/faster-rcnn.pytorch (2017)  35. Girshick, R.B.: Fast R-CNN. International Conference on Computer Vision (2015)  1440-1448  36. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: towards real-time object detection with region proposal networks. Transactions on Pattern Analysis and Machine Intelligence 39(6) (2017) 1137-1149  37. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. arXiv:1502.03167 (2015)  38. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual object classes (VOC) challenge. International journal of computer vision 88(2) (2010) 303-338  39. Paszke, A., Gross, S., Chintala, S., Chanan, G., Yang, E., DeVito, Z., Lin, Z., Desmaison, A., Antiga, L., Lerer, A.: Automatic diﬀerentiation in pytorch. (2017) In: International  40. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask R-CNN.  Conference Computer Vision. (2017) 2980-2988  41. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, In: European  P., Zitnick, C.L.: Microsoft COCO: Common objects in context. Conference on Computer Vision. (2014) 740-755"}