{"1": "1. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  segmentation. In: CVPR. (2015)  2. Chen, L., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. ICLR (2015) Segnet: A deep convolutional  3. Badrinarayanan, V., Kendall, A., Cipolla, R.:  encoder-decoder architecture for image segmentation. arXiv:1511.00561 (2015) 4. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmen-  5. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In:  tation. In: ICCV. (2015)  CVPR. (2017)  6. Wu, Z., Shen, C., van den Hengel, A.: Wider or deeper: Revisiting the resnet model  for visual recognition. arXiv:1611.10080 (2016)  7. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. (2016)  8. Paszke, A., Chaurasia, A., Kim, S., Culurciello, E.: Enet: A deep neural network  architecture for real-time semantic segmentation. arXiv:1606.02147 (2016)  9. Treml, M., Arjona-Medina, J., Unterthiner, T., Durgesh, R., Friedmann, F., Schu- berth, P., Mayr, A., Heusel, M., Hofmarcher, M., Widrich, M., Nessler1, B., Hochre- iter, S.: Speeding up semantic segmentation for autonomous driving. NIPS Work- shop (2016)  10. Wang, P., Chen, P., Yuan, Y., Liu, D., Huang, Z., Hou, X., Cottrell, G.W.: Un- derstanding convolution for semantic segmentation. arXiv:1702.08502 (2017) 11. Lin, G., Milan, A., Shen, C., Reid, I.D.: Refinenet: Multi-path refinement networks  for high-resolution semantic segmentation. In: CVPR. (2017)  12. Pohlen, T., Hermans, A., Mathias, M., Leibe, B.: Full-resolution residual networks  for semantic segmentation in street scenes. In: CVPR. (2017)  13. Chen, L., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv:1606.00915 (2016)  14. Yu, F., Koltun, V.: Multi-scale context aggregation by dilated convolutions. ICLR  (2016)  15. Liu, Z., Li, X., Luo, P., Loy, C.C., Tang, X.: Semantic image segmentation via  deep parsing network. In: ICCV. (2015)  16. Zheng, S., Jayasumana, S., Romera-Paredes, B., Vineet, V., Su, Z., Du, D., Huang, C., Torr, P.H.S.: Conditional random fields as recurrent neural networks. In: ICCV. (2015)  17. Brostow, G.J., Fauqueur, J., Cipolla, R.: Semantic object classes in video: A high-  definition ground truth database. Pattern Recognition Letters (2009)  18. Caesar, H., Uijlings, J., Ferrari, V.: Coco-stuﬀ: Thing and stuﬀ classes in context.  arXiv:1612.03716 (2016)  TPAMI (2011)  19. Liu, C., Yuen, J., Torralba, A.: Nonparametric scene parsing via label transfer.  20. Chen, L., Yang, Y., Wang, J., Xu, W., Yuille, A.L.: Attention to scale: Scale-aware  semantic image segmentation. In: CVPR. (2016)  21. Hariharan, B., Arbel´aez, P.A., Girshick, R.B., Malik, J.: Hypercolumns for object  segmentation and fine-grained localization. In: CVPR. (2015)   ICNet for Real-Time Semantic SegmentationReferences  1. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  segmentation. In: CVPR. (2015)  2. Chen, L., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. ICLR (2015) Segnet: A deep convolutional  3. Badrinarayanan, V., Kendall, A., Cipolla, R.:  encoder-decoder architecture for image segmentation. arXiv:1511.00561 (2015) 4. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmen-  5. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In:  tation. In: ICCV. (2015)  CVPR. (2017)  6. Wu, Z., Shen, C., van den Hengel, A.: Wider or deeper: Revisiting the resnet model  for visual recognition. arXiv:1611.10080 (2016)  7. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR. (2016)  8. Paszke, A., Chaurasia, A., Kim, S., Culurciello, E.: Enet: A deep neural network  architecture for real-time semantic segmentation. arXiv:1606.02147 (2016)  9. Treml, M., Arjona-Medina, J., Unterthiner, T., Durgesh, R., Friedmann, F., Schu- berth, P., Mayr, A., Heusel, M., Hofmarcher, M., Widrich, M., Nessler1, B., Hochre- iter, S.: Speeding up semantic segmentation for autonomous driving. NIPS Work- shop (2016)  10. Wang, P., Chen, P., Yuan, Y., Liu, D., Huang, Z., Hou, X., Cottrell, G.W.: Un- derstanding convolution for semantic segmentation. arXiv:1702.08502 (2017) 11. Lin, G., Milan, A., Shen, C., Reid, I.D.: Refinenet: Multi-path refinement networks  for high-resolution semantic segmentation. In: CVPR. (2017)  12. Pohlen, T., Hermans, A., Mathias, M., Leibe, B.: Full-resolution residual networks  for semantic segmentation in street scenes. In: CVPR. (2017)  13. Chen, L., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv:1606.00915 (2016)  14. Yu, F., Koltun, V.: Multi-scale context aggregation by dilated convolutions. ICLR  (2016)  15. Liu, Z., Li, X., Luo, P., Loy, C.C., Tang, X.: Semantic image segmentation via  deep parsing network. In: ICCV. (2015)  16. Zheng, S., Jayasumana, S., Romera-Paredes, B., Vineet, V., Su, Z., Du, D., Huang, C., Torr, P.H.S.: Conditional random fields as recurrent neural networks. In: ICCV. (2015)  17. Brostow, G.J., Fauqueur, J., Cipolla, R.: Semantic object classes in video: A high-  definition ground truth database. Pattern Recognition Letters (2009)  18. Caesar, H., Uijlings, J., Ferrari, V.: Coco-stuﬀ: Thing and stuﬀ classes in context.  arXiv:1612.03716 (2016)  TPAMI (2011)  19. Liu, C., Yuen, J., Torralba, A.: Nonparametric scene parsing via label transfer.  20. Chen, L., Yang, Y., Wang, J., Xu, W., Yuille, A.L.: Attention to scale: Scale-aware  semantic image segmentation. In: CVPR. (2016)  21. Hariharan, B., Arbel´aez, P.A., Girshick, R.B., Malik, J.: Hypercolumns for object  segmentation and fine-grained localization. In: CVPR. (2015)   16  H. Zhao, X. Qi, X. Shen, J. Shi, J. Jia  22. Xia, F., Wang, P., Chen, L., Yuille, A.L.: Zoom better to see clearer: Human and  object parsing with hierarchical auto-zoom net. In: ECCV. (2016)  23. Girshick, R.: Fast R-CNN. In: ICCV. (2015) 24. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: Towards real-time object  detection with region proposal networks. In: NIPS. (2015)  25. Redmon, J., Divvala, S.K., Girshick, R.B., Farhadi, A.: You only look once: Unified,  real-time object detection. In: CVPR. (2016)  26. Redmon, J., Farhadi, A.: YOLO9000: better, faster, stronger. In: CVPR. (2017) 27. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S.E., Fu, C., Berg, A.C.: Ssd:  Single shot multibox detector. In: ECCV. (2016)  28. Romera, E., Alvarez, J.M., Bergasa, L.M., Arroyo, R.: Eﬃcient convnet for real- time semantic segmentation. In: Intelligent Vehicles Symposium (IV). (2017) 29. Shelhamer, E., Rakelly, K., Hoﬀman, J., Darrell, T.: Clockwork convnets for video  semantic segmentation. In: ECCV Workshop. (2016)  30. Zhu, X., Xiong, Y., Dai, J., Yuan, L., Wei, Y.: Deep feature ﬂow for video recog-  31. Kundu, A., Vineet, V., Koltun, V.: Feature space optimization for semantic video  nition. In: CVPR. (2017)  segmentation. In: CVPR. (2016)  warping. In: ICCV. (2017)  32. Gadde, R., Jampani, V., Gehler, P.V.: Semantic video cnns through representation  33. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomed-  ical image segmentation. In: MICCAI. (2015)  34. Ghiasi, G., Fowlkes, C.C.: Laplacian pyramid reconstruction and refinement for  semantic segmentation. In: ECCV. (2016)  35. Everingham, M., Gool, L.J.V., Williams, C.K.I., Winn, J.M., Zisserman, A.: The  pascal visual object classes VOC challenge. IJCV (2010)  36. Zhou, B., Zhao, H., Puig, X., Fidler, S., Barriuso, A., Torralba, A.: Semantic  understanding of scenes through the ADE20K dataset. arXiv:1608.05442 (2016)  37. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R.B., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM MM. (2014)  38. Iandola, F.N., Moskewicz, M.W., Ashraf, K., Han, S., Dally, W.J., Keutzer, K.: Squeezenet: Alexnet-level accuracy with 50x fewer parameters and <1mb model size. arXiv:1602.07360 (2016)  39. Han, S., Mao, H., Dally, W.J.: Deep compression: Compressing deep neural network  with pruning, trained quantization and huﬀman coding. In: ICLR. (2016)  40. Han, S., Pool, J., Narang, S., Mao, H., Tang, S., Elsen, E., Catanzaro, B., Tran, J., Dally, W.J.: DSD: regularizing deep neural networks with dense-sparse-dense training ﬂow. In: ICLR. (2017)  41. Li, H., Kadav, A., Durdanovic, I., Samet, H., Graf, H.P.: Pruning filters for eﬃcient  convnets. In: ICLR. (2017)  42. Sturgess, P., Alahari, K., Ladicky, L., Torr, P.H.: Combining appearance and  structure from motion features for road scene understanding. In: BMVC. (2009)  43. Lin, T., Maire, M., Belongie, S.J., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: ECCV. (2014)"}