{"1": "1. Arnab, A., Torr, P.H.S.: Pixelwise instance segmentation with a dynamically in-  stantiated network. In: CVPR (2017) 5, 13  2. Bai, M., Urtasun, R.: Deep watershed transform for instance segmentation. In:  CVPR (2017) 5  3. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016) 2, 7, 8, 9, 10, 11 4. Chen, L.C., Papandreou, G., Schroﬀ, F., Adam, H.: Rethinking atrous convolution for semantic image segmentation. arXiv preprint arXiv:1706.05587 (2017) 11 5. Chen, L.C., Yang, Y., Wang, J., Xu, W., Yuille, A.L.: Attention to scale: Scale-  aware semantic image segmentation. In: CVPR (2016) 4, 8, 11, 12  6. Chen, X., Mottaghi, R., Liu, X., Fidler, S., Urtasun, R., et al.: Detect what you can: Detecting and representing objects using holistic models and body parts. In: CVPR (2014) 2, 4, 5, 6, 11, 12, 13, 14  7. Dai, J., He, K., Sun, J.: Instance-aware semantic segmentation via multi-task net-  work cascades. In: CVPR (2016) 2, 4, 11, 12  8. Dong, J., Chen, Q., Xia, W., Huang, Z., Yan, S.: A deformable mixture parsing  model with parselets. In: ICCV (2013) 2  9. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal  visual object classes (voc) challenge. IJCV (2010) 11  10. Gan, C., Lin, M., Yang, Y., de Melo, G., Hauptmann, A.G.: Concepts not alone: Exploring pairwise relationships for zero-shot video activity recognition. In: AAAI (2016) 2  11. Gong, K., Liang, X., Zhang, D., Shen, X., Lin, L.: Look into person: Self-supervised structure-sensitive learning and a new benchmark for human parsing. In: CVPR (2017) 2, 4, 5, 6, 11  12. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Simultaneous detection and  segmentation. In: ECCV (2014) 2, 4, 11  13. He, K., Gkioxari, G., Dollar, P., Girshick, R.: Mask r-cnn. In: ICCV (2017) 2, 4, 5 14. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016) 2  15. Kirillov, A., Levinkov, E., Andres, B., Savchynskyy, B., Rother, C.: Instancecut:  From edges to instances with multicut. In: CVPR (2017) 3, 5  16. Li, Q., Arnab, A., Torr, P.H.: Holistic, instance-level human parsing. arXiv preprint  arXiv:1709.03612 (2017) 2, 5, 11, 12, 13, 14  17. Liang, X., Lin, L., Shen, X., Feng, J., Yan, S., Xing, E.P.: Interpretable structure-  evolving lstm. In: CVPR (2017) 11  18. Liang, X., Liu, S., Shen, X., Yang, J., Liu, L., Dong, J., Lin, L., Yan, S.: Deep  human parsing with active template regression. TPAMI (2015) 2  19. Liang, X., Shen, X., Feng, J., Lin, L., Yan, S.: Semantic object parsing with graph  lstm. In: ECCV (2016) 11  20. Liang, X., Shen, X., Xiang, D., Feng, J., Lin, L., Yan, S.: Semantic object parsing  with local-global long short-term memory. In: CVPR (2016) 11  21. Liang, X., Wei, Y., Shen, X., Jie, Z., Feng, J., Lin, L., Yan, S.: Reversible recursive  instance-level object segmentation. In: CVPR (2016) 2, 4  22. Liang, X., Wei, Y., Shen, X., Yang, J., Lin, L., Yan, S.: Proposal-free network for instance-level object segmentation. arXiv preprint arXiv:1509.02636 (2015) 2, 3, 5   Instance-level Human Parsing via Part Grouping NetworkReferences  1. Arnab, A., Torr, P.H.S.: Pixelwise instance segmentation with a dynamically in-  stantiated network. In: CVPR (2017) 5, 13  2. Bai, M., Urtasun, R.: Deep watershed transform for instance segmentation. In:  CVPR (2017) 5  3. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016) 2, 7, 8, 9, 10, 11 4. Chen, L.C., Papandreou, G., Schroﬀ, F., Adam, H.: Rethinking atrous convolution for semantic image segmentation. arXiv preprint arXiv:1706.05587 (2017) 11 5. Chen, L.C., Yang, Y., Wang, J., Xu, W., Yuille, A.L.: Attention to scale: Scale-  aware semantic image segmentation. In: CVPR (2016) 4, 8, 11, 12  6. Chen, X., Mottaghi, R., Liu, X., Fidler, S., Urtasun, R., et al.: Detect what you can: Detecting and representing objects using holistic models and body parts. In: CVPR (2014) 2, 4, 5, 6, 11, 12, 13, 14  7. Dai, J., He, K., Sun, J.: Instance-aware semantic segmentation via multi-task net-  work cascades. In: CVPR (2016) 2, 4, 11, 12  8. Dong, J., Chen, Q., Xia, W., Huang, Z., Yan, S.: A deformable mixture parsing  model with parselets. In: ICCV (2013) 2  9. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal  visual object classes (voc) challenge. IJCV (2010) 11  10. Gan, C., Lin, M., Yang, Y., de Melo, G., Hauptmann, A.G.: Concepts not alone: Exploring pairwise relationships for zero-shot video activity recognition. In: AAAI (2016) 2  11. Gong, K., Liang, X., Zhang, D., Shen, X., Lin, L.: Look into person: Self-supervised structure-sensitive learning and a new benchmark for human parsing. In: CVPR (2017) 2, 4, 5, 6, 11  12. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Simultaneous detection and  segmentation. In: ECCV (2014) 2, 4, 11  13. He, K., Gkioxari, G., Dollar, P., Girshick, R.: Mask r-cnn. In: ICCV (2017) 2, 4, 5 14. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016) 2  15. Kirillov, A., Levinkov, E., Andres, B., Savchynskyy, B., Rother, C.: Instancecut:  From edges to instances with multicut. In: CVPR (2017) 3, 5  16. Li, Q., Arnab, A., Torr, P.H.: Holistic, instance-level human parsing. arXiv preprint  arXiv:1709.03612 (2017) 2, 5, 11, 12, 13, 14  17. Liang, X., Lin, L., Shen, X., Feng, J., Yan, S., Xing, E.P.: Interpretable structure-  evolving lstm. In: CVPR (2017) 11  18. Liang, X., Liu, S., Shen, X., Yang, J., Liu, L., Dong, J., Lin, L., Yan, S.: Deep  human parsing with active template regression. TPAMI (2015) 2  19. Liang, X., Shen, X., Feng, J., Lin, L., Yan, S.: Semantic object parsing with graph  lstm. In: ECCV (2016) 11  20. Liang, X., Shen, X., Xiang, D., Feng, J., Lin, L., Yan, S.: Semantic object parsing  with local-global long short-term memory. In: CVPR (2016) 11  21. Liang, X., Wei, Y., Shen, X., Jie, Z., Feng, J., Lin, L., Yan, S.: Reversible recursive  instance-level object segmentation. In: CVPR (2016) 2, 4  22. Liang, X., Wei, Y., Shen, X., Yang, J., Lin, L., Yan, S.: Proposal-free network for instance-level object segmentation. arXiv preprint arXiv:1509.02636 (2015) 2, 3, 5   16  Ke Gong, Xiaodan Liang, Yicheng Li, Yimin Chen, Ming Yang, Liang Lin  In: NIPS (2015) 2, 4  In: CVPR (2017) 5  (2016) 5  23. Liang, X., Xu, C., Shen, X., Yang, J., Liu, S., Tang, J., Lin, L., Yan, S.: Human parsing with contextualized convolutional neural network. In: ICCV (2015) 2, 4, 5, 6  24. Lin, T., Maire, M., Belongie, S.J., Bourdev, L.D., Girshick, R.B., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft COCO: common objects in context. CoRR abs/1405.0312 (2014) 2  25. Liu, S., Jia, J., Fidler, S., Urtasun, R.: Sgn: Sequential grouping networks for  instance segmentation. In: ICCV (2017) 3, 5, 10, 13  26. Liu, S., Liang, X., Liu, L., Shen, X., Yang, J., Xu, C., Lin, L., Cao, X., Yan, S.: Matching-CNN Meets KNN: Quasi-Parametric Human Parsing. In: CVPR (2015) 4  27. Liu, Y., Cheng, M.M., Hu, X., Wang, K., Bai, X.: Richer convolutional features  for edge detection. In: CVPR (2017) 11, 12  28. Liu, Z., Luo, P., Qiu, S., Wang, X., Tang, X.: Deepfashion: Powering robust clothes  recognition and retrieval with rich annotations. In: CVPR (2016) 4  29. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  segmentation. In: CVPR (2015) 2, 7  30. M. Hadi Kiapour, Xufeng Han, S.L.A.C.B.T.L.B.: Where to buy it:matching street  clothing photos in online shops. In: ICCV (2015) 4  31. Pinheiro, P.O., Collobert, R., Doll´ar, P.: Learning to segment object candidates.  32. Ren, M., Zemel, R.S.: End-to-end instance segmentation with recurrent attention.  33. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de-  tection with region proposal networks. In: NIPS (2015) 5  34. Romera-Paredes, B., Torr, P.H.S.: Recurrent instance segmentation. In: ECCV  35. Simo-Serra, E., Fidler, S., Moreno-Noguer, F., Urtasun, R.: A High Performance  CRF Model for Clothes Parsing. In: ACCV (2014) 4  36. Simo-Serra, E., Fidler, S., Moreno-Noguer, F., Urtasun, R.: Neuroaesthetics in  fashion: Modeling the perception of fashionability. In: CVPR (2015) 4  37. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014) 2  38. Wang, L., Ji, X., Deng, Q., Jia, M.: Deformable part model based multiple pedes- trian detection for video surveillance in crowded scenes. In: VISAPP (2014) 2 39. Xia, F., Wang, P., Chen, L.C., Yuille, A.L.: Zoom better to see clearer: Huamn  part segmentation with auto zoom net. In: ECCV (2016) 4, 11, 12  40. Xie, S., Tu, Z.: Holistically-nested edge detection. In: ICCV (2015) 8, 10, 12 41. Yamaguchi, K., Kiapour, M., Berg, T.: Paper doll parsing: Retrieving similar styles  to parse clothing items. In: ICCV (2013) 2, 4  42. Yamaguchi, K., Kiapour, M., Ortiz, L., Berg, T.: Parsing clothing in fashion pho-  tographs. In: CVPR (2012) 4, 5  43. Yang, J., Price, B., Cohen, S., Lee, H., Yang, M.H.: Object contour detection with  a fully convolutional encoder-decoder network. In: CVPR (2016) 12  44. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In:  CVPR (2017) 8  45. Zheng, S., Jayasumana, S., Romera-Paredes, B., Vineet, V., Su, Z., Du, D., Huang, C., Torr, P.: Conditional random fields as recurrent neural networks. In: ICCV (2015) 2"}