{"1": "1. Caicedo, J.C., Lazebnik, S.: Active object localization with deep reinforcement  learning. In: ICCV. pp. 2488-2496 (2015)  2. Cao, Y., Barrett, D., Barbu, A., Narayanaswamy, S., Yu, H., Michaux, A., Lin, Y., Dickinson, S., Mark Siskind, J., Wang, S.: Recognize human activities from partially observed videos. In: CVPR. pp. 2658-2665 (2013)  3. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR. pp. 7291-7299 (2017)  4. Carreira, J., Zisserman, A.: Quo vadis, action recognition? a new model and the  kinetics dataset. In: CVPR. pp. 6299-6308 (2017)  5. Du, Y., Wang, W., Wang, L.: Hierarchical recurrent neural network for skeleton  based action recognition. In: CVPR. pp. 1110-1118 (2015)  6. Goodrich, B., Arel, I.: Reinforcement learning based visual attention with appli-  cation to face detection. In: CVPRW. pp. 19-24 (2012)  7. Hinami, R., Mei, T., Satoh, S.: Joint detection and recounting of abnormal events  by learning deep generic knowledge. In: ICCV. pp. 3619-3627 (2017)  8. Hu, J.F., Zheng, W.S., Ma, L., Wang, G., Lai, J.: Real-time rgb-d activity predic-  tion by soft regression. In: ECCV. pp. 280-296 (2016)  9. Huang, C., Lucey, S., Ramanan, D.: Learning policies for adaptive tracking with  deep feature cascades. In: ICCV. pp. 105-114 (2017)  10. Jie, Z., Liang, X., Feng, J., Jin, X., Lu, W., Yan, S.: Tree-structured reinforcement  learning for sequential object localization. In: NIPS. pp. 127-135 (2016)  11. Karayev, S., Baumgartner, T., Fritz, M., Darrell, T.: Timely object recognition.  In: NIPS. pp. 890-898 (2012)  12. Kingma, D.P., Ba, J.: Adam:a method for stochastic optimization. In: ICLR (2015) 13. Kong, X., Xin, B., Wang, Y., Hua, G.: Collaborative deep reinforcement learning  for joint object search. In: CVPR. pp. 1695-1704 (2017)  14. Kong, Y., Fu, Y.: Max-margin action prediction machine. TPAMI 38(9), 1844-  15. Kong, Y., Jia, Y., Fu, Y.: Learning human interaction by interactive phrases. In:  1858 (2016)  ECCV. pp. 300-313 (2012)  16. Kong, Y., Kit, D., Fu, Y.: A discriminative model with multiple temporal scales  for action prediction. In: ECCV. pp. 596-611 (2014)  17. Kong, Y., Tao, Z., Fu, Y.: Deep sequential context networks for action prediction.  In: CVPR. pp. 1473-1481 (2017)  18. Krull, A., Brachmann, E., Nowozin, S., Michel, F., Shotton, J., Rother, C.: Poseagent: Budget-constrained 6d object pose estimation via reinforcement learn- ing. In: CVPR. pp. 6702-6710 (2017)  19. Lai, S., Zheng, W.S., Hu, J.F., Zhang, J.: Global-local temporal saliency action  prediction. TIP pp. 1-14 (2017)  20. Lan, T., Chen, T.C., Savarese, S.: A hierarchical representation for future action  prediction. In: ECCV. pp. 689-704 (2014)  21. Liang, X., Lee, L., Dai, W., Xing, E.P.: Dual motion gan for future-ﬂow embedded  video prediction. In: ICCV (2017)  22. Liang, X., Lee, L., Xing, E.P.: Deep variation-structured reinforcement learning for visual relationship and attribute detection. In: CVPR. pp. 848-857 (2017) 23. Littman, M.L.: Reinforcement learning improves behaviour from evaluative feed-  back. Nature 521(7553), 445-451 (2015)   Part-Activated Deep Reinforcement Learning for Action PredictionReferences  1. Caicedo, J.C., Lazebnik, S.: Active object localization with deep reinforcement  learning. In: ICCV. pp. 2488-2496 (2015)  2. Cao, Y., Barrett, D., Barbu, A., Narayanaswamy, S., Yu, H., Michaux, A., Lin, Y., Dickinson, S., Mark Siskind, J., Wang, S.: Recognize human activities from partially observed videos. In: CVPR. pp. 2658-2665 (2013)  3. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR. pp. 7291-7299 (2017)  4. Carreira, J., Zisserman, A.: Quo vadis, action recognition? a new model and the  kinetics dataset. In: CVPR. pp. 6299-6308 (2017)  5. Du, Y., Wang, W., Wang, L.: Hierarchical recurrent neural network for skeleton  based action recognition. In: CVPR. pp. 1110-1118 (2015)  6. Goodrich, B., Arel, I.: Reinforcement learning based visual attention with appli-  cation to face detection. In: CVPRW. pp. 19-24 (2012)  7. Hinami, R., Mei, T., Satoh, S.: Joint detection and recounting of abnormal events  by learning deep generic knowledge. In: ICCV. pp. 3619-3627 (2017)  8. Hu, J.F., Zheng, W.S., Ma, L., Wang, G., Lai, J.: Real-time rgb-d activity predic-  tion by soft regression. In: ECCV. pp. 280-296 (2016)  9. Huang, C., Lucey, S., Ramanan, D.: Learning policies for adaptive tracking with  deep feature cascades. In: ICCV. pp. 105-114 (2017)  10. Jie, Z., Liang, X., Feng, J., Jin, X., Lu, W., Yan, S.: Tree-structured reinforcement  learning for sequential object localization. In: NIPS. pp. 127-135 (2016)  11. Karayev, S., Baumgartner, T., Fritz, M., Darrell, T.: Timely object recognition.  In: NIPS. pp. 890-898 (2012)  12. Kingma, D.P., Ba, J.: Adam:a method for stochastic optimization. In: ICLR (2015) 13. Kong, X., Xin, B., Wang, Y., Hua, G.: Collaborative deep reinforcement learning  for joint object search. In: CVPR. pp. 1695-1704 (2017)  14. Kong, Y., Fu, Y.: Max-margin action prediction machine. TPAMI 38(9), 1844-  15. Kong, Y., Jia, Y., Fu, Y.: Learning human interaction by interactive phrases. In:  1858 (2016)  ECCV. pp. 300-313 (2012)  16. Kong, Y., Kit, D., Fu, Y.: A discriminative model with multiple temporal scales  for action prediction. In: ECCV. pp. 596-611 (2014)  17. Kong, Y., Tao, Z., Fu, Y.: Deep sequential context networks for action prediction.  In: CVPR. pp. 1473-1481 (2017)  18. Krull, A., Brachmann, E., Nowozin, S., Michel, F., Shotton, J., Rother, C.: Poseagent: Budget-constrained 6d object pose estimation via reinforcement learn- ing. In: CVPR. pp. 6702-6710 (2017)  19. Lai, S., Zheng, W.S., Hu, J.F., Zhang, J.: Global-local temporal saliency action  prediction. TIP pp. 1-14 (2017)  20. Lan, T., Chen, T.C., Savarese, S.: A hierarchical representation for future action  prediction. In: ECCV. pp. 689-704 (2014)  21. Liang, X., Lee, L., Dai, W., Xing, E.P.: Dual motion gan for future-ﬂow embedded  video prediction. In: ICCV (2017)  22. Liang, X., Lee, L., Xing, E.P.: Deep variation-structured reinforcement learning for visual relationship and attribute detection. In: CVPR. pp. 848-857 (2017) 23. Littman, M.L.: Reinforcement learning improves behaviour from evaluative feed-  back. Nature 521(7553), 445-451 (2015)   16  Lei Chen, Jiwen Lu, Zhanjie Song, Jie Zhou  24. Ma, S., Sigal, L., Sclaroﬀ, S.: Learning activity progression in lstms for activity  detection and early detection. In: CVPR. pp. 1942-1950 (2016)  25. Mahmud, T., Hasan, M., Roy-Chowdhury, A.K.: Joint prediction of activity labels  and starting times in untrimmed videos. In: ICCV. pp. 5773-5782 (2017)  26. Martinez, J., Black, M.J., Romero, J.: On human motion prediction using recurrent  neural networks. In: CVPR. pp. 2891-2900 (2017)  27. Mathe, S., Pirinen, A., Sminchisescu, C.: Reinforcement learning for visual object  detection. In: CVPR. pp. 2894-2902 (2016)  28. Mnih, V., Kavukcuoglu, K., Silver, D., Rusu, A.A., Veness, J., Bellemare, M.G., Graves, A., Riedmiller, M., Fidjeland, A.K., Ostrovski, G., et al.: Human-level control through deep reinforcement learning. Nature 518(7540), 529-533 (2015)  29. Qi, S., Huang, S., Wei, P., Zhu, S.C.: Predicting human activities using stochastic  grammar. In: ICCV. pp. 1164-1172 (2017)  30. Ren, Z., Wang, X., Zhang, N., Lv, X., Li, L.J.: Deep reinforcement learning-based  image captioning with embedding reward. In: CVPR. pp. 290-298 (2017)  31. Ryoo, M.S.: Human activity prediction: Early recognition of ongoing activities from  streaming videos. In: ICCV. pp. 1036-1043 (2011)  32. Ryoo, M.S., Aggarwal, J.: Ut-interaction dataset, icpr contest on semantic descrip-  tion of human activities (sdha). In: ICPR. vol. 2, p. 4 (2010)  33. Ryoo, M.S., Matthies, L.: First-person activity recognition: What are they doing  to me? In: CVPR. pp. 2730-2737 (2013)  34. Shi, Q., Cheng, L., Wang, L., Smola, A.: Human action segmentation and recog-  nition using discriminative semi-markov models. IJCV 93(1), 22-32 (2011)  35. Simonyan, K., Zisserman, A.: Two-stream convolutional networks for action recog-  nition in videos. In: NIPS. pp. 568-576 (2014)  36. Singh, G., Saha, S., Sapienza, M., Torr, P.H.S., Cuzzolin, F.: Online real-time multiple spatiotemporal action localisation and prediction. In: ICCV. pp. 3637- 3646 (2017)  37. Soomro, K., Zamir, A.R., Shah, M.: Ucf101: A dataset of 101 human actions classes  from videos in the wild. arXiv preprint arXiv:1212.0402 (2012)  38. Supancic III, J.S., Ramanan, D.: Tracking as online decision-making: Learning a policy from streaming videos with reinforcement learning. In: ICCV. pp. 322-331 (2017)  39. Tran, D., Bourdev, L., Fergus, R., Torresani, L., Paluri, M.: Learning spatiotem- poral features with 3d convolutional networks. In: ICCV. pp. 4489-4497 (2015) 40. Tudor Ionescu, R., Smeureanu, S., Alexe, B., Popescu, M.: Unmasking the abnor-  mal events in video. In: ICCV. pp. 2895-2903 (2017)  41. Wang, J., Liu, Z., Wu, Y., Yuan, J.: Mining actionlet ensemble for action recogni-  tion with depth cameras. In: CVPR. pp. 1290-1297 (2012)  42. Wang, L., Xiong, Y., Lin, D., Van Gool, L.: Untrimmednets for weakly supervised  action recognition and detection. In: CVPR. pp. 4325-4334 (2017)  43. Wei, S.E., Ramakrishna, V., Kanade, T., Sheikh, Y.: Convolutional pose machines.  In: CVPR. pp. 4724-4732 (2016)  44. Xu, Z., Qing, L., Miao, J.: Activity auto-completion: predicting human activities  from partial videos. In: ICCV. pp. 3191-3199 (2015)  45. Yoo, S.Y.J.C.Y., Yun, K., Choi, J.Y.: Action-decision networks for visual tracking  with deep reinforcement learning. In: CVPR. pp. 2711-2720 (2017)  46. Zaki, H.F.M., Shafait, F., Mian, A.: Modeling sub-event dynamics in first-person  action recognition. In: CVPR. pp. 7253-7262 (2017)  47. Zhuang, B., Liu, L., Shen, C., Reid, I.: Towards context-aware interaction recog-  nition for visual relationship detection. In: ICCV. pp. 589-598 (2017)"}