{"1": "1. Andriluka, M., Pishchulin, L., Gehler, P., Schiele, B.: 2d human pose estimation:  New benchmark and state of the art analysis. CVPR (2014)  2. Andriluka, M., Iqbal, U., Milan, A., Insafutdinov, E., Pishchulin, L., Gall, J., Schiele, B.: Posetrack: A benchmark for human pose estimation and tracking. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5167-5176 (2018)  3. Andriluka, M., Roth, S., Schiele, B.: People-tracking-by-detection and people- detection-by-tracking. In: Computer Vision and Pattern Recognition, 2008. CVPR 2008. IEEE Conference on. pp. 1-8. IEEE (2008)  4. Bae, S.H., Yoon, K.J.: Confidence-based data association and discriminative deep appearance learning for robust online multi-object tracking. IEEE Transactions on Pattern Analysis and Machine Intelligence 40(3), 595-610 (March 2018). https://doi.org/10.1109/TPAMI.2017.2691769  5. Bulat, A., Tzimiropoulos, G.: Human pose estimation via convolutional part heatmap regression. In: European Conference on Computer Vision. pp. 717-732. Springer (2016)  6. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR. vol. 1, p. 7 (2017)  7. Carreira, J., Agrawal, P., Fragkiadaki, K., Malik, J.: Human pose estimation with iterative error feedback. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 4733-4742 (2016)  8. Charles, J., Pfister, T., Magee, D., Hogg, D., Zisserman, A.: Personalizing human video pose estimation. In: Computer Vision and Pattern Recognition (CVPR), 2016 IEEE Conference on. pp. 3063-3072. IEEE (2016)  9. Chu, Q., Ouyang, W., Li, H., Wang, X., Liu, B., Yu, N.: Online multi-object track- ing using cnn-based single object tracker with spatial-temporal attention mecha- nism. In: 2017 IEEE International Conference on Computer Vision (ICCV). pp. 4846-4855 (Oct 2017). https://doi.org/10.1109/ICCV.2017.518  10. Dehghan, A., Tian, Y., Torr, P.H.S., Shah, M.: Target identity-aware network ﬂow for online multiple target tracking. In: 2015 IEEE Conference on Com- puter Vision and Pattern Recognition (CVPR). pp. 1146-1154 (June 2015). https://doi.org/10.1109/CVPR.2015.7298718  11. Feichtenhofer, C., Pinz, A., Zisserman, A.: Detect to track and track to detect. In: IEEE International Conference on Computer Vision, ICCV 2017, Venice, Italy, Oc- tober 22-29, 2017. pp. 3057-3065 (2017). https://doi.org/10.1109/ICCV.2017.330, https://doi.org/10.1109/ICCV.2017.330  12. Felzenszwalb, P.F., Girshick, R.B., McAllester, D., Ramanan, D.: Object de- tection with discriminatively trained part-based models. IEEE Transactions on Pattern Analysis and Machine Intelligence 32(9), 1627-1645 (Sept 2010). https://doi.org/10.1109/TPAMI.2009.167  13. Gkioxari, G., Toshev, A., Jaitly, N.: Chained predictions using convolutional neural networks. In: European Conference on Computer Vision. pp. 728-743. Springer (2016)  14. Hamid Rezatofighi, S., Milan, A., Zhang, Z., Shi, Q., Dick, A., Reid, I.: Joint probabilistic data association revisited. In: The IEEE International Conference on Computer Vision (ICCV) (December 2015)  15. Hu, P., Ramanan, D.: Bottom-up and top-down reasoning with hierarchical recti- fied gaussians. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5600-5609 (2016)   Learning to Detect and TrackReferences  1. Andriluka, M., Pishchulin, L., Gehler, P., Schiele, B.: 2d human pose estimation:  New benchmark and state of the art analysis. CVPR (2014)  2. Andriluka, M., Iqbal, U., Milan, A., Insafutdinov, E., Pishchulin, L., Gall, J., Schiele, B.: Posetrack: A benchmark for human pose estimation and tracking. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5167-5176 (2018)  3. Andriluka, M., Roth, S., Schiele, B.: People-tracking-by-detection and people- detection-by-tracking. In: Computer Vision and Pattern Recognition, 2008. CVPR 2008. IEEE Conference on. pp. 1-8. IEEE (2008)  4. Bae, S.H., Yoon, K.J.: Confidence-based data association and discriminative deep appearance learning for robust online multi-object tracking. IEEE Transactions on Pattern Analysis and Machine Intelligence 40(3), 595-610 (March 2018). https://doi.org/10.1109/TPAMI.2017.2691769  5. Bulat, A., Tzimiropoulos, G.: Human pose estimation via convolutional part heatmap regression. In: European Conference on Computer Vision. pp. 717-732. Springer (2016)  6. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. In: CVPR. vol. 1, p. 7 (2017)  7. Carreira, J., Agrawal, P., Fragkiadaki, K., Malik, J.: Human pose estimation with iterative error feedback. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 4733-4742 (2016)  8. Charles, J., Pfister, T., Magee, D., Hogg, D., Zisserman, A.: Personalizing human video pose estimation. In: Computer Vision and Pattern Recognition (CVPR), 2016 IEEE Conference on. pp. 3063-3072. IEEE (2016)  9. Chu, Q., Ouyang, W., Li, H., Wang, X., Liu, B., Yu, N.: Online multi-object track- ing using cnn-based single object tracker with spatial-temporal attention mecha- nism. In: 2017 IEEE International Conference on Computer Vision (ICCV). pp. 4846-4855 (Oct 2017). https://doi.org/10.1109/ICCV.2017.518  10. Dehghan, A., Tian, Y., Torr, P.H.S., Shah, M.: Target identity-aware network ﬂow for online multiple target tracking. In: 2015 IEEE Conference on Com- puter Vision and Pattern Recognition (CVPR). pp. 1146-1154 (June 2015). https://doi.org/10.1109/CVPR.2015.7298718  11. Feichtenhofer, C., Pinz, A., Zisserman, A.: Detect to track and track to detect. In: IEEE International Conference on Computer Vision, ICCV 2017, Venice, Italy, Oc- tober 22-29, 2017. pp. 3057-3065 (2017). https://doi.org/10.1109/ICCV.2017.330, https://doi.org/10.1109/ICCV.2017.330  12. Felzenszwalb, P.F., Girshick, R.B., McAllester, D., Ramanan, D.: Object de- tection with discriminatively trained part-based models. IEEE Transactions on Pattern Analysis and Machine Intelligence 32(9), 1627-1645 (Sept 2010). https://doi.org/10.1109/TPAMI.2009.167  13. Gkioxari, G., Toshev, A., Jaitly, N.: Chained predictions using convolutional neural networks. In: European Conference on Computer Vision. pp. 728-743. Springer (2016)  14. Hamid Rezatofighi, S., Milan, A., Zhang, Z., Shi, Q., Dick, A., Reid, I.: Joint probabilistic data association revisited. In: The IEEE International Conference on Computer Vision (ICCV) (December 2015)  15. Hu, P., Ramanan, D.: Bottom-up and top-down reasoning with hierarchical recti- fied gaussians. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5600-5609 (2016)   16  M. Fabbri et al.  16. Insafutdinov, E., Andriluka, M., Pishchulin, L., Tang, S., Levinkov, E., Andres, B., Schiele, B.: Arttrack: Articulated multi-person tracking in the wild. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). vol. 4327 (2017) 17. Insafutdinov, E., Pishchulin, L., Andres, B., Andriluka, M., Schiele, B.: Deepercut: A deeper, stronger, and faster multi-person pose estimation model. In: European Conference on Computer Vision. pp. 34-50. Springer (2016)  18. Iqbal, U., Gall, J.: Multi-person pose estimation with local joint-to-person associa- tions. In: European Conference on Computer Vision. pp. 627-642. Springer (2016) 19. Iqbal, U., Milan, A., Gall, J.: Posetrack: Joint multi-person pose estimation and tracking. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. vol. 1 (2017)  20. Izadinia, H., Saleemi, I., Li, W., Shah, M.: 2t: Multiple people multiple parts tracker. In: European Conference on Computer Vision. pp. 100-114. Springer (2012)  21. Jain, A., Tompson, J., LeCun, Y., Bregler, C.: Modeep: A deep learning framework using motion features for human pose estimation. In: Asian conference on computer vision. pp. 302-315. Springer (2014)  22. Jhuang, H., Gall, J., Zuﬃ, S., Schmid, C., Black, M.J.: Towards understanding action recognition. In: Computer Vision (ICCV), 2013 IEEE International Confer- ence on. pp. 3192-3199. IEEE (2013)  23. Levinkov, E., Uhrig, J., Tang, S., Omran, M., Insafutdinov, E., Kirillov, A., Rother, C., Brox, T., Schiele, B., Andres, B.: Joint graph decomposition & node labeling: Problem, algorithms, applications. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  24. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision. pp. 740-755. Springer (2014)  25. Milan, A., Leal-Taix´e, L., Reid, I., Roth, S., Schindler, K.: MOT16: A benchmark  for multi-object tracking. arXiv: 1603.00831 (2016)  26. Milan, A., Leal-Taix´e, L., Reid, I., Roth, S., Schindler, K.: Mot16: A benchmark  for multi-object tracking. arXiv preprint arXiv:1603.00831 (2016)  27. Newell, A., Huang, Z., Deng, J.: Associative embedding: End-to-end learning for joint detection and grouping. In: Advances in Neural Information Processing Sys- tems. pp. 2274-2284 (2017)  28. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose es- timation. In: European Conference on Computer Vision. pp. 483-499. Springer (2016)  29. Papandreou, G., Zhu, T., Kanazawa, N., Toshev, A., Tompson, J., Bregler, C., Murphy, K.: Towards accurate multiperson pose estimation in the wild. arXiv preprint arXiv:1701.01779 8 (2017)  30. Pfister, T., Charles, J., Zisserman, A.: Flowing convnets for human pose estimation in videos. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 1913-1921 (2015)  31. Pishchulin, L., Insafutdinov, E., Tang, S., Andres, B., Andriluka, M., Gehler, P.V., Schiele, B.: Deepcut: Joint subset partition and labeling for multi person pose esti- mation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 4929-4937 (2016)  32. Sadeghian, A., Alahi, A., Savarese, S.: Tracking the untrackable: Learning to track multiple cues with long-term dependencies. In: 2017 IEEE Inter- national Conference on Computer Vision (ICCV). pp. 300-311 (Oct 2017). https://doi.org/10.1109/ICCV.2017.41   Learning to Detect and Track33. Sanchez-Matilla, R., Poiesi, F., Cavallaro, A.: Online multi-target tracking with strong and weak detections. In: Hua, G., J´egou, H. (eds.) Computer Vision - ECCV 2016 Workshops. pp. 84-99. Springer International Publishing, Cham (2016) 34. Sapp, B., Weiss, D., Taskar, B.: Parsing human motion with stretchable models. In: Computer Vision and Pattern Recognition (CVPR), 2011 IEEE Conference on. pp. 1281-1288. IEEE (2011)  35. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)  36. Solera, F., Calderara, S., Cucchiara, R.: Towards the evaluation of reproducible robustness in tracking-by-detection. In: 2015 12th IEEE International Conference on Advanced Video and Signal Based Surveillance (AVSS). pp. 1-6 (Aug 2015). https://doi.org/10.1109/AVSS.2015.7301755  37. Wei, S.E., Ramakrishna, V., Kanade, T., Sheikh, Y.: Convolutional pose machines. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recog- nition. pp. 4724-4732 (2016)  38. Wojke, N., Bewley, A., Paulus, D.: Simple online and realtime tracking with a deep association metric. In: 2017 IEEE International Conference on Image Processing (ICIP). pp. 3645-3649 (2017)  39. Yu, F., Li, W., Li, Q., Liu, Y., Shi, X., Yan, J.: Poi: Multiple object tracking with high performance detection and appearance feature. In: Hua, G., J´egou, H. (eds.) Computer Vision - ECCV 2016 Workshops. pp. 36-42. Springer International Pub- lishing, Cham (2016)  40. Zhang, D., Shah, M.: Human pose estimation in videos. In: Proceedings of the  IEEE International Conference on Computer Vision. pp. 2012-2020 (2015)  41. Zhang, W., Zhu, M., Derpanis, K.G.: From actemes to action: A strongly- supervised representation for detailed action understanding. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 2248-2255 (2013)"}