{"1": "1. Nister, D.: An eﬃcient solution to the five-point relative pose problem. In: TPAMI,  IEEE (2004) 756-770  2. Fischler, M.A., Bolles, R.C.: Random sample consensus: a paradigm for model fit- ting with applications to image analysis and automated cartography. In: Readings in computer vision. Elsevier (1987) 726-740  3. Cadena, C., Carlone, L., Carrillo, H., Latif, Y., Scaramuzza, D., Neira, J., Reid, I., Leonard, J.J.: Past, present, and future of simultaneous localization and mapping: Toward the robust-perception age. IEEE Transactions on Robotics 32(6) (2016) 1309-1332  4. Agarwal, S., Furukawa, Y., Snavely, N., Simon, I., Curless, B., Seitz, S.M., Szeliski, R.: Building Rome in a day. Communications of the ACM 54(10) (2011) 105-112 5. Micusik, B., Wildenauer, H.: Structure from motion with line segments under International Journal of Computer Vision 124(1)  relaxed endpoint constraints. (2017) 65-79  6. Xu, C., Zhang, L., Cheng, L., Koch, R.: Pose estimation from line correspondences: IEEE Transactions on Pattern  A complete analysis and a series of solutions. Analysis and Machine Intelligence 39(6) (2017) 1209-1222  7. Stew´enius, H., Nist´er, D., Oskarsson, M., ˚Astr¨om, K.: Solutions to minimal gener- alized relative pose problems. In: Workshop on omnidirectional vision. Volume 1. (2005) 3  8. Pradeep, V., Lim, J.: Egomotion estimation using assorted features. International  Journal of Computer Vision 98(2) (2012) 202-216  9. Ventura, J., Arth, C., Lepetit, V.: An eﬃcient minimal solution for multi-camera  motion. In: ICCV, IEEE (2015) 747-755  10. Kneip, L., Li, H.: Efcient computation of relative pose for multi-camera systems.  In: CVPR, IEEE (2014) 1-8  11. Menze, M., Geiger, A.: Object scene ﬂow for autonomous vehicles. In: Conference  on Computer Vision and Pattern Recognition (CVPR). (2015)  12. Rublee, E., Rabaud, V., Konolige, K., Bradski, G.: ORB: An eﬃcient alternative to sift or surf. In: 2011 International conference on computer vision, IEEE (2011) 2564-2571  13. Zhang, L., Koch, R.: An eﬃcient and robust line segment matching approach based on lbd descriptor and pairwise geometric consistency. Journal of Visual Communication and Image Representation 24(7) (2013) 794-805  14. Nister, D., Naroditsky, O., Bergen, J.: Visual odometry. In: CVPR, IEEE (2004)  652-659  15. Manmohan, C., Jongwoo, L., David, K.: Moving in stereo: Eﬃcient structure and motion using lines. In: International Conference on Computer Vision, IEEE (2009) 1741-1748  16. Brian, C., Christopher, Z., Jan-Michael, F., Marc, P.: A new minimal solution to the relative pose of a calibrated stereo camera with small field of view overlap. In: International Conference on Computer Vision, IEEE (2009) 1725-1732  17. Dunn, E., Clipp, B., Frahm, J.M.: A geometric solver for calibrated stereo egomo- tion. In: Computer Vision (ICCV), 2011 IEEE International Conference on, IEEE (2011) 1187-1194  18. Nister, D.: A minimal solution to the generalised 3-point pose problem.  In: IEEE Computer Society Conference on Computer Vision and Pattern Recogni- tion. (2004)   Stereo relative pose from line and point feature tripletsReferences  1. Nister, D.: An eﬃcient solution to the five-point relative pose problem. In: TPAMI,  IEEE (2004) 756-770  2. Fischler, M.A., Bolles, R.C.: Random sample consensus: a paradigm for model fit- ting with applications to image analysis and automated cartography. In: Readings in computer vision. Elsevier (1987) 726-740  3. Cadena, C., Carlone, L., Carrillo, H., Latif, Y., Scaramuzza, D., Neira, J., Reid, I., Leonard, J.J.: Past, present, and future of simultaneous localization and mapping: Toward the robust-perception age. IEEE Transactions on Robotics 32(6) (2016) 1309-1332  4. Agarwal, S., Furukawa, Y., Snavely, N., Simon, I., Curless, B., Seitz, S.M., Szeliski, R.: Building Rome in a day. Communications of the ACM 54(10) (2011) 105-112 5. Micusik, B., Wildenauer, H.: Structure from motion with line segments under International Journal of Computer Vision 124(1)  relaxed endpoint constraints. (2017) 65-79  6. Xu, C., Zhang, L., Cheng, L., Koch, R.: Pose estimation from line correspondences: IEEE Transactions on Pattern  A complete analysis and a series of solutions. Analysis and Machine Intelligence 39(6) (2017) 1209-1222  7. Stew´enius, H., Nist´er, D., Oskarsson, M., ˚Astr¨om, K.: Solutions to minimal gener- alized relative pose problems. In: Workshop on omnidirectional vision. Volume 1. (2005) 3  8. Pradeep, V., Lim, J.: Egomotion estimation using assorted features. International  Journal of Computer Vision 98(2) (2012) 202-216  9. Ventura, J., Arth, C., Lepetit, V.: An eﬃcient minimal solution for multi-camera  motion. In: ICCV, IEEE (2015) 747-755  10. Kneip, L., Li, H.: Efcient computation of relative pose for multi-camera systems.  In: CVPR, IEEE (2014) 1-8  11. Menze, M., Geiger, A.: Object scene ﬂow for autonomous vehicles. In: Conference  on Computer Vision and Pattern Recognition (CVPR). (2015)  12. Rublee, E., Rabaud, V., Konolige, K., Bradski, G.: ORB: An eﬃcient alternative to sift or surf. In: 2011 International conference on computer vision, IEEE (2011) 2564-2571  13. Zhang, L., Koch, R.: An eﬃcient and robust line segment matching approach based on lbd descriptor and pairwise geometric consistency. Journal of Visual Communication and Image Representation 24(7) (2013) 794-805  14. Nister, D., Naroditsky, O., Bergen, J.: Visual odometry. In: CVPR, IEEE (2004)  652-659  15. Manmohan, C., Jongwoo, L., David, K.: Moving in stereo: Eﬃcient structure and motion using lines. In: International Conference on Computer Vision, IEEE (2009) 1741-1748  16. Brian, C., Christopher, Z., Jan-Michael, F., Marc, P.: A new minimal solution to the relative pose of a calibrated stereo camera with small field of view overlap. In: International Conference on Computer Vision, IEEE (2009) 1725-1732  17. Dunn, E., Clipp, B., Frahm, J.M.: A geometric solver for calibrated stereo egomo- tion. In: Computer Vision (ICCV), 2011 IEEE International Conference on, IEEE (2011) 1187-1194  18. Nister, D.: A minimal solution to the generalised 3-point pose problem.  In: IEEE Computer Society Conference on Computer Vision and Pattern Recogni- tion. (2004)   16  A. Vakhitov, V. Lempitsky and Y. Zheng  19. Ramalingam, S., Lodha, S.K., Sturm, P.: A generic structure-from-motion frame-  work. Computer Vision and Image Understanding 103(3) (2006) 218-228  20. Nist´er, D., Stew´enius, H.: A minimal solution to the generalised 3-point pose  problem. Journal of Mathematical Imaging and Vision 27(1) (2007) 67-79  21. Merzban, M.H., Abdellatif, M., Abouelsoud, A.: A simple solution for the non perspective three point pose problem. In: 3D Imaging (IC3D), 2014 International Conference on, IEEE (2014) 1-6  22. Miraldo, P., Araujo, H.: Direct solution to the minimal generalized pose. IEEE  Transactions on Cybernetics 45(3) (2015) 404-415  23. Kukelova, Z., Heller, J., Fitzgibbon, A.: Eﬃcient intersection of three quadrics and applications in computer vision. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 1799-1808  24. Hartley, R., Zisserman, A.: Multiple view geometry in computer vision. Cambridge  university press (2003)  25. Char, B.W., Geddes, K.O., Gonnet, G.H., Leong, B.L., Monagan, M.B., Watt, S.: Maple V library reference manual. Springer Science & Business Media (2013) 26. Cox, D.A., Little, J., O’shea, D.: Using algebraic geometry. Volume 185. Springer  Science & Business Media (2006)  27. Vakhitov, A., Funke, J., Moreno-Noguer, F.: Accurate and linear time pose estima- tion from points and lines. In: European Conference on Computer Vision, Springer (2016) 583-599  28. Akinlar, C., Topal, C.: Edlines: A real-time line segment detector with a false  detection control. Pattern Recognition Letters 32(13) (2011) 1633-1642  29. Gao, X.S., Hou, X.R., Tang, J., Cheng, H.F.: Complete solution classification for the perspective-three-point problem. IEEE transactions on pattern analysis and machine intelligence 25(8) (2003) 930-943  30. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the KITTI vision benchmark suite. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 3354-3361  31. Mur-Artal, R., Tard´os, J.D.: ORB-SLAM2: An open-source slam system for monocular, stereo, and RGB-D cameras. IEEE Transactions on Robotics 33(5) (2017) 1255-1262"}