{"1": "1. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., et al.: Tensorﬂow: a system for large-scale machine learning. In: OSDI. vol. 16, pp. 265-283 (2016)  2. Braido, P., Zhang, X.: Quantitative analysis of finger motion coordination in hand manipulative and gestic acts. Human movement science 22(6), 661-678 (2004) 3. Chen, X., Wang, G., Guo, H., Zhang, C.: Pose guided structured region ensemble network for cascaded hand pose estimation. arXiv preprint arXiv:1708.03416 (2017) 4. Cotugno, G., Althoefer, K., Nanayakkara, T.: The role of the thumb: study of finger motion in grasping and reachability space in human and robotic hands. IEEE Transactions on Systems, Man, and Cybernetics: Systems 47(7), 1061-1070 (2017)  5. Erol, A., Bebis, G., Nicolescu, M., Boyle, R.D., Twombly, X.: Vision-based hand pose estimation: A review. Computer Vision and Image Understanding 108(1-2), 52-73 (2007)  6. Garcia-Hernando, G., Yuan, S., Baek, S., Kim, T.K.: First-person hand action benchmark with rgb-d videos and 3d hand pose annotations. In: CVPR. vol. 1 (2018)  7. Ge, L., Liang, H., Yuan, J., Thalmann, D.: Robust 3d hand pose estimation in single depth images: from single-view cnn to multi-view cnns. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 3593-3601 (2016)   14  Y.Zhou, J.Lu, K.Du, X.Lin, Y.Sun and X.Ma  Table 3. The comparison of computational complexity on the HIM2017 Challenge dataset  Items V2V-PoseNet Ours  Parameter Quantity Testing on single GPU Testing on muti-GPU 3.5fps 673 fps  457.5M 67.27M  35fps - -  5 Conclusions  We propose a novel three-branch network called the Hand Branch Ensemble(HBE) network for 3D hand pose estimation from a single depth image. According to fingers activity space and functional importance we decompose the hand to three parts: the thumb, the index and the other fingers. Each branch corresponds to one part. The features of three branches are ensemble to predict all 3D joint locations. Our network is trained with a small amount of training data and eval- uated on three challenging datasets. Both the training and testing time are quite short, and the experimental results demonstrate that our method outperforms the state-of-the-art methods on the HIM2017 Challenge dataset and achieves comparable performance on the ICVL and MSRA dataset. Our method has less complexity and can adapt to a large range of view-points and varied hand poses. Our proposed method provides a technical approach for tracking and analyzing the complex interaction between humans and environment.  References  1. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., et al.: Tensorﬂow: a system for large-scale machine learning. In: OSDI. vol. 16, pp. 265-283 (2016)  2. Braido, P., Zhang, X.: Quantitative analysis of finger motion coordination in hand manipulative and gestic acts. Human movement science 22(6), 661-678 (2004) 3. Chen, X., Wang, G., Guo, H., Zhang, C.: Pose guided structured region ensemble network for cascaded hand pose estimation. arXiv preprint arXiv:1708.03416 (2017) 4. Cotugno, G., Althoefer, K., Nanayakkara, T.: The role of the thumb: study of finger motion in grasping and reachability space in human and robotic hands. IEEE Transactions on Systems, Man, and Cybernetics: Systems 47(7), 1061-1070 (2017)  5. Erol, A., Bebis, G., Nicolescu, M., Boyle, R.D., Twombly, X.: Vision-based hand pose estimation: A review. Computer Vision and Image Understanding 108(1-2), 52-73 (2007)  6. Garcia-Hernando, G., Yuan, S., Baek, S., Kim, T.K.: First-person hand action benchmark with rgb-d videos and 3d hand pose annotations. In: CVPR. vol. 1 (2018)  7. Ge, L., Liang, H., Yuan, J., Thalmann, D.: Robust 3d hand pose estimation in single depth images: from single-view cnn to multi-view cnns. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 3593-3601 (2016)   Hand Branch Ensemble Network for Real-time 3D Hand Pose Estimation8. Ge, L., Liang, H., Yuan, J., Thalmann, D.: 3d convolutional neural networks for eﬃcient and robust hand pose estimation from single depth images. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. vol. 1, p. 5 (2017)  9. Guo, H., Wang, G., Chen, X., Zhang, C.: Towards good practices for deep 3d hand  pose estimation. arXiv preprint arXiv:1707.07248 (2017)  10. Guo, H., Wang, G., Chen, X., Zhang, C., Qiao, F., Yang, H.: Region ensemble network: Improving convolutional network for hand pose estimation. In: Image Processing (ICIP), 2017 IEEE International Conference on. pp. 4512-4516. IEEE (2017)  11. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International Conference on Machine Learning. pp. 448-456 (2015)  12. Keskin, C., Kıra¸c, F., Kara, Y.E., Akarun, L.: Hand pose estimation and hand shape classification using multi-layered randomized decision forests. In: European Conference on Computer Vision. pp. 852-863. Springer (2012)  13. Khamis, S., Taylor, J., Shotton, J., Keskin, C., Izadi, S., Fitzgibbon, A.: Learning an eﬃcient model of hand shape variation from depth images. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 2540-2548 (2015)  14. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  15. Lin, Y., Sun, Y.: Robot grasp planning based on demonstrated grasp strategies.  The International Journal of Robotics Research 34(1), 26-42 (2015)  16. Madadi, M., Escalera, S., Bar´o, X., Gonzalez, J.: End-to-end global to local cnn learning for hand pose recovery in depth data. arXiv preprint arXiv:1705.09606 (2017)  17. Moon, G., Chang, J.Y., Lee, K.M.: V2v-posenet: Voxel-to-voxel prediction network for accurate 3d hand and human pose estimation from a single depth map. In: CVPR. vol. 2 (2018)  18. Mueller, F., Mehta, D., Sotnychenko, O., Sridhar, S., Casas, D., Theobalt, C.: Real-time hand tracking under occlusion from an egocentric rgb-d sensor. In: Proceedings of International Conference on Computer Vision (ICCV) (2017), https://handtracker.mpi-inf.mpg.de/projects/OccludedHands/  19. Oberweger, M., Lepetit, V.: Deepprior++: Improving fast and accurate 3d hand  pose estimation. In: ICCV workshop. vol. 840, p. 2 (2017)  20. Oberweger, M., Wohlhart, P., Lepetit, V.: Hands deep in deep learning for hand  pose estimation. In: Computer Vision Winter Workshop (2015)  21. Oikonomidis, I., Kyriazis, N., Argyros, A.: Eﬃcient model-based 3d tracking of  hand articulations using kinect. bmvc 2011. In: BMVC (2011)  22. Qian, C., Sun, X., Wei, Y., Tang, X., Sun, J.: Realtime and robust hand tracking from depth. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 1106-1113 (2014)  23. Rad, M., Oberweger, M., Lepetit, V.: Feature mapping for learning fast and accu- rate 3d pose inference from synthetic images. In: Proceedings of the IEEE Confer- ence on Computer Vision and Pattern Recognition. pp. 4663-4672 (2018)  24. Sharp, T., Keskin, C., Robertson, D., Taylor, J., Shotton, J., Kim, D., Rhemann, C., Leichter, I., Vinnikov, A., Wei, Y., et al.: Accurate, robust, and ﬂexible real-time hand tracking. In: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. pp. 3633-3642. ACM (2015)   16  Y.Zhou, J.Lu, K.Du, X.Lin, Y.Sun and X.Ma  25. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)  26. Sridhar, S., Mueller, F., Oulasvirta, A., Theobalt, C.: Fast and robust hand track- ing using detection-guided optimization. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3213-3221 (2015)  27. Sun, X., Wei, Y., Liang, S., Tang, X., Sun, J.: Cascaded hand pose regression. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 824-832 (2015)  28. Supancic, J.S., Rogez, G., Yang, Y., Shotton, J., Ramanan, D.: Depth-based hand pose estimation: data, methods, and challenges. In: Proceedings of the IEEE in- ternational conference on computer vision. pp. 1868-1876 (2015)  29. Susman, R.L.: Hand function and tool behavior in early hominids . Journal of  Human Evolution 35(1), 23-46 (1998)  30. Tang, D., Jin Chang, H., Tejani, A., Kim, T.K.: Latent regression forest: Structured estimation of 3d articulated hand posture. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 3786-3793 (2014)  31. Taylor, J., Tankovich, V., Tang, D., Keskin, C., Kim, D., Davidson, P., Kowdle, A., Izadi, S.: Articulated distance fields for ultra-fast tracking of hands interacting. Acm Transactions on Graphics 36(6), 1-12 (2017)  32. Tkach, A., Pauly, M., Tagliasacchi, A.: Sphere-meshes for real-time hand modeling  and tracking. ACM Transactions on Graphics (TOG) 35(6), 222 (2016)  33. Tompson, J., Stein, M., Lecun, Y., Perlin, K.: Real-time continuous pose recovery of human hands using convolutional networks. ACM Transactions on Graphics (ToG) 33(5), 169 (2014)  34. Wan, C., Probst, T., Van Gool, L., Yao, A.: Crossing nets: Combining gans and vaes with a shared latent space for hand pose estimation. In: 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). IEEE (2017)  35. Xu, C., Cheng, L.: Eﬃcient hand pose estimation from a single depth image. In: Proceedings of the IEEE international conference on computer vision. pp. 3456- 3462 (2013)  36. Yuan, S., Garcia-Hernando, G., Stenger, B., Moon, G., Chang, J.Y., Lee, K.M., Molchanov, P., Kautz, J., Honari, S., Ge, L., et al.: Depth-based 3d hand pose estimation: From current achievements to future goals. In: IEEE CVPR (2018) 37. Yuan, S., Ye, Q., Garcia-Hernando, G., Kim, T.K.: The 2017 hands in the million challenge on 3d hand pose estimation. arXiv preprint arXiv:1707.02237 (2017) 38. Yuan, S., Ye, Q., Stenger, B., Jain, S., Kim, T.K.: Bighand2. 2m benchmark: Hand pose dataset and state of the art analysis. In: Computer Vision and Pattern Recognition (CVPR), 2017 IEEE Conference on. pp. 2605-2613. IEEE (2017) 39. Zhou, X., Wan, Q., Zhang, W., Xue, X., Wei, Y.: Model-based deep hand pose estimation. In: Proceedings of the Twenty-Fifth International Joint Conference on Artificial Intelligence. pp. 2421-2427. AAAI Press (2016)"}