{"1": "1. Abu-El-Haija, S., Kothari, N., Lee, J., Natsev, P., Toderici, G., Varadarajan, B., Vijayanarasimhan, S.: Youtube-8m: A large-scale video classification benchmark. arXiv preprint arXiv:1609.08675 (2016)  2. Babaeizadeh, M., Finn, C., Erhan, D., Campbell, R.H., Levine, S.: Stochastic vari-  ational video prediction. arXiv preprint arXiv:1710.11252 (2017)  3. Byeon, W., Wang, Q., Srivastava, R.K., Koumoutsakos, P.: Fully context-aware  video prediction. arXiv preprint arXiv:1710.08518 (2017)  4. Denton, E., Fergus, R.: Stochastic video generation with a learned prior. arXiv  5. Doll´ar, P., Wojek, C., Schiele, B., Perona, P.: Pedestrian detection: A benchmark.  preprint arXiv:1802.07687 (2018)  In: CVPR (June 2009)  6. Doll´ar, P., Wojek, C., Schiele, B., Perona, P.: Pedestrian detection: An evaluation  of the state of the art. PAMI 34 (2012)  7. Dosovitskiy, A., Fischer, P., Ilg, E., Hausser, P., Hazirbas, C., Golkov, V., van der Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: Proceedings of the IEEE International Conference on Computer Vi- sion. pp. 2758-2766 (2015)  8. He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpassing human- level performance on imagenet classification. In: Proceedings of the IEEE interna- tional conference on computer vision. pp. 1026-1034 (2015)  9. Ilg, E., Mayer, N., Saikia, T., Keuper, M., Dosovitskiy, A., Brox, T.: Flownet 2.0: Evolution of optical ﬂow estimation with deep networks. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). vol. 2 (2017)  10. Jiang, H., Sun, D., Jampani, V., Yang, M.H., Learned-Miller, E., Kautz, J.: Super slomo: High quality estimation of multiple intermediate frames for video interpo- lation. arXiv preprint arXiv:1712.00080 (2017)  11. Johnson, J., Alahi, A., Fei-Fei, L.: Perceptual losses for real-time style transfer and super-resolution. In: European Conference on Computer Vision. pp. 694-711. Springer (2016)  12. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  13. Leibfried, F., Kushman, N., Hofmann, K.: A deep learning approach for joint video frame and reward prediction in atari games. arXiv preprint arXiv:1611.07078 (2016)  14. Liang, X., Lee, L., Dai, W., Xing, E.P.: Dual motion gan for future-ﬂow embedded  video prediction. In: ICCV (2017)  15. Liu, Z., Yeh, R., Tang, X., Liu, Y., Agarwala, A.: Video frame synthesis using deep voxel ﬂow. In: International Conference on Computer Vision (ICCV). vol. 2 (2017) 16. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 3431-3440 (2015)  17. Lotter, W., Kreiman, G., Cox, D.: Deep predictive coding networks for video pre-  diction and unsupervised learning. In: ICLR (2014)  18. Lu, C., Hirsch, M., Sch¨olkopf, B.: Flexible spatio-temporal networks for video pre- diction. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 6523-6531 (2017)  19. Luc, P., Neverova, N., Couprie, C., Verbeek, J., LeCun, Y.: Predicting deeper into the future of semantic segmentation. In: of: ICCV 2017-International Conference on Computer Vision. p. 10 (2017)   SDC-Net: Video prediction using spatially-displaced convolutionReferences  1. Abu-El-Haija, S., Kothari, N., Lee, J., Natsev, P., Toderici, G., Varadarajan, B., Vijayanarasimhan, S.: Youtube-8m: A large-scale video classification benchmark. arXiv preprint arXiv:1609.08675 (2016)  2. Babaeizadeh, M., Finn, C., Erhan, D., Campbell, R.H., Levine, S.: Stochastic vari-  ational video prediction. arXiv preprint arXiv:1710.11252 (2017)  3. Byeon, W., Wang, Q., Srivastava, R.K., Koumoutsakos, P.: Fully context-aware  video prediction. arXiv preprint arXiv:1710.08518 (2017)  4. Denton, E., Fergus, R.: Stochastic video generation with a learned prior. arXiv  5. Doll´ar, P., Wojek, C., Schiele, B., Perona, P.: Pedestrian detection: A benchmark.  preprint arXiv:1802.07687 (2018)  In: CVPR (June 2009)  6. Doll´ar, P., Wojek, C., Schiele, B., Perona, P.: Pedestrian detection: An evaluation  of the state of the art. PAMI 34 (2012)  7. Dosovitskiy, A., Fischer, P., Ilg, E., Hausser, P., Hazirbas, C., Golkov, V., van der Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: Proceedings of the IEEE International Conference on Computer Vi- sion. pp. 2758-2766 (2015)  8. He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpassing human- level performance on imagenet classification. In: Proceedings of the IEEE interna- tional conference on computer vision. pp. 1026-1034 (2015)  9. Ilg, E., Mayer, N., Saikia, T., Keuper, M., Dosovitskiy, A., Brox, T.: Flownet 2.0: Evolution of optical ﬂow estimation with deep networks. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). vol. 2 (2017)  10. Jiang, H., Sun, D., Jampani, V., Yang, M.H., Learned-Miller, E., Kautz, J.: Super slomo: High quality estimation of multiple intermediate frames for video interpo- lation. arXiv preprint arXiv:1712.00080 (2017)  11. Johnson, J., Alahi, A., Fei-Fei, L.: Perceptual losses for real-time style transfer and super-resolution. In: European Conference on Computer Vision. pp. 694-711. Springer (2016)  12. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  13. Leibfried, F., Kushman, N., Hofmann, K.: A deep learning approach for joint video frame and reward prediction in atari games. arXiv preprint arXiv:1611.07078 (2016)  14. Liang, X., Lee, L., Dai, W., Xing, E.P.: Dual motion gan for future-ﬂow embedded  video prediction. In: ICCV (2017)  15. Liu, Z., Yeh, R., Tang, X., Liu, Y., Agarwala, A.: Video frame synthesis using deep voxel ﬂow. In: International Conference on Computer Vision (ICCV). vol. 2 (2017) 16. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 3431-3440 (2015)  17. Lotter, W., Kreiman, G., Cox, D.: Deep predictive coding networks for video pre-  diction and unsupervised learning. In: ICLR (2014)  18. Lu, C., Hirsch, M., Sch¨olkopf, B.: Flexible spatio-temporal networks for video pre- diction. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 6523-6531 (2017)  19. Luc, P., Neverova, N., Couprie, C., Verbeek, J., LeCun, Y.: Predicting deeper into the future of semantic segmentation. In: of: ICCV 2017-International Conference on Computer Vision. p. 10 (2017)   16  F.A. Reda et al.  20. Mahjourian, R., Wicke, M., Angelova, A.: Geometry-based next frame prediction from monocular video. In: Intelligent Vehicles Symposium (IV), 2017 IEEE. pp. 1700-1707. IEEE (2017)  21. Michael Mathieu, Camille Couprie, Y.L.: Deep multi-scale video prediction beyond mean square error. International Conference on Learning Representations (2016) 22. Milletari, F., Navab, N., Ahmadi, S.A.: V-net: Fully convolutional neural networks for volumetric medical image segmentation. In: 3D Vision (3DV), 2016 Fourth International Conference on. pp. 565-571. IEEE (2016)  23. Niklaus, S., Mai, L., Liu, F.: Video frame interpolation via adaptive convolution.  In: IEEE Conference on Computer Vision and Pattern Recognition (2017)  24. Niklaus, S., Mai, L., Liu, F.: Video frame interpolation via adaptive separable convolution. In: IEEE International Conference on Computer Vision (2017) 25. Odena, A., Dumoulin, V., Olah, C.: Deconvolution and checkerboard artifacts. Dis- till (2016). https://doi.org/10.23915/distill.00003, http://distill.pub/2016/deconv- checkerboard  26. Oliu, M., Selva, J., Escalera, S.: Folded recurrent neural networks for future video  prediction. arXiv preprint arXiv:1712.00311 (2017)  27. Paszke, A., Gross, S., Chintala, S., Chanan, G., Yang, E., DeVito, Z., Lin, Z., Desmaison, A., Antiga, L., Lerer, A.: Automatic diﬀerentiation in pytorch (2017) 28. Ranzato, M., Szlam, A., Bruna, J., Mathieu, M., Collobert, R., Chopra, S.: Video (language) modeling: a baseline for generative models of natural videos. arXiv preprint arXiv:1412.6604 (2014)  29. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomedi- cal image segmentation. In: International Conference on Medical image computing and computer-assisted intervention. pp. 234-241. Springer (2015)  30. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. CoRR abs/1409.1556 (2014)  31. Srivastava, N., Mansimov, E., Salakhutdinov, R.: Unsupervised learning of video  representations using LSTMs. In: ICML (2015)  32. Sun, D., Yang, X., Liu, M.Y., Kautz, J.: Pwc-net: Cnns for optical ﬂow using pyramid, warping, and cost volume. arXiv preprint arXiv:1709.02371 (2017) 33. Van Amersfoort, J., Kannan, A., Ranzato, M., Szlam, A., Tran, D., Chintala, S.: Transformation-based models of video sequences. arXiv preprint arXiv:1701.08435 (2017)  34. Villegas, R., Yang, J., Hong, S., Lin, X., Lee, H.: Decomposing motion and content  for natural video sequence prediction. In: ICLR (2017)  35. Vondrick, C., Pirsiavash, H., Torralba, A.: Generating videos with scene dynamics. In: Advances In Neural Information Processing Systems. pp. 613-621 (2016) 36. Vondrick, C., Torralba, A.: Generating the future with adversarial transformers. 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR) pp. 2992-3000 (2017)  37. Vukoti´c, V., Pintea, S.L., Raymond, C., Gravier, G., van Gemert, J.C.: One-step time-dependent future video frame prediction with a convolutional encoder-decoder neural network. In: International Conference on Image Analysis and Processing. pp. 140-151. Springer (2017)  38. Wang, Z., Bovik, A.C., Sheikh, H.R., Simoncelli, E.P.: Image quality assessment: from error visibility to structural similarity. IEEE transactions on image processing 13(4), 600-612 (2004)"}