{"1": "1. Adam W Harley, Konstantinos G. Derpanis, I.K.: Segmentation-aware convolu-  tional networks using local attention masks. In: Proc. ICCV (2017)  2. Andriluka, M., Stewart, R., Ng, A.Y.: End-to-end people detection in crowded  scenes. In: Proc. CVPR (2016)  3. Arnab, A., Torr, P.H.S.: Pixelwise instance segmentation with a dynamically in-  stantiated network. In: Proc. CVPR (2017)  4. Bai, M., Urtasun, R.: Deep watershed transform for instance segmentation. In:  Proc. CVPR (2017)  5. Ballard, D.H.: Readings in computer vision: Issues, problems, principles, and paradigms. chap. Generalizing the Hough Transform to Detect Arbitrary Shapes, pp. 714-725. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA (1987) 6. Chandra, S., Usunier, N., Kokkinos, I.: Dense and Low-Rank Gaussian CRFs Using  Deep Embeddings. In: Proc. ICCV (2017)  7. Chen, Y.T., Liu, X., Yang, M.H.: Multi-instance object segmentation with occlu-  8. Dai, J., He, K., Li, Y., Ren, S., Sun, J.: Instance-sensitive fully convolutional  9. Dai, J., He, K., Sun, J.: Convolutional feature masking for joint object and stuﬀ  sion handling. In: Proc. CVPR (2015)  networks. In: Proc. ECCV (2016)  segmentation. In: Proc. CVPR (2015)  work cascades. In: Proc. CVPR (2016)  10. Dai, J., He, K., Sun, J.: Instance-aware semantic segmentation via multi-task net-  11. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully  convolutional networks. In: Proc. NIPS (2016)  12. De Brabandere, B., Neven, D., Van Gool, L.: Semantic instance segmentation with  a discriminative loss function. arXiv preprint arXiv:1708.02551 (2017)  13. Duda, R.O., Hart, P.E.: Use of the hough transformation to detect lines and curves  in pictures. Commun. ACM 15(1), 11-15 (1972)  14. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The PASCAL Visual Object Classes Challenge 2012 (VOC2012) Results. http://www.pascal-network.org/challenges/VOC/voc2012/workshop/index.html  15. Fathi, A., Wojna, Z., Rathod, V., Wang, P., Song, H.O., Guadarrama, S., Murphy, K.P.: Semantic instance segmentation via deep metric learning. CoRR abs/1703.10277 (2017)  16. Felzenszwalb, P.F., Huttenlocher, D.P.: Eﬃcient graph-based image segmentation.  IJCV 59(2), 167-181 (2004)  17. Feragen, A., Lauze, F., Hauberg, S.: Geodesic exponential kernels: When curvature  and linearity conﬂict. In: Proc. CVPR (2015) 18. Girshick, R.: Fast r-cnn. In: Proc. ICCV (2015) 19. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accu-  rate object detection and semantic segmentation. In: Proc. CVPR (2014)  20. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Simultaneous detection and  segmentation. In: Proc. ECCV (2014)  21. Harley, A.W., Derpanis, K.G., Kokkinos, I.: Learning dense convolutional embed-  dings for semantic segmentation. In: Proc. ICLR (2016)  22. Hayder, Z., He, X., Salzmann, M.: Boundary-aware instance segmentation. In:  Proc. CVPR (2017)  23. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: Proc. ICCV (2017)   Novotny et al.: Semi-convolutional Operators for Instance SegmentationReferences  1. Adam W Harley, Konstantinos G. Derpanis, I.K.: Segmentation-aware convolu-  tional networks using local attention masks. In: Proc. ICCV (2017)  2. Andriluka, M., Stewart, R., Ng, A.Y.: End-to-end people detection in crowded  scenes. In: Proc. CVPR (2016)  3. Arnab, A., Torr, P.H.S.: Pixelwise instance segmentation with a dynamically in-  stantiated network. In: Proc. CVPR (2017)  4. Bai, M., Urtasun, R.: Deep watershed transform for instance segmentation. In:  Proc. CVPR (2017)  5. Ballard, D.H.: Readings in computer vision: Issues, problems, principles, and paradigms. chap. Generalizing the Hough Transform to Detect Arbitrary Shapes, pp. 714-725. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA (1987) 6. Chandra, S., Usunier, N., Kokkinos, I.: Dense and Low-Rank Gaussian CRFs Using  Deep Embeddings. In: Proc. ICCV (2017)  7. Chen, Y.T., Liu, X., Yang, M.H.: Multi-instance object segmentation with occlu-  8. Dai, J., He, K., Li, Y., Ren, S., Sun, J.: Instance-sensitive fully convolutional  9. Dai, J., He, K., Sun, J.: Convolutional feature masking for joint object and stuﬀ  sion handling. In: Proc. CVPR (2015)  networks. In: Proc. ECCV (2016)  segmentation. In: Proc. CVPR (2015)  work cascades. In: Proc. CVPR (2016)  10. Dai, J., He, K., Sun, J.: Instance-aware semantic segmentation via multi-task net-  11. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully  convolutional networks. In: Proc. NIPS (2016)  12. De Brabandere, B., Neven, D., Van Gool, L.: Semantic instance segmentation with  a discriminative loss function. arXiv preprint arXiv:1708.02551 (2017)  13. Duda, R.O., Hart, P.E.: Use of the hough transformation to detect lines and curves  in pictures. Commun. ACM 15(1), 11-15 (1972)  14. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The PASCAL Visual Object Classes Challenge 2012 (VOC2012) Results. http://www.pascal-network.org/challenges/VOC/voc2012/workshop/index.html  15. Fathi, A., Wojna, Z., Rathod, V., Wang, P., Song, H.O., Guadarrama, S., Murphy, K.P.: Semantic instance segmentation via deep metric learning. CoRR abs/1703.10277 (2017)  16. Felzenszwalb, P.F., Huttenlocher, D.P.: Eﬃcient graph-based image segmentation.  IJCV 59(2), 167-181 (2004)  17. Feragen, A., Lauze, F., Hauberg, S.: Geodesic exponential kernels: When curvature  and linearity conﬂict. In: Proc. CVPR (2015) 18. Girshick, R.: Fast r-cnn. In: Proc. ICCV (2015) 19. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accu-  rate object detection and semantic segmentation. In: Proc. CVPR (2014)  20. Hariharan, B., Arbel´aez, P., Girshick, R., Malik, J.: Simultaneous detection and  segmentation. In: Proc. ECCV (2014)  21. Harley, A.W., Derpanis, K.G., Kokkinos, I.: Learning dense convolutional embed-  dings for semantic segmentation. In: Proc. ICLR (2016)  22. Hayder, Z., He, X., Salzmann, M.: Boundary-aware instance segmentation. In:  Proc. CVPR (2017)  23. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: Proc. ICCV (2017)   16  Novotny D., Albanie S., Larlus D., Vedaldi A.  24. Hu, H., Lan, S., Jiang, Y., Cao, Z., Sha, F.: Fastmask: Segment multi-scale object  candidates in one shot. In: Proc. CVPR (2017)  25. Kendall, A., Gal, Y., Cipolla, R.: Multi-task learning using uncertainty to weigh  losses for scene geometry and semantics. Proc. CVPR (2017)  26. Kirillov, A., Levinkov, E., Andres, B., Savchynskyy, B., Rother, C.: Instancecut:  From edges to instances with multicut. In: Proc. CVPR (July 2017)  27. Kokkinos, I.: Ubernet: Training a universal convolutional neural network for low-, mid-, and high-level vision using diverse datasets and limited memory. In: Proc. CVPR (2017)  28. Kong, S., Fowlkes, C.: Recurrent pixel embedding for instance grouping. In: Proc.  29. Ladick´y, L., Sturgess, P., Alahari, K., Russell, C., Torr, P.H.S.: What, where and  how many? combining object detectors and crfs. In: Proc. ECCV (2010)  30. Leibe, B., Schiele, B.: Interleaved object categorization and segmentation. In: Proc.  CVPR (2018)  BMVC (2003)  31. Li, Y., Qi, H., Dai, J., Ji, X., Wei, Y.: Fully convolutional instance-aware semantic  segmentation. In: Proc. CVPR (2017)  32. Liang, X., Wei, Y., Shen, X., Jie, Z., Feng, J., Lin, L., Yan, S.: Reversible recursive  instance-level object segmentation. In: Proc. CVPR (2016)  33. Liang, X., Wei, Y., Shen, X., Yang, J., Lin, L., Yan, S.: Proposal-free network for  instance-level object segmentation. PAMI (2017)  34. Lin, T., Dollar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature pyra-  mid networks for object detection. In: Proc. CVPR (2017)  35. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: Proc. ECCV (2014) 36. Liu, R., Lehman, J., Molino, P., Such, F.P., Frank, E., Sergeev, A., Yosinski, J.: An intriguing failing of convolutional neural networks and the coordconv solution. arXiv preprint arXiv:1807.03247 (2018)  37. Liu, S., Jia, J., Fidler, S., Urtasun, R.: Sgn: Sequential grouping networks for  instance segmentation. In: Proc. ICCV (2017)  38. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  Single shot multibox detector. In: Proc. ECCV (2016)  39. Ljosa, V., Sokolnicki, K.L., Carpenter, A.E.: Annotated high-throughput mi-  croscopy image sets for validation. Nat Methods 9(7), 637 (2012)  40. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic  segmentation. In: Proc. CVPR (2015)  41. Newell, A., Huang, Z., Deng, J.: Associative embedding: End-to-end learning for  joint detection and grouping. In: Proc. NIPS (2017)  42. Pinheiro, P.O., Collobert, R., Doll´ar, P.: Learning to segment object candidates.  43. Pinheiro, P.O., Lin, T., Collobert, R., Doll´ar, P.: Learning to refine object segments.  In: Proc. NIPS (2015)  In: Proc. ECCV (2016)  (2017)  In: Proc. CVPR (2017)  44. Redmon, J., Farhadi, A.: YOLO9000: better, faster, stronger. In: Proc. CVPR  45. Ren, M., Zemel, R.S.: End-to-end instance segmentation with recurrent attention.  46. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: Towards real-time object  detection with region proposal networks. In: Proc. NIPS (2015)  47. Romera-Paredes, B., Torr, P.H.S.: Recurrent instance segmentation. In: Proc.  ECCV (2016)   Novotny et al.: Semi-convolutional Operators for Instance Segmentation48. Shi, J., Malik, J.: Normalized cuts and image segmentation. PAMI 22(8), 888-905  (2000)  49. Silberman, N., Sontag, D., Fergus, R.: Instance segmentation of indoor scenes using  a coverage loss. In: Proc. ECCV (2014)  50. Tighe, J., Niethammer, M., Lazebnik, S.: Scene parsing with object instances and  occlusion ordering. In: Proc. CVPR (2014)  51. Uhrig, J., Cordts, M., Franke, U., Brox, T.: Pixel-level encoding and depth layering  for instance-level semantic labeling. In: Proc. GCPR (2016)  52. W¨ahlby, C., Riklin-Raviv, T., Ljosa, V., Conery, A.L., Golland, P., Ausubel, F.M., Carpenter, A.E.: Resolving clustered worms via probabilistic shape models. In: Biomedical Imaging: From Nano to Macro, 2010 IEEE International Symposium on. pp. 552-555. IEEE (2010)  53. Wang, L., Lu, H., Ruan, X., Yang, M.H.: Deep networks for saliency detection via  local estimation and global search. In: Proc. CVPR (June 2015)  54. Yurchenko, V., Lempitsky, V.: Parsing images of overlapping organisms with deep  singling-out networks. Proc. CVPR (2017)  55. Zhang, Z., Schwing, A.G., Fidler, S., Urtasun, R.: Monocular object instance seg-  mentation and depth ordering with cnns. In: Proc. ICCV (2015)"}