{"1": "1. Ali, N.H., Hassan, G.M.: Kalman filter tracking. IJCA (9) (2014) 2. Ammar, H.B., Eaton, E., Ruvolo, P., Taylor, M.: Online multi-task learning for  policy gradient methods. In: ICML. pp. 1206-1214 (2014)  3. Babenko, B., Yang, M.H., Belongie, S.: Visual tracking with online multiple in-  stance learning. In: CVPR. pp. 983-990 (2009)  4. Bao, C., Wu, Y., Ling, H., Ji, H.: Real time robust l1 tracker using accelerated  proximal gradient approach. In: CVPR. pp. 1830-1837 (2012)  5. Bolme, D.S., Beveridge, J.R., Draper, B.A., Lui, Y.M.: Visual object tracking using  adaptive correlation filters. In: CVPR. pp. 2544-2550 (2010)  6. Caicedo, J.C., Lazebnik, S.: Active object localization with deep reinforcement  learning. In: ICCV. pp. 2488-2496 (2015)  7. Cao, Q., Lin, L., Shi, Y., Liang, X., Li, G.: Attention-aware face hallucination via  deep reinforcement learning. In: CVPR. pp. 690-698 (2017)  8. Chatfield, K., Simonyan, K., Vedaldi, A., Zisserman, A.: Return of the devil in the  details: Delving deep into convolutional nets. arXiv (2014)  9. Comaniciu, D., Ramesh, V., Meer, P.: Real-time tracking of non-rigid objects using  mean shift. In: CVPR. pp. 142-149 (2000)  10. Cui, Z., Xiao, S., Feng, J., Yan, S.: Recurrently target-attending tracking. In:  CVPR. pp. 1449-1458 (2016)  11. Danelljan, M., H¨ager, G., Khan, F.S., Felsberg, M.: Discriminative scale space  tracking. TPAMI (8), 1561-1575 (2017)  12. Danelljan, M., Hager, G., Shahbaz Khan, F., Felsberg, M.: Learning spatially reg- ularized correlation filters for visual tracking. In: ICCV. pp. 4310-4318 (2015) 13. Danelljan, M., Robinson, A., Khan, F.S., Felsberg, M.: Beyond correlation filters: Learning continuous convolution operators for visual tracking. In: ECCV. pp. 472- 488. Springer (2016)  14. Decarlo, D., Metaxas, D.: Optical ﬂow constraints on deformable models with  applications to face tracking. IJCV (2), 99-127 (2000)  15. Deng, J., Dong, W., Socher, R., Li, L., Li, K., Li, F.: Imagenet: A large-scale  hierarchical image database. In: CVPR. pp. 248-255 (2009)  16. Gao, J., Ling, H., Hu, W., Xing, J.: Transfer learning based visual tracking with  gaussian processes regression. In: ECCV. pp. 188-203 (2014)  17. Girshick, R.B., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: CVPR. pp. 580-587 (2014) 18. Gordon, D., Farhadi, A., Fox, D.: Re3 : Real-time recurrent regression networks  for object tracking. CoRR (2017)  19. Hager, G.D., Belhumeur, P.N.: Eﬃcient region tracking with parametric models of  geometry and illumination. TPAMI (10), 1025-1039 (1998)  20. Henriques, J.F., Caseiro, R., Martins, P., Batista, J.: High-speed tracking with  kernelized correlation filters. TPAMI (3), 583-596 (2015)  21. Huang, C., Lucey, S., Ramanan, D.: Learning policies for adaptive tracking with  deep feature cascades. In: ICCV. pp. 105-114 (2017)  22. Isard, M., Blake, A.: Condensation-conditional density propagation for visual  tracking,(1998). IJCV pp. 5-28  23. Jie, Z., Liang, X., Feng, J., Jin, X., Lu, W., Yan, S.: Tree-structured reinforcement  learning for sequential object localization. In: NIPS. pp. 127-135 (2016)  24. Kalal, Z., Mikolajczyk, K., Matas, J.: Tracking-learning-detection. TPAMI (7),  1409-1422 (2012)   DRL-IS for Visual TrackingReferences  1. Ali, N.H., Hassan, G.M.: Kalman filter tracking. IJCA (9) (2014) 2. Ammar, H.B., Eaton, E., Ruvolo, P., Taylor, M.: Online multi-task learning for  policy gradient methods. In: ICML. pp. 1206-1214 (2014)  3. Babenko, B., Yang, M.H., Belongie, S.: Visual tracking with online multiple in-  stance learning. In: CVPR. pp. 983-990 (2009)  4. Bao, C., Wu, Y., Ling, H., Ji, H.: Real time robust l1 tracker using accelerated  proximal gradient approach. In: CVPR. pp. 1830-1837 (2012)  5. Bolme, D.S., Beveridge, J.R., Draper, B.A., Lui, Y.M.: Visual object tracking using  adaptive correlation filters. In: CVPR. pp. 2544-2550 (2010)  6. Caicedo, J.C., Lazebnik, S.: Active object localization with deep reinforcement  learning. In: ICCV. pp. 2488-2496 (2015)  7. Cao, Q., Lin, L., Shi, Y., Liang, X., Li, G.: Attention-aware face hallucination via  deep reinforcement learning. In: CVPR. pp. 690-698 (2017)  8. Chatfield, K., Simonyan, K., Vedaldi, A., Zisserman, A.: Return of the devil in the  details: Delving deep into convolutional nets. arXiv (2014)  9. Comaniciu, D., Ramesh, V., Meer, P.: Real-time tracking of non-rigid objects using  mean shift. In: CVPR. pp. 142-149 (2000)  10. Cui, Z., Xiao, S., Feng, J., Yan, S.: Recurrently target-attending tracking. In:  CVPR. pp. 1449-1458 (2016)  11. Danelljan, M., H¨ager, G., Khan, F.S., Felsberg, M.: Discriminative scale space  tracking. TPAMI (8), 1561-1575 (2017)  12. Danelljan, M., Hager, G., Shahbaz Khan, F., Felsberg, M.: Learning spatially reg- ularized correlation filters for visual tracking. In: ICCV. pp. 4310-4318 (2015) 13. Danelljan, M., Robinson, A., Khan, F.S., Felsberg, M.: Beyond correlation filters: Learning continuous convolution operators for visual tracking. In: ECCV. pp. 472- 488. Springer (2016)  14. Decarlo, D., Metaxas, D.: Optical ﬂow constraints on deformable models with  applications to face tracking. IJCV (2), 99-127 (2000)  15. Deng, J., Dong, W., Socher, R., Li, L., Li, K., Li, F.: Imagenet: A large-scale  hierarchical image database. In: CVPR. pp. 248-255 (2009)  16. Gao, J., Ling, H., Hu, W., Xing, J.: Transfer learning based visual tracking with  gaussian processes regression. In: ECCV. pp. 188-203 (2014)  17. Girshick, R.B., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: CVPR. pp. 580-587 (2014) 18. Gordon, D., Farhadi, A., Fox, D.: Re3 : Real-time recurrent regression networks  for object tracking. CoRR (2017)  19. Hager, G.D., Belhumeur, P.N.: Eﬃcient region tracking with parametric models of  geometry and illumination. TPAMI (10), 1025-1039 (1998)  20. Henriques, J.F., Caseiro, R., Martins, P., Batista, J.: High-speed tracking with  kernelized correlation filters. TPAMI (3), 583-596 (2015)  21. Huang, C., Lucey, S., Ramanan, D.: Learning policies for adaptive tracking with  deep feature cascades. In: ICCV. pp. 105-114 (2017)  22. Isard, M., Blake, A.: Condensation-conditional density propagation for visual  tracking,(1998). IJCV pp. 5-28  23. Jie, Z., Liang, X., Feng, J., Jin, X., Lu, W., Yan, S.: Tree-structured reinforcement  learning for sequential object localization. In: NIPS. pp. 127-135 (2016)  24. Kalal, Z., Mikolajczyk, K., Matas, J.: Tracking-learning-detection. TPAMI (7),  1409-1422 (2012)   16  Liangliang Ren, Xin Yuan, Jiwen Lu, Ming Yang, Jie Zhou  25. Kamalapurkar, R., Andrews, L., Walters, P., Dixon, W.E.: Model-based reinforce- ment learning for infinite-horizon approximate optimal tracking. TNNLS (3), 753- 758 (2017)  26. Karayev, S., Baumgartner, T., Fritz, M., Darrell, T.: Timely object recognition.  In: NIPS. pp. 899-907 (2012)  27. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. CoRR (2014) 28. Konda, V.R., Tsitsiklis, J.N.: Actor-critic algorithms. In: NIPS. pp. 1008-1014  (2000)  29. Kong, X., Xin, B., Wang, Y., Hua, G.: Collaborative deep reinforcement learning  for joint object search. In: CVPR (2017)  30. Kristan, M., Matas, J., Leonardis, A., Voj´ıˇr, T., Pﬂugfelder, R., Fernandez, G., Nebehay, G., Porikli, F., ˇCehovin, L.: A novel performance evaluation methodology for single-target trackers. TPAMI (11), 2137-2155 (2016)  31. Liang, P., Blasch, E., Ling, H.: Encoding color information for visual tracking:  Algorithms and benchmark. TIP (12), 5630-5644 (2015)  32. Ma, C., Huang, J.B., Yang, X., Yang, M.H.: Hierarchical convolutional features for  visual tracking. In: ICCV. pp. 3074-3082 (2015)  33. Mathe, S., Pirinen, A., Sminchisescu, C.: Reinforcement learning for visual object  detection. In: CVPR. pp. 2894-2902 (2016)  34. Mnih, V., Kavukcuoglu, K., Silver, D., Rusu, A.A., Veness, J., Bellemare, M.G., Graves, A., Riedmiller, M., Fidjeland, A.K., Ostrovski, G., et al.: Human-level control through deep reinforcement learning. Nature (7540), 529-533 (2015) 35. Nam, H., Han, B.: Learning multi-domain convolutional neural networks for visual  tracking. CoRR (2015)  36. Nam, H., Han, B.: Learning multi-domain convolutional neural networks for visual  tracking. In: CVPR. pp. 4293-4302 (2016)  37. O’Donoghue, B., Munos, R., Kavukcuoglu, K., Mnih, V.: Pgq: Combining policy  gradient and q-learning. arXiv preprint arXiv:1611.01626 (2016)  38. Okuma, K., Taleghani, A., De Freitas, N., Little, J.J., Lowe, D.G.: A boosted particle filter: Multitarget detection and tracking. In: ECCV. pp. 28-39 (2004) 39. Qi, Y., Zhang, S., Qin, L., Yao, H., Huang, Q., Lim, J., Yang, M.H.: Hedged deep  tracking. In: CVPR. pp. 4303-4311 (2016)  40. Rao, Y., Lu, J., Zhou, J.: Attention-aware deep reinforcement learning for video  face recognition. In: ICCV. pp. 3931-3940 (2017)  41. Smeulders, A.W., Chu, D.M., Cucchiara, R., Calderara, S., Dehghan, A., Shah, M.: Visual tracking: An experimental survey. TPAMI (7), 1442-1468 (2014) 42. Song, Y., Ma, C., Gong, L., Zhang, J., Lau, R.W.H., Yang, M.: CREST: convolu-  tional residual learning for visual tracking. CoRR (2017)  43. Song, Y., Ma, C., Gong, L., Zhang, J., Lau, R.W.H., Yang, M.H.: Crest: Convolu- tional residual learning for visual tracking. In: ICCV. pp. 2555-2564 (2017) 44. Supancic, III, J., Ramanan, D.: Tracking as online decision-making: Learning a policy from streaming videos with reinforcement learning. In: ICCV. pp. 322-331 (2017)  45. Tao, R., Gavves, E., Smeulders, A.W.: Siamese instance search for tracking. In:  CVPR. pp. 1420-1429 (2016)  46. Wang, L., Ouyang, W., Wang, X., Lu, H.: Stct: Sequentially training convolutional  networks for visual tracking. In: CVPR. pp. 1373-1381 (2016)  47. Wang, N., Yeung, D.Y.: Learning a deep compact image representation for visual  tracking. In: NIPS. pp. 809-817 (2013)  48. Wu, Y., Lim, J., Yang, M.H.: Online object tracking: A benchmark. In: CVPR.  pp. 2411-2418 (2013)   DRL-IS for Visual Tracking49. Wu, Y., Lim, J., Yang, M.H.: Object tracking benchmark. TPAMI (9), 1834-1848  (2015)  50. Yang, B., Nevatia, R.: Multi-target tracking by online learning of non-linear motion  patterns and robust appearance models. In: CVPR. pp. 1918-1925 (2012)  51. Yang, H., Shao, L., Zheng, F., Wang, L., Song, Z.: Recent advances and trends in  visual tracking: A review. Neurocomputing (18), 3823-3831 (2011)  52. Yun, S., Choi, J., Yoo, Y., Yun, K., Young Choi, J.: Action-decision networks for visual tracking with deep reinforcement learning. In: CVPR. pp. 2711-2720 (2017) 53. Zhang, D., Maei, H., Wang, X., Wang, Y.F.: Deep reinforcement learning for visual  object tracking in videos. arXiv preprint arXiv:1701.08936 (2017)  54. Zhang, J., Ma, S., Sclaroﬀ, S.: Meem: robust tracking via multiple experts using  entropy minimization. In: ECCV. pp. 188-203 (2014)"}