{"1": "1. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., et al.: Tensorﬂow: A system for large-scale machine learning. In: OSDI. vol. 16, pp. 265-283 (2016)  2. Abbeel, P., Ng, A.Y.: Apprenticeship learning via inverse reinforcement learning. In: Proceedings of the twenty-first international conference on Machine learning. p. 1. ACM (2004)  3. Alahi, A., Goel, K., Ramanathan, V., Robicquet, A., Fei-Fei, L., Savarese, S.: Social lstm: Human trajectory prediction in crowded spaces. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 961-971 (2016) 4. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein gan. arXiv preprint  arXiv:1701.07875 (2017)  5. Ballan, L., Castaldo, F., Alahi, A., Palmieri, F., Savarese, S.: Knowledge transfer for scene-specific motion prediction. In: European Conference on Computer Vision. pp. 697-713. Springer (2016)  6. Baram, N., Anschel, O., Caspi, I., Mannor, S.: End-to-end diﬀerentiable adversarial imitation learning. In: International Conference on Machine Learning. pp. 390-399 (2017)  7. Bhattacharyya, A., Malinowski, M., Schiele, B., Fritz, M.: Long-term image bound- ary prediction. In: Thirty-Second AAAI Conference on Artificial Intelligence. AAAI (2017)  8. Bhattacharyya, A., Schiele, B., Fritz, M.: Accurate and diverse sampling of se- quences based on a best of many sample objective. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 8485-8493 (2018) 9. Dinh, L., Sohl-Dickstein, J., Bengio, S.: Density estimation using real nvp. arXiv  preprint arXiv:1605.08803 (2016)  10. Finn, C., Levine, S.: Deep visual foresight for planning robot motion. In: Robotics and Automation (ICRA), 2017 IEEE International Conference on. pp. 2786-2793. IEEE (2017)  11. Gal, Y.: Uncertainty in deep learning. Ph.D. thesis, University of Cambridge (2016) 12. Galceran, E., Cunningham, A.G., Eustice, R.M., Olson, E.: Multipolicy decision- making for autonomous driving via changepoint-based behavior prediction. In: Robotics: Science and Systems XI, Sapienza University of Rome, Rome, Italy, July 13-17, 2015 (2015), http://www.roboticsproceedings.org/rss11/p43.html  13. Grover, A., Dhar, M., Ermon, S.: Flow-gan: Bridging implicit and prescribed learn-  ing in generative models. arXiv preprint arXiv:1705.08868 (2017)  14. Gulrajani, I., Ahmed, F., Arjovsky, M., Dumoulin, V., Courville, A.C.: Improved training of wasserstein gans. In: Advances in Neural Information Processing Sys- tems. pp. 5769-5779 (2017)  15. Gupta, A., Johnson, J.: Social gan: Socially acceptable trajectories with generative  adversarial networks  16. Ho, J., Ermon, S.: Generative adversarial imitation learning. In: Advances in Neural  Information Processing Systems. pp. 4565-4573 (2016)  17. Hoai, M., De la Torre, F.: Max-margin early event detectors. International Journal  of Computer Vision 107(2), 191-202 (2014)  18. Jain, A., Singh, A., Koppula, H.S., Soh, S., Saxena, A.: Recurrent neural networks for driver activity anticipation via sensory-fusion architecture. In: Robotics and Automation (ICRA), 2016 IEEE International Conference on. pp. 3118-3125. IEEE (2016)   R2P2 for Diverse, Precise Generative Path ForecastingReferences  1. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., et al.: Tensorﬂow: A system for large-scale machine learning. In: OSDI. vol. 16, pp. 265-283 (2016)  2. Abbeel, P., Ng, A.Y.: Apprenticeship learning via inverse reinforcement learning. In: Proceedings of the twenty-first international conference on Machine learning. p. 1. ACM (2004)  3. Alahi, A., Goel, K., Ramanathan, V., Robicquet, A., Fei-Fei, L., Savarese, S.: Social lstm: Human trajectory prediction in crowded spaces. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 961-971 (2016) 4. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein gan. arXiv preprint  arXiv:1701.07875 (2017)  5. Ballan, L., Castaldo, F., Alahi, A., Palmieri, F., Savarese, S.: Knowledge transfer for scene-specific motion prediction. In: European Conference on Computer Vision. pp. 697-713. Springer (2016)  6. Baram, N., Anschel, O., Caspi, I., Mannor, S.: End-to-end diﬀerentiable adversarial imitation learning. In: International Conference on Machine Learning. pp. 390-399 (2017)  7. Bhattacharyya, A., Malinowski, M., Schiele, B., Fritz, M.: Long-term image bound- ary prediction. In: Thirty-Second AAAI Conference on Artificial Intelligence. AAAI (2017)  8. Bhattacharyya, A., Schiele, B., Fritz, M.: Accurate and diverse sampling of se- quences based on a best of many sample objective. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 8485-8493 (2018) 9. Dinh, L., Sohl-Dickstein, J., Bengio, S.: Density estimation using real nvp. arXiv  preprint arXiv:1605.08803 (2016)  10. Finn, C., Levine, S.: Deep visual foresight for planning robot motion. In: Robotics and Automation (ICRA), 2017 IEEE International Conference on. pp. 2786-2793. IEEE (2017)  11. Gal, Y.: Uncertainty in deep learning. Ph.D. thesis, University of Cambridge (2016) 12. Galceran, E., Cunningham, A.G., Eustice, R.M., Olson, E.: Multipolicy decision- making for autonomous driving via changepoint-based behavior prediction. In: Robotics: Science and Systems XI, Sapienza University of Rome, Rome, Italy, July 13-17, 2015 (2015), http://www.roboticsproceedings.org/rss11/p43.html  13. Grover, A., Dhar, M., Ermon, S.: Flow-gan: Bridging implicit and prescribed learn-  ing in generative models. arXiv preprint arXiv:1705.08868 (2017)  14. Gulrajani, I., Ahmed, F., Arjovsky, M., Dumoulin, V., Courville, A.C.: Improved training of wasserstein gans. In: Advances in Neural Information Processing Sys- tems. pp. 5769-5779 (2017)  15. Gupta, A., Johnson, J.: Social gan: Socially acceptable trajectories with generative  adversarial networks  16. Ho, J., Ermon, S.: Generative adversarial imitation learning. In: Advances in Neural  Information Processing Systems. pp. 4565-4573 (2016)  17. Hoai, M., De la Torre, F.: Max-margin early event detectors. International Journal  of Computer Vision 107(2), 191-202 (2014)  18. Jain, A., Singh, A., Koppula, H.S., Soh, S., Saxena, A.: Recurrent neural networks for driver activity anticipation via sensory-fusion architecture. In: Robotics and Automation (ICRA), 2016 IEEE International Conference on. pp. 3118-3125. IEEE (2016)   16  Nicholas Rhinehart, Kris M. Kitani, Paul Vernaza  19. Kakade, S.M., et al.: On the sample complexity of reinforcement learning. Ph.D.  thesis (2003)  20. Kingma, D.P., Dhariwal, P.: Glow: Generative ﬂow with invertible 1x1 convolu-  tions. arXiv preprint arXiv:1807.03039 (2018)  21. Kingma, D.P., Salimans, T., Jozefowicz, R., Chen, X., Sutskever, I., Welling, M.: Improved variational inference with inverse autoregressive ﬂow. In: Advances in Neural Information Processing Systems. pp. 4743-4751 (2016)  22. Kingma, D.P., Welling, M.: Auto-encoding variational bayes. arXiv preprint  arXiv:1312.6114 (2013)  23. Kitani, K.M., Ziebart, B.D., Bagnell, J.A., Hebert, M.: Activity forecasting. In:  European Conference on Computer Vision. pp. 201-214. Springer (2012)  24. Lan, T., Chen, T.C., Savarese, S.: A hierarchical representation for future action prediction. In: European Conference on Computer Vision. pp. 689-704. Springer (2014)  25. Lee, N., Choi, W., Vernaza, P., Choy, C.B., Torr, P.H., Chandraker, M.: Desire:  Distant future prediction in dynamic scenes with interacting agents (2017)  26. Lee, N., Kitani, K.M.: Predicting wide receiver trajectories in american football. In: Applications of Computer Vision (WACV), 2016 IEEE Winter Conference on. pp. 1-9. IEEE (2016)  27. Li, Y., Song, J., Ermon, S.: Infogail: Interpretable imitation learning from visual demonstrations. In: Advances in Neural Information Processing Systems. pp. 3815- 3825 (2017)  28. Ma, W.C., Huang, D.A., Lee, N., Kitani, K.M.: Forecasting interactive dynamics of pedestrians with fictitious play. In: Computer Vision and Pattern Recognition (CVPR), 2017 IEEE Conference on. pp. 4636-4644. IEEE (2017)  29. Najfeld, I., Havel, T.F.: Derivatives of the matrix exponential and their computa-  tion. Advances in applied mathematics 16(3), 321-375 (1995)  30. Park, H.S., Hwang, J.J., Niu, Y., Shi, J.: Egocentric future localization. In: CVPR.  vol. 2, p. 4 (2016)  31. Ratliﬀ, N.D., Bagnell, J.A., Zinkevich, M.A.: Maximum margin planning. In: Pro- ceedings of the 23rd international conference on Machine learning. pp. 729-736. ACM (2006)  32. Recht, B.: The policy of truth. http://www.argmin.net/2018/02/20/reinforce/  (2018)  33. Rhinehart, N., Kitani, K.M.: First-person activity forecasting with online inverse reinforcement learning. In: The IEEE International Conference on Computer Vi- sion (ICCV) (Oct 2017)  34. Robicquet, A., Sadeghian, A., Alahi, A., Savarese, S.: Learning social etiquette: Human trajectory understanding in crowded scenes. In: European conference on computer vision. pp. 549-565. Springer (2016)  35. Ryoo, M.S., Fuchs, T.J., Xia, L., Aggarwal, J.K., Matthies, L.H.: Robot- they do centric activity prediction from first-person videos: What will to me’. the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction, HRI 2015, Portland, OR, USA, March 2-5, 2015. pp. 295-302 (2015). https://doi.org/10.1145/2696454.2696462, http://doi.acm.org/10.1145/2696454.2696462  In: Proceedings of  36. Ryoo, M.S.: Human activity prediction: Early recognition of ongoing activities from streaming videos. In: Computer Vision (ICCV), 2011 IEEE International Conference on. pp. 1036-1043. IEEE (2011)  37. Sadeghian, A., Kosaraju, V., Gupta, A., Savarese, S., Alahi, A.: Trajnet: Towards  a benchmark for human trajectory prediction. arXiv preprint (2018)   R2P2 for Diverse, Precise Generative Path Forecasting38. Salimans, T., Goodfellow, I., Zaremba, W., Cheung, V., Radford, A., Chen, X.: Im- proved techniques for training gans. In: Advances in Neural Information Processing Systems. pp. 2234-2242 (2016)  39. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A., et al.: Going deeper with convolutions. Cvpr (2015) 40. Venkatraman, A., Rhinehart, N., Sun, W., Pinto, L., Hebert, M., Boots, B., Ki- tani, K., Bagnell, J.: Predictive-state decoders: Encoding the future into recurrent networks. In: Advances in Neural Information Processing Systems. pp. 1172-1183 (2017)  41. Verlet, L.: Computer” experiments” on classical ﬂuids. i. thermodynamical prop-  erties of lennard-jones molecules. Physical review 159(1), 98 (1967)  42. Villegas, R., Yang, J., Zou, Y., Sohn, S., Lin, X., Lee, H.: Learn- In: Proceed- ing to generate long-term future via hierarchical prediction. ings of ICML the 34th International Conference on Machine Learning, 2017, Sydney, NSW, Australia, 6-11 August 2017. pp. 3560-3569 (2017), http://proceedings.mlr.press/v70/villegas17a.html  43. Vondrick, C., Pirsiavash, H., Torralba, A.: Anticipating visual representations from unlabeled video. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 98-106 (2016)  44. Vondrick, C., Pirsiavash, H., Torralba, A.: Generating videos with scene dynamics. In: Advances In Neural Information Processing Systems. pp. 613-621 (2016)  transformers.  45. Vondrick, C., Torralba, A.: Generating  ial Pattern Recognition, CVPR 2017, Honolulu, HI, USA, (2017). 2992-3000 2017. https://doi.org/10.1109/CVPR.2017.319  adversar- the In: 2017 IEEE Conference on Computer Vision and 21-26, https://doi.org/10.1109/CVPR.2017.319,  future with  July  pp.  46. Walker, J., Gupta, A., Hebert, M.: Patch to the future: Unsupervised visual pre- diction. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3302-3309 (2014)  47. Walker, J., Marino, K., Gupta, A., Hebert, M.: The pose knows: Video forecasting by generating pose futures. In: 2017 IEEE International Conference on Computer Vision (ICCV). pp. 3352-3361. IEEE (2017)  48. Williams, R.J.: Simple statistical gradient-following algorithms for connectionist reinforcement learning. In: Reinforcement Learning, pp. 5-32. Springer (1992) 49. Wulfmeier, M., Rao, D., Wang, D.Z., Ondruska, P., Posner, I.: Large-scale cost function learning for path planning using deep inverse reinforcement learning. The International Journal of Robotics Research 36(10), 1073-1087 (2017)  50. Xie, D., Todorovic, S., Zhu, S.C.: Inferring “dark matter” and “dark energy” from videos. In: Computer Vision (ICCV), 2013 IEEE International Conference on. pp. 2224-2231. IEEE (2013)  51. Zhu, J., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation using cycle-consistent adversarial networks. In: IEEE International Conference on Com- puter Vision, ICCV 2017, Venice, Italy, October 22-29, 2017. pp. 2242-2251 (2017). https://doi.org/10.1109/ICCV.2017.244, https://doi.org/10.1109/ICCV.2017.244 52. Ziebart, B.D., Maas, A.L., Bagnell, J.A., Dey, A.K.: Maximum entropy inverse reinforcement learning. In: Proceedings of the Twenty-Third AAAI Conference on Artificial Intelligence, AAAI 2008, Chicago, Illinois, USA, July 13-17, 2008. pp. 1433-1438 (2008), http://www.aaai.org/Library/AAAI/2008/aaai08-227.php"}