{"1": "1. Whitnall, G.: History of zoning. Annals of the American Academy of Political and Social  Science 155 (1931) 1-14  2. GoLdberg, M., Horwood, P., Block, W.: Zoning: Its Costs and Relevance for the 1980s.  Fraser Institute’s housing and land economics series. Fraser Institute (1980)  3. Brown, D., Pijanowski, B., Duh, J.: Modeling the relationships between land use and land cover on private lands in the upper midwest, usa. Journal of Environmental Management 59(4) (2000) 247-263  4. Rozenstein, O., Karnieli, A.: Comparison of methods for land-use classification incorporat-  ing remote sensing and gis inputs. Applied Geography 31(2) (2011) 533-544  5. Tuia, D., Mu˜noz-Mar´ı, J., Kanevski, M., Camps-Valls, G.: Structured output svm for remote sensing image classification. Journal of Signal Processing Systems 65(3) (2011) 301-310 6. Frohlich, B., Bach, E., Walde, I., Hese, S., Schmullius, C., Denzler, J.: Land cover classifi- cation of satellite images using contextual information. Annals of Photogrammetry, Remote Sensing and Spatial Information Sciences (1) (2013) 1-6  7. Banerjee, B., Bovolo, F., Bhattacharya, A., Bruzzone, L., Chaudhuri, S., Mohan, B.: A new self-training-based unsupervised satellite image classification technique using cluster ensemble strategy. IEEE Geoscience and Remote Sensing Letters 12(4) (2015) 741-745 8. Tokarczyk, P., Wegner, J., Walk, S., Schindler, K.: Features, color spaces, and boosting: New insights on semantic classification of remote sensing images. IEEE Transactions on Geoscience and Remote Sensing 53(1) (2015) 280-295  9. Volpi, M., Ferrari, V.: Semantic segmentation of urban scenes by learning local class inter-  actions. In: Proc IEEE Computer Vision and Pattern Recognition Workshops. (2015)  10. Volpi, M., Tuia, D.: Dense semantic labeling of sub-decimeter resolution images with con- volutional neural networks. IEEE Transactions on Geoscience and Remote Sensing 55(2) (2017) 881-893  11. Albert, L., Rottensteiner, F., Heipke, C.: An Iterative Inference Procedure Applying Con- ditional Random Fields for Simultaneous Classification of Land Cover and Land Use. IS- PRS Annals of Photogrammetry, Remote Sensing and Spatial Information Sciences (August 2015) 369-376  12. Porway, J., Wang, K., Yao, B., Zhu, S.C.: A hierarchical and contextual model for aerial im- age understanding. In: Proc IEEE International Conference on Computer Vision and Pattern Recognition. (2008) 1-8  13. Porway, J., Wang, Q., Zhu, S.C.: A hierarchical and contextual model for aerial image  parsing. International Journal of Computer Vision 88(2) (2010) 254-283  14. Hu, S., Wang, L.: Automated urban land-use classification with remote sensing. International  Journal of Remote Sensing 34(3) (2013) 790-803  15. Lienou, M., Maitre, H., Datcu, M.: Semantic Annotation of Satellite Images Using Latent Dirichlet Allocation. IEEE Geoscience and Remote Sensing Letters 7 (January 2010) 28-32 16. Luus, F.P.S., Salmon, B.P., van den Bergh, F., Maharaj, B.T.J.: Multiview deep learning for land-use classification. IEEE Geoscience and Remote Sensing Letters 12(12) (Dec 2015) 2448-2452  17. Food and Agriculture Organization of the United Nations: Land Cover Classification System  (LCCS): classification concepts and user manual. (2000)  18. Forster, B.C.: An examination of some problems and solutions in monitoring urban areas from satellite platforms. International Journal of Remote Sensing 6(1) (1985) 139-151 19. Gong, P., Howarth, P.J.: Land-use classification of spot hrv data using a cover-frequency  method. International Journal of Remote Sensing 13(8) (1991)   Urban ZoningReferences  1. Whitnall, G.: History of zoning. Annals of the American Academy of Political and Social  Science 155 (1931) 1-14  2. GoLdberg, M., Horwood, P., Block, W.: Zoning: Its Costs and Relevance for the 1980s.  Fraser Institute’s housing and land economics series. Fraser Institute (1980)  3. Brown, D., Pijanowski, B., Duh, J.: Modeling the relationships between land use and land cover on private lands in the upper midwest, usa. Journal of Environmental Management 59(4) (2000) 247-263  4. Rozenstein, O., Karnieli, A.: Comparison of methods for land-use classification incorporat-  ing remote sensing and gis inputs. Applied Geography 31(2) (2011) 533-544  5. Tuia, D., Mu˜noz-Mar´ı, J., Kanevski, M., Camps-Valls, G.: Structured output svm for remote sensing image classification. Journal of Signal Processing Systems 65(3) (2011) 301-310 6. Frohlich, B., Bach, E., Walde, I., Hese, S., Schmullius, C., Denzler, J.: Land cover classifi- cation of satellite images using contextual information. Annals of Photogrammetry, Remote Sensing and Spatial Information Sciences (1) (2013) 1-6  7. Banerjee, B., Bovolo, F., Bhattacharya, A., Bruzzone, L., Chaudhuri, S., Mohan, B.: A new self-training-based unsupervised satellite image classification technique using cluster ensemble strategy. IEEE Geoscience and Remote Sensing Letters 12(4) (2015) 741-745 8. Tokarczyk, P., Wegner, J., Walk, S., Schindler, K.: Features, color spaces, and boosting: New insights on semantic classification of remote sensing images. IEEE Transactions on Geoscience and Remote Sensing 53(1) (2015) 280-295  9. Volpi, M., Ferrari, V.: Semantic segmentation of urban scenes by learning local class inter-  actions. In: Proc IEEE Computer Vision and Pattern Recognition Workshops. (2015)  10. Volpi, M., Tuia, D.: Dense semantic labeling of sub-decimeter resolution images with con- volutional neural networks. IEEE Transactions on Geoscience and Remote Sensing 55(2) (2017) 881-893  11. Albert, L., Rottensteiner, F., Heipke, C.: An Iterative Inference Procedure Applying Con- ditional Random Fields for Simultaneous Classification of Land Cover and Land Use. IS- PRS Annals of Photogrammetry, Remote Sensing and Spatial Information Sciences (August 2015) 369-376  12. Porway, J., Wang, K., Yao, B., Zhu, S.C.: A hierarchical and contextual model for aerial im- age understanding. In: Proc IEEE International Conference on Computer Vision and Pattern Recognition. (2008) 1-8  13. Porway, J., Wang, Q., Zhu, S.C.: A hierarchical and contextual model for aerial image  parsing. International Journal of Computer Vision 88(2) (2010) 254-283  14. Hu, S., Wang, L.: Automated urban land-use classification with remote sensing. International  Journal of Remote Sensing 34(3) (2013) 790-803  15. Lienou, M., Maitre, H., Datcu, M.: Semantic Annotation of Satellite Images Using Latent Dirichlet Allocation. IEEE Geoscience and Remote Sensing Letters 7 (January 2010) 28-32 16. Luus, F.P.S., Salmon, B.P., van den Bergh, F., Maharaj, B.T.J.: Multiview deep learning for land-use classification. IEEE Geoscience and Remote Sensing Letters 12(12) (Dec 2015) 2448-2452  17. Food and Agriculture Organization of the United Nations: Land Cover Classification System  (LCCS): classification concepts and user manual. (2000)  18. Forster, B.C.: An examination of some problems and solutions in monitoring urban areas from satellite platforms. International Journal of Remote Sensing 6(1) (1985) 139-151 19. Gong, P., Howarth, P.J.: Land-use classification of spot hrv data using a cover-frequency  method. International Journal of Remote Sensing 13(8) (1991)   16  T. Feng, Q. T. Truong, D. T. Nguyen, J. Y. Koh, L. F. Yu, A. Binder, and S. K. Yeung  20. Barnsley, M.J., Barr, S.L.: Inferring urban land use from satellite sensor images using kernel- based spatial reclassification. Photogrammetric Engineering and Remote Sensing 62(8) (1996) 949-958  21. Doersch, C., Singh, S., Gupta, A., Sivic, J., Efros, A.A.: What makes paris look like paris?  ACM Transactions on Graphics 31(4) (2012) 101:1-101:9  22. Zhou, B., Liu, L., Oliva, A., Torralba, A.: Recognizing city identity via attribute analysis of geo-tagged images. In: Proc European Conference on Computer Vision. (2014) 519-534 23. Lee, S., Zhang, H., Crandall, D.J.: Predicting geo-informative attributes in large-scale im- In: Proc IEEE International Winter  age collections using convolutional neural networks. Conference on Applications of Computer Vision. (2015) 550-557  24. Ordonez, V., Berg, T.L.: Learning high-level judgments of urban perception. In: Proc Euro-  pean Conference on Computer Vision. (2014) 494-510  25. Quercia, D., O’Hare, N.K., Cramer, H.: Aesthetic capital: What makes london look beautiful, quiet, and happy? In: Proc 17th ACM Conference on Computer Supported Cooperative Work and Social Computing, New York, NY, USA, ACM (2014) 945-955  26. Dubey, A., Naik, N., Parikh, D., Raskar, R., Hidalgo, C.A.  In: Deep Learning the City: Quantifying Urban Perception at a Global Scale. Springer International Publishing, Cham (2016) 196-212  27. Leung, D., Newsam, S.: Proximate sensing: Inferring what-is-where from georeferenced photo collections. In: Proc IEEE International Conference on Computer Vision and Pattern Recognition. (2010) 2955-2962  28. Oba, H., Hirota, M., Chbeir, R., Ishikawa, H., Yokoyama, S.: Towards better land cover In: Proc IEEE International Symposium on  classification using geo-tagged photographs. Multimedia. (2014) 320-327  29. Frey, N., Torralba, A., Stauffer, C.: Unsupervised non-parametric geospatial modeling from ground imagery. In: Proc IEEE International Winter Conference on Applications of Com- puter Vision. (2014) 698-705  30. Lin, T.Y., Cui, Y., Belongie, S., Hays, J.: Learning deep representations for ground-to-aerial geolocalization. In: Proc IEEE International Conference on Computer Vision and Pattern Recognition. (2015) 5007-5015  31. M´attyus, G., Wang, S., Fidler, S., Urtasun, R.: Hd maps: Fine-grained road segmentation by parsing ground and aerial images. In: Proc IEEE International Conference on Computer Vision and Pattern Recognition. (2016) 3611-3619  32. Workman, S., Zhai, M., Crandall, D.J., Jacobs, N.: A unified model for near and remote sensing. In: Proc IEEE International Conference on Computer Vision. (2017) 2688-2697 33. Kr¨ahenb¨uhl, P., Koltun, V.: Efficient inference in fully connected crfs with gaussian edge potentials. In: Proc Conference on Neural Information Processing Systems. (2011) 109-117 34. Felzenszwalb, P.F., Huttenlocher, D.P.: Distance transforms of sampled functions. Technical  report, Cornell Computing and Information Science (2004)  35. Jordan, M.I., Ghahramani, Z., Jaakkola, T.S., Saul, L.: An introduction to variational meth-  ods for graphical models. Machine Learning (1999) 183-233  36. Wainwright, M.J., Jordan, M.I.: Graphical models, exponential families, and variational  inference. Foundations and Trends in Machine Learning 1(1-2) (2008) 1-305  37. Vineet, V., Warrell, J., Torr, P.H.S.: Filter-based mean-field inference for random fields with higher-order terms and product label-spaces. International Journal of Computer Vision 110(3) (2014) 290-307  38. Farabet, C., Couprie, C., Najman, L., LeCun, Y.: Learning hierarchical features for scene IEEE Transactions on Pattern Analysis and Machine Intelligence 35(8) (2013)  labeling. 1915-1929  39. Oliva, A., Torralba, A.: Modeling the shape of the scene: A holistic representation of the  spatial envelope. International Journal of Computer Vision 42(3) (2001) 145-175   Urban Zoning40. Dalal, N., Triggs, B.: Histograms of oriented gradients for human detection. In: Proc IEEE International Conference on Computer Vision and Pattern Recognition. (2005) 886-893 41. Ojala, T., Pietikˇainen, M., Harwood, D.: A comparative study of texture measures with classification based on featured distributions. Pattern Recognition 29(1) (1996) 51-59 42. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep convolutional neural networks. In: Proc Conference on Neural Information Processing Systems. (2012) 1106-1114  43. Zhou, B., Lapedriza, `A., Xiao, J., Torralba, A., Oliva, A.: Learning deep features for scene recognition using places database. In: Proc Conference on Neural Information Processing Systems. (2014) 487-495  44. Breiman, L.: Random forests. Machine Learning 45(1) (2001) 5-32 45. Kuncheva, L.I.: Combining Pattern Classifiers: Methods and Algorithms. Wiley-Interscience  46. USGS: The national map. https://viewer.nationalmap.gov/basic/ 47. Esri Inc.: ESRI Shapefile Technical Description. Environmental Systems Research Institute,  (2004)  Inc. (July 1998)"}