{"1": "1. Pan, G., Sun, L., Wu, Z., Lao, S.: Eyeblink-based anti-spoofing in face recognition from a  generic webcamera. In: ICCV, IEEE (2007)  2. Patel, K., Han, H., Jain, A.K.: Cross-database face antispoofing with robust feature repre-  sentation. In: Chinese Conference on Biometric Recognition, Springer (2016)  3. de Freitas Pereira, T., Anjos, A., De Martino, J.M., Marcel, S.: LBP-TOP based countermea-  sure against face spoofing attacks. In: ACCV, Springer (2012)  4. de Freitas Pereira, T., Anjos, A., De Martino, J.M., Marcel, S.: Can face anti-spoofing coun-  termeasures work in a real world scenario? In: ICB, IEEE (2013)  5. Komulainen, J., Hadid, A., Pietikainen, M.: Context based face anti-spoofing. In: BTAS,  6. Yang, J., Lei, Z., Liao, S., Li, S.Z.: Face liveness detection with component dependent  IEEE (2013)  descriptor. In: ICB, IEEE (2013)  7. Li, L., Feng, X., Boulkenafet, Z., Xia, Z., Li, M., Hadid, A.: An original face anti-spoofing approach using partial convolutional neural network. In: Image Processing Theory Tools and Applications (IPTA), 2016 6th International Conference on, IEEE (2016)  8. Yang, J., Lei, Z., Li, S.Z.: Learn convolutional neural network for face anti-spoofing. arXiv  preprint arXiv:1408.5601 (2014)  9. Dong, C., Loy, C.C., He, K., Tang, X.: Learning a deep convolutional network for image  super-resolution. In: ECCV, Springer (2014)  10. Jourabloo, A., Feghahati, A., Jamzad, M.: New algorithms for recovering highly corrupted  images with impulse noise. Scientia Iranica 19(6) (2012) 1738-1745  11. Kulkarni, K., Lohit, S., Turaga, P., Kerviche, R., Ashok, A.: Reconnet: Non-iterative recon- struction of images from compressively sensed measurements. In: CVPR, IEEE (2016) 12. Pathak, D., Krahenbuhl, P., Donahue, J., Darrell, T., Efros, A.A.: Context encoders: Feature  learning by inpainting. In: CVPR, IEEE (2016)  13. Lefkimmiatis, S.: Non-local color image denoising with convolutional neural networks. In:  14. Tai, Y., Yang, J., Liu, X., Xu, C.: Memnet: A persistent memory network for image restora-  15. Tai, Y., Yang, J., Liu, X.: Image super-resolution via deep recursive residual network. In:  16. Zhou, R., Achanta, R., S¨usstrunk, S.: Deep residual network for joint demosaicing and  super-resolution. arXiv preprint arXiv:1802.06573 (2018)  17. Gharbi, M., Chaurasia, G., Paris, S., Durand, F.: Deep joint demosaicking and denoising.  ACM Trans. Graph. 35(6) (2016) 191  18. Liu, Y., Jourabloo, A., Liu, X.: Learning deep models for face anti-spoofing: Binary or  auxiliary supervision. In: CVPR, IEEE (2018)  19. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep convolutional  neural networks. In: NIPS. (2012)  20. Jourabloo, A., Liu, X.: Pose-invariant face alignment via CNN-based dense 3D model fitting.  Int. J. Comput. Vision 124(2) (April 2017) 187-203  21. M¨a¨att¨a, J., Hadid, A., Pietik¨ainen, M.: Face spoofing detection from single images using  micro-texture analysis. In: ICJB, IEEE (2011)  22. Patel, K., Han, H., Jain, A.K.: Secure face unlock: Spoof detection on smartphones. IEEE  Trans. Inf. Forens. Security 11(10) (2016) 2268-2283  23. Boulkenafet, Z., Komulainen, J., Hadid, A.: Face antispoofing using speeded-up robust fea- tures and fisher vector encoding. IEEE Signal Processing Letters 24(2) (2017) 141-145  CVPR, IEEE (2017)  tion. In: ICCV, IEEE (2017)  CVPR, IEEE (2017)   Face De-SpoofingReferences  1. Pan, G., Sun, L., Wu, Z., Lao, S.: Eyeblink-based anti-spoofing in face recognition from a  generic webcamera. In: ICCV, IEEE (2007)  2. Patel, K., Han, H., Jain, A.K.: Cross-database face antispoofing with robust feature repre-  sentation. In: Chinese Conference on Biometric Recognition, Springer (2016)  3. de Freitas Pereira, T., Anjos, A., De Martino, J.M., Marcel, S.: LBP-TOP based countermea-  sure against face spoofing attacks. In: ACCV, Springer (2012)  4. de Freitas Pereira, T., Anjos, A., De Martino, J.M., Marcel, S.: Can face anti-spoofing coun-  termeasures work in a real world scenario? In: ICB, IEEE (2013)  5. Komulainen, J., Hadid, A., Pietikainen, M.: Context based face anti-spoofing. In: BTAS,  6. Yang, J., Lei, Z., Liao, S., Li, S.Z.: Face liveness detection with component dependent  IEEE (2013)  descriptor. In: ICB, IEEE (2013)  7. Li, L., Feng, X., Boulkenafet, Z., Xia, Z., Li, M., Hadid, A.: An original face anti-spoofing approach using partial convolutional neural network. In: Image Processing Theory Tools and Applications (IPTA), 2016 6th International Conference on, IEEE (2016)  8. Yang, J., Lei, Z., Li, S.Z.: Learn convolutional neural network for face anti-spoofing. arXiv  preprint arXiv:1408.5601 (2014)  9. Dong, C., Loy, C.C., He, K., Tang, X.: Learning a deep convolutional network for image  super-resolution. In: ECCV, Springer (2014)  10. Jourabloo, A., Feghahati, A., Jamzad, M.: New algorithms for recovering highly corrupted  images with impulse noise. Scientia Iranica 19(6) (2012) 1738-1745  11. Kulkarni, K., Lohit, S., Turaga, P., Kerviche, R., Ashok, A.: Reconnet: Non-iterative recon- struction of images from compressively sensed measurements. In: CVPR, IEEE (2016) 12. Pathak, D., Krahenbuhl, P., Donahue, J., Darrell, T., Efros, A.A.: Context encoders: Feature  learning by inpainting. In: CVPR, IEEE (2016)  13. Lefkimmiatis, S.: Non-local color image denoising with convolutional neural networks. In:  14. Tai, Y., Yang, J., Liu, X., Xu, C.: Memnet: A persistent memory network for image restora-  15. Tai, Y., Yang, J., Liu, X.: Image super-resolution via deep recursive residual network. In:  16. Zhou, R., Achanta, R., S¨usstrunk, S.: Deep residual network for joint demosaicing and  super-resolution. arXiv preprint arXiv:1802.06573 (2018)  17. Gharbi, M., Chaurasia, G., Paris, S., Durand, F.: Deep joint demosaicking and denoising.  ACM Trans. Graph. 35(6) (2016) 191  18. Liu, Y., Jourabloo, A., Liu, X.: Learning deep models for face anti-spoofing: Binary or  auxiliary supervision. In: CVPR, IEEE (2018)  19. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep convolutional  neural networks. In: NIPS. (2012)  20. Jourabloo, A., Liu, X.: Pose-invariant face alignment via CNN-based dense 3D model fitting.  Int. J. Comput. Vision 124(2) (April 2017) 187-203  21. M¨a¨att¨a, J., Hadid, A., Pietik¨ainen, M.: Face spoofing detection from single images using  micro-texture analysis. In: ICJB, IEEE (2011)  22. Patel, K., Han, H., Jain, A.K.: Secure face unlock: Spoof detection on smartphones. IEEE  Trans. Inf. Forens. Security 11(10) (2016) 2268-2283  23. Boulkenafet, Z., Komulainen, J., Hadid, A.: Face antispoofing using speeded-up robust fea- tures and fisher vector encoding. IEEE Signal Processing Letters 24(2) (2017) 141-145  CVPR, IEEE (2017)  tion. In: ICCV, IEEE (2017)  CVPR, IEEE (2017)   16  Amin Jourabloo, Yaojie Liu, Xiaoming Liu  24. Boulkenafet, Z., Komulainen, J., Hadid, A.: Face anti-spoofing based on color texture anal-  ysis. In: ICIP, IEEE (2015)  25. Boulkenafet, Z., Komulainen, J., Hadid, A.: Face spoofing detection using colour texture  analysis. IEEE Trans. Inf. Forens. Security 11(8) (2016) 1818-1830  26. Siddiqui, T.A., Bharadwaj, S., Dhamecha, T.I., Agarwal, A., Vatsa, M., Singh, R., Ratha, N.:  Face anti-spoofing with multifeature videolet aggregation. In: ICPR, IEEE (2016)  27. Bao, W., Li, H., Li, N., Jiang, W.: A liveness detection method for face recognition based on  optical ﬂow field. In: IASP, IEEE (2009)  28. Feng, L., Po, L.M., Li, Y., Xu, X., Yuan, F., Cheung, T.C.H., Cheung, K.W.: Integration of image quality and motion cues for face anti-spoofing: a neural network approach. Journal of Visual Communication and Image Representation 38 (2016) 451-460  29. Xu, Z., Li, S., Deng, W.: Learning temporal features using LSTM-CNN architecture for face  anti-spoofing. In: IAPR Asian Conference, IEEE (2015)  30. Li, J., Wang, Y., Tan, T., Jain, A.K.: Live face detection based on the analysis of fourier  spectra. In: Biometric Technology for Human Identification, SPIE (2004)  31. Atoum, Y., Liu, Y., Jourabloo, A., Liu, X.: Face anti-spoofing using patch and depth-based  32. Tran, L., Yin, X., Liu, X.: Disentangled representation learning GAN for pose-invariant face  cnns. In: ICJB, IEEE (2017)  recognition. In: CVPR, IEEE (2017)  33. Buades, A., Coll, B., Morel, J.M.: A non-local algorithm for image denoising. In: CVPR,  IEEE (2005)  (2018)  34. Zhang, H., Sindagi, V., Patel, V.M.: Image de-raining using a conditional generative adver-  sarial network. arXiv preprint arXiv:1701.05957 (2017)  35. Zhang, H., Patel, V.M.: Densely connected pyramid dehazing network. In: CVPR, IEEE  36. Criminisi, A., P´erez, P., Toyama, K.: Region filling and object removal by exemplar-based  image inpainting. IEEE Trans. Image Process. 13(9) (2004) 1200-1212  37. Bertalmio, M., Vese, L., Sapiro, G., Osher, S.: Simultaneous structure and texture image  inpainting. IEEE Trans. Image Process. 12(8) (2003) 882-889  38. Chen, Y., Tai, Y., Liu, X., Shen, C., Yang, J.: FSRNet: End-to-end learning face super-  resolution with facial priors. In: CVPR, IEEE (2018)  39. Liu, Y., Shu, C.: A comparison of image inpainting techniques.  In: Sixth International  Conference on Graphic and Image Processing (ICGIP 2014), SPIE (2015)  40. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: CVPR,  IEEE (2016)  41. Liu, Y., Jourabloo, A., Ren, W., Liu, X.: Dense face alignment. In: ICCVW, IEEE (2017) 42. Johnson, J., Alahi, A., Fei-Fei, L.: Perceptual losses for real-time style transfer and super-  resolution. In: ECCV, Springer (2016)  43. Boulkenafet, Z., Komulainen, J., Li, L., Feng, X., Hadid, A.: OULU-NPU: A mobile face  presentation attack database with real-world variations. In: FG, IEEE (2017)  44. Zhang, Z., Yan, J., Liu, S., Lei, Z., Yi, D., Li, S.Z.: A face antispoofing database with diverse  45. Chingovska, I., Anjos, A., Marcel, S.: On the effectiveness of local binary patterns in face  46. Abadi, M., Agarwal, A., et al: TensorFlow: Large-scale machine learning on heterogeneous  47. ISO/IEC JTC 1/SC 37 Biometrics:  Information technology biometric presenta- tion attack detection part 1: Framework. international organization for standardization. https://www.iso.org/obp/ui/iso (2016)  48. Bengio, S., Mari´ethoz, J.: A statistical significance test for person authentication. In: Pro- ceedings of Odyssey 2004: The Speaker and Language Recognition Workshop. (2004)  attacks. In: ICB, IEEE (2012)  anti-spoofing, IEEE (2012)  systems (2015)   Face De-Spoofing49. Boulkenafet, Z.: A competition on generalized software-based face presentation attack de-  tection in mobile scenarios. In: ICJB, IEEE (2017)  50. Bharadwaj, S., Dhamecha, T.I., Vatsa, M., Singh, R.: Computationally efficient face spoofing  detection with motion magnification. In: CVPRW, IEEE (2013)  51. Pinto, A., Pedrini, H., Schwartz, W.R., Rocha, A.: Face spoofing detection through visual codebooks of spectral temporal cubes. IEEE Trans. Image Process. 24(12) (2015) 4726-4740 Journal of machine learning  52. Maaten, L.v.d., Hinton, G.: Visualizing data using t-SNE.  research 9(Nov) (2008) 2579-2605"}