{"1": "1. Akata, Z., Perronnin, F., Harchaoui, Z., Schmid, C.: Label-embedding for attribute- based classification. In: Proc. of Computer Vision and Pattern Recognition. pp. 819-826 (2013)  2. Akata, Z., Reed, S., Walter, D., Lee, H., Schiele, B.: Evaluation of output em- beddings for fine-grained image classification. In: Proc. of Computer Vision and Pattern Recognition. pp. 2927-2936 (2015)  3. Bucher, M., Herbin, S., Jurie, F.: Improving semantic embedding consistency by metric learning for zero-shot classification. In: Proc. of European Conference on Computer Vision (2016)  4. Changpinyo, S., Chao, W.L., Gong, B., Sha, F.: Synthesized classifiers for zero-shot learning. Proc. of Computer Vision and Pattern Recognition pp. 5327-5336 (2016) 5. Changpinyo, S., Chao, W.L., Sha, F.: Predicting visual exemplars of unseen classes for zero-shot learning. Proc. of International Conference on Computer Vision pp. 3496-3505 (2017)  6. Chao, W.L., Changpinyo, S., Gong, B., Sha, F.: An empirical study and analysis of generalized zero-shot learning for object recognition in the wild. In: Proc. of European Conference on Computer Vision (2016)  7. Demirel, B., Cinbis, R.G., Ikizler-Cinbis, N.: Attributes2classname: A discrimina- tive model for attribute-based unsupervised zero-shot learning. Proc. of Interna- tional Conference on Computer Vision pp. 1241-1250 (2017)  8. Ding, Z., Shao, M., Fu, Y.: Low-rank embedded ensemble semantic dictionary for zero-shot learning. Proc. of Computer Vision and Pattern Recognition pp. 6005- 6013 (2017)  9. Farhadi, A., Endres, I., Hoiem, D., Forsyth, D.: Describing objects by their at- tributes. In: Proc. of Computer Vision and Pattern Recognition. pp. 1778-1785 (2009)  10. Frome, A., Corrado, G.S., Shlens, J., Bengio, S., Dean, J., Ranzato, M., Mikolov, T.: Devise: A deep visual-semantic embedding model. In: Proc. of Advances in Neural Information Processing Systems. pp. 2121-2129 (2013)  11. Fu, Y., Hospedales, T.M., Xiang, T., Gong, S.: Transductive multi-view zero-shot learning. IEEE Transactions on Pattern Analysis and Machine Intelligence 37, 2332-2345 (2015)  12. Fu, Z.Y., Xiang, T.A., Kodirov, E., Gong, S.: Zero-shot object recognition by semantic manifold distance. Proc. of Computer Vision and Pattern Recognition pp. 2635-2644 (2015)  13. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: Proc. of Computer Vision and Pattern Recognition. pp. 770-778 (2016)  14. Jiang, H., Wang, R., Shan, S., Yang, Y., Chen, X.: Learning discriminative la- tent attributes for zero-shot classification. Proc. of International Conference on Computer Vision pp. 4233-4242 (2017)  15. Kodirov, E., Xiang, T., Fu, Z.Y., Gong, S.: Unsupervised domain adaptation for zero-shot learning. Proc. of International Conference on Computer Vision pp. 2452- 2460 (2015)  16. Kodirov, E., Xiang, T., Gong, S.: Semantic autoencoder for zero-shot learning.  Proc. of Computer Vision and Pattern Recognition pp. 4447-4456 (2017)  17. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Proc. of Advances in Neural Information Processing Systems. pp. 1097-1105 (2012)   Learning Class Prototypes via Structure Alignment for ZSLReferences  1. Akata, Z., Perronnin, F., Harchaoui, Z., Schmid, C.: Label-embedding for attribute- based classification. In: Proc. of Computer Vision and Pattern Recognition. pp. 819-826 (2013)  2. Akata, Z., Reed, S., Walter, D., Lee, H., Schiele, B.: Evaluation of output em- beddings for fine-grained image classification. In: Proc. of Computer Vision and Pattern Recognition. pp. 2927-2936 (2015)  3. Bucher, M., Herbin, S., Jurie, F.: Improving semantic embedding consistency by metric learning for zero-shot classification. In: Proc. of European Conference on Computer Vision (2016)  4. Changpinyo, S., Chao, W.L., Gong, B., Sha, F.: Synthesized classifiers for zero-shot learning. Proc. of Computer Vision and Pattern Recognition pp. 5327-5336 (2016) 5. Changpinyo, S., Chao, W.L., Sha, F.: Predicting visual exemplars of unseen classes for zero-shot learning. Proc. of International Conference on Computer Vision pp. 3496-3505 (2017)  6. Chao, W.L., Changpinyo, S., Gong, B., Sha, F.: An empirical study and analysis of generalized zero-shot learning for object recognition in the wild. In: Proc. of European Conference on Computer Vision (2016)  7. Demirel, B., Cinbis, R.G., Ikizler-Cinbis, N.: Attributes2classname: A discrimina- tive model for attribute-based unsupervised zero-shot learning. Proc. of Interna- tional Conference on Computer Vision pp. 1241-1250 (2017)  8. Ding, Z., Shao, M., Fu, Y.: Low-rank embedded ensemble semantic dictionary for zero-shot learning. Proc. of Computer Vision and Pattern Recognition pp. 6005- 6013 (2017)  9. Farhadi, A., Endres, I., Hoiem, D., Forsyth, D.: Describing objects by their at- tributes. In: Proc. of Computer Vision and Pattern Recognition. pp. 1778-1785 (2009)  10. Frome, A., Corrado, G.S., Shlens, J., Bengio, S., Dean, J., Ranzato, M., Mikolov, T.: Devise: A deep visual-semantic embedding model. In: Proc. of Advances in Neural Information Processing Systems. pp. 2121-2129 (2013)  11. Fu, Y., Hospedales, T.M., Xiang, T., Gong, S.: Transductive multi-view zero-shot learning. IEEE Transactions on Pattern Analysis and Machine Intelligence 37, 2332-2345 (2015)  12. Fu, Z.Y., Xiang, T.A., Kodirov, E., Gong, S.: Zero-shot object recognition by semantic manifold distance. Proc. of Computer Vision and Pattern Recognition pp. 2635-2644 (2015)  13. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: Proc. of Computer Vision and Pattern Recognition. pp. 770-778 (2016)  14. Jiang, H., Wang, R., Shan, S., Yang, Y., Chen, X.: Learning discriminative la- tent attributes for zero-shot classification. Proc. of International Conference on Computer Vision pp. 4233-4242 (2017)  15. Kodirov, E., Xiang, T., Fu, Z.Y., Gong, S.: Unsupervised domain adaptation for zero-shot learning. Proc. of International Conference on Computer Vision pp. 2452- 2460 (2015)  16. Kodirov, E., Xiang, T., Gong, S.: Semantic autoencoder for zero-shot learning.  Proc. of Computer Vision and Pattern Recognition pp. 4447-4456 (2017)  17. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Proc. of Advances in Neural Information Processing Systems. pp. 1097-1105 (2012)   16  H. Jiang, R. Wang, S. Shan, X. Chen  18. Kruskal, J.B.: Multidimensional scaling by optimizing goodness of fit to a non-  metric hypothesis. Psychometrika 29(1), 1-27 (1964)  19. Lampert, C.H., Nickisch, H., Harmeling, S.: Learning to detect unseen object class- es by between-class attribute transfer. In: Proc. of Computer Vision and Pattern Recognition. pp. 951-958 (2009)  20. Long, Y., Liu, L., Shen, F., Shao, L., Li, X.: Zero-shot learning using synthesised unseen visual data with diﬀusion regularisation. IEEE Transactions on Pattern Analysis and Machine Intelligence pp. 1-1 (2018)  21. van der Maaten, L., Hinton, G.E.: Visualizing data using t-sne. In: Journal of  Machine Learning Research. vol. 9, pp. 2579-2605 (2008)  22. Morgado, P., Vasconcelos, N.: Semantically consistent regularization for zero-shot recognition. Proc. of Computer Vision and Pattern Recognition pp. 2037-2046 (2017)  23. Norouzi, M., Mikolov, T., Bengio, S., Singer, Y., Shlens, J., Frome, A., Corrado, G.S., Dean, J.: Zero-shot learning by convex combination of semantic embeddings. Proc. of International Conference on Learning Representations (2014)  24. Paredes, B.R., Torr, P.: An embarrassingly simple approach to zero-shot learning. In: Proc. of International Conference on Machine Learning. pp. 2152-2161 (2015) 25. Patterson, G., Xu, C., Su, H., Hays, J.: The SUN attribute database: Beyond cat- egories for deeper scene understanding. International Journal of Computer Vision 108(1-2), 59-81 (2014)  26. Reed, S.E., Akata, Z., Schiele, B., Lee, H.: Learning deep representations of fine- grained visual descriptions. Proc. of Computer Vision and Pattern Recognition pp. 49-58 (2016)  27. Romera-Paredes, B., Torr, P.H.S.: An embarrassingly simple approach to zero-shot learning. In: Proc. of International Conference on Machine Learning (2015) 28. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., Berg, A.C., Fei-Fei, L.: Imagenet large s- cale visual recognition challenge. International Journal of Computer Vision 115(3), 211-252 (2015)  29. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. CoRR abs/1409.1556 (2014)  30. Socher, R., Ganjoo, M., Sridhar, H., Bastani, O., Manning, C.D., Ng, A.Y.: Zero- shot learning through cross-modal transfer. In: Proc. of Advances in Neural Infor- mation Processing Systems. pp. 935-943 (2013)  31. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Van- houcke, V., Rabinovich, A.: Going deeper with convolutions. In: Proc. of Computer Vision and Pattern Recognition. pp. 1-9 (2015)  32. Wah, C., Branson, S., Welinder, P., Perona, P., Belongie, S.: The Caltech-UCSD  Birds-200-2011 Dataset. Tech. rep. (2011)  33. Wah, C., Branson, S., Welinder, P., Perona, P., Belongie, S.J.: The caltech-ucsd birds-200-2011 dataset. Technical Report CNS-TR-2011-001, California Institute of Technology (2011)  34. Wang, L., Li, Y., Lazebnik, S.: Learning deep structure-preserving image-text em- beddings. Proc. of Computer Vision and Pattern Recognition pp. 5005-5013 (2016) 35. Xian, Y., Akata, Z., Sharma, G., Nguyen, Q.N., Hein, M., Schiele, B.: Latent embeddings for zero-shot classification. Proc. of Computer Vision and Pattern Recognition pp. 69-77 (2016)  36. Xian, Y., Schiele, B., Akata, Z.: Zero-shot learning - the good, the bad and the  ugly. In: Proc. of Computer Vision and Pattern Recognition (2017)   Learning Class Prototypes via Structure Alignment for ZSL37. Xu, X., Shen, F., Yang, Y., Zhang, D., Shen, H.T., Song, J.: Matrix tri-factorization with manifold regularizations for zero-shot learning. Proc. of Computer Vision and Pattern Recognition pp. 2007-2016 (2017)  38. Zhang, L., Xiang, T., Gong, S.: Learning a deep embedding model for zero-shot learning. Proc. of Computer Vision and Pattern Recognition pp. 3010-3019 (2017) 39. Zhang, Z., Saligrama, V.: Zero-shot learning via semantic similarity embedding. Proc. of International Conference on Computer Vision pp. 4166-4174 (2015) 40. Zhang, Z., Saligrama, V.: Zero-shot learning via joint latent similarity embedding.  Proc. of Computer Vision and Pattern Recognition pp. 6034-6042 (2016)  41. Zhu, X., Anguelov, D., Ramanan, D.: Capturing long-tail distributions of object subcategories. In: Proc. of Computer Vision and Pattern Recognition. pp. 915-922 (2014)"}