{"1": "1. Alameda-Pineda, X., Ricci, E., Yan, Y., Sebe, N.: Recognizing emotions from ab-  stract paintings using non-linear matrix completion. In: CVPR (2016)  2. Bengio, Y., Louradour, J., Collobert, R., Weston, J.: Curriculum learning. In:  3. Cesa-Bianchi, N., Gentile, C., Zaniboni, L.: Incremental algorithms for hierarchical  ICML (2009)  classification. JMLR (2006)  4. Chen, T., Borth, D., Darrell, T., Chang, S.F.: Deepsentibank: Visual sentiment concept classification with deep convolutional neural networks. arXiv preprint arXiv:1410.8586 (2014)  5. Chen, X., Gupta, A.: Webly supervised learning of convolutional networks. In:  ICCV (2015)  6. Chu, W.S., Song, Y., Jaimes, A.: Video co-summarization: Video summarization  by visual co-occurrence. In: CVPR (2015)  7. Chu, W.S., De la Torre, F., Cohn, J.F.: Selective transfer machine for personalized  facial expression analysis. TPAMI (2017)  8. Deng, J., Krause, J., Berg, A.C., Fei-Fei, L.: Hedging your bets: Optimizing accuracy-specificity trade-oﬀs in large scale visual recognition. In: CVPR (2012) 9. Deng, J., Satheesh, S., Berg, A.C., Li, F.: Fast and balanced: Eﬃcient label tree  learning for large scale object recognition. In: NIPS (2011)  10. Divvala, S.K., Farhadi, A., Guestrin, C.: Learning everything about anything:  Webly-supervised visual concept learning. In: CVPR (2014)  11. Dong, Q., Gong, S., Zhu, X.: Multi-task curriculum transfer deep learning of cloth-  ing attributes. In: WACV (2017)  12. Du, S., Tao, Y., Martinez, A.M.: Compound facial expressions of emotion. Pro-  ceedings of the National Academy of Sciences (2014)  13. Ekman, P.: An argument for basic emotions. Cognition & emotion (1992) 14. Eleftheriadis, S., Rudovic, O., Pantic, M.: Discriminative shared gaussian processes  for multiview and view-invariant facial expression recognition. TIP (2015)  15. Eleftheriadis, S., Rudovic, O., Pantic, M.: Joint facial action unit detection and  feature fusion: A multi-conditional learning approach. TIP (2016)  16. Fabian Benitez-Quiroz, C., Srinivasan, R., Martinez, A.M.: Emotionet: An accu- rate, real-time algorithm for the automatic annotation of a million facial expres- sions in the wild. In: CVPR (2016)  17. Gan, C., Sun, C., Duan, L., Gong, B.: Webly-supervised video recognition by mu- tually voting for relevant web images and web video frames. In: ECCV (2016) 18. Gan, C., Yao, T., Yang, K., Yang, Y., Mei, T.: You lead, we exceed: Labor-free video concept learning by jointly exploiting web videos and images. In: CVPR (2016)  19. Gao, R., Grauman, K.: On-demand learning for deep image restoration. In: ICCV  20. Griﬃn, G., Perona, P.: Learning and using taxonomies for fast visual categoriza-  21. Gygli, M., Grabner, H., Riemenschneider, H., Van Gool, L.: Creating summaries  22. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  (2017)  tion. In: CVPR. pp. 1-8 (2008)  from user videos. In: ECCV (2014)  In: CVPR (2016)  23. Hussain, Z., Zhang, M., Zhang, X., Ye, K., Thomas, C., Agha, Z., Ong, N., Ko- vashka, A.: Automatic understanding of image and video advertisements. In: CVPR (2017)   Contemplating Visual EmotionsReferences  1. Alameda-Pineda, X., Ricci, E., Yan, Y., Sebe, N.: Recognizing emotions from ab-  stract paintings using non-linear matrix completion. In: CVPR (2016)  2. Bengio, Y., Louradour, J., Collobert, R., Weston, J.: Curriculum learning. In:  3. Cesa-Bianchi, N., Gentile, C., Zaniboni, L.: Incremental algorithms for hierarchical  ICML (2009)  classification. JMLR (2006)  4. Chen, T., Borth, D., Darrell, T., Chang, S.F.: Deepsentibank: Visual sentiment concept classification with deep convolutional neural networks. arXiv preprint arXiv:1410.8586 (2014)  5. Chen, X., Gupta, A.: Webly supervised learning of convolutional networks. In:  ICCV (2015)  6. Chu, W.S., Song, Y., Jaimes, A.: Video co-summarization: Video summarization  by visual co-occurrence. In: CVPR (2015)  7. Chu, W.S., De la Torre, F., Cohn, J.F.: Selective transfer machine for personalized  facial expression analysis. TPAMI (2017)  8. Deng, J., Krause, J., Berg, A.C., Fei-Fei, L.: Hedging your bets: Optimizing accuracy-specificity trade-oﬀs in large scale visual recognition. In: CVPR (2012) 9. Deng, J., Satheesh, S., Berg, A.C., Li, F.: Fast and balanced: Eﬃcient label tree  learning for large scale object recognition. In: NIPS (2011)  10. Divvala, S.K., Farhadi, A., Guestrin, C.: Learning everything about anything:  Webly-supervised visual concept learning. In: CVPR (2014)  11. Dong, Q., Gong, S., Zhu, X.: Multi-task curriculum transfer deep learning of cloth-  ing attributes. In: WACV (2017)  12. Du, S., Tao, Y., Martinez, A.M.: Compound facial expressions of emotion. Pro-  ceedings of the National Academy of Sciences (2014)  13. Ekman, P.: An argument for basic emotions. Cognition & emotion (1992) 14. Eleftheriadis, S., Rudovic, O., Pantic, M.: Discriminative shared gaussian processes  for multiview and view-invariant facial expression recognition. TIP (2015)  15. Eleftheriadis, S., Rudovic, O., Pantic, M.: Joint facial action unit detection and  feature fusion: A multi-conditional learning approach. TIP (2016)  16. Fabian Benitez-Quiroz, C., Srinivasan, R., Martinez, A.M.: Emotionet: An accu- rate, real-time algorithm for the automatic annotation of a million facial expres- sions in the wild. In: CVPR (2016)  17. Gan, C., Sun, C., Duan, L., Gong, B.: Webly-supervised video recognition by mu- tually voting for relevant web images and web video frames. In: ECCV (2016) 18. Gan, C., Yao, T., Yang, K., Yang, Y., Mei, T.: You lead, we exceed: Labor-free video concept learning by jointly exploiting web videos and images. In: CVPR (2016)  19. Gao, R., Grauman, K.: On-demand learning for deep image restoration. In: ICCV  20. Griﬃn, G., Perona, P.: Learning and using taxonomies for fast visual categoriza-  21. Gygli, M., Grabner, H., Riemenschneider, H., Van Gool, L.: Creating summaries  22. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  (2017)  tion. In: CVPR. pp. 1-8 (2008)  from user videos. In: ECCV (2014)  In: CVPR (2016)  23. Hussain, Z., Zhang, M., Zhang, X., Ye, K., Thomas, C., Agha, Z., Ong, N., Ko- vashka, A.: Automatic understanding of image and video advertisements. In: CVPR (2017)   16  R. Panda, J. Zhang, H. Li, J. Lee, X. Lu, and A. K. Roy-Chowdhury  24. Jia, Y., Abbott, J.T., Austerweil, J.L., Griﬃths, T., Darrell, T.: Visual concept learning: Combining machine vision and bayesian generalization on concept hier- archies. In: NIPS (2013)  25. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: MM (2014)  26. Joo, J., Li, W., Steen, F.F., Zhu, S.C.: Visual persuasion: Inferring communicative  27. Jou, B., Bhattacharya, S., Chang, S.F.: Predicting viewer perceived emotions in  intents of images. In: CVPR (2014)  animated gifs. In: MM (2014)  28. Joulin, A., van der Maaten, L., Jabri, A., Vasilache, N.: Learning visual features  from large weakly supervised data. In: ECCV (2016)  29. Kahou, S.E., Pal, C., Bouthillier, X., Froumenty, P., G¨ul¸cehre, C¸ ., Memisevic, R., Vincent, P., Courville, A., Bengio, Y., Ferrari, R.C., et al.: Combining modality specific deep neural networks for emotion recognition in video. In: ICMI (2013) 30. Kim, H.R., Kim, S.J., Lee, I.K.: Building emotional machines: Recognizing image  emotions through deep neural networks. arXiv preprint arXiv:1705.07543 (2017)  31. Kosti, R., Alvarez, J.M., Recasens, A., Lapedriza, A.: Emotion recognition in con-  text. In: CVPR (2017)  32. Krause, J., Sapp, B., Howard, A., Zhou, H., Toshev, A., Duerig, T., Philbin, J., Fei- Fei, L.: The unreasonable eﬀectiveness of noisy data for fine-grained recognition. In: ECCV (2016)  33. Lee, Y.J., Grauman, K.: Learning the easy things first: Self-paced visual category  discovery. In: CVPR (2011)  34. Li, L.J., Wang, C., Lim, Y., Blei, D.M., Fei-Fei, L.: Building and using a seman-  tivisual image hierarchy. In: CVPR (2010)  35. Li, W., Wang, L., Li, W., Agustsson, E., Van Gool, L.: Webvision database: Visual learning and understanding from web data. arXiv preprint arXiv:1708.02862 (2017) 36. Liang, J., Jiang, L., Meng, D., Hauptmann, A.: Exploiting multi-modal curriculum in noisy web data for large-scale concept learning. arXiv preprint arXiv:1607.04780 (2016)  37. Liang, J., Jiang, L., Meng, D., Hauptmann, A.G.: Learning to detect concepts from  webly-labeled video data. In: IJCAI (2016)  38. Machajdik, J., Hanbury, A.: Aﬀective image classification using features inspired  by psychology and art theory. In: MM (2010)  39. Marszalek, M., Schmid, C.: Semantic hierarchies for visual object recognition. In:  CVPR (2007)  40. Ng, H.W., Nguyen, V.D., Vonikakis, V., Winkler, S.: Deep learning for emotion  recognition on small datasets using transfer learning. In: ICMI (2015)  41. Panda, R., Roy-Chowdhury, A.K.: Collaborative summarization of topic-related  videos. CVPR (2017)  (2001)  42. Parrott, W.G.: Emotions in social psychology: Essential readings. Psychology Press  43. Peng, K.C., Chen, T., Sadovnik, A., Gallagher, A.C.: A mixed bag of emotions:  Model, predict, and transfer emotion distributions. In: CVPR (2015)  44. Pentina, A., Sharmanska, V., Lampert, C.H.: Curriculum learning of multiple  tasks. In: CVPR (2015)  45. Plutchik, R., Kellerman, H.: Emotion, Theory, Research, and Experience: Theory,  Research and Experience. Academic press (1980)  46. Silla Jr, C.N., Freitas, A.A.: A survey of hierarchical classification across diﬀerent  application domains. Data Mining and Knowledge Discovery (2011)   Contemplating Visual Emotions47. Soleymani, M., Asghari-Esfeden, S., Fu, Y., Pantic, M.: Analysis of eeg signals and  facial expressions for continuous emotion detection. TAC (2016)  48. Srivastava, N., Salakhutdinov, R.R.: Discriminative transfer learning with tree-  49. Sukhbaatar, S., Fergus, R.: Learning from noisy labels with deep neural networks.  based priors. In: NIPS (2013)  arXiv preprint arXiv:1406.2080 (2014)  50. Sun, C., Shrivastava, A., Singh, S., Gupta, A.: Revisiting unreasonable eﬀectiveness  of data in deep learning era. In: ICCV (2017)  51. Torralba, A., Efros, A.A.: Unbiased look at dataset bias. In: CVPR (2011) 52. Tousch, A.M., Herbin, S., Audibert, J.Y.: Semantic hierarchies for image annota-  tion: A survey. PR (2012)  53. Tran, D., Bourdev, L., Fergus, R., Torresani, L., Paluri, M.: Learning spatiotem-  poral features with 3d convolutional networks. In: ICCV (2015)  54. Verma, N., Mahajan, D., Sellamanickam, S., Nair, V.: Learning hierarchical simi-  larity metrics. In: CVPR (2012)  55. Wang, D., Shen, Z., Shao, J., Zhang, W., Xue, X., Zhang, Z.: Multiple granularity  descriptors for fine-grained categorization. In: ICCV (2015)  56. Wang, X., Jia, J., Tang, J., Wu, B., Cai, L., Xie, L.: Modeling emotion inﬂuence  in image social networks. TAC (2015)  57. Wu, B., Jia, J., Yang, Y., Zhao, P., Tang, J., Tian, Q.: Inferring emotional tags  from social images with user demographics. TMM (2017)  58. Xiao, T., Zhang, J., Yang, K., Peng, Y., Zhang, Z.: Error-driven incremental learn- ing in deep convolutional neural network for large-scale image classification. In: MM (2014)  59. Xu, B., Fu, Y., Jiang, Y.G., Li, B., Sigal, L.: Heterogeneous knowledge transfer in  video emotion recognition, attribution and summarization. TAC (2016)  60. Xu, B., Fu, Y., Jiang, Y.G., Li, B., Sigal, L.: Video emotion recognition with ferred  deep feature encodings. In: ICMR (2016)  61. Yan, Z., Zhang, H., Piramuthu, R., Jagadeesh, V., DeCoste, D., Di, W., Yu, Y.: Hd-cnn: hierarchical deep convolutional neural networks for large scale visual recog- nition. In: ICCV (2015)  62. You, Q., Luo, J., Jin, H., Yang, J.: Robust image sentiment analysis using progres-  sively trained and domain transferred deep networks. In: AAAI (2015)  63. You, Q., Luo, J., Jin, H., Yang, J.: Building a large scale dataset for image emotion  recognition: The fine print and the benchmark. In: AAAI (2016)  64. Zhang, Y., David, P., Gong, B.: Curriculum domain adaptation for semantic seg-  mentation of urban scenes. arXiv preprint arXiv:1707.09465 (2017)  65. Zhao, S., Gao, Y., Jiang, X., Yao, H., Chua, T.S., Sun, X.: Exploring principles-  of-art features for image emotion recognition. In: MM (2014)"}