{"1": "1. Goodfellow, I.J., Shlens, J., Szegedy, C.: Explaining and harnessing adversarial  examples. In: ICLR. (2015)  2. Szegedy, C., Zaremba, W., Sutskever, I., Bruna, J., Erhan, D., Goodfellow, I.,  Fergus, R.: Intriguing properties of neural networks. In: ICLR. (2014)  3. Kurakin, A., Goodfellow, I., Bengio, S.: Adversarial examples in the physical world.  In: ICLR Workshop. (2017)  4. Pevn´y, T., Filler, T., Bas, P. In: Using High-Dimensional Image Models to Per- form Highly Undetectable Steganography. Springer Berlin Heidelberg, Berlin, Hei- delberg (2010) 161-177  5. Bi, N., Sun, Q., Huang, D., Yang, Z., Huang, J.: Robust image watermarking based on multiband wavelets and empirical mode decomposition. IEEE Transactions on Image Processing (2007)  6. Papernot, N., McDaniel, P., Goodfellow, I., Jha, S., Celik, Z.B., Swami, A.: Prac- tical black-box attacks against machine learning. In: Proceedings of the 2017 ACM on Asia Conference on Computer and Communications Security, ACM (2017) 506- 519  7. Van Schyndel, R.G., Tirkel, A.Z., Osborne, C.F.: A digital watermark. In: IEEE  Converence on Image Processing, 1994, IEEE (1994)  8. Wolfgang, R.B., Delp, E.J.: A watermark for digital images. In: Image Processing, 1996. Proceedings., International Conference on. Volume 3., IEEE (1996) 219-222 9. Qin, J., Xiang, X., Wang, M.X.: A review on detection of LSB matching steganog-  raphy. Information Technology Journal 9(8) (aug 2010) 1725-1738  10. Holub, V., Fridrich, J.: Designing steganographic distortion using directional fil- ters. In: 2012 IEEE International Workshop on Information Forensics and Security (WIFS). (Dec 2012) 234-239  11. Holub, V., Fridrich, J., Denemark, T.: Universal distortion function for steganog- raphy in an arbitrary domain. EURASIP Journal on Information Security 2014(1) (2014) 1  12. Cox, I.J., Kilian, J., Leighton, F.T., Shamoon, T.: Secure spread spectrum wa- termarking for multimedia. IEEE transactions on image processing 6(12) (1997) 1673-1687  13. Hsieh, M.S., Tseng, D.C., Huang, Y.H.: Hiding digital watermarks using multireso- lution wavelet transform. IEEE Transactions on industrial electronics 48(5) (2001) 875-882  14. Pereira, S., Pun, T.: Robust template matching for aﬃne resistant image water-  marks. IEEE transactions on image Processing 9(6) (2000) 1123-1129  15. Potdar, V., Han, S., Chang, E.: A survey of digital image watermarking techniques. In: 3rd IEEE International Conference on Industrial Informatics (INDIN 2005), IEEE (2005) 709-716  16. Zheng, D., Zhao, J., El Saddik, A.: Rst-invariant digital image watermarking based on log-polar mapping and phase correlation. IEEE transactions on circuits and systems for video technology (2003)  17. Isac, B., Santhi, V.: A study on digital image and video watermarking schemes us- ing neural networks. International Journal of Computer Applications 12(9) (2011) 1-6  18. Jin, C., Wang, S.: Applications of a neural network to estimate watermark em- In: Workshop on Image Analysis for Multimedia Interactive  bedding strength. Services, IEEE (2007)   HiDDeN: Hiding Data With Deep NetworksReferences  1. Goodfellow, I.J., Shlens, J., Szegedy, C.: Explaining and harnessing adversarial  examples. In: ICLR. (2015)  2. Szegedy, C., Zaremba, W., Sutskever, I., Bruna, J., Erhan, D., Goodfellow, I.,  Fergus, R.: Intriguing properties of neural networks. In: ICLR. (2014)  3. Kurakin, A., Goodfellow, I., Bengio, S.: Adversarial examples in the physical world.  In: ICLR Workshop. (2017)  4. Pevn´y, T., Filler, T., Bas, P. In: Using High-Dimensional Image Models to Per- form Highly Undetectable Steganography. Springer Berlin Heidelberg, Berlin, Hei- delberg (2010) 161-177  5. Bi, N., Sun, Q., Huang, D., Yang, Z., Huang, J.: Robust image watermarking based on multiband wavelets and empirical mode decomposition. IEEE Transactions on Image Processing (2007)  6. Papernot, N., McDaniel, P., Goodfellow, I., Jha, S., Celik, Z.B., Swami, A.: Prac- tical black-box attacks against machine learning. In: Proceedings of the 2017 ACM on Asia Conference on Computer and Communications Security, ACM (2017) 506- 519  7. Van Schyndel, R.G., Tirkel, A.Z., Osborne, C.F.: A digital watermark. In: IEEE  Converence on Image Processing, 1994, IEEE (1994)  8. Wolfgang, R.B., Delp, E.J.: A watermark for digital images. In: Image Processing, 1996. Proceedings., International Conference on. Volume 3., IEEE (1996) 219-222 9. Qin, J., Xiang, X., Wang, M.X.: A review on detection of LSB matching steganog-  raphy. Information Technology Journal 9(8) (aug 2010) 1725-1738  10. Holub, V., Fridrich, J.: Designing steganographic distortion using directional fil- ters. In: 2012 IEEE International Workshop on Information Forensics and Security (WIFS). (Dec 2012) 234-239  11. Holub, V., Fridrich, J., Denemark, T.: Universal distortion function for steganog- raphy in an arbitrary domain. EURASIP Journal on Information Security 2014(1) (2014) 1  12. Cox, I.J., Kilian, J., Leighton, F.T., Shamoon, T.: Secure spread spectrum wa- termarking for multimedia. IEEE transactions on image processing 6(12) (1997) 1673-1687  13. Hsieh, M.S., Tseng, D.C., Huang, Y.H.: Hiding digital watermarks using multireso- lution wavelet transform. IEEE Transactions on industrial electronics 48(5) (2001) 875-882  14. Pereira, S., Pun, T.: Robust template matching for aﬃne resistant image water-  marks. IEEE transactions on image Processing 9(6) (2000) 1123-1129  15. Potdar, V., Han, S., Chang, E.: A survey of digital image watermarking techniques. In: 3rd IEEE International Conference on Industrial Informatics (INDIN 2005), IEEE (2005) 709-716  16. Zheng, D., Zhao, J., El Saddik, A.: Rst-invariant digital image watermarking based on log-polar mapping and phase correlation. IEEE transactions on circuits and systems for video technology (2003)  17. Isac, B., Santhi, V.: A study on digital image and video watermarking schemes us- ing neural networks. International Journal of Computer Applications 12(9) (2011) 1-6  18. Jin, C., Wang, S.: Applications of a neural network to estimate watermark em- In: Workshop on Image Analysis for Multimedia Interactive  bedding strength. Services, IEEE (2007)   16  Zhu*, Kaplan*, Johnson and Fei-Fei  19. Kandi, H., Mishra, D., Gorthi, S.R.S.: Exploring the learning capabilities of con- volutional neural networks for robust image watermarking. Computers & Security (2017)  20. Mun, S.M., Nam, S.H., Jang, H.U., Kim, D., Lee, H.K.: A robust blind watermark-  ing using convolutional neural network. arXiv preprint arXiv:1704.03248 (2017)  21. Hayes, J., Danezis, G.: Generating steganographic images via adversarial training.  In: NIPS. (2017)  22. Baluja, S.: Hiding images in plain sight: Deep steganography. In: NIPS. (2017) 23. Abadi, M., Andersen, D.G.: Learning to protect communications with adversarial  neural cryptography. arXiv preprint arXiv:1610.06918 (2016)  24. Uchida, Y., Nagai, Y., Sakazawa, S., Satoh, S.: Embedding watermarks into deep neural networks. In: International Conference on Multimedia Retrieval. (2017) 25. Fang, T., Jaggi, M., Argyraki, K.: Generating steganographic text with LSTMs. In: ACL Student Research Workshop 2017. Number EPFL-CONF-229881 (2017) 26. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S.,  Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS. (2014)  27. Wallace, G.K.: The jpeg still picture compression standard. IEEE transactions on  consumer electronics 38(1) (1992) xviii-xxxiv  28. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P.,  Zitnick, C.L.: Microsoft COCO: Common objects in context. In: ECCV. (2014)  29. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In: ICLR. (2015) 30. Lerch-Hostalot, D., Megas, D.: Unsupervised steganalysis based on artificial train- ing sets. Engineering Applications of Artificial Intelligence 50 (2016) 45 - 59 31. Bas, P., Filler, T., Pevn`y, T.: break our steganographic system: The ins and outs of organizing BOSS. In: International Workshop on Information Hiding, Springer (2011) 59-70  32. Digimarc: Digimarc. https://www.digimarc.com/home"}