{"1": "1. Antonacopoulos, A., Karatzas, D.: Document image analysis for World War II personal records. In: Workshop on Document Image Analysis for Libraries. pp. 336-341. IEEE (2004)  2. Avidan, S., Shamir, A.: Seam carving for  resiz- In: ACM SIGGRAPH 2007 Papers. SIGGRAPH ’07, ACM (2007).  content-aware  image  ing. https://doi.org/10.1145/1275808.1276390  3. Bluche, T.: Joint line segmentation and transcription for end-to-end handwritten paragraph recognition. In: Advances in Neural Information Processing Systems (NIPS). pp. 838-846 (2016)  4. Bluche, T., Louradour, J., Messina, R.: Scan, attend and read: End-to-end hand-  written paragraph recognition with MDLSTM attention (04 2016)  5. Boiangiu, C.A., Tanase, M., Ioanitescu, R.: Handwritten documents text line seg- mentation based on information energy. International Journal of Computers, Com- munications and Control (IJCCC) 9, 8-15 (12 2014)  6. Bunke, H., Bengio, S., Vinciarelli, A.: Oﬄine recognition of unconstrained hand- written texts using HMMs and statistical language models. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 26(6), 709-720 (2004)  7. Diem, M., Kleber, F., Fiel, S., Gr¨uning, T., Gatos, B.: cBAD: ICDAR2017 com- petition on baseline detection. In: 14th International Conference on Document Analysis and Recognition (ICDAR). pp. 1355-1360. IEEE (2017)  8. Erhan, D., Szegedy, C., Toshev, A., Anguelov, D.: Scalable object detection us- ing deep neural networks. CoRR abs/1312.2249 (2013), http://arxiv.org/abs/ 1312.2249  9. Frinken, V., Fischer, A., Mart´ınez-Hinarejos, C.D.: Handwriting recognition in historical documents using very large vocabularies. In: 2nd International Workshop on Historical Document Imaging and Processing (HIP). pp. 67-72. ACM (2013)  10. Graves, A., Fern´andez, S., Gomez, F., Schmidhuber, J.: Connectionist temporal classification: Labelling unsegmented sequence data with recurrent neural net- works. In: 23rd International Conference on Machine Learning. pp. 369-376. ACM (2006)  11. Graves, A., Liwicki, M., Fern´andez, S., Bertolami, R., Bunke, H., Schmidhuber, J.: A novel connectionist system for unconstrained handwriting recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 31(5), 855- 868 (2009)  12. Graves, A., Schmidhuber, J.: Oﬄine handwriting recognition with multidimen- sional recurrent neural networks. In: Advances in Neural Information Processing Systems (NIPS). pp. 545-552 (2009) 13. Ha, J., Haralick, R.M., Phillips,  the bounding-box project. Analysis and Recognition (ICDAR). vol. 2, pp. 1119-1122. https://doi.org/10.1109/ICDAR.1995.602115  I.T.: Document page decomposition by In: 3rd International Conference on Document IEEE (1995).  14. He, J., Downton, A.C.: User-assisted archive document image analysis for digi- tal library construction. In: International Conference on Document Analysis and Recognition. pp. 498-502. IEEE (2003)  15. Jaderberg, M., Simonyan, K., Zisserman, A., Kavukcuoglu, K.: Spatial transformer networks. In: Advances in Neural Information Processing Systems (NIPS), pp. 2017-2025 (2015)   Start, Follow, Read: End-to-End Full-Page Handwriting RecognitionReferences  1. Antonacopoulos, A., Karatzas, D.: Document image analysis for World War II personal records. In: Workshop on Document Image Analysis for Libraries. pp. 336-341. IEEE (2004)  2. Avidan, S., Shamir, A.: Seam carving for  resiz- In: ACM SIGGRAPH 2007 Papers. SIGGRAPH ’07, ACM (2007).  content-aware  image  ing. https://doi.org/10.1145/1275808.1276390  3. Bluche, T.: Joint line segmentation and transcription for end-to-end handwritten paragraph recognition. In: Advances in Neural Information Processing Systems (NIPS). pp. 838-846 (2016)  4. Bluche, T., Louradour, J., Messina, R.: Scan, attend and read: End-to-end hand-  written paragraph recognition with MDLSTM attention (04 2016)  5. Boiangiu, C.A., Tanase, M., Ioanitescu, R.: Handwritten documents text line seg- mentation based on information energy. International Journal of Computers, Com- munications and Control (IJCCC) 9, 8-15 (12 2014)  6. Bunke, H., Bengio, S., Vinciarelli, A.: Oﬄine recognition of unconstrained hand- written texts using HMMs and statistical language models. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 26(6), 709-720 (2004)  7. Diem, M., Kleber, F., Fiel, S., Gr¨uning, T., Gatos, B.: cBAD: ICDAR2017 com- petition on baseline detection. In: 14th International Conference on Document Analysis and Recognition (ICDAR). pp. 1355-1360. IEEE (2017)  8. Erhan, D., Szegedy, C., Toshev, A., Anguelov, D.: Scalable object detection us- ing deep neural networks. CoRR abs/1312.2249 (2013), http://arxiv.org/abs/ 1312.2249  9. Frinken, V., Fischer, A., Mart´ınez-Hinarejos, C.D.: Handwriting recognition in historical documents using very large vocabularies. In: 2nd International Workshop on Historical Document Imaging and Processing (HIP). pp. 67-72. ACM (2013)  10. Graves, A., Fern´andez, S., Gomez, F., Schmidhuber, J.: Connectionist temporal classification: Labelling unsegmented sequence data with recurrent neural net- works. In: 23rd International Conference on Machine Learning. pp. 369-376. ACM (2006)  11. Graves, A., Liwicki, M., Fern´andez, S., Bertolami, R., Bunke, H., Schmidhuber, J.: A novel connectionist system for unconstrained handwriting recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 31(5), 855- 868 (2009)  12. Graves, A., Schmidhuber, J.: Oﬄine handwriting recognition with multidimen- sional recurrent neural networks. In: Advances in Neural Information Processing Systems (NIPS). pp. 545-552 (2009) 13. Ha, J., Haralick, R.M., Phillips,  the bounding-box project. Analysis and Recognition (ICDAR). vol. 2, pp. 1119-1122. https://doi.org/10.1109/ICDAR.1995.602115  I.T.: Document page decomposition by In: 3rd International Conference on Document IEEE (1995).  14. He, J., Downton, A.C.: User-assisted archive document image analysis for digi- tal library construction. In: International Conference on Document Analysis and Recognition. pp. 498-502. IEEE (2003)  15. Jaderberg, M., Simonyan, K., Zisserman, A., Kavukcuoglu, K.: Spatial transformer networks. In: Advances in Neural Information Processing Systems (NIPS), pp. 2017-2025 (2015)   16  C. Wigington et al.  16. Kozielski, M., Rybach, D., Hahn, S., Schlter, R., Ney, H.: Open vocabulary hand- writing recognition using combined word-level and character-level language models. In: 2013 IEEE International Conference on Acoustics, Speech and Signal Process- ing. pp. 8257-8261 (May 2013). https://doi.org/10.1109/ICASSP.2013.6639275 17. Lorigo, L.M., Govindaraju, V.: Oﬄine arabic handwriting recognition: a survey. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 28(5), 712-724 (2006)  18. Marti, U.V., Bunke, H.: The IAM-database: an english sentence database for of- ﬂine handwriting recognition. International Journal on Document Analysis and Recognition 5(1), 39-46 (2002)  19. Moysset, B., Kermorvant, C., Wolf, C.: Full-page text recognition: Learn- ing where to start and when to stop. In: 14th International Conference on Document Analysis and Recognition (ICDAR). pp. 871-876. IEEE (2017). https://doi.org/10.1109/ICDAR.2017.147  20. Pl¨otz, T., Fink, G.A.: Markov models for oﬄine handwriting recognition: a survey. International Journal on Document Analysis and Recognition (IJDAR) 12(4), 269 (2009)  21. Povey, D., Ghoshal, A., Boulianne, G., Burget, L., Glembek, O., Goel, N., Hanne- mann, M., Motlicek, P., Qian, Y., Schwarz, P., Silovsky, J., Stemmer, G., Vesely, K.: The Kaldi speech recognition toolkit. In: IEEE 2011 Workshop on Auto- matic Speech Recognition and Understanding. IEEE Signal Processing Society (Dec 2011), iEEE Catalog No.: CFP11SRW-USB  22. Puigcerver, J.: Are multidimensional  really necessary for handwritten text recognition? In: 14th International Conference on Docu- IEEE (Nov 2017). ment Analysis and Recognition (ICDAR). pp. 67-72. https://doi.org/10.1109/ICDAR.2017.20  recurrent  layers  23. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: Towards real-time object detection with region proposal networks. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(6), 1137-1149 (June 2017)  24. Saabni, R., El-Sana, J.: Language-independent text lines extraction using seam carving. In: 11th International Conference on Document Analysis and Recognition (ICDAR). pp. 563-568. IEEE (2011)  25. Sanchez, J.A., Romero, V., Toselli, A.H., Villegas, M., Vidal, E.: ICDAR2017 competition on handwritten text recognition on the READ dataset. In: 14th International Conference on Document Analysis and Recognition (ICDAR). pp. 1383-1388. IEEE (Nov 2017). https://doi.org/10.1109/ICDAR.2017.226, doi. ieeecomputersociety.org/10.1109/ICDAR.2017.226  26. Shapiro, V., Gluhchev, G., Sgurev, V.: Handwritten document image segmentation  and analysis. Pattern Recognition Letters 14(1), 71-78 (1993)  27. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale image recognition. CoRR abs/1409.1556 (2014), http://arxiv.org/abs/1409. 1556  28. Smith, R.: Tutorial: Tesseract blends old and new OCR technology (2016) 29. Snchez, J.A., Romero, V., Toselli, A.H., Vidal, E.: ICFHR2016 competition on handwritten text recognition on the READ dataset. In: 15th International Confer- ence on Frontiers in Handwriting Recognition (ICFHR). pp. 630-635. IEEE (Oct 2016). https://doi.org/10.1109/ICFHR.2016.0120  30. Tensmeyer, C., Saunders, D., Martinez, T.: Convolutional neural net- works In: 14th International Conference on Docu- ment Analysis and Recognition (ICDAR). pp. 985-990. IEEE (Nov 2018).  font classification.  for   Start, Follow, Read: End-to-End Full-Page Handwriting Recognitionhttps://doi.org/10.1109/ICDAR.2017.164, 1109/ICDAR.2017.164  doi.ieeecomputersociety.org/10.  31. Tian, Z., Huang, W., He, T., He, P., Qiao, Y.: Detecting text in natural image with connectionist text proposal network. CoRR abs/1609.03605 (2016), http: //arxiv.org/abs/1609.03605  32. Vinciarelli, A.: A survey on oﬀ-line cursive word recognition. Pattern recognition  35(7), 1433-1446 (2002)  33. Wigington, C., Stewart, S., Davis, B., Barrett, W., Price, B., Cohen, S.: Data augmentation for recognition of handwritten words and lines using a CNN-LSTM network. 14th International Conference on Document Analysis and Recognition (ICDAR) pp. 639-645 (2017)  34. Zamora-Martinez, F., Frinken, V., Espa˜na-Boquera, S., Castro-Bleda, M.J., Fis- cher, A., Bunke, H.: Neural network language models for oﬀ-line handwriting recog- nition. Pattern Recognition 47(4), 1642-1652 (2014)"}