{"1": "1. Bambach, S., Lee, S., Crandall, D.J., Yu, C.: Lending A Hand: Detecting Hands and Recognizing Activities in Complex Egocentric Interactions. In: IEEE International Conference on Computer Vision (ICCV) (2015)  2. Beck, C., Broun, A., Mirmehdi, M., Pipe, T., Melhuish, C.: Text Line Aggregation. In: The 3rd International Conference on Pattern Recognition Applications and Methods (2014)  3. Chou, J.C., Kamel, M.: Finding the Position and Orientation of a Sensor on a Robot Manipulator Using Quaternions. The International Journal of Robotics Sesearch 10(3), 240-254 (1991)  4. Garcia-Hernando, G., Yuan, S., Baek, S., Kim, T.K.: First-Person Hand Action Benchmark with RGB-D Videos and 3D Hand Pose Annotations. arXiv preprint arXiv:1704.02463 (2017)  5. Geiger, A., Lenz, P., Urtasun, R.: Are We Ready for Autonomous Driving? The KITTI Vision Benchmark Suite. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2012)  6. Girshick, R.: Fast R-CNN. In: IEEE International Conference on Computer Vision  7. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask R-CNN. arXiv preprint  (ICCV) (2015)  arXiv:1703.06870 (2017)  8. Hinterstoisser, S., Lepetit, V., Ilic, S., Holzer, S., Bradski, G., Konolige, K., Navab, N.: Model Based Training, Detection and Pose Estimation of Texture-less 3d Ob- jects in Heavily Cluttered Scenes. In: Asian conference on computer vision (2012) 9. Hodaˇn, T., Matas, J., Obdrˇz´alek, ˇS.: On Evaluation of 6D Object Pose Estimation.  In: European Conference on Computer Vision (ECCV) (2016)  10. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: MobileNets: Eﬃcient Convolutional Neural Networks for Mobile Vision Applications. arXiv preprint arXiv:1704.04861 (2017)  11. Huang, J., Rathod, V., Sun, C., Zhu, M., Korattikara, A., Fathi, A., Fischer, I., Wojna, Z., Song, Y., Guadarrama, S., Murphy, K.: Speed/Accuracy trade-oﬀs for modern convolutional object detectors. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  12. Kehl, W., Manhardt, F., Tombari, F., Ilic, S., Navab, N.: SSD-6D: Making RGB- based 3D detection and 6D pose estimation great again. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  13. Kingma, D., Ba, J.: Adam: A Method for Stochastic Optimization. arXiv preprint  arXiv:1412.6980 (2014)  14. Liu, S., Wang, S., Wu, L., Jiang, S.: Multiple Feature Fusion Based Hand-held Object Recognition with RGB-D Data. In: International Conference on Internet Multimedia Computing and Service (2014)  15. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: SSD: Single Shot Multibox Detector. In: European Conference on Computer Vision (ECCV) (2016)  16. Mahendran, S., Ali, H., Vidal, R.: 3D Pose Regression Using Convolutional Neural Networks. In: IEEE International Conference on Computer Vision (ICCV) (2017) 17. Mousavian, A., Anguelov, D., Flynn, J., Koˇseck´a, J.: 3d Bounding Box Estimation Using Deep Learning and Geometry. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)   Eﬃcient Egocentric 6-DoF Tracking of Handheld ObjectsReferences  1. Bambach, S., Lee, S., Crandall, D.J., Yu, C.: Lending A Hand: Detecting Hands and Recognizing Activities in Complex Egocentric Interactions. In: IEEE International Conference on Computer Vision (ICCV) (2015)  2. Beck, C., Broun, A., Mirmehdi, M., Pipe, T., Melhuish, C.: Text Line Aggregation. In: The 3rd International Conference on Pattern Recognition Applications and Methods (2014)  3. Chou, J.C., Kamel, M.: Finding the Position and Orientation of a Sensor on a Robot Manipulator Using Quaternions. The International Journal of Robotics Sesearch 10(3), 240-254 (1991)  4. Garcia-Hernando, G., Yuan, S., Baek, S., Kim, T.K.: First-Person Hand Action Benchmark with RGB-D Videos and 3D Hand Pose Annotations. arXiv preprint arXiv:1704.02463 (2017)  5. Geiger, A., Lenz, P., Urtasun, R.: Are We Ready for Autonomous Driving? The KITTI Vision Benchmark Suite. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2012)  6. Girshick, R.: Fast R-CNN. In: IEEE International Conference on Computer Vision  7. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask R-CNN. arXiv preprint  (ICCV) (2015)  arXiv:1703.06870 (2017)  8. Hinterstoisser, S., Lepetit, V., Ilic, S., Holzer, S., Bradski, G., Konolige, K., Navab, N.: Model Based Training, Detection and Pose Estimation of Texture-less 3d Ob- jects in Heavily Cluttered Scenes. In: Asian conference on computer vision (2012) 9. Hodaˇn, T., Matas, J., Obdrˇz´alek, ˇS.: On Evaluation of 6D Object Pose Estimation.  In: European Conference on Computer Vision (ECCV) (2016)  10. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: MobileNets: Eﬃcient Convolutional Neural Networks for Mobile Vision Applications. arXiv preprint arXiv:1704.04861 (2017)  11. Huang, J., Rathod, V., Sun, C., Zhu, M., Korattikara, A., Fathi, A., Fischer, I., Wojna, Z., Song, Y., Guadarrama, S., Murphy, K.: Speed/Accuracy trade-oﬀs for modern convolutional object detectors. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  12. Kehl, W., Manhardt, F., Tombari, F., Ilic, S., Navab, N.: SSD-6D: Making RGB- based 3D detection and 6D pose estimation great again. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  13. Kingma, D., Ba, J.: Adam: A Method for Stochastic Optimization. arXiv preprint  arXiv:1412.6980 (2014)  14. Liu, S., Wang, S., Wu, L., Jiang, S.: Multiple Feature Fusion Based Hand-held Object Recognition with RGB-D Data. In: International Conference on Internet Multimedia Computing and Service (2014)  15. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: SSD: Single Shot Multibox Detector. In: European Conference on Computer Vision (ECCV) (2016)  16. Mahendran, S., Ali, H., Vidal, R.: 3D Pose Regression Using Convolutional Neural Networks. In: IEEE International Conference on Computer Vision (ICCV) (2017) 17. Mousavian, A., Anguelov, D., Flynn, J., Koˇseck´a, J.: 3d Bounding Box Estimation Using Deep Learning and Geometry. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)   16  R. Pandey, P. Pidlypenskyi, S. Yang, C. Kaeser-Chen  18. Mueller, F., Mehta, D., Sotnychenko, O., Sridhar, S., Casas, D., Theobalt, C.: Real-time Hand Tracking under Occlusion from an Egocentric RGB-D Sensor. In: IEEE International Conference on Computer Vision (ICCV) (2017)  19. Poirson, P., Ammirato, P., Fu, C.Y., Liu, W., Kosecka, J., Berg, A.C.: Fast Single Shot Detection and Pose Estimation. In: IEEE International Conference on 3D Vision (3DV) (2016)  20. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You Only Look Once: Unified, Real-time Object Detection. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  21. Rivera-Rubio, J., Idrees, S., Alexiou, I., Hadjilucas, L., Bharath, A.A.: Small Hand- held Object Recognition Test. In: IEEE Winter Conference on Applications of Computer Vision (WACV) (2014)  22. Sundararajan, M., Taly, A., Yan, Q.: Axiomatic Attribution for Deep Networks.  arXiv preprint arXiv:1703.01365 (2017)  23. Tejani, A., Tang, D., Kouskouridas, R., Kim, T.K.: Latent-class Hough Forests for 3D Object Detection and Pose Estimation. In: European Conference on Computer Vision (ECCV) (2014)  24. Vicon: Vicon Motion Capture Software. https://www.vicon.com/products/  software/tracker, accessed: 2018-03-13  25. Xiang, Y., Mottaghi, R., Savarese, S.: Beyond Pascal: A Benchmark for 3D Object Detection in the Wild. In: IEEE Winter Conference on Applications of Computer Vision (WACV) (2014)  26. Yuan, S., Ye, Q., Stenger, B., Jain, S., Kim, T.K.: BigHand2. 2M Benchmark: Hand Pose Dataset and State of the Art Analysis. arXiv preprint arXiv:1704.02612 (2017)"}