{"1": "1. Anderson, P., He, X., Buehler, C., Teney, D., Johnson, M., Gould, S., Zhang, L.: Bottom-up and top-down attention for image captioning and vqa. arXiv preprint arXiv:1707.07998 (2017)  2. Andreas, J., Rohrbach, M., Darrell, T., Klein, D.: Learning to compose neural  networks for question answering. arXiv preprint arXiv:1601.01705 (2016)  3. Andreas, J., Rohrbach, M., Darrell, T., Klein, D.: Neural module networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 39-48 (2016)  4. Antol, S., Agrawal, A., Lu, J., Mitchell, M., Batra, D., Lawrence Zitnick, C., Parikh, D.: Vqa: Visual question answering. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 2425-2433 (2015)  5. Bai, Y., Yang, K., Yu, W., Xu, C., Ma, W.Y., Zhao, T.: Automatic image dataset construction from click-through logs using deep neural network. In: Proceedings of the 23rd ACM International Conference on Multimedia. pp. 441-450 (2015)  6. Ben-younes, H., Cadene, R., Cord, M., Thome, N.: Mutan: Multimodal tucker fusion for visual question answering. In: The IEEE International Conference on Computer Vision (ICCV). vol. 1, p. 3 (2017)  7. Chen, K., Wang, J., Chen, L.C., Gao, H., Xu, W., Nevatia, R.: Abc-cnn: An at- tention based convolutional neural network for visual question answering. arXiv preprint arXiv:1511.05960 (2015)  8. Donahue, J., Anne Hendricks, L., Guadarrama, S., Rohrbach, M., Venugopalan, S., Saenko, K., Darrell, T.: Long-term recurrent convolutional networks for visual recognition and description. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 2625-2634 (2015)  9. Fukui, A., Park, D.H., Yang, D., Rohrbach, A., Darrell, T., Rohrbach, M.: Multi- modal compact bilinear pooling for visual question answering and visual grounding. arXiv preprint arXiv:1606.01847 (2016)  10. Goyal, Y., Khot, T., Summers-Stay, D., Batra, D., Parikh, D.: Making the v in vqa matter: Elevating the role of image understanding in visual question answering. In: CVPR. vol. 1, p. 9 (2017)  11. Ilievski, I., Yan, S., Feng, J.: A focused dynamic attention model for visual question  answering. arXiv preprint arXiv:1604.01485 (2016)  12. Jabri, A., Joulin, A., van der Maaten, L.: Revisiting visual question answering base-  lines. In: European conference on computer vision. pp. 727-739. Springer (2016)  13. Kim, J.H., Lee, S.W., Kwak, D., Heo, M.O., Kim, J., Ha, J.W., Zhang, B.T.: Multimodal residual learning for visual qa. In: Advances in Neural Information Processing Systems. pp. 361-369 (2016)  14. Kim, J.H., On, K.W., Lim, W., Kim, J., Ha, J.W., Zhang, B.T.: Hadamard product  for low-rank bilinear pooling (2017)  15. Kiros, R., Zhu, Y., Salakhutdinov, R.R., Zemel, R., Urtasun, R., Torralba, A., Fidler, S.: Skip-thought vectors. In: Advances in neural information processing systems. pp. 3294-3302 (2015)  16. Li, R., Jia, J.: Visual question answering with question representation update (qru). In: Advances in Neural Information Processing Systems. pp. 4655-4663 (2016) 17. Lu, J., Yang, J., Batra, D., Parikh, D.: Hierarchical question-image co-attention for visual question answering. In: Advances In Neural Information Processing Systems. pp. 289-297 (2016)   Deep Attention Neural Tensor Network for VQAReferences  1. Anderson, P., He, X., Buehler, C., Teney, D., Johnson, M., Gould, S., Zhang, L.: Bottom-up and top-down attention for image captioning and vqa. arXiv preprint arXiv:1707.07998 (2017)  2. Andreas, J., Rohrbach, M., Darrell, T., Klein, D.: Learning to compose neural  networks for question answering. arXiv preprint arXiv:1601.01705 (2016)  3. Andreas, J., Rohrbach, M., Darrell, T., Klein, D.: Neural module networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 39-48 (2016)  4. Antol, S., Agrawal, A., Lu, J., Mitchell, M., Batra, D., Lawrence Zitnick, C., Parikh, D.: Vqa: Visual question answering. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 2425-2433 (2015)  5. Bai, Y., Yang, K., Yu, W., Xu, C., Ma, W.Y., Zhao, T.: Automatic image dataset construction from click-through logs using deep neural network. In: Proceedings of the 23rd ACM International Conference on Multimedia. pp. 441-450 (2015)  6. Ben-younes, H., Cadene, R., Cord, M., Thome, N.: Mutan: Multimodal tucker fusion for visual question answering. In: The IEEE International Conference on Computer Vision (ICCV). vol. 1, p. 3 (2017)  7. Chen, K., Wang, J., Chen, L.C., Gao, H., Xu, W., Nevatia, R.: Abc-cnn: An at- tention based convolutional neural network for visual question answering. arXiv preprint arXiv:1511.05960 (2015)  8. Donahue, J., Anne Hendricks, L., Guadarrama, S., Rohrbach, M., Venugopalan, S., Saenko, K., Darrell, T.: Long-term recurrent convolutional networks for visual recognition and description. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 2625-2634 (2015)  9. Fukui, A., Park, D.H., Yang, D., Rohrbach, A., Darrell, T., Rohrbach, M.: Multi- modal compact bilinear pooling for visual question answering and visual grounding. arXiv preprint arXiv:1606.01847 (2016)  10. Goyal, Y., Khot, T., Summers-Stay, D., Batra, D., Parikh, D.: Making the v in vqa matter: Elevating the role of image understanding in visual question answering. In: CVPR. vol. 1, p. 9 (2017)  11. Ilievski, I., Yan, S., Feng, J.: A focused dynamic attention model for visual question  answering. arXiv preprint arXiv:1604.01485 (2016)  12. Jabri, A., Joulin, A., van der Maaten, L.: Revisiting visual question answering base-  lines. In: European conference on computer vision. pp. 727-739. Springer (2016)  13. Kim, J.H., Lee, S.W., Kwak, D., Heo, M.O., Kim, J., Ha, J.W., Zhang, B.T.: Multimodal residual learning for visual qa. In: Advances in Neural Information Processing Systems. pp. 361-369 (2016)  14. Kim, J.H., On, K.W., Lim, W., Kim, J., Ha, J.W., Zhang, B.T.: Hadamard product  for low-rank bilinear pooling (2017)  15. Kiros, R., Zhu, Y., Salakhutdinov, R.R., Zemel, R., Urtasun, R., Torralba, A., Fidler, S.: Skip-thought vectors. In: Advances in neural information processing systems. pp. 3294-3302 (2015)  16. Li, R., Jia, J.: Visual question answering with question representation update (qru). In: Advances in Neural Information Processing Systems. pp. 4655-4663 (2016) 17. Lu, J., Yang, J., Batra, D., Parikh, D.: Hierarchical question-image co-attention for visual question answering. In: Advances In Neural Information Processing Systems. pp. 289-297 (2016)   16  Y. Bai, J. Fu, T. Zhao and T. Mei  18. Malinowski, M., Rohrbach, M., Fritz, M.: Ask your neurons: A deep learning ap- proach to visual question answering. International Journal of Computer Vision 125(1-3), 110-135 (2017)  19. Noh, H., Han, B.: Training recurrent answering units with joint loss minimization  for vqa. arXiv preprint arXiv:1606.03647 (2016)  20. Noh, H., Hongsuck Seo, P., Han, B.: Image question answering using convolutional neural network with dynamic parameter prediction. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 30-38 (2016) 21. Pennington, J., Socher, R., Manning, C.D.: Glove: Global vectors for word repre- sentation. Proceedings of the Empiricial Methods in Natural Language Processing (EMNLP 2014) 12 (2014)  22. Qiu, X., Huang, X.: Convolutional neural tensor network architecture for  community-based question answering. In: IJCAI. pp. 1305-1311 (2015)  23. Reed, S., Akata, Z., Yan, X., Logeswaran, L., Schiele, B., Lee, H.: Generative adversarial text to image synthesis. arXiv preprint arXiv:1605.05396 (2016) 24. Ren, M., Kiros, R., Zemel, R.: Exploring models and data for image question answering. In: Advances in neural information processing systems. pp. 2953-2961 (2015)  25. Shih, K.J., Singh, S., Hoiem, D.: Where to look: Focus regions for visual ques- tion answering. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 4613-4621 (2016)  26. Socher, R., Chen, D., Manning, C.D., Ng, A.: Reasoning with neural tensor net- works for knowledge base completion. In: Advances in neural information process- ing systems. pp. 926-934 (2013)  27. Teney, D., Anderson, P., He, X., Hengel, A.v.d.: Tips and tricks for visual question answering: Learnings from the 2017 challenge. arXiv preprint arXiv:1708.02711 (2017)  28. Wu, Q., Wang, P., Shen, C., Dick, A., van den Hengel, A.: Ask me anything: Free-form visual question answering based on knowledge from external sources. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 4622-4630 (2016)  29. Xiong, C., Merity, S., Socher, R.: Dynamic memory networks for visual and textual question answering. In: International Conference on Machine Learning. pp. 2397- 2406 (2016)  30. Xu, H., Saenko, K.: Ask, attend and answer: Exploring question-guided spatial attention for visual question answering. In: European Conference on Computer Vision. pp. 451-466. Springer (2016)  31. Yang, Z., He, X., Gao, J., Deng, L., Smola, A.: Stacked attention networks for image question answering. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 21-29 (2016)  32. Yu, Z., Yu, J., Fan, J., Tao, D.: Multi-modal factorized bilinear pooling with co- attention learning for visual question answering. In: Proc. IEEE Int. Conf. Comp. Vis. vol. 3 (2017)  33. Zhou, B., Tian, Y., Sukhbaatar, S., Szlam, A., Fergus, R.: Simple baseline for visual  question answering. arXiv preprint arXiv:1512.02167 (2015)"}