{"1": "1. Krizhevsky, A., Sutskever, I., Hinton, G.: Imagenet classification with deep convo-  lutional neural networks. In: NIPS. Volume 1. (2012) 1097-1105  2. Johnson, J., Karpathy, A., Fei-Fei, L.: Densecap: Fully convolutional localization  networks for dense captioning. In: CVPR. (2016)  3. Gordo, A., Almaz´an, J., Revaud, J., Larlus, D.: Deep image retrieval: Learning  global representations for image search. In: ECCV. (2016) 241-257   14  M.-M. Paumard, D. Picard, H. Tabia  Fig. 7: Examples of reconstructions with 4 missing fragments. The red outlined fragments are misplaced  (surprisingly better than in the case where the central fragment is unknown), but perfectly reassembling the image is very diﬃcult. This means that the algo- rithm tends to drop fragments instead of assigning them to an uncertain location. Figure 7 shows examples of reconstructions in the case of missing fragments.  5 Conclusion  In this paper, we tackled the image reassembly problem where given a unordered list of image fragments, we want to recover the original image. To that end, we proposed a deep neural network architecture that predicts the relative position of a given pair of fragments. Then, we cast the reassembly problem into a shortest path in a graph algorithm for which we propose several construction algorithms depending on whether the puzzle is complete or if there are missing pieces. We propose a new dataset containing 14,000 images to test several reassembly tasks and we show that we are able to perfectly reassemble the image 44.4% of the time in the simpler case and 29.5% of the time if there are missing pieces.  References  1. Krizhevsky, A., Sutskever, I., Hinton, G.: Imagenet classification with deep convo-  lutional neural networks. In: NIPS. Volume 1. (2012) 1097-1105  2. Johnson, J., Karpathy, A., Fei-Fei, L.: Densecap: Fully convolutional localization  networks for dense captioning. In: CVPR. (2016)  3. Gordo, A., Almaz´an, J., Revaud, J., Larlus, D.: Deep image retrieval: Learning  global representations for image search. In: ECCV. (2016) 241-257   Image Reassembly Combining Deep Learning and Shortest Path Problem4. Doersch, C., Gupta, A., Efros, A.: Unsupervised visual representation learning by  context prediction. In: ICCV. (2015)  5. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., Berg, A.C., Fei-Fei, L.: ImageNet Large Scale Visual Recognition Challenge. IJCV 115(3) (2015) 211-252  6. Rasheed, N., M.J., N.: A survey of classification and reconstruction methods for  the 2d archaeological objects. In: ISTMET. (August 2015) 142-147  7. Rasheed, N., M.J., N.: A survey of computer methods in reconstruction of 3d  archaeological pottery objects. Volume 3. (2015) 712-714  8. McBride, J., Kimia, B.: Archaeological fragment reconstruction using curve-  matching. In: CVPRW. (2003)  9. Jampy, F., Hostein, A., Fauvet, E., Laligant, O., Truchetet, F.: 3d puzzle recon-  struction for archeological fragments. In: 3DIPM. (2015)  10. Zhu, L., Zhou, Z., Zhang, J., Hu, D.: A partial curve matching method for auto-  matic reassembly of 2d fragments. ICI LNCIS 345 (2006) 645-650  11. Hammoudeh, Z., Pollett, C.: Clustering-based, fully automated mixed-bag jigsaw puzzle solving. In: Computer Analysis of Images and Patterns. (2017) 205-217 12. Andal´o, F., Taubin, G., Goldenstein, S.: Psqp: Puzzle solving by quadratic pro-  gramming. IEEE TPAMI 39 (Feb 2017) 385-396  13. Lifang, C., Cao, D., Liu, Y.: A new intelligent jigsaw puzzle algorithm base on  mixed similarity and symbol matrix. IJPRAI 32 (2018)  14. Mikolov, T., Sutskever, I., Chen, K., Corrado, G.S., Dean, J.: Distributed rep- In: NIPS. (2013)  resentations of words and phrases and their compositionality. 3111-3119  15. Kiros, R., Zhu, Y., Salakhutdinov, R.R., Zemel, R., Urtasun, R., Torralba, A.,  Fidler, S.: Skip-thought vectors. In: NIPS. (2015) 3294-3302  16. Noroozi, M., Favaro, P.: Unsupervised learning of visual representations by solving  jigsaw puzzles. (2015)  17. Gur, S., Ben-Shahar, O.: From square pieces to brick walls: The next challenge in  18. Lin, T.Y., RoyChowdhury, A., Maji, S.: Bilinear cnn models for fine-grained visual  solving jigsaw puzzles. In: ICCV. (2017)  recognition. In: ICCV. (2015) 1449-1457  19. Gao, Y., Beijbom, O., Zhang, N., Darrell, T.: Compact bilinear pooling. In: IEEE  20. Kim, J.H., On, K.W., Lim, W., Ha, J., B.-T., Z.: Hadamard product for low-rank  CVPR. (2016) 317-326  bilinear pooling. In: ICLR. (2017)  21. Ben-younes, H., Cadene, R., Cord, M., Thome, N.: Mutan: Multimodal tucker  fusion for visual question answering. (2017) 2612-2620  22. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition, ILSVRC (2014)  23. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. In: ICML. (2015)  24. Nair, V., Hinton, G.: Rectified linear units improve restricted boltzmann machines.  25. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  26. Lin, M., Chen, Q., Yan, S.: Network in network. arXiv preprint arXiv:1312.4400  27. Dijkstra, E.: A note on two problems in connexion with graphs. Numerische  In: ICML. (2010)  In: IEEE CVPR. (2016) 770-778  (2013)  Mathematik 1 (1959) 269-271"}