{"1": "1. Benitez-Quiroz, C.F., Srinivasan, R., Martinez, A.M., et al.: Emotionet: An accu- rate, real-time algorithm for the automatic annotation of a million facial expression- s in the wild. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 5562-5570. IEEE (2016)  2. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. IEEE Transactions on Pattern Analysis and Machine Intelli- gence 40(4), 834-848 (2017)  3. Chu, W.S., De la Torre, F., Cohn, J.F.: Learning spatial and temporal cues for multi-label facial action unit detection. In: IEEE International Conference on Au- tomatic Face & Gesture Recognition. pp. 25-32. IEEE (2017)  4. Cootes, T.F., Edwards, G.J., Taylor, C.J.: Active appearance models. IEEE Trans-  actions on Pattern Analysis and Machine Intelligence 23(6), 681-685 (2001)  5. Ekman, P., Rosenberg, E.L.: What the face reveals: Basic and applied studies of spontaneous expression using the Facial Action Coding System (FACS). Oxford University Press, USA (1997)  6. Fan, R.E., Chang, K.W., Hsieh, C.J., Wang, X.R., Lin, C.J.: Liblinear: A library for large linear classification. Journal of Machine Learning Research 9(Aug), 1871- 1874 (2008)  7. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International Conference on Machine Learning. pp. 448-456 (2015)  8. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM International Conference on Multimedia. pp. 675-678. ACM (2014) 9. Li, W., Abtahi, F., Zhu, Z.: Action unit detection with region adaptation, multi- labeling learning and optimal temporal fusing. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 6766-6775. IEEE (2017)  10. Li, W., Abtahi, F., Zhu, Z., Yin, L.: Eac-net: A region-based deep enhancing and cropping approach for facial action unit detection. In: IEEE International Confer- ence on Automatic Face & Gesture Recognition. pp. 103-110. IEEE (2017)  11. Li, Y., Wang, S., Zhao, Y., Ji, Q.: Simultaneous facial feature tracking and facial expression recognition. IEEE Transactions on Image Processing 22(7), 2559-2573 (2013)  12. Liu, Z., Song, G., Cai, J., Cham, T.J., Zhang, J.: Conditional adversarial synthesis  of 3d facial action units. arXiv preprint arXiv:1802.07421 (2018)  13. Martinez, B., Valstar, M.F., Jiang, B., Pantic, M.: Automatic analysis of facial actions: A survey. IEEE Transactions on Aﬀective Computing PP(99), 1-1 (2017) 14. Mavadati, S.M., Mahoor, M.H., Bartlett, K., Trinh, P., Cohn, J.F.: Disfa: A sponta- neous facial action intensity database. IEEE Transactions on Aﬀective Computing 4(2), 151-160 (2013)  15. Milletari, F., Navab, N., Ahmadi, S.A.: V-net: Fully convolutional neural networks for volumetric medical image segmentation. In: International Conference on 3D Vision. pp. 565-571. IEEE (2016)  16. Nair, V., Hinton, G.E.: Rectified linear units improve restricted boltzmann ma- chines. In: International Conference on Machine Learning. pp. 807-814 (2010) 17. Ranjan, R., Patel, V.M., Chellappa, R.: Hyperface: A deep multi-task learning framework for face detection, landmark localization, pose estimation, and gender   Joint Facial Action Unit Detection and Face AlignmentReferences  1. Benitez-Quiroz, C.F., Srinivasan, R., Martinez, A.M., et al.: Emotionet: An accu- rate, real-time algorithm for the automatic annotation of a million facial expression- s in the wild. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 5562-5570. IEEE (2016)  2. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. IEEE Transactions on Pattern Analysis and Machine Intelli- gence 40(4), 834-848 (2017)  3. Chu, W.S., De la Torre, F., Cohn, J.F.: Learning spatial and temporal cues for multi-label facial action unit detection. In: IEEE International Conference on Au- tomatic Face & Gesture Recognition. pp. 25-32. IEEE (2017)  4. Cootes, T.F., Edwards, G.J., Taylor, C.J.: Active appearance models. IEEE Trans-  actions on Pattern Analysis and Machine Intelligence 23(6), 681-685 (2001)  5. Ekman, P., Rosenberg, E.L.: What the face reveals: Basic and applied studies of spontaneous expression using the Facial Action Coding System (FACS). Oxford University Press, USA (1997)  6. Fan, R.E., Chang, K.W., Hsieh, C.J., Wang, X.R., Lin, C.J.: Liblinear: A library for large linear classification. Journal of Machine Learning Research 9(Aug), 1871- 1874 (2008)  7. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International Conference on Machine Learning. pp. 448-456 (2015)  8. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM International Conference on Multimedia. pp. 675-678. ACM (2014) 9. Li, W., Abtahi, F., Zhu, Z.: Action unit detection with region adaptation, multi- labeling learning and optimal temporal fusing. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 6766-6775. IEEE (2017)  10. Li, W., Abtahi, F., Zhu, Z., Yin, L.: Eac-net: A region-based deep enhancing and cropping approach for facial action unit detection. In: IEEE International Confer- ence on Automatic Face & Gesture Recognition. pp. 103-110. IEEE (2017)  11. Li, Y., Wang, S., Zhao, Y., Ji, Q.: Simultaneous facial feature tracking and facial expression recognition. IEEE Transactions on Image Processing 22(7), 2559-2573 (2013)  12. Liu, Z., Song, G., Cai, J., Cham, T.J., Zhang, J.: Conditional adversarial synthesis  of 3d facial action units. arXiv preprint arXiv:1802.07421 (2018)  13. Martinez, B., Valstar, M.F., Jiang, B., Pantic, M.: Automatic analysis of facial actions: A survey. IEEE Transactions on Aﬀective Computing PP(99), 1-1 (2017) 14. Mavadati, S.M., Mahoor, M.H., Bartlett, K., Trinh, P., Cohn, J.F.: Disfa: A sponta- neous facial action intensity database. IEEE Transactions on Aﬀective Computing 4(2), 151-160 (2013)  15. Milletari, F., Navab, N., Ahmadi, S.A.: V-net: Fully convolutional neural networks for volumetric medical image segmentation. In: International Conference on 3D Vision. pp. 565-571. IEEE (2016)  16. Nair, V., Hinton, G.E.: Rectified linear units improve restricted boltzmann ma- chines. In: International Conference on Machine Learning. pp. 807-814 (2010) 17. Ranjan, R., Patel, V.M., Chellappa, R.: Hyperface: A deep multi-task learning framework for face detection, landmark localization, pose estimation, and gender   16  Zhiwen Shao, Zhilei Liu, Jianfei Cai, and Lizhuang Ma  recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence P- P(99), 1-1 (2017)  18. Shao, Z., Ding, S., Zhao, Y., Zhang, Q., Ma, L.: Learning deep representation from coarse to fine for face alignment. In: IEEE International Conference on Multimedia and Expo. pp. 1-6. IEEE (2016)  19. Shao, Z., Zhu, H., Hao, Y., Wang, M., Ma, L.: Learning a multi-center convolutional network for unconstrained face alignment. In: IEEE International Conference on Multimedia and Expo. pp. 109-114. IEEE (2017)  20. la Torre, F.D., Chu, W.S., Xiong, X., Vicente, F., Ding, X., Cohn, J.: Intraface. In: IEEE International Conference on Automatic Face & Gesture Recognition. pp. 1-8. IEEE (2015)  21. Valstar, M., Pantic, M.: Fully automatic facial action unit detection and tempo- ral analysis. In: IEEE Conference on Computer Vision and Pattern Recognition Workshop. pp. 149-149. IEEE (2006)  22. Wu, Y., Gou, C., Ji, Q.: Simultaneous facial landmark detection, pose and de- formation estimation under facial occlusion. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 3471-3480. IEEE (2017)  23. Wu, Y., Ji, Q.: Constrained joint cascade regression framework for simultaneous facial action unit recognition and facial landmark detection. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 3400-3408. IEEE (2016) 24. Xiong, X., De la Torre, F.: Supervised descent method and its applications to face alignment. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 532-539. IEEE (2013)  25. Zeng, J., Chu, W.S., De la Torre, F., Cohn, J.F., Xiong, Z.: Confidence preserving machine for facial action unit detection. In: IEEE International Conference on Computer Vision. pp. 3622-3630. IEEE (2015)  26. Zhang, X., Yin, L., Cohn, J.F., Canavan, S., Reale, M., Horowitz, A., Liu, P.: A high-resolution spontaneous 3d dynamic facial expression database. In: IEEE Inter- national Conference and Workshops on Automatic Face and Gesture Recognition. pp. 1-6. IEEE (2013)  27. Zhang, Z., Luo, P., Loy, C.C., Tang, X.: Facial landmark detection by deep multi- task learning. In: European Conference on Computer Vision. pp. 94-108. Springer (2014)  28. Zhang, Z., Luo, P., Loy, C.C., Tang, X.: Learning deep representation for face alignment with auxiliary attributes. IEEE Transactions on Pattern Analysis and Machine Intelligence 38(5), 918-930 (2016)  29. Zhao, K., Chu, W.S., De la Torre, F., Cohn, J.F., Zhang, H.: Joint patch and multi- label learning for facial action unit detection. In: IEEE Conference on Computer Vision and Pattern Recognition. pp. 2207-2216. IEEE (2015)  30. Zhao, K., Chu, W.S., De la Torre, F., Cohn, J.F., Zhang, H.: Joint patch and multi-label learning for facial action unit and holistic expression recognition. IEEE Transactions on Image Processing 25(8), 3931-3946 (2016)  31. Zhao, K., Chu, W.S., Zhang, H.: Deep region and multi-label learning for facial action unit detection. In: IEEE Conference on Computer Vision and Pattern Recog- nition. pp. 3391-3399. IEEE (2016)  32. Zhong, L., Liu, Q., Yang, P., Huang, J., Metaxas, D.N.: Learning multiscale active facial patches for expression analysis. IEEE Transactions on Cybernetics 45(8), 1499-1510 (2015)"}