{"1": "1. Rehg, J.M., Kanade, T.: Visual tracking of high DOF articulated structures: an  application to human hand tracking. In: ECCV. (1994) 1  2. de Campos, T.E., Murray, D.W.: Regression-based hand pose estimation from  3. Oikonomidis, I., Kyriazis, N., Argyros., A.A.: Markerless and eﬃcient 26-DOF  multiple cameras. In: CVPR. (2006) 1  hand pose recovery. In: ACCV. (2010) 1  4. Rosales, R., Athitsos, V., Sigal, L., Sclaroﬀ, S.: 3D hand pose reconstruction using  specialized mappings. In: ICCV. (2001) 1  5. Ballan, L., Taneja, A., Gall, J., Van-Gool, L., Pollefeys, M.: Motion capture of  hands in action using discriminative salient points. In: ECCV. (2012) 1  6. Sridhar, S., Rhodin, H., Seidel, H.P., Oulasvirta, A., Theobalt, C.: Real-time hand  tracking using a sum of anisotropic gaussians model. In: 3DV. (2014) 1  7. Tzionas, D., Ballan, L., Srikantha, A., Aponte, P., Pollefeys, M., Gall, J.: Capturing hands in action using discriminative salient points and physics simulation. IJCV (2016) 1  8. Panteleris, P., Argyros, A.: Back to RGB: 3D tracking of hands and hand-object interactions based on short-baseline stereo. In: arXiv preprint arXiv:1705.05301. (2017) 1  9. Romero, J., Tzionas, D., Black, M.J.: Embodied hands: Modeling and capturing  hands and bodies together. In: Siggraph Asia. (2017) 1  10. Oikonomidis, I., Kyriazis, N., Argyros, A.A.: Full DOF tracking of a hand inter- acting with an object by modeling occlusions and physical constraints. In: ICCV. (2011) 1  11. Xu, C., Cheng, L.: Eﬃcient hand pose estimation from a single depth image. In:  12. Qian, C., Sun, X., Wei, Y., Tang, X., Sun, J.: Realtime and robust hand tracking  ICCV. (2013) 1  from depth. In: CVPR. (2014) 1  13. Taylor, J., Stebbing, R., Ramakrishna, V., Keskin, C., Shotton, J., Izadi, S., Hertz- mann, A., Fitzgibbon, A.: User-specific hand modeling from monocular depth sequences. In: CVPR. (2014) 1  14. Tang, D., Chang, H.J., Tejani, A., Kim, T.K.: Latent regression forest: Structured  estimation of 3D articulated hand posture. In: CVPR. (2014) 1  15. Tompson, J., Stein, M., Lecun, Y., Perlin, K.: Real-time continuous pose recovery  of human hands using convolutional networks. In: ToG. (2014) 1  16. Tang, D., Taylor, J., Kohli, P., Keskin, C., Kim, T.K., Shotton, J.: Opening the black box: Hierarchical sampling optimization for estimating human hand pose. In: ICCV. (2015) 1  17. Makris, A., Kyriazis, N., Argyros, A.A.: Hierarchical particle filtering for 3D hand  tracking. In: CVPR. (2015) 1  18. Sridhar, S., Mueller, F., Oulasvirta, A., Theobalt, C.: Fast and robust hand track-  ing using detection-guided optimization. In: CVPR. (2015) 1  19. Sun, X., Wei, Y., Liang, S., Tang, X., Sun, J.: Cascaded hand pose regression. In:  20. Oberweger, M., Wohlhart, P., Lepetit, V.: Training a feedback loop for hand pose  CVPR. (2015) 1  estimation. In: ICCV. (2015) 1  21. Oberweger, M., Riegler, G., Wohlhart, P., Lepetit, V.: Eﬃciently creating 3D  training data for fine hand pose estimation. In: CVPR. (2016) 1   Hand Pose Estimation via Latent 2.5D Heatmap RegressionReferences  1. Rehg, J.M., Kanade, T.: Visual tracking of high DOF articulated structures: an  application to human hand tracking. In: ECCV. (1994) 1  2. de Campos, T.E., Murray, D.W.: Regression-based hand pose estimation from  3. Oikonomidis, I., Kyriazis, N., Argyros., A.A.: Markerless and eﬃcient 26-DOF  multiple cameras. In: CVPR. (2006) 1  hand pose recovery. In: ACCV. (2010) 1  4. Rosales, R., Athitsos, V., Sigal, L., Sclaroﬀ, S.: 3D hand pose reconstruction using  specialized mappings. In: ICCV. (2001) 1  5. Ballan, L., Taneja, A., Gall, J., Van-Gool, L., Pollefeys, M.: Motion capture of  hands in action using discriminative salient points. In: ECCV. (2012) 1  6. Sridhar, S., Rhodin, H., Seidel, H.P., Oulasvirta, A., Theobalt, C.: Real-time hand  tracking using a sum of anisotropic gaussians model. In: 3DV. (2014) 1  7. Tzionas, D., Ballan, L., Srikantha, A., Aponte, P., Pollefeys, M., Gall, J.: Capturing hands in action using discriminative salient points and physics simulation. IJCV (2016) 1  8. Panteleris, P., Argyros, A.: Back to RGB: 3D tracking of hands and hand-object interactions based on short-baseline stereo. In: arXiv preprint arXiv:1705.05301. (2017) 1  9. Romero, J., Tzionas, D., Black, M.J.: Embodied hands: Modeling and capturing  hands and bodies together. In: Siggraph Asia. (2017) 1  10. Oikonomidis, I., Kyriazis, N., Argyros, A.A.: Full DOF tracking of a hand inter- acting with an object by modeling occlusions and physical constraints. In: ICCV. (2011) 1  11. Xu, C., Cheng, L.: Eﬃcient hand pose estimation from a single depth image. In:  12. Qian, C., Sun, X., Wei, Y., Tang, X., Sun, J.: Realtime and robust hand tracking  ICCV. (2013) 1  from depth. In: CVPR. (2014) 1  13. Taylor, J., Stebbing, R., Ramakrishna, V., Keskin, C., Shotton, J., Izadi, S., Hertz- mann, A., Fitzgibbon, A.: User-specific hand modeling from monocular depth sequences. In: CVPR. (2014) 1  14. Tang, D., Chang, H.J., Tejani, A., Kim, T.K.: Latent regression forest: Structured  estimation of 3D articulated hand posture. In: CVPR. (2014) 1  15. Tompson, J., Stein, M., Lecun, Y., Perlin, K.: Real-time continuous pose recovery  of human hands using convolutional networks. In: ToG. (2014) 1  16. Tang, D., Taylor, J., Kohli, P., Keskin, C., Kim, T.K., Shotton, J.: Opening the black box: Hierarchical sampling optimization for estimating human hand pose. In: ICCV. (2015) 1  17. Makris, A., Kyriazis, N., Argyros, A.A.: Hierarchical particle filtering for 3D hand  tracking. In: CVPR. (2015) 1  18. Sridhar, S., Mueller, F., Oulasvirta, A., Theobalt, C.: Fast and robust hand track-  ing using detection-guided optimization. In: CVPR. (2015) 1  19. Sun, X., Wei, Y., Liang, S., Tang, X., Sun, J.: Cascaded hand pose regression. In:  20. Oberweger, M., Wohlhart, P., Lepetit, V.: Training a feedback loop for hand pose  CVPR. (2015) 1  estimation. In: ICCV. (2015) 1  21. Oberweger, M., Riegler, G., Wohlhart, P., Lepetit, V.: Eﬃciently creating 3D  training data for fine hand pose estimation. In: CVPR. (2016) 1   16  Umar Iqbal et al.  22. Sridhar, S., Mueller, F., Zollh¨oefer, M., Casas, D., Oulasvirta, A., Theobalt, C.: Real-time joint tracking of a hand manipulating an object from RGB-D input. In: ECCV. (2016) 1, 9, 13  23. Yuan, S., Garcia-Hernando, G., Stenger, B., Moon, G., Chang, J.Y., Lee, K.M., Molchanov, P., Kautz, J., Honari, S., Ge, L., et al.: Depth-based 3d hand pose estimation: From current achievements to future goals. In: IEEE CVPR. (2018) 1 24. Oikonomidis, I., Kyriazis, N., Argyros, A.A.: Eﬃcient model-based 3d tracking of  hand articulations using kinect. In: BMVC. Volume 1. (2011) 3 1  25. Wang, R.Y., Popovi´c, J.: Real-time hand-tracking with a color glove. ToG (2009)26. Wei, S.E., Ramakrishna, V., Kanade, T., Sheikh, Y.: Convolutional pose machines.  In: CVPR. (2016) 2, 3, 7, 12, 13  27. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti-  mation. In: ECCV. (2016) 2, 3, 7, 10, 12  28. Toshev, A., Szegedy, C.: Deeppose: Human pose estimation via deep neural net-  29. Sun, X., Shang, J., Liang, S., Wei, Y.: Compositional human pose regression. In:  works. In: CVPR. (2014) 2  ICCV. (2017) 2, 3, 11  30. Pavlakos, G., Zhou, X., Derpanis, K.G., Daniilidis, K.: Coarse-to-fine volumetric  prediction for single-image 3D human pose. In: CVPR. (2017) 2, 3, 7  31. Heap, T., Hogg, D.: Towards 3D hand tracking using a deformable model. In: FG.  (1996) 2  (2001) 2  32. Wu, Y., Lin, J.Y., Huang, T.S.: Capturing natural hand articulation. In: ICCV.  33. Sigal, L., Balan, A.O., Black, M.J.: HumanEva: Synchronized video and motion capture dataset and baseline algorithm for evaluation of articulated human motion. IJCV 87(1) (2010) 4-27 2  34. de La Gorce, M., Fleet, D.J., Paragios, N.: Model-based 3D hand pose estimation  from monocular video. TPAMI (2011) 2  35. Lu, S., Metaxas, D., Samaras, D., Oliensis, J.: Using multiple cues for hand tracking  and model refinement. In: CVPR. (2003) 2  36. Bogo, F., Kanazawa, A., Lassner, C., Gehler, P., Romero, J., Black, M.J.: Keep it smpl: Automatic estimation of 3D human pose and shape from a single image. In: ECCV. (2016) 2  37. Panteleris, P., Oikonomidis, I., Argyros, A.: Using a single RGB frame for real  time 3D hand pose estimation in the wild. In: WACV. (2018) 2  38. Athitsos, V., Sclaroﬀ, S.: Estimating 3D hand pose from a cluttered image. In:  CVPR. (2003) 2  39. Romero, J., Kjellstr¨om, H., Kragic, D.: Hands in action: real-time 3D reconstruc-  tion of hands in interaction with objects. In: ICRA. (2010) 2  40. Chen, C., Ramanan, D.: 3D human pose estimation = 2D pose estimation +  matching. In: CVPR. (2017) 2  41. Iqbal, U., Doering, A., Yasin, H., Kr¨uger, B., Weber, A., Gall, J.: A dual-source  approach for 3D pose estimation in single images. CVIU (2018) 2  42. Ramakrishna, V., Kanade, T., Sheikh, Y.A.: Reconstructing 3D human pose from  2D image landmarks. In: ECCV. (2012) 3  43. Simo-Serra, E., Quattoni, A., Torras, C., Moreno-Noguer, F.: A joint model for  2D and 3D pose estimation from a single image. In: CVPR. (2013) 3  44. Akhter, I., Black, M.J.: Pose-conditioned joint angle limits for 3D human pose  reconstruction. In: CVPR. (2015) 3   Hand Pose Estimation via Latent 2.5D Heatmap Regression45. Tome, D., Russell, C., Agapito, L.: Lifting from the deep: Convolutional 3D pose  estimation from a single image. In: CVPR. (2017) 3  46. Moreno-Noguer, F.: 3D human pose estimation from a single image via distance  matrix regression. In: CVPR. (2017) 3  47. Martinez, J., Hossain, R., Romero, J., Little, J.J.: A simple yet eﬀective baseline  for 3D human pose estimation. In: ICCV. (2017) 3  48. Zimmermann, C., Brox, T.: Learning to estimate 3D hand pose from single RGB  images. In: ICCV. (2017) 3, 9, 10, 12, 13  49. Tekin, B., Marquez-Neila, P., Salzmann, M., Fua, P.: Learning to fuse 2D and 3D  image cues for monocular body pose estimation. In: ICCV. (2017) 3  50. Li, S., Chan, A.B.: 3D human pose estimation from monocular images with deep  convolutional neural network. In: ACCV. (2014) 3  51. Zhou, X., Sun, X., Zhang, W., Liang, S., Wei, Y.: Deep kinematic pose regression.  In: ECCV Workshops. (2016) 3  52. Mueller, F., Bernard, F., Sotnychenko, O., Mehta, D., Sridhar, S., Casas, D., Theobalt, C.: GANerated hands for real-time 3D hand tracking from monocu- lar RGB. In: CVPR. (2018) 3, 9, 12, 13  53. Spurr, A., Song, J., Park, S., Hilliges, O.: Cross-modal deep variational hand pose  estimation. In: CVPR. (2018) 3, 13  54. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., S. Ozair,  A.C., Bengio, Y.: Generative adversarial nets. In: NIPS. (2014) 3  55. Popa, A., Zanfir, M., Sminchisescu, C.: Deep multitask architecture for integrated  2D and 3D human sensing. In: CVPR. (2017) 3  56. Zhou, X., Huang, Q., Sun, X., Xue, X., Wei, Y.: Weakly-supervised transfer for  3D human pose estimation in the wild. In: ICCV. (2017) 3  57. Nie, B.X., Wei, P., Zhu, S.C.: Monocular 3D human pose estimation by predicting  depth on joints. In: ICCV. (2017) 3  58. Mehta, D., Sridhar, S., Sotnychenko, O., Rhodin, H., Shafiei, M., Seidel, H., Xu, W., Casas, D., Theobalt, C.: VNect: Real-time 3D human pose estimation with a single RGB camera. In: SIGGRAPH. (2017) 3  59. Tompson, J., Goroshin, R., Jain, A., LeCun, Y., Bregler, C.: Eﬃcient object  localization using convolutional networks. In: CVPR. (2015) 7  60. Simon, T., Joo, H., Matthews, I., Sheikh, Y.: Hand keypoint detection in single images using multiview bootstrapping. In: CVPR. (2017) 7, 9, 10, 11, 12, 13 61. Chapelle, O., Wu, M.: Gradient descent optimization of smoothed information  retrieval metrics. Information Retrieval (2010) 8  62. Mueller, F., Mehta, D., Sotnychenko, O., Sridhar, S., Casas, D., Theobalt, C.: Real-time hand tracking under occlusion from an egocentric RGB-D sensor. In: ICCV. (2017) 9  63. Nathan Silberman, Derek Hoiem, P.K., Fergus, R.: Indoor segmentation and sup-  port inference from RGBD images. In: ECCV. (2012) 9  64. Zhang, J., Jiao, J., Chen, M., Qu, L., Xu, X., Yang, Q.: 3D hand pose tracking and estimation using stereo matching. In: arXiv preprint arXiv:1610.07214. (2016) 9, 10  65. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomed-  ical image segmentation. (2015) 10  66. Redmon, J., Farhadi, A.: YOLO9000: better, faster, stronger. In: CVPR. (2017)  67. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.In: CVPR. (2016) 11"}