{"1": "1. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep In: Advances in Neural Information Processing  convolutional neural networks. Systems (NIPS). (2012)  2. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2016) 3. Durand, T., Mordan, T., Thome, N., Cord, M.: WILDCAT: Weakly Supervised Learning of Deep ConvNets for Image Classification, Pointwise Localization and Segmentation. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017)  4. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully convolutional networks. In: Advances in Neural Information Processing Systems (NIPS). (2016)  5. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified, real-time object detection. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2016)  6. Mordan, T., Thome, N., Cord, M., Henaﬀ, G.: Deformable Part-based Fully Con- volutional Network for Object Detection. In: British Machine Vision Conference (BMVC). (2017)  7. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Semantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) (2018)  8. Engilberge, M., Chevallier, L., P´erez, P., Cord, M.: Finding beans in burgers: Deep semantic-visual embedding with localization. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2018)  9. Carvalho, M., Cad`ene, R., Picard, D., Soulier, L., Thome, N., Cord, M.: Cross- modal retrieval in the cooking context: Learning semantic text-image embeddings. Special Interest Group on Information Retrieval (SIGIR) (2018)  10. Ben-Younes, H., Cad`ene, R., Thome, N., Cord, M.: Mutan: Multimodal tucker fusion for visual question answering. IEEE International Conference on Computer Vision (ICCV) (2017)  11. Krogh, A., Hertz, J.A.: A simple weight decay can improve generalization.  In:  Advances in Neural Information Processing Systems (NIPS). (1992)  12. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. Journal of Machine Learning Research (JMLR) (2016)  13. Srivastava, N., Hinton, G., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.: Dropout: A simple way to prevent neural networks from overfitting. Journal of Machine Learning Research (JMLR) (2014)  14. Blot, M., Robert, T., Thome, N., Cord, M.: Shade: Information-based regulariza- In: IEEE International Conference on Image Processing  tion for deep learning. (ICIP). (2018)  15. Bengio, Y., Lamblin, P., Popovici, D., Larochelle, H.: Greedy layer-wise training of deep networks. In: Advances in Neural Information Processing Systems (NIPS). (2007)  16. Hinton, G.E., Salakhutdinov, R.R.: Reducing the dimensionality of data with  neural networks. Science (2006)   HybridNet: Classification and Reconstruction Cooperation for SSLReferences  1. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep In: Advances in Neural Information Processing  convolutional neural networks. Systems (NIPS). (2012)  2. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2016) 3. Durand, T., Mordan, T., Thome, N., Cord, M.: WILDCAT: Weakly Supervised Learning of Deep ConvNets for Image Classification, Pointwise Localization and Segmentation. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017)  4. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully convolutional networks. In: Advances in Neural Information Processing Systems (NIPS). (2016)  5. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified, real-time object detection. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2016)  6. Mordan, T., Thome, N., Cord, M., Henaﬀ, G.: Deformable Part-based Fully Con- volutional Network for Object Detection. In: British Machine Vision Conference (BMVC). (2017)  7. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Semantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) (2018)  8. Engilberge, M., Chevallier, L., P´erez, P., Cord, M.: Finding beans in burgers: Deep semantic-visual embedding with localization. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2018)  9. Carvalho, M., Cad`ene, R., Picard, D., Soulier, L., Thome, N., Cord, M.: Cross- modal retrieval in the cooking context: Learning semantic text-image embeddings. Special Interest Group on Information Retrieval (SIGIR) (2018)  10. Ben-Younes, H., Cad`ene, R., Thome, N., Cord, M.: Mutan: Multimodal tucker fusion for visual question answering. IEEE International Conference on Computer Vision (ICCV) (2017)  11. Krogh, A., Hertz, J.A.: A simple weight decay can improve generalization.  In:  Advances in Neural Information Processing Systems (NIPS). (1992)  12. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. Journal of Machine Learning Research (JMLR) (2016)  13. Srivastava, N., Hinton, G., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.: Dropout: A simple way to prevent neural networks from overfitting. Journal of Machine Learning Research (JMLR) (2014)  14. Blot, M., Robert, T., Thome, N., Cord, M.: Shade: Information-based regulariza- In: IEEE International Conference on Image Processing  tion for deep learning. (ICIP). (2018)  15. Bengio, Y., Lamblin, P., Popovici, D., Larochelle, H.: Greedy layer-wise training of deep networks. In: Advances in Neural Information Processing Systems (NIPS). (2007)  16. Hinton, G.E., Salakhutdinov, R.R.: Reducing the dimensionality of data with  neural networks. Science (2006)   16  Thomas Robert, Nicolas Thome and Matthieu Cord  17. Zhao, J., Mathieu, M., Goroshin, R., LeCun, Y.: Stacked What-Where Auto- In: International Conference on Learning Representations Workshop  encoders. (ICLR-W). (2016)  18. Zhang, Y., Lee, K., Lee, H.: Augmenting supervised neural networks with unsuper- vised objectives for large-scale image classification. In: International Conference on Machine Learning (ICML). (2016)  19. Rasmus, A., Berglund, M., Honkala, M., Valpola, H., Raiko, T.: Semi-supervised In: Advances in Neural Information Processing  learning with ladder networks. Systems (NIPS). (2015)  20. Mallat, S.: Group invariant scattering. Communications on Pure and Applied  Mathematics (CPAM) (2012)  21. Bruna, J., Mallat, S.: Invariant scattering convolution networks. IEEE Transac-  tions on Pattern Analysis and Machine Intelligence (TPAMI) (2013)  22. Bietti, A., Mairal, J.: Group Invariance, Stability to Deformations, and Complex- ity of Deep Convolutional Representations. In: Advances in Neural Information Processing Systems (NIPS). (2017)  23. Sajjadi, M., Javanmardi, M., Tasdizen, T.: Regularization with stochastic trans- formations and perturbations for deep semi-supervised learning. In: Advances in Neural Information Processing Systems (NIPS). (2016)  24. Laine, S., Aila, T.: Temporal ensembling for semi-supervised learning. In: Inter-  national Conference on Learning Representations (ICLR). (2017)  25. Tarvainen, A., Valpola, H.: Mean teachers are better role models: Weight-averaged consistency targets improve semi-supervised deep learning results. In: Advances in Neural Information Processing Systems (NIPS). (2017)  26. Zhu, X.: Semi-supervised learning literature survey. Technical Report 1530, Com-  puter Sciences, University of Wisconsin-Madison (2005)  27. Ranzato, M., Szummer, M.: Semi-supervised learning of compact document repre- sentations with deep networks. In: International Conference on Machine Learning (ICML). (2008)  28. Ranzato, M., Huang, F.J., Boureau, Y.L., LeCun, Y.: Unsupervised learning of In: IEEE  invariant feature hierarchies with applications to object recognition. Conference on Computer Vision and Pattern Recognition (CVPR). (June 2007)  29. Vincent, P., Larochelle, H., Bengio, Y., Manzagol, P.A.: Extracting and compos- ing robust features with denoising autoencoders. In: International Conference on Machine Learning (ICML). (2008)  30. Ranzato, M., Poultney, C., Chopra, S., Lecun, Y.: Eﬃcient learning of sparse representations with an energy-based model. In: Advances in Neural Information Processing Systems (NIPS). (2007)  31. Larochelle, H., Bengio, Y.: Classification using discriminative restricted boltzmann machines. In: International Conference on Machine Learning (ICML). (2008) 32. Kingma, D.P., Mohamed, S., Rezende, D.J., Welling, M.: Semi-supervised learn- ing with deep generative models. In: Advances in Neural Information Processing Systems (NIPS). (2014)  33. Erhan, D., Bengio, Y., Courville, A., Manzagol, P.A., Vincent, P., Bengio, S.: Why does unsupervised pre-training help deep learning? Journal of Machine Learning Research (JMLR) (2010)  34. Goh, H., Thome, N., Cord, M., Lim, J.H.: Top-down regularization of deep belief networks. In: Advances in Neural Information Processing Systems (NIPS). (2013) 35. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., In: Advances in Neural  Courville, A., Bengio, Y.: Generative adversarial nets. Information Processing Systems (NIPS). (2014)   HybridNet: Classification and Reconstruction Cooperation for SSL36. Makhzani, A., Shlens, J., Jaitly, N., Goodfellow, I.: Adversarial autoencoders. In:  International Conference on Learning Representations (ICLR). (2016)  37. Hastie, T., Tibshirani, R., Friedman, J.: The Elements of Statistical Learning.  Springer (2009)  38. Th´eriault, C., Thome, N., Cord, M.: Dynamic Scene Classification: Learning Mo- tion Descriptors with Slow Features Analysis. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2013)  39. Goodfellow, I.J., Shlens, J., Szegedy, C.: Explaining and harnessing adversarial ex- amples. In: International Conference on Learning Representations (ICLR). (2015) 40. Miyato, T., Maeda, S.i., Koyama, M., Nakae, K., Ishii, S.: Distributional smooth- In: International Conference on Learning  ing with virtual adversarial training. Representations (ICLR). (2016)  41. Wojna, Z., Ferrari, V., Guadarrama, S., Silberman, N., Chen, L.C., Fathi, A., Uijlings, J.: The devil is in the decoder. In: British Machine Vision Conference (BMVC). (2017)  42. Dumoulin, V., Visin, F.: A guide to convolution arithmetic for deep learning.  Technical Report (2016)  43. Gomez, A.N., Ren, M., Urtasun, R., Grosse, R.B.: The reversible residual network: Backpropagation without storing activations. In: Advances in Neural Information Processing Systems (NIPS). (2017)  44. Jacobsen, J.H., Smeulders, A., Oyallon, E.:  i-RevNet: Deep Invertible Networks.  In: International Conference on Learning Representations (ICLR). (2018)  45. Sweldens, W.: The lifting scheme: A new philosophy in biorthogonal wavelet con- structions. In: Wavelet Applications in Signal and Image Processing III. (1995) 46. Mallat, S.G., Peyr´e, G.: A wavelet tour of signal processing : the sparse way.  Academic Press (2009)  47. Zeiler, M.D., Fergus, R.: Visualizing and understanding convolutional networks.  In: European Conference on Computer Vision (ECCV). (2014)  48. Netzer, Y., Wang, T., Coates, A., Bissacco, A., Wu, B., Ng, A.Y.: Reading digits in natural images with unsupervised feature learning. In: NIPS workshop on deep learning and unsupervised feature learning. (2011)  49. Krizhevsky, A., Hinton, G.: Learning multiple layers of features from tiny images.  Technical Report (2009)  50. Coates, A., Ng, A., Lee, H.: An analysis of single-layer networks in unsupervised feature learning. In: International Conference on Artificial Intelligence and Statis- tics (AISTATS). (2011)  51. Gastaldi, X.: Shake-shake regularization of 3-branch residual networks. In: Inter- national Conference on Learning Representations Workshop (ICLR-W). (2017) 52. Springenberg, J.T.: Unsupervised and Semi-supervised Learning with Categori- In: International Conference on Learning  cal Generative Adversarial Networks. Representations (ICLR). (2016)  53. Salimans, T., Goodfellow, I., Zaremba, W., Cheung, V., Radford, A., Chen, X., Chen, X.: Improved techniques for training gans. In Lee, D.D., Sugiyama, M., Luxburg, U.V., Guyon, I., Garnett, R., eds.: Advances in Neural Information Pro- cessing Systems (NIPS). Curran Associates, Inc. (2016)"}