{"1": "1. Ben-Shabat, Y., Lindenbaum, M., Fischer, A.: 3d point cloud classification and seg- mentation using 3d modified fisher vector representation for convolutional neural networks. arXiv preprint arXiv:1711.08241 (2017)  2. Chang, A., Dai, A., Funkhouser, T., Halber, M., Niebner, M., Savva, M., Song, S., Zeng, A., Zhang, Y.: Matterport3d: Learning from rgb-d data in indoor environ- ments. In: 3DV. pp. 667-676. IEEE (2017)  3. Chollet, F.: Xception: Deep learning with depthwise separable convolutions. In:  CVPR. pp. 1251-1258 (2017)  4. Dai, A., Qi, C.R., Nießner, M.: Shape completion using 3d-encoder-predictor cnns  and shape synthesis. In: CVPR. vol. 3 (2017)  5. Dai, A., Ritchie, D., Bokeloh, M., Reed, S., Sturm, J., Nießner, M.: Scancomplete: Large-scale scene completion and semantic segmentation for 3d scans. In: CVPR. vol. 1, p. 2 (2018)  6. Engelcke, M., Rao, D., Wang, D.Z., Tong, C.H., Posner, I.: Vote3deep: Fast object detection in 3d point clouds using eﬃcient convolutional neural networks. In: ICRA. pp. 1355-1361. IEEE (2017)  7. Firman, M., Mac Aodha, O., Julier, S., Brostow, G.J.: Structured prediction of unobserved voxels from a single depth image. In: CVPR. pp. 5431-5440 (2016) 8. Gong, Y., Liu, L., Yang, M., Bourdev, L.: Compressing deep convolutional networks  using vector quantization. arXiv preprint arXiv:1412.6115 (2014)  9. Graham, B.: Sparse 3d convolutional neural networks. arXiv preprint arX-  iv:1505.02890 (2015)  10. Graham, B., Engelcke, M., van der Maaten, L.: 3d semantic segmentation with  submanifold sparse convolutional networks. CVPR (2018)  11. Graham, B., van der Maaten, L.: Submanifold sparse convolutional networks. arXiv  12. Guo, R., Zou, C., Hoiem, D.: Predicting complete 3d models of indoor scenes.  preprint arXiv:1706.01307 (2017)  arXiv preprint arXiv:1504.02437 (2015)  13. Hackel, T., Usvyatsov, M., Galliani, S., Wegner, J.D., Schindler, K.: Inference, learning and attention mechanisms that exploit and preserve sparsity in convolu- tional networks. arXiv preprint arXiv:1801.10585 (2018)  14. Han, S., Pool, J., Tran, J., Dally, W.: Learning both weights and connections for  eﬃcient neural network. In: NIPS. pp. 1135-1143 (2015)  15. Han, X., Li, Z., Huang, H., Kalogerakis, E., Yu, Y.: High-resolution shape comple- tion using deep neural networks for global structure and local geometry inference. In: CVPR. pp. 85-93 (2017)  16. Handa, A., Patraucean, V., Badrinarayanan, V., Stent, S., Cipolla, R.: Under- standing real world indoor scenes with synthetic data. In: CVPR. pp. 4077-4085 (2016)  17. H¨ane, C., Tulsiani, S., Malik, J.: Hierarchical surface prediction for 3d object re-  18. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  construction. In: 3DV (2017)  In: CVPR. pp. 770-778 (2016)  19. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks.  In: ECCV. pp. 630-645. Springer (2016)  20. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: MobileNets: Eﬃcient Convolutional Neural Networks for Mobile Vision Applications. ArXiv e-prints (Apr 2017)   Semantic Scene Completion with Spatial Group ConvolutionReferences  1. Ben-Shabat, Y., Lindenbaum, M., Fischer, A.: 3d point cloud classification and seg- mentation using 3d modified fisher vector representation for convolutional neural networks. arXiv preprint arXiv:1711.08241 (2017)  2. Chang, A., Dai, A., Funkhouser, T., Halber, M., Niebner, M., Savva, M., Song, S., Zeng, A., Zhang, Y.: Matterport3d: Learning from rgb-d data in indoor environ- ments. In: 3DV. pp. 667-676. IEEE (2017)  3. Chollet, F.: Xception: Deep learning with depthwise separable convolutions. In:  CVPR. pp. 1251-1258 (2017)  4. Dai, A., Qi, C.R., Nießner, M.: Shape completion using 3d-encoder-predictor cnns  and shape synthesis. In: CVPR. vol. 3 (2017)  5. Dai, A., Ritchie, D., Bokeloh, M., Reed, S., Sturm, J., Nießner, M.: Scancomplete: Large-scale scene completion and semantic segmentation for 3d scans. In: CVPR. vol. 1, p. 2 (2018)  6. Engelcke, M., Rao, D., Wang, D.Z., Tong, C.H., Posner, I.: Vote3deep: Fast object detection in 3d point clouds using eﬃcient convolutional neural networks. In: ICRA. pp. 1355-1361. IEEE (2017)  7. Firman, M., Mac Aodha, O., Julier, S., Brostow, G.J.: Structured prediction of unobserved voxels from a single depth image. In: CVPR. pp. 5431-5440 (2016) 8. Gong, Y., Liu, L., Yang, M., Bourdev, L.: Compressing deep convolutional networks  using vector quantization. arXiv preprint arXiv:1412.6115 (2014)  9. Graham, B.: Sparse 3d convolutional neural networks. arXiv preprint arX-  iv:1505.02890 (2015)  10. Graham, B., Engelcke, M., van der Maaten, L.: 3d semantic segmentation with  submanifold sparse convolutional networks. CVPR (2018)  11. Graham, B., van der Maaten, L.: Submanifold sparse convolutional networks. arXiv  12. Guo, R., Zou, C., Hoiem, D.: Predicting complete 3d models of indoor scenes.  preprint arXiv:1706.01307 (2017)  arXiv preprint arXiv:1504.02437 (2015)  13. Hackel, T., Usvyatsov, M., Galliani, S., Wegner, J.D., Schindler, K.: Inference, learning and attention mechanisms that exploit and preserve sparsity in convolu- tional networks. arXiv preprint arXiv:1801.10585 (2018)  14. Han, S., Pool, J., Tran, J., Dally, W.: Learning both weights and connections for  eﬃcient neural network. In: NIPS. pp. 1135-1143 (2015)  15. Han, X., Li, Z., Huang, H., Kalogerakis, E., Yu, Y.: High-resolution shape comple- tion using deep neural networks for global structure and local geometry inference. In: CVPR. pp. 85-93 (2017)  16. Handa, A., Patraucean, V., Badrinarayanan, V., Stent, S., Cipolla, R.: Under- standing real world indoor scenes with synthetic data. In: CVPR. pp. 4077-4085 (2016)  17. H¨ane, C., Tulsiani, S., Malik, J.: Hierarchical surface prediction for 3d object re-  18. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  construction. In: 3DV (2017)  In: CVPR. pp. 770-778 (2016)  19. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks.  In: ECCV. pp. 630-645. Springer (2016)  20. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: MobileNets: Eﬃcient Convolutional Neural Networks for Mobile Vision Applications. ArXiv e-prints (Apr 2017)   16  Jiahui Zhang, Hao Zhao and et al.  21. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. In: ICML. pp. 448-456 (2015)  22. Johnston, A., Garg, R., Carneiro, G., Reid, I., vd Hengel, A.: Scaling cnns for high resolution volumetric reconstruction from a single image. In: ICCV Workshops (2017)  23. Klokov, R., Lempitsky, V.: Escape from cells: Deep kd-networks for the recognition  of 3d point cloud models. In: ICCV. pp. 863-872. IEEE (2017)  24. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS. pp. 1097-1105 (2012)  25. Le Cun, Y., Denker, J.S., Solla, S.A.: Optimal brain damage. In: NIPS. pp. 598-  605. NIPS’89, MIT Press, Cambridge, MA, USA (1989)  26. Li, X., Liu, Z., Luo, P., Change Loy, C., Tang, X.: Not all pixels are equal: Diﬃculty- aware semantic segmentation via deep layer cascade. In: CVPR. pp. 3193-3202 (2017)  27. Li, Y., Bu, R., Sun, M., Chen, B.: PointCNN. ArXiv e-prints (Jan 2018) 28. Li, Y., Pirk, S., Su, H., Qi, C.R., Guibas, L.J.: Fpnn: Field probing neural networks  for 3d data. In: NIPS. pp. 307-315 (2016)  29. Liu, F., Li, S., Zhang, L., Zhou, C., Ye, R., Wang, Y., Lu, J.: 3dcnn-dqn-rnn: A deep reinforcement learning framework for semantic parsing of large-scale 3d point clouds. In: CVPR. pp. 5678-5687 (2017)  30. Maturana, D., Scherer, S.: Voxnet: A 3d convolutional neural network for real-time  object recognition. In: IROS. pp. 922-928. IEEE (2015)  31. Qi, C.R., Su, H., Mo, K., Guibas, L.J.: Pointnet: Deep learning on point sets for  3d classification and segmentation. In: CVPR. pp. 652-660 (2017)  32. Qi, C.R., Su, H., Nießner, M., Dai, A., Yan, M., Guibas, L.J.: Volumetric and multi-view cnns for object classification on 3d data. In: CVPR. pp. 5648-5656 (2016)  33. Qi, C.R., Yi, L., Su, H., Guibas, L.J.: Pointnet++: Deep hierarchical feature learn-  ing on point sets in a metric space. In: NIPS. pp. 5105-5114 (2017)  34. Qi, X., Liao, R., Jia, J., Fidler, S., Urtasun, R.: 3D Graph Neural Networks for  RGBD Semantic Segmentation. In: ICCV (2017)  35. Ren, M., Pokrovsky, A., Yang, B., Urtasun, R.: Sbnet: Sparse blocks network for  fast inference. In: CVPR. pp. 8711-8720 (2018)  36. Riegler, G., Ulusoy, A.O., Bischof, H., Geiger, A.: Octnetfusion: Learning depth  fusion from data. In: 3DV (2017)  37. Riegler, G., Ulusoy, A.O., Geiger, A.: Octnet: Learning deep 3d representations at  high resolutions. In: CVPR. vol. 3 (2017)  38. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomed-  ical image segmentation. In: MICCAI. pp. 234-241. Springer (2015)  39. Silberman, N., Hoiem, D., Kohli, P., Fergus, R.: Indoor segmentation and support  inference from rgbd images. In: ECCV. pp. 746-760. Springer (2012)  40. Song, S., Yu, F., Zeng, A., Chang, A.X., Savva, M., Funkhouser, T.: Semantic scene completion from a single depth image. In: CVPR. pp. 190-198. IEEE (2017) 41. Tatarchenko, M., Dosovitskiy, A., Brox, T.: Octree generating networks: Eﬃcient convolutional architectures for high-resolution 3d outputs. In: CVPR. pp. 2088- 2096 (2017)  42. Uhrig, J., Schneider, N., Schneidre, L., Franke, U., Brox, T., Geiger, A.: Sparsity  invariant cnns. In: 3DV (2017)  43. Varley, J., DeChant, C., Richardson, A., Ruales, J., Allen, P.: Shape completion  enabled robotic grasping. In: IROS. pp. 2442-2447. IEEE (2017)   Semantic Scene Completion with Spatial Group Convolution44. Wang, P.S., Liu, Y., Guo, Y.X., Sun, C.Y., Tong, X.: O-cnn: Octree-based convo-  lutional neural networks for 3d shape analysis. TOG 36(4), 72 (2017)  45. Wu, Z., Song, S., Khosla, A., Yu, F., Zhang, L., Tang, X., Xiao, J.: 3d shapenets: A deep representation for volumetric shapes. In: CVPR. pp. 1912-1920 (2015) 46. Xie, S., Girshick, R., Doll´ar, P., Tu, Z., He, K.: Aggregated residual transformations  for deep neural networks. In: CVPR. pp. 5987-5995. IEEE (2017)  47. Yang, B., Rosa, S., Markham, A., Trigoni, N., Wen, H.: 3d object dense recon-  struction from a single depth view. arXiv preprint arXiv:1802.00411 (2018)  48. Yi, L., Guibas, L., Hertzmann, A., Kim, V.G., Su, H., Yumer, E.: Learning hierar- chical shape segmentation and labeling from online repositories. TOG 36(4), 70 (2017)  49. Yi, L., Shao, L., Savva, M., Huang, H., Zhou, Y., Wang, Q., Graham, B., Engelcke, M., Klokov, R., Lempitsky, V., Gan, Y., Wang, P., Liu, K., Yu, F., Shui, P., Hu, B., Zhang, Y., Li, Y., Bu, R., Sun, M., Wu, W., Jeong, M., Choi, J., Kim, C., Geetchandra, A., Murthy, N., Ramu, B., Manda, B., Ramanathan, M., Kumar, G., Preetham, P., Srivastava, S., Bhugra, S., Lall, B., Haene, C., Tulsiani, S., Malik, J., Lafer, J., Jones, R., Li, S., Lu, J., Jin, S., Yu, J., Huang, Q., Kalogerakis, E., Savarese, S., Hanrahan, P., Funkhouser, T., Su, H., Guibas, L.: Large-Scale 3D Shape Reconstruction and Segmentation from ShapeNet Core55 (2017)  50. Zhang, X., Zhou, X., Lin, M., Sun, J.: Shuﬄenet: An extremely eﬃcient convolu-  tional neural network for mobile devices. CVPR (2018)"}