{"1": "1. Liu, C., Sun, D.: A bayesian approach to adaptive video super resolution.  In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2011)  2. Kim, T.H., Lee, K.M.: Generalized video deblurring for dynamic scenes. In: Pro- ceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2015)  3. Zhao, W., Sawhney, H.S.: Is super-resolution with optical ﬂow feasible? In: Pro-  ceedings of the European Conference on Computer Vision (ECCV). (2002)  4. Dosovitskiy, A., Fischer, P., Ilg, E., Hausser, P., Hazirbas, C., Golkov, V., van der Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV). (2015)  5. Ilg, E., Mayer, N., Saikia, T., Keuper, M., Dosovitskiy, A., Brox, T.: Flownet 2.0: Evolution of optical ﬂow estimation with deep networks. Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  6. Ranjan, A., Black, M.J.: Optical ﬂow estimation using a spatial pyramid network. Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  7. Ren, Z., Yan, J., Ni, B., Liu, B., Yang, X., Zha, H.: Unsupervised deep learn- ing for optical ﬂow estimation. In: Association for the Advancement of Artificial Intelligence (AAAI). (2017)  8. Meister, S., Hur, J., Roth, S.: Unﬂow: Unsupervised learning of optical ﬂow with  a bidirectional census loss. In: AAAI. (2017)  9. Dosovitskiy, A., Springenberg, J.T., Brox, T.: Learning to generate chairs with con- volutional neural networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2015)  10. Mayer, N., Ilg, E., Hausser, P., Fischer, P., Cremers, D., Dosovitskiy, A., Brox, T.: A large dataset to train convolutional networks for disparity, optical ﬂow, and scene ﬂow estimation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2016)  11. Ahmadi, A., Patras, I.: Unsupervised convolutional neural networks for motion estimation. In: IEEE International Conference on Image Processing (ICIP). (2016) 12. Jason, J.Y., Harley, A.W., Derpanis, K.G.: Back to basics: Unsupervised learning of optical ﬂow via brightness constancy and motion smoothness. In: Proceedings of the European Conference on Computer Vision Workshops (ECCVW). (2016)  13. Jaderberg, M., Simonyan, K., Zisserman, A., Kavukcuoglu, K.: Spatial transformer networks. In: Advances in Neural Information Processing Systems (NIPS). (2015) 14. Zimmer, H., Bruhn, A., Weickert, J.: Optic ﬂow in harmony. International Journal  of Computer Vision (IJCV) 93(3) (2011) 368-388  15. Werlberger, M., Pock, T., Bischof, H.: Motion estimation with non-local total In: Proceedings of the IEEE Conference on Computer  variation regularization. Vision and Pattern Recognition (CVPR). (2010)  16. Lee, K.J., Kwon, D., Yun, I.D., Lee, S.U.: Optical ﬂow estimation with adap- tive convolution kernel prior on discrete framework. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2010)  17. Sun, D., Roth, S., Black, M.J.: Secrets of optical ﬂow estimation and their prin- ciples. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2010)   Spatio-Temporal Transformer Network for Video RestorationReferences  1. Liu, C., Sun, D.: A bayesian approach to adaptive video super resolution.  In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2011)  2. Kim, T.H., Lee, K.M.: Generalized video deblurring for dynamic scenes. In: Pro- ceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2015)  3. Zhao, W., Sawhney, H.S.: Is super-resolution with optical ﬂow feasible? In: Pro-  ceedings of the European Conference on Computer Vision (ECCV). (2002)  4. Dosovitskiy, A., Fischer, P., Ilg, E., Hausser, P., Hazirbas, C., Golkov, V., van der Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV). (2015)  5. Ilg, E., Mayer, N., Saikia, T., Keuper, M., Dosovitskiy, A., Brox, T.: Flownet 2.0: Evolution of optical ﬂow estimation with deep networks. Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  6. Ranjan, A., Black, M.J.: Optical ﬂow estimation using a spatial pyramid network. Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  7. Ren, Z., Yan, J., Ni, B., Liu, B., Yang, X., Zha, H.: Unsupervised deep learn- ing for optical ﬂow estimation. In: Association for the Advancement of Artificial Intelligence (AAAI). (2017)  8. Meister, S., Hur, J., Roth, S.: Unﬂow: Unsupervised learning of optical ﬂow with  a bidirectional census loss. In: AAAI. (2017)  9. Dosovitskiy, A., Springenberg, J.T., Brox, T.: Learning to generate chairs with con- volutional neural networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2015)  10. Mayer, N., Ilg, E., Hausser, P., Fischer, P., Cremers, D., Dosovitskiy, A., Brox, T.: A large dataset to train convolutional networks for disparity, optical ﬂow, and scene ﬂow estimation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2016)  11. Ahmadi, A., Patras, I.: Unsupervised convolutional neural networks for motion estimation. In: IEEE International Conference on Image Processing (ICIP). (2016) 12. Jason, J.Y., Harley, A.W., Derpanis, K.G.: Back to basics: Unsupervised learning of optical ﬂow via brightness constancy and motion smoothness. In: Proceedings of the European Conference on Computer Vision Workshops (ECCVW). (2016)  13. Jaderberg, M., Simonyan, K., Zisserman, A., Kavukcuoglu, K.: Spatial transformer networks. In: Advances in Neural Information Processing Systems (NIPS). (2015) 14. Zimmer, H., Bruhn, A., Weickert, J.: Optic ﬂow in harmony. International Journal  of Computer Vision (IJCV) 93(3) (2011) 368-388  15. Werlberger, M., Pock, T., Bischof, H.: Motion estimation with non-local total In: Proceedings of the IEEE Conference on Computer  variation regularization. Vision and Pattern Recognition (CVPR). (2010)  16. Lee, K.J., Kwon, D., Yun, I.D., Lee, S.U.: Optical ﬂow estimation with adap- tive convolution kernel prior on discrete framework. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2010)  17. Sun, D., Roth, S., Black, M.J.: Secrets of optical ﬂow estimation and their prin- ciples. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2010)   16  T.H. Kim, M.S.M. Sajjadi, M. Hirsch, and B. Sch¨olkopf  18. Xu, L., Jia, J., Matsushita, Y.: Motion detail preserving optical ﬂow estimation. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) 34(9) (2012) 1744-1757  19. Kim, T.H., Lee, H.S., Lee, K.M.: Optical ﬂow via locally adaptive fusion of com- plementary data costs. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV). (2013)  20. Volz, S., Bruhn, A., Valgaerts, L., Zimmer, H.: Modeling temporal coherence for optical ﬂow. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV). (2011)  21. Baker, S., Scharstein, D., Lewis, J., Roth, S., Black, M.J., Szeliski, R.: A database and evaluation methodology for optical ﬂow. International Journal of Computer Vision (IJCV) 92(1) (2011) 1-31  22. Butler, D.J., Wulﬀ, J., Stanley, G.B., Black, M.J.: A naturalistic open source movie for optical ﬂow evaluation. In: Proceedings of the European Conference on Computer Vision (ECCV). (2012)  23. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the kitti In: Proceedings of the IEEE Conference on Computer  vision benchmark suite. Vision and Pattern Recognition (CVPR). (2012)  24. Xu, J., Ranftl, R., Koltun, V.: Accurate optical ﬂow via direct cost volume pro- cessing. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017)  25. G¨uney, F., Geiger, A.: Deep discrete ﬂow. In: Proceedings of the Asian Conference  on Computer Vision (ACCV). (2016)  26. Revaud, J., Weinzaepfel, P., Harchaoui, Z., Schmid, C.: Deepmatching: Hierarchical International Journal of Computer Vision (IJCV)  deformable dense matching. 120(3) (2016) 300-323  27. Bailer, C., Taetz, B., Stricker, D.: Flow fields: Dense correspondence fields for highly accurate large displacement optical ﬂow estimation. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV). (2015)  28. Mitzel, D., Pock, T., Schoenemann, T., Cremers, D.: Video super resolution using duality based tv-l1 optical ﬂow. In: Joint Pattern Recognition Symposium. (2009) 29. Kappeler, A., Yoo, S., Dai, Q., Katsaggelos, A.K.: Video super-resolution with convolutional neural networks. IEEE Transactions on Computational Imaging 2(2) (2016) 109-122  30. Caballero, J., Ledig, C., Aitken, A., Acosta, A., Totz: Real-time video super- resolution with spatio-temporal networks and motion compensation. In: Pro- ceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017)  31. Makansi, O., Ilg, E., Brox, T.: End-to-end learning of video super-resolution with In: Proceedings of the German Conference on Pattern  motion compensation. Recognition (GCPR). (2017)  32. Tao, X., Gao, H., Liao, R., Wang, J., Jia, J.: Detail-revealing deep video super- In: Proceedings of the IEEE International Conference on Computer  resolution. Vision (ICCV). (2017)  33. Liu, D., Wang, Z., Fan, Y., Liu, X., Wang, Z., Chang, S., Huang, T.: Robust video In: Proceedings of the IEEE  super-resolution with learned temporal dynamics. Conference on Computer Vision and Pattern Recognition (CVPR). (2017)  34. Sajjadi, M.S.M., Vemulapalli, R., Brown, M.: Frame-recurrent video super- In: Proceedings of the IEEE Conference on Computer Vision and  resolution. Pattern Recognition (CVPR). (2018)   Spatio-Temporal Transformer Network for Video Restoration35. Cai, J.F., Ji, H., Liu, C., Shen, Z.: Blind motion deblurring using multiple images.  Journal of computational physics 228(14) (2009) 5057-5071  36. Zhang, H., Wipf, D., Zhang, Y.: Multi-image blind deblurring using a coupled adaptive sparse prior. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2013)  37. Cho, S., Cho, H., Tai, Y.W., Lee, S.: Registration based non-uniform motion  deblurring. Computer Graphics Forum 31(7) (2012) 2183-2192  38. Zhang, H., Carin, L.: Multi-shot imaging:  joint alignment, deblurring and In: Proceedings of the IEEE Conference on Computer  resolution-enhancement. Vision and Pattern Recognition (CVPR). (2014)  39. Zhang, H., Yang, J.: Intra-frame deblurring by leveraging inter-frame camera mo- tion. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2015)  40. Li, Y., Kang, S.B., Joshi, N., Seitz, S.M., Huttenlocher, D.P.: Generating sharp panoramas from motion-blurred videos. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2010)  41. Wulﬀ, J., Black, M.J.: Modeling blurred video with layers. In: Proceedings of the  European Conference on Computer Vision (ECCV). (2014)  42. Kim, T.H., Nah, S., Lee, K.M.: Dynamic video deblurring using a locally adaptive linear blur model. IEEE Transactions on Pattern Analysis and Machine Intelligence (PAMI) (2018)  43. Kim, T.H., Lee, K.M.: Segmentation-free dynamic scene deblurring.  In: Pro- ceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2014)  44. Nah, S., Kim, T.H., Lee, K.M.: Deep multi-scale convolutional neural network for dynamic scene deblurring. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017)  45. Su, S., Delbracio, M., Wang, J., Sapiro, G., Heidrich, W., Wang, O.: Deep video In: Proceedings of the IEEE Conference on Computer Vision and  deblurring. Pattern Recognition (CVPR). (2017)  46. Wieschollek, P., Hirsch, M., Sch¨olkopf, B., Lensch, H.P.: Learning blind motion deblurring. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV). (2017)  47. Kim, T.H., Lee, K.M., Sch¨olkopf, B., Hirsch, M.: Online video deblurring via dynamic temporal blending network. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV). (2017)  48. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomedi- cal image segmentation. In: International Conference on Medical image computing and computer-assisted intervention (MICCAI), Springer (2015) 234-241  49. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. International Conference on Machine Learning (2015)  50. Sajjadi, M.S.M., Sch¨olkopf, B., Hirsch, M.: EnhanceNet: Single image super- In: Proceedings of the IEEE  resolution through automated texture synthesis. International Conference on Computer Vision (ICCV). (2017)  51. Kim, J., Kwon Lee, J., Mu Lee, K.: Accurate image super-resolution using very deep convolutional networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2016)  52. P´erez, J.S., Meinhardt-Llopis, E., Facciolo, G.: Tv-l1 optical ﬂow estimation. Image  Processing On Line (IPOL) (2013)"}