{"1": "1. Xiang, L., Echtler, F., Kerl, C., Wiedemeyer, T., Lars, hanyazou, Gordon, R., Facioni, F., laborer2008, Wareham, R., Goldhoorn, M., alberth, gaborpapp, Fuchs, S., jmtatsch, Blake, J., Federico, Jungkurth, H., Mingze, Y., vinouz, Coleman, D., Burns, B., Rawat, R., Mokhov, S., Reynolds, P., Viau, P., Fraissinet-Tachet, M., Ludique, Billingham, J., Alistair: libfreenect2: Release 0.2 (April 2016)  2. Bhandari, A., Raskar, R.: Signal processing for time-of-ﬂight imaging sensors: An introduction to inverse problems in computational 3-d imaging. IEEE Signal Processing Magazine (2016)  3. Feigin, M., Bhandari, A., Izadi, S., Rhemann, C., Schmidt, M., Raskar, R.: Re- sensors  solving multipath interference in kinect: An inverse problem approach. (2016)  4. Marco, J., Hernandez, Q., Mu˜noz, A., Dong, Y., Jarabo, A., Kim, M.H., Tong, X., Gutierrez, D.: DeepToF: Oﬀ-the-shelf real-time correction of multipath interference in time-of-ﬂight imaging. In: ACM Transactions on Graphics (SIGGRAPH ASIA). (2017)  5. Mutny, M., Nair, R., Gottfried, J.: Learning the correction for multi-path devia-  tions in time-of-ﬂight cameras. arXiv preprint arXiv:1512.04077 (2015)  6. Son, K., Liu, M., Taguchi, Y.: Automatic learning to remove multipath dis- tortions in time-of-ﬂight range images for a robotic arm setup. arXiv preprint arXiv:1601.01750 (2016)  7. Dosovitskiy, A., Fischer, P., Ilg, E., H¨ausser, P., Hazırba¸s, C., Golkov, V., v.d. Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV). (2015)  8. Bako, S., Vogels, T., McWilliams, B., Meyer, M., Nov´ak, J., Harvill, A., Sen, P., DeRose, T., Rousselle, F.: Kernel-predicting convolutional networks for denoising monte carlo renderings. In: ACM Transactions on Graphics (SIGGRAPH). (2017) 9. Jiyoung Jung, Joon-Young Lee, I.S.K.: Noise aware depth denoising for a time-of- ﬂight camera. In: Korea-Japan Joint Workshop on Frontiers of Computer Vision. (2014)  10. Jarabo, A., Masia, B., Marco, J., Gutierrez, D.: Recent advances in transient  imaging: A computer graphics and vision perspective. Visual Informatics (2017)  11. Ferstl, D., Reinbacher, C., Riegler, G., Rther, M., Bischof, H.: Learning depth calibration of time-of-ﬂight cameras. In: Proceedings of the British Machine Vision Conference (BMVC). (2015)  12. Lenzen, F., Kim, K.I., Sch¨afer, H., Nair, R., Meister, S., Becker, F., Garbe, C.S., Theobalt, C.: Denoising strategies for time-of-ﬂight data. In: Time-of-Flight and Depth Imaging. (2013)  13. Gottfried, J.M., Nair, R., Meister, S., Garbe, C.S., Kondermann, D.: Time of ﬂight motion compensation revisited. In: IEEE International Conference on Image Processing (ICIP). (2014)  14. Lee, S.: Time-of-ﬂight depth camera motion blur detection and deblurring. IEEE  Signal Processing Letters (2014)  15. Hansard, M., Lee, S., Choi, O., Horaud, R.: Time-of-Flight Cameras: Principles, Methods and Applications. Springer Publishing Company, Incorporated (2012) 16. Heide, F., Heidrich, W., Hullin, M., Wetzstein, G.: Doppler time-of-ﬂight imaging.  In: ACM Transactions on Graphics (SIGGRAPH). (2015)   Tackling 3D ToF ArtifactsReferences  1. Xiang, L., Echtler, F., Kerl, C., Wiedemeyer, T., Lars, hanyazou, Gordon, R., Facioni, F., laborer2008, Wareham, R., Goldhoorn, M., alberth, gaborpapp, Fuchs, S., jmtatsch, Blake, J., Federico, Jungkurth, H., Mingze, Y., vinouz, Coleman, D., Burns, B., Rawat, R., Mokhov, S., Reynolds, P., Viau, P., Fraissinet-Tachet, M., Ludique, Billingham, J., Alistair: libfreenect2: Release 0.2 (April 2016)  2. Bhandari, A., Raskar, R.: Signal processing for time-of-ﬂight imaging sensors: An introduction to inverse problems in computational 3-d imaging. IEEE Signal Processing Magazine (2016)  3. Feigin, M., Bhandari, A., Izadi, S., Rhemann, C., Schmidt, M., Raskar, R.: Re- sensors  solving multipath interference in kinect: An inverse problem approach. (2016)  4. Marco, J., Hernandez, Q., Mu˜noz, A., Dong, Y., Jarabo, A., Kim, M.H., Tong, X., Gutierrez, D.: DeepToF: Oﬀ-the-shelf real-time correction of multipath interference in time-of-ﬂight imaging. In: ACM Transactions on Graphics (SIGGRAPH ASIA). (2017)  5. Mutny, M., Nair, R., Gottfried, J.: Learning the correction for multi-path devia-  tions in time-of-ﬂight cameras. arXiv preprint arXiv:1512.04077 (2015)  6. Son, K., Liu, M., Taguchi, Y.: Automatic learning to remove multipath dis- tortions in time-of-ﬂight range images for a robotic arm setup. arXiv preprint arXiv:1601.01750 (2016)  7. Dosovitskiy, A., Fischer, P., Ilg, E., H¨ausser, P., Hazırba¸s, C., Golkov, V., v.d. Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV). (2015)  8. Bako, S., Vogels, T., McWilliams, B., Meyer, M., Nov´ak, J., Harvill, A., Sen, P., DeRose, T., Rousselle, F.: Kernel-predicting convolutional networks for denoising monte carlo renderings. In: ACM Transactions on Graphics (SIGGRAPH). (2017) 9. Jiyoung Jung, Joon-Young Lee, I.S.K.: Noise aware depth denoising for a time-of- ﬂight camera. In: Korea-Japan Joint Workshop on Frontiers of Computer Vision. (2014)  10. Jarabo, A., Masia, B., Marco, J., Gutierrez, D.: Recent advances in transient  imaging: A computer graphics and vision perspective. Visual Informatics (2017)  11. Ferstl, D., Reinbacher, C., Riegler, G., Rther, M., Bischof, H.: Learning depth calibration of time-of-ﬂight cameras. In: Proceedings of the British Machine Vision Conference (BMVC). (2015)  12. Lenzen, F., Kim, K.I., Sch¨afer, H., Nair, R., Meister, S., Becker, F., Garbe, C.S., Theobalt, C.: Denoising strategies for time-of-ﬂight data. In: Time-of-Flight and Depth Imaging. (2013)  13. Gottfried, J.M., Nair, R., Meister, S., Garbe, C.S., Kondermann, D.: Time of ﬂight motion compensation revisited. In: IEEE International Conference on Image Processing (ICIP). (2014)  14. Lee, S.: Time-of-ﬂight depth camera motion blur detection and deblurring. IEEE  Signal Processing Letters (2014)  15. Hansard, M., Lee, S., Choi, O., Horaud, R.: Time-of-Flight Cameras: Principles, Methods and Applications. Springer Publishing Company, Incorporated (2012) 16. Heide, F., Heidrich, W., Hullin, M., Wetzstein, G.: Doppler time-of-ﬂight imaging.  In: ACM Transactions on Graphics (SIGGRAPH). (2015)   16  Q. Guo, I. Frosio, O. Gallo, T. Zickler, and J. Kautz  17. Freedman, D., Krupka, E., Smolin, Y., Leichter, I., Schmidt, M.: SRA: fast removal  of general multipath for tof sensors. arXiv preprint arXiv:1403.5919 (2014)  18. Gupta, M., Nayar, S.K., Hullin, M.B., Martin, J.: Phasor imaging: A generalization of correlation-based time-of-ﬂight imaging. ACM Transactions on Graphics (2015) 19. Nair, R., Meister, S., Lambers, M., Balda, M., Hofmann, H., Kolb, A., Konder- mann, D., J¨ahne, B.: Ground truth for evaluating time of ﬂight imaging. Time-of- Flight and Depth Imaging. Sensors, Algorithms, and Applications (2012)  20. Jarabo, A., Marco, J., Mu˜noz, A., Buisan, R., Jarosz, W., Gutierrez, D.: A frame- In: ACM Transactions on Graphics (SIGGRAPH  work for transient rendering. ASIA). (2014)  21. Gushov, V., Solodkin, Y.N.: Automatic processing of fringe patterns in integer  interferometers. Optics and Lasers in Engineering (1991)  22. Curless, B., Levoy, M.: A volumetric method for building complex models from range images. In: Proceedings of the 23rd annual conference on Computer graphics and interactive techniques, ACM (1996) 303-312 23. Burkardt, J.: Obj files: A 3d object format.  https://people.sc.fsu.edu/  24. Dana, K.J., Van Ginneken, B., Nayar, S.K., Koenderink, J.J.: Reﬂectance and  ~jburkardt/data/obj/obj.html (2016)  texture of real-world surfaces. (1999)  25. Mildenhall, B., Barron, J.T., Chen, J., Sharlet, D., Ng, R., Carroll, R.: Burst denoising with kernel prediction networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2018)  26. Su, S., Heide, F., Wetzstein, G., Heidrich, W.: Deep end-to-end time-of-ﬂight imaging. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (June 2018)"}