{"1": "1. Hays, J., Efros, A.A.: Scene completion using millions of photographs. In: ACM Transac-  tions on Graphics (TOG). Volume 26., ACM (2007) 4 1, 2, 9, 10  2. King, D., Cohen, S.F.: The commissar vanishes: the falsification of photographs and art in  Stalin’s Russia. Canongate (1997) 2  3. Farid, H.: Photo forensics. MIT Press (2016) 2, 3, 14 4. Zhu, J.Y., Krahenbuhl, P., Shechtman, E., Efros, A.A.: Learning a discriminative model for the perception of realism in composite images. In: The IEEE International Conference on Computer Vision (ICCV). (December 2015) 2  5. Tsai, Y.H., Shen, X., Lin, Z., Sunkavalli, K., Lu, X., Yang, M.H.: Deep image harmonization.  In: CVPR. (2017) 2  6. Barnes, C., Shechtman, E., Finkelstein, A., Goldman, D.B.: Patchmatch: A randomized correspondence algorithm for structural image editing. ACM Trans. Graph. 28(3) (2009) 24-1 2  7. Pathak, D., Krahenbuhl, P., Donahue, J., Darrell, T., Efros, A.A.: Context encoders: Feature learning by inpainting. In: The IEEE Conference on Computer Vision and Pattern Recogni- tion (CVPR). (June 2016) 2  8. Suwajanakorn, S., Seitz, S.M., Kemelmacher-Shlizerman, I.: Synthesizing obama: learning  lip sync from audio. ACM Transactions on Graphics (TOG) 36(4) (2017) 95 2  9. Chung, J.S., Jamaludin, A., Zisserman, A.: You said that? arXiv preprint arXiv:1705.02966  (2017) 2  10. of Standards, N.I., Technology: The 2017 nimble challenge evaluation datasets. https:  //www.nist.gov/itl/iad/mig/nimble-challenge 2  11. Liu, Q.: Detection of misaligned cropping and recompression with the same quantization  matrix and relevant forgery. (2011) 3  12. Luo, W., Huang, J., Qiu, G.: Jpeg error analysis and its applications to digital image forensics.  IEEE Transactions on Information Forensics and Security 5(3) (2010) 480-491 3  13. Huang, F., Huang, J., Shi, Y.Q.: Detecting double jpeg compression with the same quantiza- tion matrix. IEEE Transactions on Information Forensics and Security 5(4) (2010) 848-856 3  14. Popescu, A.C., Farid, H.: Exposing digital forgeries by detecting traces of resampling. IEEE  Transactions on signal processing (2005) 3  15. Swaminathan, A., Wu, M., Liu, K.R.: Digital image forensics via intrinsic fingerprints. 3(1)  (2008) 101-117 3  and Security (2017) 3  16. Agarwal, S., Farid, H.: Photo forensics from jpeg dimples. Workshop on Image Forensics  17. Salloum, R., Ren, Y., Kuo, C.J.: Image splicing localization using A multi-task fully convo-  lutional network (MFCN). CoRR abs/1709.02016 (2017) 3, 9, 10, 13  18. Barni, M., Bondi, L., Bonettini, N., Bestagini, P., Costanzo, A., Maggini, M., Tondi, B., Tubaro, S.: Aligned and non-aligned double JPEG detection using convolutional neural networks. CoRR abs/1708.00930 (2017) 3  19. Amerini, I., Uricchio, T., Ballan, L., Caldelli, R.: Localization of jpeg double compression through multi-domain convolutional neural networks. In: Proc. of IEEE CVPR Workshop on Media Forensics. (2017) 3  20. Wen, L., Qi, H., Lyu, S.: Contrast enhancement estimation for digital image forensics. arXiv  preprint arXiv:1706.03875 (2017) 3  21. Bondi, L., Baroffio, L., G¨uera, D., Bestagini, P., Delp, E.J., Tubaro, S.: First steps toward camera model identification with convolutional neural networks. IEEE Signal Processing Letters 24(3) (March 2017) 259-263 3, 5   Fighting Fake News: Image Splice Detection via Learned Self-ConsistencyReferences  1. Hays, J., Efros, A.A.: Scene completion using millions of photographs. In: ACM Transac-  tions on Graphics (TOG). Volume 26., ACM (2007) 4 1, 2, 9, 10  2. King, D., Cohen, S.F.: The commissar vanishes: the falsification of photographs and art in  Stalin’s Russia. Canongate (1997) 2  3. Farid, H.: Photo forensics. MIT Press (2016) 2, 3, 14 4. Zhu, J.Y., Krahenbuhl, P., Shechtman, E., Efros, A.A.: Learning a discriminative model for the perception of realism in composite images. In: The IEEE International Conference on Computer Vision (ICCV). (December 2015) 2  5. Tsai, Y.H., Shen, X., Lin, Z., Sunkavalli, K., Lu, X., Yang, M.H.: Deep image harmonization.  In: CVPR. (2017) 2  6. Barnes, C., Shechtman, E., Finkelstein, A., Goldman, D.B.: Patchmatch: A randomized correspondence algorithm for structural image editing. ACM Trans. Graph. 28(3) (2009) 24-1 2  7. Pathak, D., Krahenbuhl, P., Donahue, J., Darrell, T., Efros, A.A.: Context encoders: Feature learning by inpainting. In: The IEEE Conference on Computer Vision and Pattern Recogni- tion (CVPR). (June 2016) 2  8. Suwajanakorn, S., Seitz, S.M., Kemelmacher-Shlizerman, I.: Synthesizing obama: learning  lip sync from audio. ACM Transactions on Graphics (TOG) 36(4) (2017) 95 2  9. Chung, J.S., Jamaludin, A., Zisserman, A.: You said that? arXiv preprint arXiv:1705.02966  (2017) 2  10. of Standards, N.I., Technology: The 2017 nimble challenge evaluation datasets. https:  //www.nist.gov/itl/iad/mig/nimble-challenge 2  11. Liu, Q.: Detection of misaligned cropping and recompression with the same quantization  matrix and relevant forgery. (2011) 3  12. Luo, W., Huang, J., Qiu, G.: Jpeg error analysis and its applications to digital image forensics.  IEEE Transactions on Information Forensics and Security 5(3) (2010) 480-491 3  13. Huang, F., Huang, J., Shi, Y.Q.: Detecting double jpeg compression with the same quantiza- tion matrix. IEEE Transactions on Information Forensics and Security 5(4) (2010) 848-856 3  14. Popescu, A.C., Farid, H.: Exposing digital forgeries by detecting traces of resampling. IEEE  Transactions on signal processing (2005) 3  15. Swaminathan, A., Wu, M., Liu, K.R.: Digital image forensics via intrinsic fingerprints. 3(1)  (2008) 101-117 3  and Security (2017) 3  16. Agarwal, S., Farid, H.: Photo forensics from jpeg dimples. Workshop on Image Forensics  17. Salloum, R., Ren, Y., Kuo, C.J.: Image splicing localization using A multi-task fully convo-  lutional network (MFCN). CoRR abs/1709.02016 (2017) 3, 9, 10, 13  18. Barni, M., Bondi, L., Bonettini, N., Bestagini, P., Costanzo, A., Maggini, M., Tondi, B., Tubaro, S.: Aligned and non-aligned double JPEG detection using convolutional neural networks. CoRR abs/1708.00930 (2017) 3  19. Amerini, I., Uricchio, T., Ballan, L., Caldelli, R.: Localization of jpeg double compression through multi-domain convolutional neural networks. In: Proc. of IEEE CVPR Workshop on Media Forensics. (2017) 3  20. Wen, L., Qi, H., Lyu, S.: Contrast enhancement estimation for digital image forensics. arXiv  preprint arXiv:1706.03875 (2017) 3  21. Bondi, L., Baroffio, L., G¨uera, D., Bestagini, P., Delp, E.J., Tubaro, S.: First steps toward camera model identification with convolutional neural networks. IEEE Signal Processing Letters 24(3) (March 2017) 259-263 3, 5   16  Huh et al.  22. Bondi, L., Lameri, S., G¨uera, D., Bestagini, P., Delp, E.J., Tubaro, S.: Tampering detection In: Proceedings of the and localization through clustering of camera-based cnn features. IEEE Conference on Computer Vision and Pattern Recognition Workshops. (2017) 1855- 1864 3  23. Zhou, P., Han, X., Morariu, V.I., Davis, L.S.: Two-stream neural networks for tampered face detection. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) Workshops. (July 2017) 3  24. Zhou, P., Han, X., Morariu, V.I., Davis, L.S.: Learning rich features for image manipulation detection. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (June 2018) 3  25. Owen Mayer, M.C.S.: Learned forensic source similarity for unknown camra models. IEEE  International Conference on Acoustics, Speech and Signal Processing (2018) 4  26. Chen, B.C., Ghosh, P., Morariu, V.I., Davis., L.S.: Detection of metadata tampering through IEEE  discrepancy between image content and metadata using multi-task deep learning. Conference on Computer Vision and Pattern Recognition Workshops (CVPRW) (2017) 4 27. de Sa, V.: Learning classification with unlabeled data. In: Neural Information Processing  28. Doersch, C., Gupta, A., Efros, A.A.: Unsupervised visual representation learning by context  29. Jayaraman, D., Grauman, K.: Learning image representations tied to ego-motion. In: ICCV.  Systems. (1994) 4  prediction. ICCV (2015) 4, 5  (December 2015) 4  30. Agrawal, P., Carreira, J., Malik, J.: Learning to see by moving. In: ICCV. (2015) 4 31. Owens, A., Wu, J., McDermott, J.H., Freeman, W.T., Torralba, A.: Ambient sound provides  32. Zhang, R., Isola, P., Efros, A.A.: Split-brain autoencoders: Unsupervised learning by cross-  33. Isola, P., Zoran, D., Krishnan, D., Adelson, E.H.:  Learning visual groups from co-  supervision for visual learning. (2016) 4  channel prediction. (2017) 4  occurrences in space and time. (2016) 4, 7  34. Kuthirummal, S., Agarwala, A., Goldman, D.B., Nayar, S.K.: Priors for large photo col- lections and what they reveal about cameras. In: European conference on computer vision, Springer (2008) 74-87 4  35. Hoai, M., De la Torre, F.: Max-margin early event detectors. International Journal of Com-  puter Vision 107(2) (2014) 191-202 4  36. Mahadevan, V., Li, W., Bhalodia, V., Vasconcelos, N.: Anomaly detection in crowded scenes. In: Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on, IEEE (2010) 1975-1981 4  37. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2016) 770-778 5, 10  38. Lalonde, J.F., Efros, A.A.: Using color compatibility for assessing image realism. In: Com- puter Vision, 2007. ICCV 2007. IEEE 11th International Conference on, IEEE (2007) 1-8 7  39. Cheng, Y.: Mean shift, mode seeking, and clustering. IEEE Transactions on Pattern Analysis  and Machine Intelligence 17(8) (Aug 1995) 790-799 8  40. Shi, J., Malik, J.: Normalized cuts and image segmentation. IEEE Transactions on Pattern  Analysis and Machine Intelligence 22(8) (Aug 2000) 888-905 8  41. Ng, T.T., Chang, S.F.: A data set of authentic and spliced image blocks. (2004) 8, 9, 10 42. d. Carvalho, T.J., Riess, C., Angelopoulou, E., Pedrini, H., d. R. Rocha, A.: Exposing dig- ital image forgeries by illumination color classification. IEEE Transactions on Information Forensics and Security 8(7) (July 2013) 1182-1194 9, 10   Fighting Fake News: Image Splice Detection via Learned Self-Consistency43. Korus, P., Huang, J.: Evaluation of random field models in multi-modal unsupervised tam- pering localization. In: Proc. of IEEE Int. Workshop on Inf. Forensics and Security. (2016) 9, 10  44. Moreira, D., Bharati, A., Brogan, J., Pinto, A., Parowski, M., Bowyer, K.W., Flynn, arXiv preprint  Image provenance analysis at scale.  P.J., Rocha, A., Scheirer, W.J.: arXiv:1801.06510 (2018) 9  45. Ferrara, P., Bianchi, T., Rosa, A.D., Piva, A.:  Image forgery localization via fine-grained analysis of cfa artifacts. IEEE Trans. Information Forensics and Security 7(5) (2012) 1566- 1577 9, 10  46. Ye, S., Sun, Q., Chang, E.C.: Detecting digital image forgeries by measuring inconsistencies  of blocking artifact. In: ICME07. (2017) 9, 10  47. Mahdian, B., Saic, S.: Using noise inconsistencies for blind image forensics. In: IVC09.  (2009) 9, 10  48. Zampoglou, M., Papadopoulos, S., Kompatsiaris, Y., Bouwmeester, R., Spangenberg, J.: Web and social media image forensics for news professionals. In: Social Media In the News- Room, SMNews16@CWSM, Tenth International AAAI Conference on Web and Social Me- dia workshops. (2016) 9  49. Shelhamer, E., Long, J., Darrell, T.: Fully convolutional networks for semantic segmentation.  CoRR abs/1605.06211 (2016) 9  50. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A Large-Scale Hier-  archical Image Database. In: CVPR09. (2009) 10  51. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. CoRR abs/1412.6980  (2014) 10  (2014) 14  52. Ian J. Goodfellow, Y.B.: Generative adversarial networks. arXiv preprint arXiv:1406.2661  53. Szegedy, C., Zaremba, W., Sutskever, I., Bruna, J., Erhan, D., Goodfellow, I., Fergus, R.:  Intriguing properties of neural networks. arXiv preprint arXiv:1312.6199 (2013) 14"}