{"1": "1. Bourdev, L., Brandt, J.: Robust object detection via soft cascade. In: IEEE CVPR.  2. Cai, Z., Vasconcelos, N.: Cascade r-cnn: Delving into high quality object detection.  vol. 2, pp. 236-243 (2005)  In: IEEE CVPR (June 2018)  3. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully  convolutional networks. In: NIPS. pp. 379-387 (2016)  4. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. In: IEEE ICCV. pp. 764-773 (2017)  5. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: IEEE CVPR. pp. 248-255 (2009)  6. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The pascal visual object classes (voc) challenge. IJCV 88(2), 303-338 (Jun 2010) 7. Felzenszwalb, P.F., Girshick, R.B., McAllester, D., Ramanan, D.: Object detection with discriminatively trained part-based models. IEEE TPAMI 32(9), 1627-1645 (2010)  8. Freund, Y., Schapire, R.E.: A decision-theoretic generalization of on-line learning and an application to boosting. Journal of computer and system sciences 55(1), 119-139 (1997)  9. Fu, C.Y., Liu, W., Ranga, A., Tyagi, A., Berg, A.C.: Dssd: Deconvolutional single  shot detector. arXiv preprint arXiv:1701.06659 (2017)  10. Girshick, R.: Fast r-cnn. In: IEEE ICCV. pp. 1440-1448 (2015) 11. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: IEEE CVPR. pp. 580-587 (2014)  12. Goyal, P., Doll´ar, P., Girshick, R., Noordhuis, P., Wesolowski, L., Kyrola, A., Tul- loch, A., Jia, Y., He, K.: Accurate, large minibatch sgd: training imagenet in 1 hour. arXiv preprint arXiv:1706.02677 (2017)  13. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: IEEE ICCV. pp.  2980-2988 (2017)  14. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional  networks for visual recognition. In: ECCV. pp. 346-361 (2014)  15. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: IEEE CVPR. pp. 770-778 (2016)  16. Li, H., Lin, Z., Shen, X., Brandt, J., Hua, G.: A convolutional neural network  cascade for face detection. In: IEEE CVPR. pp. 5325-5334 (2015)  17. Li, J., Liang, X., Li, J., Wei, Y., Xu, T., Feng, J., Yan, S.: Multistage object detection with group recursive learning. IEEE Transactions on Multimedia 20(7), 1645-1655 (2018)  18. Li, J., Liang, X., Wei, Y., Xu, T., Feng, J., Yan, S.: Perceptual generative adver-  sarial networks for small object detection. In: IEEE CVPR (2017)  19. Li, J., Wei, Y., Liang, X., Dong, J., Xu, T., Feng, J., Yan, S.: Attentive contexts for object detection. IEEE Transactions on Multimedia 19(5), 944-954 (2017) 20. Liang, X., Liu, S., Wei, Y., Liu, L., Lin, L., Yan, S.: Towards computational baby learning: A weakly-supervised approach for object detection. In: IEEE ICCV. pp. 999-1007 (2015)  21. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature  pyramid networks for object detection. In: IEEE CVPR. vol. 1, p. 4 (2017)   Revisiting RCNNReferences  1. Bourdev, L., Brandt, J.: Robust object detection via soft cascade. In: IEEE CVPR.  2. Cai, Z., Vasconcelos, N.: Cascade r-cnn: Delving into high quality object detection.  vol. 2, pp. 236-243 (2005)  In: IEEE CVPR (June 2018)  3. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully  convolutional networks. In: NIPS. pp. 379-387 (2016)  4. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. In: IEEE ICCV. pp. 764-773 (2017)  5. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: IEEE CVPR. pp. 248-255 (2009)  6. Everingham, M., Van Gool, L., Williams, C.K.I., Winn, J., Zisserman, A.: The pascal visual object classes (voc) challenge. IJCV 88(2), 303-338 (Jun 2010) 7. Felzenszwalb, P.F., Girshick, R.B., McAllester, D., Ramanan, D.: Object detection with discriminatively trained part-based models. IEEE TPAMI 32(9), 1627-1645 (2010)  8. Freund, Y., Schapire, R.E.: A decision-theoretic generalization of on-line learning and an application to boosting. Journal of computer and system sciences 55(1), 119-139 (1997)  9. Fu, C.Y., Liu, W., Ranga, A., Tyagi, A., Berg, A.C.: Dssd: Deconvolutional single  shot detector. arXiv preprint arXiv:1701.06659 (2017)  10. Girshick, R.: Fast r-cnn. In: IEEE ICCV. pp. 1440-1448 (2015) 11. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: IEEE CVPR. pp. 580-587 (2014)  12. Goyal, P., Doll´ar, P., Girshick, R., Noordhuis, P., Wesolowski, L., Kyrola, A., Tul- loch, A., Jia, Y., He, K.: Accurate, large minibatch sgd: training imagenet in 1 hour. arXiv preprint arXiv:1706.02677 (2017)  13. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: IEEE ICCV. pp.  2980-2988 (2017)  14. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional  networks for visual recognition. In: ECCV. pp. 346-361 (2014)  15. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: IEEE CVPR. pp. 770-778 (2016)  16. Li, H., Lin, Z., Shen, X., Brandt, J., Hua, G.: A convolutional neural network  cascade for face detection. In: IEEE CVPR. pp. 5325-5334 (2015)  17. Li, J., Liang, X., Li, J., Wei, Y., Xu, T., Feng, J., Yan, S.: Multistage object detection with group recursive learning. IEEE Transactions on Multimedia 20(7), 1645-1655 (2018)  18. Li, J., Liang, X., Wei, Y., Xu, T., Feng, J., Yan, S.: Perceptual generative adver-  sarial networks for small object detection. In: IEEE CVPR (2017)  19. Li, J., Wei, Y., Liang, X., Dong, J., Xu, T., Feng, J., Yan, S.: Attentive contexts for object detection. IEEE Transactions on Multimedia 19(5), 944-954 (2017) 20. Liang, X., Liu, S., Wei, Y., Liu, L., Lin, L., Yan, S.: Towards computational baby learning: A weakly-supervised approach for object detection. In: IEEE ICCV. pp. 999-1007 (2015)  21. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature  pyramid networks for object detection. In: IEEE CVPR. vol. 1, p. 4 (2017)   16  B. Cheng, Y. Wei, H. Shi, R. Feris, J. Xiong and T. Huang  22. Lin, T.Y., Goyal, P., Girshick, R., He, K., Dollar, P.: Focal loss for dense object  detection. In: IEEE ICCV. pp. 2980-2988 (2017)  23. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: ECCV. pp. 740-755 (2014)  24. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  Single shot multibox detector. In: ECCV. pp. 21-37 (2016)  25. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified,  real-time object detection. In: IEEE CVPR. pp. 779-788 (2016)  26. Redmon, J., Farhadi, A.: Yolo9000: Better, faster, stronger. In: IEEE CVPR. pp.  6517-6525 (2017)  27. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de-  tection with region proposal networks. In: NIPS. pp. 91-99 (2015)  28. Sermanet, P., Eigen, D., Zhang, X., Mathieu, M., Fergus, R., LeCun, Y.: Overfeat: Integrated recognition, localization and detection using convolutional networks. arXiv preprint arXiv:1312.6229 (2013)  29. Uijlings, J.R., Van De Sande, K.E., Gevers, T., Smeulders, A.W.: Selective search  for object recognition. IJCV 104(2), 154-171 (2013)  30. Viola, P., Jones, M.J.: Robust real-time face detection. IJCV 57(2), 137-154 (2004) 31. Wei, Y., Shen, Z., Cheng, B., Shi, H., Xiong, J., Feng, J., Huang, T.: Ts2c: Tight box mining with surrounding segmentation context for weakly supervised object detection. In: ECCV (2018)  32. Xie, S., Girshick, R., Doll´ar, P., Tu, Z., He, K.: Aggregated residual transformations  for deep neural networks. In: IEEE CVPR. pp. 5987-5995 (2017)  33. Xu, H., Lv, X., Wang, X., Ren, Z., Chellappa, R.: Deep regionlets for object de-  tection. arXiv preprint arXiv:1712.02408 (2017)"}