{"1": "1. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  2. Coates, A., Ng, A., Lee, H.: An analysis of single-layer networks in unsupervised feature learning. In: Proceedings of the fourteenth international conference on ar- tificial intelligence and statistics. pp. 215-223 (2011)  3. Crone, E.A., Wendelken, C., Van Leijenhorst, L., Honomichl, R.D., Christoﬀ, K., Bunge, S.A.: Neurocognitive development of relational reasoning. Developmental science 12(1), 55-66 (2009)  4. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully convolutional networks. In: Advances in neural information processing systems. pp. 379-387 (2016)  5. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. arXiv preprint arXiv:1703.06211 (2017)  6. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A Large-  Scale Hierarchical Image Database. In: CVPR09 (2009)  7. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 580-587 (2014)  8. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional networks for visual recognition. In: European Conference on Computer Vision. pp. 346-361. Springer (2014)  9. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016)  10. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural computation  9(8), 1735-1780 (1997)  11. Holschneider, M., Kronland-Martinet, R., Morlet, J., Tchamitchian, P.: A real-time algorithm for signal analysis with the help of the wavelet transform. In: Wavelets, pp. 286-297. Springer (1990)  12. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks. arXiv preprint  arXiv:1709.01507 (2017)  13. Jaderberg, M., Simonyan, K., Zisserman, A., et al.: Spatial transformer networks. In: Advances in Neural Information Processing Systems. pp. 2017-2025 (2015) 14. Jeon, Y., Kim, J.: Active convolution: Learning the shape of convolution for image  classification. arXiv preprint arXiv:1703.09076 (2017)  15. Jia, Y., Huang, C., Darrell, T.: Beyond spatial pyramids: Receptive field learning for pooled image features. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on. pp. 3370-3377. IEEE (2012)  16. Johnson, J., Hariharan, B., van der Maaten, L., Fei-Fei, L., Zitnick, C.L., Girshick, R.: Clevr: A diagnostic dataset for compositional language and elementary visual reasoning. arXiv preprint arXiv:1612.06890 (2016)  17. Johnson, J., Hariharan, B., van der Maaten, L., Hoﬀman, J., Fei-Fei, L., Zitnick, C.L., Girshick, R.: Inferring and executing programs for visual reasoning. arXiv preprint arXiv:1705.03633 (2017)  18. Kemp, C., Tenenbaum, J.B.: The discovery of structural form. Proceedings of the  National Academy of Sciences 105(31), 10687-10692 (2008)   Broadcasting Convolutional Network for Visual Relational ReasoningReferences  1. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  2. Coates, A., Ng, A., Lee, H.: An analysis of single-layer networks in unsupervised feature learning. In: Proceedings of the fourteenth international conference on ar- tificial intelligence and statistics. pp. 215-223 (2011)  3. Crone, E.A., Wendelken, C., Van Leijenhorst, L., Honomichl, R.D., Christoﬀ, K., Bunge, S.A.: Neurocognitive development of relational reasoning. Developmental science 12(1), 55-66 (2009)  4. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully convolutional networks. In: Advances in neural information processing systems. pp. 379-387 (2016)  5. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. arXiv preprint arXiv:1703.06211 (2017)  6. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A Large-  Scale Hierarchical Image Database. In: CVPR09 (2009)  7. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for ac- curate object detection and semantic segmentation. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 580-587 (2014)  8. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional networks for visual recognition. In: European Conference on Computer Vision. pp. 346-361. Springer (2014)  9. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016)  10. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural computation  9(8), 1735-1780 (1997)  11. Holschneider, M., Kronland-Martinet, R., Morlet, J., Tchamitchian, P.: A real-time algorithm for signal analysis with the help of the wavelet transform. In: Wavelets, pp. 286-297. Springer (1990)  12. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks. arXiv preprint  arXiv:1709.01507 (2017)  13. Jaderberg, M., Simonyan, K., Zisserman, A., et al.: Spatial transformer networks. In: Advances in Neural Information Processing Systems. pp. 2017-2025 (2015) 14. Jeon, Y., Kim, J.: Active convolution: Learning the shape of convolution for image  classification. arXiv preprint arXiv:1703.09076 (2017)  15. Jia, Y., Huang, C., Darrell, T.: Beyond spatial pyramids: Receptive field learning for pooled image features. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on. pp. 3370-3377. IEEE (2012)  16. Johnson, J., Hariharan, B., van der Maaten, L., Fei-Fei, L., Zitnick, C.L., Girshick, R.: Clevr: A diagnostic dataset for compositional language and elementary visual reasoning. arXiv preprint arXiv:1612.06890 (2016)  17. Johnson, J., Hariharan, B., van der Maaten, L., Hoﬀman, J., Fei-Fei, L., Zitnick, C.L., Girshick, R.: Inferring and executing programs for visual reasoning. arXiv preprint arXiv:1705.03633 (2017)  18. Kemp, C., Tenenbaum, J.B.: The discovery of structural form. Proceedings of the  National Academy of Sciences 105(31), 10687-10692 (2008)   16  Simyung Chang, John Yang, SeongUk Park, Nojun Kwak  19. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Advances in neural information processing systems. pp. 1097-1105 (2012)  20. LeCun, Y.: The mnist database of handwritten digits. http://yann.  lecun.  com/exdb/mnist/ (1998)  21. LeCun, Y., Bengio, Y., et al.: Convolutional networks for images, speech, and time series. The handbook of brain theory and neural networks 3361(10), 1995 (1995) 22. Liang, X., Wei, Y., Shen, X., Yang, J., Lin, L., Yan, S.: Proposal-free network for  instance-level object segmentation. arXiv preprint arXiv:1509.02636 (2015)  23. Logan, G.D., Sadler, D.D.: A computational analysis of the apprehension of spatial  relations. (1996)  24. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3431-3440 (2015)  25. Luo, W., Li, Y., Urtasun, R., Zemel, R.: Understanding the eﬀective receptive field in deep convolutional neural networks. In: Advances in Neural Information Processing Systems. pp. 4898-4906 (2016)  26. Perez, E., Strub, F., De Vries, H., Dumoulin, V., Courville, A.: Film: Visual rea- soning with a general conditioning layer. arXiv preprint arXiv:1709.07871 (2017) 27. Raposo, D., Santoro, A., Barrett, D., Pascanu, R., Lillicrap, T., Battaglia, P.: Discovering objects and their relations from entangled scene representations. arXiv preprint arXiv:1702.05068 (2017)  28. Raven, J.C.: Standardization of progressive matrices, 1938. Psychology and Psy-  chotherapy: Theory, Research and Practice 19(1), 137-150 (1941)  29. Santoro, A., Raposo, D., Barrett, D.G., Malinowski, M., Pascanu, R., Battaglia, P., Lillicrap, T.: A simple neural network module for relational reasoning. arXiv preprint arXiv:1706.01427 (2017)  30. Srivastava, R.K., Greﬀ, K., Schmidhuber, J.: Training very deep networks. In:  Advances in neural information processing systems. pp. 2377-2385 (2015)  31. Thoma, M.: Analysis and optimization of convolutional neural network architec-  tures. arXiv preprint arXiv:1707.09725 (2017)  32. Tian, Y., Zhu, Y.: Better computer go player with neural network and long-term  prediction. arXiv preprint arXiv:1511.06410 (2015)  33. Yu, F., Koltun, V.: Multi-scale context aggregation by dilated convolutions. arXiv  preprint arXiv:1511.07122 (2015)"}