{"1": "1. Open video project: http://www.open-video.org/ 2. Youtube statistics: https://www.youtube.com/yt/press/statistics.html 3. Bahdanau, D., Cho, K., Bengio, Y.: Neural machine translation by jointly learning  to align and translate. In: ICLR (2015)  4. Bahdanau, D., Chorowski, J., Serdyuk, D., Brakel, P., Bengio, Y.: End-to-end  attention-based large vocabulary speech recognition. In: ICASSP (2016)  5. Bellet, A., Habrard, A., Sebban, M.: Metric learning. Synthesis Lectures on Arti-  ficial Intelligence and Machine Learning 9(1), 1-151 (2015)  6. Chao, W.L., Gong, B., Grauman, K., Sha, F.: Large-margin determinantal point  processes. In: UAI (2015)  7. Cho, K., Van Merri¨enboer, B., Gulcehre, C., Bahdanau, D., Bougares, F., Schwenk, H., Bengio, Y.: Learning phrase representations using rnn encoder-decoder for statistical machine translation. arXiv preprint (2014)  8. Chu, W.S., Song, Y., Jaimes, A.: Video co-summarization: Video summarization  by visual co-occurrence. In: CVPR (2015)  9. Chung, J., Ahn, S., Bengio, Y.: Hierarchical multiscale recurrent neural networks.  arXiv preprint (2016)  10. Dai, A.M., Le, Q.V.: Semi-supervised sequence learning. In: NIPS (2015) 11. De Avila, S.E.F., Lopes, A.P.B., da Luz, A., de Albuquerque Ara´ujo, A.: Vsumm: A mechanism designed to produce static video summaries and a novel evaluation method. Pattern Recognition Letters 32(1), 56-68 (2011)  12. Furini, M., Geraci, F., Montangero, M., Pellegrini, M.: Stimo: Still and moving video storyboard for the web scenario. Multimedia Tools and Applications 46(1), 47-69 (2010)  13. Gers, F.A., Schmidhuber, J., Cummins, F.: Learning to forget: Continual prediction  with lstm. Neural Computation 12(10), 2451-2471 (2000)  14. Goldman, D.B., Curless, B., Salesin, D., Seitz, S.M.: Schematic storyboarding for video visualization and editing. ACM Transactions on Graphics 25(3), 862-871 (2006)  15. Gong, B., Chao, W.L., Grauman, K., Sha, F.: Diverse sequential subset selection  for supervised video summarization. In: NIPS (2014)  16. Graves, A., Jaitly, N.: Towards end-to-end speech recognition with recurrent neural  networks. In: ICML (2014)  17. Graves, A., Schmidhuber, J.: Framewise phoneme classification with bidirectional lstm and other neural network architectures. Neural Networks 18(5), 602-610 (2005)  18. Gygli, M., Grabner, H., Van Gool, L.: Video summarization by learning submod-  ular mixtures of objectives. In: CVPR (2015)  19. Gygli, M., Grabner, H., Riemenschneider, H., Van Gool, L.: Creating summaries  20. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural computation  from user videos. In: ECCV (2014)  9(8), 1735-1780 (1997)  21. Hong, R., Tang, J., Tan, H.K., Yan, S., Ngo, C., Chua, T.S.: Event driven summa-  rization for web videos. In: SIGMM Workshop (2009)  22. Jean, S., Cho, K., Memisevic, R., Bengio, Y.: On using very large target vocabulary  for neural machine translation. In: ACL (2015)  23. Jean, S., Firat, O., Cho, K., Memisevic, R., Bengio, Y.: Montreal neural machine  translation systems for wmt15. In: WMT (2015)   Retrospective Encoders for Video SummarizationReferences  1. Open video project: http://www.open-video.org/ 2. Youtube statistics: https://www.youtube.com/yt/press/statistics.html 3. Bahdanau, D., Cho, K., Bengio, Y.: Neural machine translation by jointly learning  to align and translate. In: ICLR (2015)  4. Bahdanau, D., Chorowski, J., Serdyuk, D., Brakel, P., Bengio, Y.: End-to-end  attention-based large vocabulary speech recognition. In: ICASSP (2016)  5. Bellet, A., Habrard, A., Sebban, M.: Metric learning. Synthesis Lectures on Arti-  ficial Intelligence and Machine Learning 9(1), 1-151 (2015)  6. Chao, W.L., Gong, B., Grauman, K., Sha, F.: Large-margin determinantal point  processes. In: UAI (2015)  7. Cho, K., Van Merri¨enboer, B., Gulcehre, C., Bahdanau, D., Bougares, F., Schwenk, H., Bengio, Y.: Learning phrase representations using rnn encoder-decoder for statistical machine translation. arXiv preprint (2014)  8. Chu, W.S., Song, Y., Jaimes, A.: Video co-summarization: Video summarization  by visual co-occurrence. In: CVPR (2015)  9. Chung, J., Ahn, S., Bengio, Y.: Hierarchical multiscale recurrent neural networks.  arXiv preprint (2016)  10. Dai, A.M., Le, Q.V.: Semi-supervised sequence learning. In: NIPS (2015) 11. De Avila, S.E.F., Lopes, A.P.B., da Luz, A., de Albuquerque Ara´ujo, A.: Vsumm: A mechanism designed to produce static video summaries and a novel evaluation method. Pattern Recognition Letters 32(1), 56-68 (2011)  12. Furini, M., Geraci, F., Montangero, M., Pellegrini, M.: Stimo: Still and moving video storyboard for the web scenario. Multimedia Tools and Applications 46(1), 47-69 (2010)  13. Gers, F.A., Schmidhuber, J., Cummins, F.: Learning to forget: Continual prediction  with lstm. Neural Computation 12(10), 2451-2471 (2000)  14. Goldman, D.B., Curless, B., Salesin, D., Seitz, S.M.: Schematic storyboarding for video visualization and editing. ACM Transactions on Graphics 25(3), 862-871 (2006)  15. Gong, B., Chao, W.L., Grauman, K., Sha, F.: Diverse sequential subset selection  for supervised video summarization. In: NIPS (2014)  16. Graves, A., Jaitly, N.: Towards end-to-end speech recognition with recurrent neural  networks. In: ICML (2014)  17. Graves, A., Schmidhuber, J.: Framewise phoneme classification with bidirectional lstm and other neural network architectures. Neural Networks 18(5), 602-610 (2005)  18. Gygli, M., Grabner, H., Van Gool, L.: Video summarization by learning submod-  ular mixtures of objectives. In: CVPR (2015)  19. Gygli, M., Grabner, H., Riemenschneider, H., Van Gool, L.: Creating summaries  20. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural computation  from user videos. In: ECCV (2014)  9(8), 1735-1780 (1997)  21. Hong, R., Tang, J., Tan, H.K., Yan, S., Ngo, C., Chua, T.S.: Event driven summa-  rization for web videos. In: SIGMM Workshop (2009)  22. Jean, S., Cho, K., Memisevic, R., Bengio, Y.: On using very large target vocabulary  for neural machine translation. In: ACL (2015)  23. Jean, S., Firat, O., Cho, K., Memisevic, R., Bengio, Y.: Montreal neural machine  translation systems for wmt15. In: WMT (2015)   16  K. Zhang, K. Grauman, and F. Sha  24. Ji, Z., Xiong, K., Pang, Y., Li, X.: Video summarization with attention-based  encoder-decoder networks. arXiv preprint (2017)  25. Kang, H.W., Matsushita, Y., Tang, X., Chen, X.Q.: Space-time video montage. In:  CVPR (2006)  26. Khosla, A., Hamid, R., Lin, C.J., Sundaresan, N.: Large-scale video summarization  using web-image priors. In: CVPR (2013)  27. Kim, G., Xing, E.P.: Reconstructing storyline graphs for image recommendation  from web community photos. In: CVPR (2014)  28. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  (2014)  29. Lagani`ere, R., Bacco, R., Hocevar, A., Lambert, P., Pa¨ıs, G., Ionescu, B.E.: Video summarization from spatio-temporal features. In: ACM TRECVid Video Summa- rization Workshop (2008)  30. Lee, Y.J., Ghosh, J., Grauman, K.: Discovering important people and objects for  egocentric video summarization. In: CVPR (2012)  31. Li, Y., Merialdo, B.: Multi-video summarization based on video-mmr. In: WIAMIS  Workshop (2010)  32. Liu, D., Hua, G., Chen, T.: A hierarchical visual model for video object summa- rization. Pattern Analysis and Machine Intelligence, IEEE Transactions on 32(12), 2178-2190 (2010)  33. Liu, T., Kender, J.R.: Optimization algorithms for the selection of key frame se-  quences of variable length. In: ECCV (2002)  34. Lu, Z., Grauman, K.: Story-driven summarization for egocentric video. In: CVPR  (2013)  35. Luong, M.T., Pham, H., Manning, C.D.: Eﬀective approaches to attention-based  neural machine translation. arXiv preprint (2015)  36. Ma, Y.F., Lu, L., Zhang, H.J., Li, M.: A user attention model for video summa-  37. Maaten, L.v.d., Hinton, G.: Visualizing data using t-sne. Journal of machine learn-  rization. In: ACM MM (2002)  ing research 9(Nov), 2579-2605 (2008)  38. Mahasseni, B., Lam, M., Todorovic, S.: Unsupervised video summarization with  adversarial lstm networks. In: CVPR (2017)  39. Mueller, J., Giﬀord, D., Jaakkola, T.: Sequence to better sequence: continuous  revision of combinatorial structures. In: ICML. pp. 2536-2544 (2017)  40. Mundur, P., Rao, Y., Yesha, Y.: Keyframe-based video summarization using de- launay clustering. International Journal on Digital Libraries 6(2), 219-232 (2006) 41. Nam, J., Tewfik, A.H.: Event-driven video abstraction and visualization. Multime-  dia Tools and Applications 16(1-2), 55-77 (2002)  42. Ng, J.Y.H., Hausknecht, M., Vijayanarasimhan, S., Vinyals, O., Monga, R., Toderici, G.: Beyond short snippets: Deep networks for video classification. In: CVPR (2015)  43. Ngo, C.W., Ma, Y.F., Zhang, H.: Automatic video summarization by graph mod-  eling. In: ICCV (2003)  44. Panda, R., Das, A., Wu, Z., Ernst, J., Roy-Chowdhury, A.K.: Weakly supervised  summarization of web videos. In: ICCV (2017)  45. Potapov, D., Douze, M., Harchaoui, Z., Schmid, C.: Category-specific video sum-  46. Pritch, Y., Rav-Acha, A., Gutman, A., Peleg, S.: Webcam synopsis: Peeking around  marization. In: ECCV (2014)  the world. In: ICCV (2007)  47. Ramachandran, P., Liu, P.J., Le, Q.V.: Unsupervised pretraining for sequence to  sequence learning. arXiv preprint (2016)   Retrospective Encoders for Video Summarization48. Sharghi, A., Gong, B., Shah, M.: Query-focused extractive video summarization.  In: ECCV (2016)  49. Sharghi, A., Laurel, J.S., Gong, B.: Query-focused video summarization: Dataset,  evaluation, and a memory network based approach. In: CVPR (2017)  50. Song, Y., Vallmitjana, J., Stent, A., Jaimes, A.: Tvsum: Summarizing web videos  51. Sun, M., Farhadi, A., Taskar, B., Seitz, S.: Salient montages from unconstrained  52. Sutskever, I., Vinyals, O., Le, Q.V.: Sequence to sequence learning with neural  using titles. In: CVPR (2015)  videos. In: ECCV (2014)  networks. In: NIPS (2014)  53. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A.: Going deeper with convolutions. In: CVPR (2015) 54. Vasudevan, A.B., Gygli, M., Volokitin, A., Van Gool, L.: Query-adaptive video summarization via quality-aware relevance estimation. In: ACM MM (2017) 55. Venugopalan, S., Rohrbach, M., Donahue, J., Mooney, R., Darrell, T., Saenko, K.:  Sequence to sequence-video to text. In: ICCV (2015)  56. Vinyals, O., Kaiser,  L., Koo, T., Petrov, S., Sutskever, I., Hinton, G.: Grammar as  57. Vinyals, O., Toshev, A., Bengio, S., Erhan, D.: Show and tell: A neural image  a foreign language. In: NIPS (2015)  caption generator. In: CVPR (2015)  58. Wu, Y., Schuster, M., Chen, Z., Le, Q.V., Norouzi, M., Macherey, W., Krikun, M., Cao, Y., Gao, Q., Macherey, K., et al.: Google’s neural machine translation system: Bridging the gap between human and machine translation. arXiv preprint (2016)  59. Xu, K., Ba, J., Kiros, R., Cho, K., Courville, A.C., Salakhutdinov, R., Zemel, R.S., Bengio, Y.: Show, attend and tell: Neural image caption generation with visual attention. In: ICML (2015)  60. Yang, H., Wang, B., Lin, S., Wipf, D., Guo, M., Guo, B.: Unsupervised extraction  of video highlights via robust recurrent auto-encoders. In: ICCV (2015) 61. Zaremba, W., Sutskever, I.: Learning to execute. arXiv preprint (2014) 62. Zeng, K.H., Chen, T.H., Niebles, J.C., Sun, M.: Title generation for user generated  videos. In: ECCV (2016)  63. Zhang, H.J., Wu, J., Zhong, D., Smoliar, S.W.: An integrated system for content- based video retrieval and browsing. Pattern Recognition 30(4), 643-658 (1997) 64. Zhang, K., Chao, W.L., Sha, F., Grauman, K.: Summary transfer: Exemplar-based  subset selection for video summarization. In: CVPR (2016)  65. Zhang, K., Chao, W.L., Sha, F., Grauman, K.: Video summarization with long  short-term memory. In: ECCV (2016)  66. Zhao, B., Li, X., Lu, X.: Hierarchical recurrent neural network for video summa-  67. Zhao, B., Xing, E.P.: Quasi real-time summarization for consumer videos. In:  rization. In: ACM MM (2017)  CVPR (2014)  68. Zhou, K., Qiao, Y.: Deep reinforcement learning for unsupervised video summa-  rization with diversity-representativeness reward. arXiv preprint (2017)"}