{"1": "1. Arandjelovi´c, R., Gronat, P., Torii, A., Pajdla, T., Sivic, J.: NetVLAD: CNN ar-  chitecture for weakly supervised place recognition. In: CVPR (2016)  2. Arandjelovi´c, R., Zisserman, A.: Visual Vocabulary with a Semantic Twist. In:  ACCV (2014)  3. Ardeshir, S., Zamir, A.R., Torroella, A., Shah, M.: GIS-Assisted Object Detection  and Geospatial Localization. In: ECCV (2014)  4. Atanasov, N., Zhu, M., Daniilidis, K., Pappas, G.J.: Localization from semantic  observations via the matrix permanent. IJRR 35(1-3), 73-99 (2016)  5. Badino, H., Huber, D., Kanade, T.: Visual Topometric Localization. In: IV (2011) 6. Brachmann, E., Krull, A., Nowozin, S., Shotton, J., Michel, F., Gumhold, S., Rother, C.: DSAC - Diﬀerentiable RANSAC for Camera Localization. In: CVPR (2017)  7. Brachmann, E., Rother, C.: Learning Less is More - 6D Camera Localization via  3D Surface Regression. In: CVPR (2018)  8. Camposeco, F., Sattler, T., Cohen, A., Geiger, A., Pollefeys, M.: Toroidal Con- straints for Two-Point Localization under High Outlier Ratios. In: CVPR (2017) 9. Castle, R.O., Klein, G., Murray, D.W.: Video-rate localization in multiple maps  for wearable augmented reality. In: ISWC (2008)  10. Cavallari, T., Golodetz, S., Lord, N.A., Valentin, J., Di Stefano, L., Torr, P.H.S.: On-The-Fly Adaptation of Regression Forests for Online Camera Relocalisation. In: CVPR (2017)  11. Chen, D.M., Baatz, G., K¨oser, K., Tsai, S.S., Vedantham, R., Pylv¨an¨ainen, T., Roimela, K., Chen, X., Bach, J., Pollefeys, M., Girod, B., Grzeszczuk, R.: City- Scale Landmark Identification on Mobile Devices. In: CVPR (2011)  12. Choudhary, S., Narayanan, P.J.: Visibility Probability Structure from SfM Datasets  and Applications. In: ECCV (2012)  13. Chum, O., Matas, J.: Matching with PROSAC - progressive sample consensus. In:  CVPR (2005)  14. Cohen, A., Sattler, T., Pollefeys, M.: Merging the Unmatchable: Stitching Visually  Disconnected SfM Models. In: ICCV (2015)  15. Cohen, A., Sch¨onberger, J.L., Speciale, P., Sattler, T., Frahm, J., Pollefeys, M.:  Indoor-Outdoor 3D Reconstruction Alignment. In: ECCV (2016)  16. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The Cityscapes Dataset for Semantic Urban Scene Understanding. In: CVPR (2016)  17. Cummins, M., Newman, P.: Appearance-only SLAM at large scale with FAB-MAP  2.0. IJRR 30(9), 1100-1123 (2011)  18. Fischler, M., Bolles, R.: Random Sampling Consensus: A Paradigm for Model Fit- ting with Application to Image Analysis and Automated Cartography. Commun. ACM 24, 381-395 (1981)  19. Haralick, R., Lee, C.N., Ottenberg, K., N¨olle, M.: Review and analysis of solutions of the three point perspective pose estimation problem. IJCV 13(3), 331-356 (1994) 20. Irschara, A., Zach, C., Frahm, J.M., Bischof, H.: From Structure-from-Motion Point  Clouds to Fast Location Recognition. In: CVPR (2009)  21. Kendall, A., Cipolla, R.: Geometric loss functions for camera pose regression with  deep learning. In: CVPR (2017)  22. Kendall, A., Grimes, M., Cipolla, R.: PoseNet: A Convolutional Network for Real-  Time 6-DOF Camera Relocalization. In: ICCV (2015)   Semantic Match ConsistencyReferences  1. Arandjelovi´c, R., Gronat, P., Torii, A., Pajdla, T., Sivic, J.: NetVLAD: CNN ar-  chitecture for weakly supervised place recognition. In: CVPR (2016)  2. Arandjelovi´c, R., Zisserman, A.: Visual Vocabulary with a Semantic Twist. In:  ACCV (2014)  3. Ardeshir, S., Zamir, A.R., Torroella, A., Shah, M.: GIS-Assisted Object Detection  and Geospatial Localization. In: ECCV (2014)  4. Atanasov, N., Zhu, M., Daniilidis, K., Pappas, G.J.: Localization from semantic  observations via the matrix permanent. IJRR 35(1-3), 73-99 (2016)  5. Badino, H., Huber, D., Kanade, T.: Visual Topometric Localization. In: IV (2011) 6. Brachmann, E., Krull, A., Nowozin, S., Shotton, J., Michel, F., Gumhold, S., Rother, C.: DSAC - Diﬀerentiable RANSAC for Camera Localization. In: CVPR (2017)  7. Brachmann, E., Rother, C.: Learning Less is More - 6D Camera Localization via  3D Surface Regression. In: CVPR (2018)  8. Camposeco, F., Sattler, T., Cohen, A., Geiger, A., Pollefeys, M.: Toroidal Con- straints for Two-Point Localization under High Outlier Ratios. In: CVPR (2017) 9. Castle, R.O., Klein, G., Murray, D.W.: Video-rate localization in multiple maps  for wearable augmented reality. In: ISWC (2008)  10. Cavallari, T., Golodetz, S., Lord, N.A., Valentin, J., Di Stefano, L., Torr, P.H.S.: On-The-Fly Adaptation of Regression Forests for Online Camera Relocalisation. In: CVPR (2017)  11. Chen, D.M., Baatz, G., K¨oser, K., Tsai, S.S., Vedantham, R., Pylv¨an¨ainen, T., Roimela, K., Chen, X., Bach, J., Pollefeys, M., Girod, B., Grzeszczuk, R.: City- Scale Landmark Identification on Mobile Devices. In: CVPR (2011)  12. Choudhary, S., Narayanan, P.J.: Visibility Probability Structure from SfM Datasets  and Applications. In: ECCV (2012)  13. Chum, O., Matas, J.: Matching with PROSAC - progressive sample consensus. In:  CVPR (2005)  14. Cohen, A., Sattler, T., Pollefeys, M.: Merging the Unmatchable: Stitching Visually  Disconnected SfM Models. In: ICCV (2015)  15. Cohen, A., Sch¨onberger, J.L., Speciale, P., Sattler, T., Frahm, J., Pollefeys, M.:  Indoor-Outdoor 3D Reconstruction Alignment. In: ECCV (2016)  16. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The Cityscapes Dataset for Semantic Urban Scene Understanding. In: CVPR (2016)  17. Cummins, M., Newman, P.: Appearance-only SLAM at large scale with FAB-MAP  2.0. IJRR 30(9), 1100-1123 (2011)  18. Fischler, M., Bolles, R.: Random Sampling Consensus: A Paradigm for Model Fit- ting with Application to Image Analysis and Automated Cartography. Commun. ACM 24, 381-395 (1981)  19. Haralick, R., Lee, C.N., Ottenberg, K., N¨olle, M.: Review and analysis of solutions of the three point perspective pose estimation problem. IJCV 13(3), 331-356 (1994) 20. Irschara, A., Zach, C., Frahm, J.M., Bischof, H.: From Structure-from-Motion Point  Clouds to Fast Location Recognition. In: CVPR (2009)  21. Kendall, A., Cipolla, R.: Geometric loss functions for camera pose regression with  deep learning. In: CVPR (2017)  22. Kendall, A., Grimes, M., Cipolla, R.: PoseNet: A Convolutional Network for Real-  Time 6-DOF Camera Relocalization. In: ICCV (2015)   16  C. Toft et al.  23. Kneip, L., Scaramuzza, D., Siegwart, R.: A Novel Parametrization of the Perspective-Three-Point Problem for a Direct Computation of Absolute Camera Position and Orientation. In: CVPR (2011)  24. Knopp, J., Sivic, J., Pajdla, T.: Avoding Confusing Features in Place Recognition.  In: ECCV (2010)  25. Kobyshev, N., Riemenschneider, H., Gool, L.V.: Matching Features Correctly  through Semantic Understanding. In: 3DV (2014)  26. Kukelova, Z., Bujnak, M., Pajdla, T.: Closed-form Solutions to Minimal Absolute  Pose Problems with Known Vertical Direction. In: ACCV (2011)  27. Li, Y., Snavely, N., Huttenlocher, D., Fua, P.: Worldwide Pose Estimation Using  28. Li, Y., Snavely, N., Huttenlocher, D.P.: Location Recognition using Prioritized  3D Point Clouds. In: ECCV (2012)  Feature Matching. In: ECCV (2010)  29. Liu, L., Li, H., Dai, Y.: Eﬃcient Global 2D-3D Matching for Camera Localization  in a Large-Scale 3D Map. In: ICCV (2017)  30. Lowe, D.: Distinctive Image Features from Scale-Invariant Keypoints. IJCV 60(2)  (2004)  31. Lynen, S., Sattler, T., Bosse, M., Hesch, J., Pollefeys, M., Siegwart, R.: Get Out of My Lab: Large-scale, Real-Time Visual-Inertial Localization. In: RSS (2015) 32. Maddern, W., Pascoe, G., Linegar, C., Newman, P.: 1 Year, 1000km: The Oxford  RobotCar Dataset. IJRR 36(1), 3-15 (2017)  33. Massiceti, D., Krull, A., Brachmann, E., Rother, C., Torr, P.H.: Random Forests versus Neural Networks - What’s Best for Camera Relocalization? In: ICRA (2017) 34. Neuhold, G., Ollmann, T., Rota Bul`o, S., Kontschieder, P.: The Mapillary Vis- tas Dataset for Semantic Understanding of Street Scenes. In: ICCV (2017), https://www.mapillary.com/dataset/vistas  35. Salas-Moreno, R.F., Newcombe, R.A., Strasdat, H., Kelly, P.H.J., Davison, A.J.: SLAM++: Simultaneous Localisation and Mapping at the Level of Objects. In: CVPR (2013)  36. Sattler, T., Leibe, B., Kobbelt, L.: Eﬃcient & Eﬀective Prioritized Matching for  Large-Scale Image-Based Localization. PAMI 39(9), 1744-1756 (2017)  37. Sattler, T., Maddern, W., Toft, C., Torii, A., Hammarstrand, L., Stenborg, E., Safari, D., Okutomi, M., Pollefeys, M., Sivic, J., Kahl, F., Pajdla, T.: Benchmarking 6DOF Outdoor Visual Localization in Changing Conditions. In: CVPR (2018) 38. Sattler, T., Havlena, M., Radenovic, F., Schindler, K., Pollefeys, M.: Hyperpoints and Fine Vocabularies for Large-Scale Location Recognition. In: ICCV (2015) 39. Sattler, T., Havlena, M., Schindler, K., Pollefeys, M.: Large-Scale Location Recog-  nition and the Geometric Burstiness Problem. In: CVPR (2016)  40. Sattler, T., Torii, A., Sivic, J., Pollefeys, M., Taira, H., Okutomi, M., Pajdla, T.: Are Large-Scale 3D Models Really Necessary for Accurate Visual Localization? In: CVPR (2017)  41. Schindler, G., Brown, M., Szeliski, R.: City-Scale Location Recognition. In: CVPR  42. Sch¨onberger, J.L., Pollefeys, M., Geiger, A., Sattler, T.: Semantic Visual Localiza-  43. Sch¨onberger, J.L., Frahm, J.M.: Structure-From-Motion Revisited. In: CVPR  44. Schreiber, M., Kn¨oppel, C., Franke, U.: LaneLoc: Lane marking based localization  using highly accurate maps. In: IV (2013)  (2007)  (2016)  tion. In: CVPR (2018)   Semantic Match Consistency45. Shotton, J., Glocker, B., Zach, C., Izadi, S., Criminisi, A., Fitzgibbon, A.: Scene Coordinate Regression Forests for Camera Relocalization in RGB-D Images. In: CVPR (2013)  46. Singh, G., Koˇseck´a, J.: Semantically Guided Geo-location and Modeling in Urban  Environments. In: Large-Scale Visual Geo-Localization (2016)  47. Sv¨arm, L., Enqvist, O., Kahl, F., Oskarsson, M.: City-Scale Localization for Cam-  eras with Known Vertical Direction. PAMI 39(7), 1455-1461 (2017)  48. Toft, C., Olsson, C., Kahl, F.: Long-term 3D Localization and Pose from Semantic  Labellings. In: ICCV Workshops (2017)  49. Torii, A., Arandjelovi´c, R., Sivic, J., Okutomi, M., Pajdla, T.: 24/7 Place Recog-  nition by View Synthesis. In: CVPR (2015)  50. Valentin, J., Nießner, M., Shotton, J., Fitzgibbon, A., Izadi, S., Torr, P.: Exploiting Uncertainty in Regression Forests for Accurate Camera Relocalization. In: CVPR (2015)  51. Walch, F., Hazirbas, C., Leal-Taix´e, L., Sattler, T., Hilsenbeck, S., Cremers, D.: Image-Based Localization Using LSTMs for Structured Feature Correlation. In: ICCV (2017)  52. Weyand, T., Kostrikov, I., Philbin, J.: PlaNet - Photo Geolocation with Convolu-  tional Neural Networks. In: ECCV (2016)  53. Yi, K.M., Trulls, E., Lepetit, V., Fua, P.: LIFT: Learned Invariant Feature Trans-  54. Yu, F., Koltun, V.: Multi-Scale Context Aggregation by Dilated Convolutions. In:  55. Yu, F., Xiao, J., Funkhouser, T.A.: Semantic alignment of LiDAR data at city  56. Zamir, A.R., Shah, M.: Accurate Image Localization Based on Google Maps Street  form. In: ECCV (2016)  ICLR (2016)  scale. In: CVPR (2015)  View. In: ECCV (2010)  57. Zamir, A.R., Shah, M.: Image Geo-Localization Based on MultipleNearest Neigh- bor Feature Matching Using Generalized Graphs. PAMI 36(8), 1546-1558 (2014) 58. Zeisl, B., Sattler, T., Pollefeys, M.: Camera Pose Voting for Large-Scale Image-  Based Localization. In: ICCV (2015)  59. Zhang, W., Kosecka, J.: Image based Localization in Urban Environments. In:  60. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid Scene Parsing Network. In:  3DPVT (2006)  CVPR (2017)"}