{"1": "1. Martin Abadi, Andy Chu, Ian Goodfellow, H Brendan McMahan, Ilya Mironov, Kunal Talwar, and Li Zhang. Deep learning with diﬀerential privacy. In Proceedings of the 2016 ACM SIGSAC Conference on Computer and Communications Security, pages 308-318. ACM, 2016.  2. Moez Baccouche, Franck Mamalet, Christian Wolf, Christophe Garcia, and Atilla Baskurt. Sequential deep learning for human action recognition. In International Workshop on Human Behavior Understanding, pages 29-39. Springer, 2011.  3. Daniel J Butler, Justin Huang, Franziska Roesner, and Maya Cakmak. The privacy- utility tradeoﬀ for remotely teleoperated robots. In Proceedings of the Tenth An- nual ACM/IEEE International Conference on Human-Robot Interaction, pages 27- 34. ACM, 2015.  4. Ankur Chattopadhyay and Terrance E Boult. Privacycam: a privacy preserving camera using uclinux on the blackfin dsp. In Computer Vision and Pattern Recog- nition, 2007. CVPR’07. IEEE Conference on, pages 1-8. IEEE, 2007.  5. Chen Chen, Roozbeh Jafari, and Nasser Kehtarnavaz. Action recognition from depth sequences using depth motion maps-based local binary patterns. In Appli- cations of Computer Vision (WACV), 2015 IEEE Winter Conference on, pages 1092-1099. IEEE, 2015.  6. Jiawei Chen, Jonathan Wu, Janusz Konrad, and Prakash Ishwar. Semi-coupled two-stream fusion convnets for action recognition at extremely low resolutions. arXiv preprint arXiv:1610.03898, 2016.  7. Bowen Cheng, Zhangyang Wang, Zhaobin Zhang, Zhu Li, Ding Liu, Jianchao Yang, Shuai Huang, and Thomas S Huang. Robust emotion recognition from low quality and low bit rate video: A deep learning approach. In Aﬀective Computing and Intelligent Interaction (ACII), 2017 Seventh International Conference on, pages 65-70. IEEE, 2017.  8. Graham Cormode. Individual privacy vs population privacy: Learning to attack  anonymization. arXiv preprint arXiv:1011.2511, 2010.  9. Ji Dai, Behrouz Saghafi, Jonathan Wu, Janusz Konrad, and Prakash Ishwar. To- In Image Processing  wards privacy-preserving recognition of human activities. (ICIP), 2015 IEEE International Conference on, pages 4238-4242. IEEE, 2015.  10. Guillaume Desjardins, Aaron Courville, and Yoshua Bengio. Disentangling factors of variation via generative entangling. arXiv preprint arXiv:1210.5474, 2012. 11. Yong Du, Wei Wang, and Liang Wang. Hierarchical recurrent neural network for skeleton based action recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 1110-1118, 2015.  12. Cynthia Dwork. Diﬀerential privacy: A survey of results. In International Confer- ence on Theory and Applications of Models of Computation, pages 1-19. Springer, 2008.  13. Zekeriya Erkin, Martin Franz, Jorge Guajardo, Stefan Katzenbeisser, Inald La- In International  gendijk, and Tomas Toft. Privacy-preserving face recognition. Symposium on Privacy Enhancing Technologies Symposium, 2009.  14. Farhad Farokhi and Henrik Sandberg. Fisher information as a measure of pri- vacy: Preserving privacy of households with smart meters using batteries. IEEE Transactions on Smart Grid, 2017.  15. Cl´ement Godard, Oisin Mac Aodha, and Gabriel J Brostow. Unsupervised monoc- In CVPR, volume 2, page 7,  ular depth estimation with left-right consistency. 2017.   Privacy-Preserving Visual Recognition via Adversarial TrainingReferences  1. Martin Abadi, Andy Chu, Ian Goodfellow, H Brendan McMahan, Ilya Mironov, Kunal Talwar, and Li Zhang. Deep learning with diﬀerential privacy. In Proceedings of the 2016 ACM SIGSAC Conference on Computer and Communications Security, pages 308-318. ACM, 2016.  2. Moez Baccouche, Franck Mamalet, Christian Wolf, Christophe Garcia, and Atilla Baskurt. Sequential deep learning for human action recognition. In International Workshop on Human Behavior Understanding, pages 29-39. Springer, 2011.  3. Daniel J Butler, Justin Huang, Franziska Roesner, and Maya Cakmak. The privacy- utility tradeoﬀ for remotely teleoperated robots. In Proceedings of the Tenth An- nual ACM/IEEE International Conference on Human-Robot Interaction, pages 27- 34. ACM, 2015.  4. Ankur Chattopadhyay and Terrance E Boult. Privacycam: a privacy preserving camera using uclinux on the blackfin dsp. In Computer Vision and Pattern Recog- nition, 2007. CVPR’07. IEEE Conference on, pages 1-8. IEEE, 2007.  5. Chen Chen, Roozbeh Jafari, and Nasser Kehtarnavaz. Action recognition from depth sequences using depth motion maps-based local binary patterns. In Appli- cations of Computer Vision (WACV), 2015 IEEE Winter Conference on, pages 1092-1099. IEEE, 2015.  6. Jiawei Chen, Jonathan Wu, Janusz Konrad, and Prakash Ishwar. Semi-coupled two-stream fusion convnets for action recognition at extremely low resolutions. arXiv preprint arXiv:1610.03898, 2016.  7. Bowen Cheng, Zhangyang Wang, Zhaobin Zhang, Zhu Li, Ding Liu, Jianchao Yang, Shuai Huang, and Thomas S Huang. Robust emotion recognition from low quality and low bit rate video: A deep learning approach. In Aﬀective Computing and Intelligent Interaction (ACII), 2017 Seventh International Conference on, pages 65-70. IEEE, 2017.  8. Graham Cormode. Individual privacy vs population privacy: Learning to attack  anonymization. arXiv preprint arXiv:1011.2511, 2010.  9. Ji Dai, Behrouz Saghafi, Jonathan Wu, Janusz Konrad, and Prakash Ishwar. To- In Image Processing  wards privacy-preserving recognition of human activities. (ICIP), 2015 IEEE International Conference on, pages 4238-4242. IEEE, 2015.  10. Guillaume Desjardins, Aaron Courville, and Yoshua Bengio. Disentangling factors of variation via generative entangling. arXiv preprint arXiv:1210.5474, 2012. 11. Yong Du, Wei Wang, and Liang Wang. Hierarchical recurrent neural network for skeleton based action recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 1110-1118, 2015.  12. Cynthia Dwork. Diﬀerential privacy: A survey of results. In International Confer- ence on Theory and Applications of Models of Computation, pages 1-19. Springer, 2008.  13. Zekeriya Erkin, Martin Franz, Jorge Guajardo, Stefan Katzenbeisser, Inald La- In International  gendijk, and Tomas Toft. Privacy-preserving face recognition. Symposium on Privacy Enhancing Technologies Symposium, 2009.  14. Farhad Farokhi and Henrik Sandberg. Fisher information as a measure of pri- vacy: Preserving privacy of households with smart meters using batteries. IEEE Transactions on Smart Grid, 2017.  15. Cl´ement Godard, Oisin Mac Aodha, and Gabriel J Brostow. Unsupervised monoc- In CVPR, volume 2, page 7,  ular depth estimation with left-right consistency. 2017.   16  Zhenyu Wu, Zhangyang Wang, Zhaowen Wang and Hailin Jin  16. Ian Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, Bing Xu, David Warde-Farley, Sherjil Ozair, Aaron Courville, and Yoshua Bengio. Generative adversarial nets. In Advances in neural information processing systems, pages 2672-2680, 2014. 17. Ian J Goodfellow, Jonathon Shlens, and Christian Szegedy. Explaining and har-  nessing adversarial examples. arXiv preprint arXiv:1412.6572, 2014.  18. Jihun Hamm. Minimax filter: learning to preserve privacy from inference attacks.  The Journal of Machine Learning Research, 18(1):4704-4734, 2017.  19. Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. Deep residual learning  for image recognition. arXiv preprint arXiv:1512.03385, 2015.  20. Irina Higgins, Arka Pal, Andrei A Rusu, Loic Matthey, Christopher P Burgess, Alexander Pritzel, Matthew Botvinick, Charles Blundell, and Alexander Lerchner. Darla: Improving zero-shot transfer in reinforcement learning. arXiv:1707.08475, 2017.  21. Andrew G Howard, Menglong Zhu, Bo Chen, Dmitry Kalenichenko, Weijun Wang, Tobias Weyand, Marco Andreetto, and Hartwig Adam. Mobilenets: Eﬃcient convolutional neural networks for mobile vision applications. arXiv preprint arXiv:1704.04861, 2017.  22. Shuiwang Ji, Wei Xu, Ming Yang, and Kai Yu. 3d convolutional neural networks for human action recognition. IEEE transactions on pattern analysis and machine intelligence, 35(1):221-231, 2013.  23. Li Jia and Richard J Radke. Using time-of-ﬂight measurements for privacy- preserving tracking in a smart room. IEEE Transactions on Industrial Informatics, 10(1):689-696, 2014.  24. Justin Johnson, Alexandre Alahi, and Li Fei-Fei. Perceptual losses for real-time style transfer and super-resolution. In European Conference on Computer Vision, 2016.  25. Jing Li, Stan Z Li, Quan Pan, and Tao Yang. Illumination and motion-based video enhancement for night surveillance. In Visual Surveillance and Performance Evalu- ation of Tracking and Surveillance, 2005. 2nd Joint IEEE International Workshop on, pages 169-175. IEEE, 2005.  26. Yifang Li, Nishant Vishwamitra, Bart P Knijnenburg, Hongxin Hu, and Kelly Caine. Blur vs. block: Investigating the eﬀectiveness of privacy-enhancing ob- fuscation for images. In Computer Vision and Pattern Recognition Workshops (CVPRW), 2017 IEEE Conference on, pages 1343-1351. IEEE, 2017.  27. Min Lin, Qiang Chen, and Shuicheng Yan. Network in network. arXiv preprint  arXiv:1312.4400, 2013.  28. Ding Liu, Bowen Cheng, Zhangyang Wang, Haichao Zhang, and Thomas S Huang. Enhance visual recognition under adverse conditions via deep networks. arXiv preprint arXiv:1712.07732, 2017.  29. Ping Liu, Joey Tianyi Zhou, Ivor Wai-Hung Tsang, Zibo Meng, Shizhong Han, and Yan Tong. Feature disentangling machine-a novel approach of feature selection and disentangling in facial expression analysis. In European Conference on Computer Vision, pages 151-166. Springer, 2014.  30. Behrooz Mahasseni, Sinisa Todorovic, and Alan Fern. Budget-aware deep semantic  video segmentation.  31. Aravindh Mahendran and Andrea Vedaldi. Visualizing deep convolutional neural International Journal of Computer Vision,  networks using natural pre-images. 2016.  32. Richard McPherson, Reza Shokri, and Vitaly Shmatikov. Defeating image obfus-  cation with deep learning. arXiv preprint arXiv:1609.00408, 2016.   Privacy-Preserving Visual Recognition via Adversarial Training33. Alan Mislove, Bimal Viswanath, Krishna P Gummadi, and Peter Druschel. You are who you know: inferring user profiles in online social networks. In Proceedings of the third ACM international conference on Web search and data mining, pages 251-260. ACM, 2010.  34. Arvind Narayanan and Vitaly Shmatikov. De-anonymizing social networks.  In Security and Privacy, 2009 30th IEEE Symposium on, pages 173-187. IEEE, 2009. 35. Shree K Nayar and Srinivasa G Narasimhan. Vision in bad weather. In Computer Vision, 1999. The Proceedings of the Seventh IEEE International Conference on, volume 2, pages 820-827. IEEE, 1999.  36. Anh Nguyen, Jason Yosinski, and Jeﬀ Clune. Deep neural networks are easily fooled: High confidence predictions for unrecognizable images. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 427-436, 2015.  37. Seong Joon Oh, Rodrigo Benenson, Mario Fritz, and Bernt Schiele. Faceless per- son recognition: Privacy implications in social media. In European Conference on Computer Vision, pages 19-35. Springer, 2016.  38. Seong Joon Oh, Mario Fritz, and Bernt Schiele. Adversarial image perturbation for privacy protection-a game theory perspective. In International Conference on Computer Vision (ICCV), 2017.  39. Tribhuvanesh Orekondy, Bernt Schiele, and Mario Fritz. Towards a visual privacy advisor: Understanding and predicting privacy risks in images. In IEEE Interna- tional Conference on Computer Vision (ICCV), 2017.  40. Tribhuvanesh Orekondy, Bernt Schiele, Mario Fritz, and Saarland Informatics Campus. Towards a visual privacy advisor: Understanding and predicting privacy risks in images. arXiv preprint arXiv:1703.10660, 2017.  41. Francesco Pittaluga and Sanjeev J Koppal. Privacy preserving optics for miniature vision sensors. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 314-324, 2015.  42. Francesco Pittaluga and Sanjeev Jagannatha Koppal. Pre-capture privacy for small vision sensors. IEEE transactions on pattern analysis and machine intelligence, 39(11):2215-2226, 2017.  43. Nisarg Raval, Ashwin Machanavajjhala, and Landon P Cox. Protecting visual secrets using adversarial nets. In Computer Vision and Pattern Recognition Work- shops (CVPRW), 2017 IEEE Conference on, pages 1329-1332. IEEE, 2017. 44. M. S. Ryoo, T. J. Fuchs, L. Xia, J. K. Aggarwal, and L. Matthies. Robot-centric ac- tivity prediction from first-person videos: What will they do to me? In ACM/IEEE International Conference on Human-Robot Interaction (HRI), pages 295-302, Port- land, OR, March 2015.  45. M. S. Ryoo and L. Matthies. First-person activity recognition: What are they doing to me? In IEEE Conference on Computer Vision and Pattern Recognition (CVPR), Portland, OR, June 2013.  46. Michael S Ryoo, Kiyoon Kim, and Hyun Jong Yang. Extreme low resolu- tion activity recognition with multi-siamese embedding learning. arXiv preprint arXiv:1708.00999, 2017.  47. Michael S Ryoo, Brandon Rothrock, Charles Fleming, and Hyun Jong Yang. Privacy-preserving human activity recognition from extreme low resolution. 2017. 48. Tim Salimans, Ian Goodfellow, Wojciech Zaremba, Vicki Cheung, Alec Radford, In Advances in Neural  and Xi Chen. Improved techniques for training gans. Information Processing Systems, pages 2234-2242, 2016.   18  Zhenyu Wu, Zhangyang Wang, Zhaowen Wang and Hailin Jin  49. Christian Schuldt, Ivan Laptev, and Barbara Caputo. Recognizing human actions: a local svm approach. In Pattern Recognition, 2004. ICPR 2004. Proceedings of the 17th International Conference on, volume 3, pages 32-36. IEEE, 2004.  50. Shikhar Sharma, Ryan Kiros, and Ruslan Salakhutdinov. Action recognition using  visual attention. arXiv preprint arXiv:1511.04119, 2015.  51. N Siddharth, Brooks Paige, Alban Desmaison, Jan-Willem van de Meent, Frank Wood, Noah D Goodman, Pushmeet Kohli, and Philip HS Torr. Learning disen- tangled representations in deep generative models. 2016.  52. Karen Simonyan and Andrew Zisserman. Two-stream convolutional networks for action recognition in videos. In Advances in neural information processing systems, pages 568-576, 2014.  53. Jure Sokolic, Qiang Qiu, Miguel RD Rodrigues, and Guillermo Sapiro. Learning to succeed while teaching to fail: Privacy in closed machine learning systems. arXiv preprint arXiv:1705.08197, 2017.  54. Khurram Soomro, Amir Roshan Zamir, and Mubarak Shah. Ucf101: A dataset of 101 human actions classes from videos in the wild. arXiv preprint arXiv:1212.0402, 2012.  55. Christian Szegedy, Vincent Vanhoucke, Sergey Ioﬀe, Jon Shlens, and Zbigniew Wojna. Rethinking the inception architecture for computer vision. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 2818- 2826, 2016.  56. Christian Szegedy, Wojciech Zaremba, Ilya Sutskever, Joan Bruna, Dumitru Erhan, Ian Goodfellow, and Rob Fergus. Intriguing properties of neural networks. arXiv preprint arXiv:1312.6199, 2013.  57. Yaniv Taigman, Ming Yang, Marc’Aurelio Ranzato, and Lior Wolf. Deepface: Closing the gap to human-level performance in face verification. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, 2014.  58. Shuai Tao, Mineichi Kudo, and Hidetoshi Nonaka. Privacy-preserved behav- ior analysis and fall detection by an infrared ceiling sensor network. Sensors, 12(12):16920-16936, 2012.  59. TechCrunch. Amazon’s camera-equipped echo look raises new questions about  smart home privacy. http://alturl.com/7ewnu.  60. Du Tran, Lubomir Bourdev, Rob Fergus, Lorenzo Torresani, and Manohar Paluri. In Computer Learning spatiotemporal features with 3d convolutional networks. Vision (ICCV), 2015 IEEE International Conference on, pages 4489-4497. IEEE, 2015.  61. Zhangyang Wang, Shiyu Chang, Yingzhen Yang, Ding Liu, and Thomas S Huang. Studying very low resolution recognition using deep networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, 2016.  62. Daniel Weinland, Remi Ronfard, and Edmond Boyer. Free viewpoint action recog- nition using motion history volumes. Computer vision and image understanding, 104(2):249-257, 2006.  63. Thomas Winkler, Ad´am Erd´elyi, and Bernhard Rinner. Trusteye. m4: protect- ing the sensornot the camera. In Advanced Video and Signal Based Surveillance (AVSS), 2014 11th IEEE International Conference on, pages 159-164. IEEE, 2014. 64. Xiang Xiang and Trac D Tran. Linear disentangled representation learning for  facial actions. arXiv preprint arXiv:1701.03102, 2017.  65. Yanchun Xie, Jimin Xiao, Tammam Tillo, Yunchao Wei, and Yao Zhao. 3d video super-resolution using fully convolutional neural networks. In Multimedia and Expo (ICME), 2016 IEEE International Conference on, pages 1-6. IEEE, 2016.   Privacy-Preserving Visual Recognition via Adversarial Training66. Ryo Yonetani, Vishnu Naresh Boddeti, Kris M Kitani, and Yoichi Sato. Privacy- preserving visual learning using doubly permuted homomorphic encryption. arXiv preprint arXiv:1704.02203, 2017.  67. Kiwon Yun, Jean Honorio, Debaleena Chattopadhyay, Tamara L. Berg, and Dim- itris Samaras. Two-person interaction detection using body-pose features and In IEEE Computer Vision and Pattern Recognition multiple instance learning. Workshops (CVPRW), 2012.  68. Barret Zoph, Vijay Vasudevan, Jonathon Shlens, and Quoc V Le.  ing transferable architectures for scalable image recognition. arXiv:1707.07012, 2017.  Learn- arXiv preprint"}