{"1": "1. Amerini, I., Ballan, L., Caldelli, R., Del Bimbo, A., Serra, G.: A sift-based forensic method for copy-move attack detection and transformation recovery. IEEE Trans- actions on Information Forensics and Security 6(3), 1099-1110 (2011) 3  2. Ardizzone, E., Bruno, A., Mazzola, G.: Copy-move forgery detection by matching triangles of keypoints. IEEE Transactions on Information Forensics and Security 10(10), 2084-2094 (2015) 3  3. Asghar, K., Habib, Z., Hussain, M.: Copy-move and splicing image forgery detec- tion and localization techniques: a review. Australian Journal of Forensic Sciences 49(3), 281-307 (2017) 3  4. Bayram, S., Sencar, H.T., Memon, N.: An eﬃcient and robust method for detecting copy-move forgery. In: Acoustics, Speech and Signal Processing, 2009. ICASSP 2009. IEEE International Conference on. pp. 1053-1056. IEEE (2009) 3  5. Birajdar, G.K., Mankar, V.H.: Digital image forgery detection using passive tech-  niques: A survey. Digital Investigation 10(3), 226-245 (2013) 3  6. Bunk, J., Bappy, J.H., Mohammed, T.M., Nataraj, L., Flenner, A., Manjunath, B., Chandrasekaran, S., Roy-Chowdhury, A.K., Peterson, L.: Detection and localiza- tion of image forgeries using resampling features and deep learning. In: Computer Vision and Pattern Recognition Workshops (CVPRW), 2017 IEEE Conference on. pp. 1881-1889. IEEE (2017) 3  7. Christlein, V., Riess, C., Jordan, J., Riess, C., Angelopoulou, E.: An evaluation of popular copy-move forgery detection approaches. IEEE Transactions on informa- tion forensics and security 7(6), 1841-1854 (2012) 9, 10, 11  8. Costanzo, A., Amerini, I., Caldelli, R., Barni, M.: Forensic analysis of sift keypoint removal and injection. IEEE Transactions on Information Forensics and Security 9(9), 1450-1464 (2014) 3  9. Cozzolino, D., Poggi, G., Verdoliva, L.: Eﬃcient dense-field copy-move forgery detection. IEEE Transactions on Information Forensics and Security 10(11), 2284- 2297 (2015) 3, 9, 10, 11, 12, 13  10. Dwibedi, D., Misra, I., Hebert, M.: Cut, paste and learn: Surprisingly easy synthesis for instance detection. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017) 8  11. Farid, H.: Seeing is not believing. IEEE Spectrum 46(8) (2009) 3 12. Fridrich, A.J., Soukal, B.D., Luk´aˇs, A.J.: Detection of copy-move forgery in digital images. In: in Proceedings of Digital Forensic Research Workshop. Citeseer (2003) 3  13. Gupta, A., Vedaldi, A., Zisserman, A.: Synthetic data for text localisation in nat- ural images. In: IEEE Conference on Computer Vision and Pattern Recognition (2016) 8  14. Huang, D.Y., Huang, C.N., Hu, W.C., Chou, C.H.: Robustness of copy-move forgery detection under high jpeg compression artifacts. Multimedia Tools and Applications 76(1), 1509-1530 (2017) 3  15. Ke, Y., Sukthankar, R., Huston, L.: An eﬃcient parts-based near-duplicate and sub-image retrieval system. In: Proceedings of the 12th annual ACM international conference on Multimedia. pp. 869-876. ACM (2004) 3  16. Li, J., Li, X., Yang, B., Sun, X.: Segmentation-based image copy-move forgery detection scheme. IEEE Transactions on Information Forensics and Security 10(3), 507-518 (2015) 3, 12, 13   BusterNet for Copy-Move Forgery DetectionReferences  1. Amerini, I., Ballan, L., Caldelli, R., Del Bimbo, A., Serra, G.: A sift-based forensic method for copy-move attack detection and transformation recovery. IEEE Trans- actions on Information Forensics and Security 6(3), 1099-1110 (2011) 3  2. Ardizzone, E., Bruno, A., Mazzola, G.: Copy-move forgery detection by matching triangles of keypoints. IEEE Transactions on Information Forensics and Security 10(10), 2084-2094 (2015) 3  3. Asghar, K., Habib, Z., Hussain, M.: Copy-move and splicing image forgery detec- tion and localization techniques: a review. Australian Journal of Forensic Sciences 49(3), 281-307 (2017) 3  4. Bayram, S., Sencar, H.T., Memon, N.: An eﬃcient and robust method for detecting copy-move forgery. In: Acoustics, Speech and Signal Processing, 2009. ICASSP 2009. IEEE International Conference on. pp. 1053-1056. IEEE (2009) 3  5. Birajdar, G.K., Mankar, V.H.: Digital image forgery detection using passive tech-  niques: A survey. Digital Investigation 10(3), 226-245 (2013) 3  6. Bunk, J., Bappy, J.H., Mohammed, T.M., Nataraj, L., Flenner, A., Manjunath, B., Chandrasekaran, S., Roy-Chowdhury, A.K., Peterson, L.: Detection and localiza- tion of image forgeries using resampling features and deep learning. In: Computer Vision and Pattern Recognition Workshops (CVPRW), 2017 IEEE Conference on. pp. 1881-1889. IEEE (2017) 3  7. Christlein, V., Riess, C., Jordan, J., Riess, C., Angelopoulou, E.: An evaluation of popular copy-move forgery detection approaches. IEEE Transactions on informa- tion forensics and security 7(6), 1841-1854 (2012) 9, 10, 11  8. Costanzo, A., Amerini, I., Caldelli, R., Barni, M.: Forensic analysis of sift keypoint removal and injection. IEEE Transactions on Information Forensics and Security 9(9), 1450-1464 (2014) 3  9. Cozzolino, D., Poggi, G., Verdoliva, L.: Eﬃcient dense-field copy-move forgery detection. IEEE Transactions on Information Forensics and Security 10(11), 2284- 2297 (2015) 3, 9, 10, 11, 12, 13  10. Dwibedi, D., Misra, I., Hebert, M.: Cut, paste and learn: Surprisingly easy synthesis for instance detection. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017) 8  11. Farid, H.: Seeing is not believing. IEEE Spectrum 46(8) (2009) 3 12. Fridrich, A.J., Soukal, B.D., Luk´aˇs, A.J.: Detection of copy-move forgery in digital images. In: in Proceedings of Digital Forensic Research Workshop. Citeseer (2003) 3  13. Gupta, A., Vedaldi, A., Zisserman, A.: Synthetic data for text localisation in nat- ural images. In: IEEE Conference on Computer Vision and Pattern Recognition (2016) 8  14. Huang, D.Y., Huang, C.N., Hu, W.C., Chou, C.H.: Robustness of copy-move forgery detection under high jpeg compression artifacts. Multimedia Tools and Applications 76(1), 1509-1530 (2017) 3  15. Ke, Y., Sukthankar, R., Huston, L.: An eﬃcient parts-based near-duplicate and sub-image retrieval system. In: Proceedings of the 12th annual ACM international conference on Multimedia. pp. 869-876. ACM (2004) 3  16. Li, J., Li, X., Yang, B., Sun, X.: Segmentation-based image copy-move forgery detection scheme. IEEE Transactions on Information Forensics and Security 10(3), 507-518 (2015) 3, 12, 13   16  Y. Wu, W. Abd-Almageed, & P. Natarajan  17. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision. pp. 740-755. Springer (2014) 8  18. Liu, Y., Guan, Q., Zhao, X.: Copy-move forgery detection based on convolutional kernel network. Multimedia Tools and Applications pp. 1-25 (2017) 3, 12, 13 19. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3431-3440 (2015) 5  20. Mahdian, B., Saic, S.: Detection of copy-move forgery using a method based on  blur moment invariants. Forensic science international 171(2), 180-189 (2007) 3  21. Mahmood, T., Nawaz, T., Irtaza, A., Ashraf, R., Shah, M., Mahmood, M.T.: Copy- move forgery detection technique for forensic analysis in digital images. Mathemat- ical Problems in Engineering 2016 (2016) 3  22. Manu, V., Mehtre, B.M.: Detection of copy-move forgery in images using seg- mentation and surf. In: Advances in Signal Processing and Intelligent Recognition Systems, pp. 645-654. Springer (2016) 3  23. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmen- tation. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 1520-1528 (2015) 5  24. P´erez, P., Gangnet, M., Blake, A.: Poisson image editing. In: ACM Transactions  on graphics (TOG). vol. 22, pp. 313-318. ACM (2003) 8  25. Pun, C.M., Yuan, X.C., Bi, X.L.: Image forgery detection using adaptive overseg- mentation and feature point matching. IEEE Transactions on Information Foren- sics and Security 10(8), 1705-1716 (2015) 3, 10  26. Ryu, S.J., Lee, M.J., Lee, H.K.: Detection of copy-rotate-move forgery using zernike moments. In: Information hiding. vol. 6387, pp. 51-65. Springer (2010) 3, 10, 11, 12, 13  27. Shivakumar, B., Baboo, S.: Detection of region duplication forgery in digital images using surf. International Journal of computer science Issues 8(4), 199-205 (2011) 3  28. Silva, E., Carvalho, T., Ferreira, A., Rocha, A.: Going deeper into copy-move forgery detection: Exploring image telltales via multi-scale analysis and voting processes. Journal of Visual Communication and Image Representation 29, 16-32 (2015) 3, 12, 13  29. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. CoRR abs/1409.1556 (2014) 5  30. Soni, B., Das, P., Thounaojam, D.: Cmfd: A detailed review of block based and key feature based techniques in image copy-move forgery detection. IET Image Processing (2017) 3  31. Tralic, D., Zupancic, I., Grgic, S., Grgic, M.: Comofodnew database for copy-move forgery detection. In: ELMAR, 2013 55th international symposium. pp. 49-54. IEEE (2013) 10, 12, 13  32. Warif, N.B.A., Wahab, A.W.A., Idris, M.Y.I., Ramli, R., Salleh, R., Shamshirband, S., Choo, K.K.R.: Copy-move forgery detection: Survey, challenges and future di- rections. Journal of Network and Computer Applications 75, 259-278 (2016) 3, 7  33. Wojna, Z., Ferrari, V., Guadarrama, S., Silberman, N., Chen, L.C., Fathi, A.,  Uijlings, J.: The devil is in the decoder (2017) 5  34. Wu, Y., Abd-Almageed, W., Natarajan, P.: Deep matching and validation network: An end-to-end solution to constrained image splicing localization and detection.   BusterNet for Copy-Move Forgery DetectionIn: Proceedings of the 2017 ACM on Multimedia Conference. pp. 1480-1502. MM ’17 (2017) 3, 8, 9, 10, 11, 12, 13  35. Xiao, J., Hays, J., Ehinger, K.A., Oliva, A., Torralba, A.: Sun database: Large-scale scene recognition from abbey to zoo. In: Computer vision and pattern recognition (CVPR), 2010 IEEE conference on. pp. 3485-3492. IEEE (2010) 8  36. Yang, B., Sun, X., Guo, H., Xia, Z., Chen, X.: A copy-move forgery detection method based on cmfd-sift. Multimedia Tools and Applications pp. 1-19 (2017) 3 37. Zampoglou, M., Papadopoulos, S., Kompatsiaris, Y.: Detecting image splicing in the wild (web). In: Multimedia & Expo Workshops (ICMEW), 2015 IEEE Inter- national Conference on. pp. 1-6. IEEE (2015) 8  38. Zampoglou, M., Papadopoulos, S., Kompatsiaris, Y.: Large-scale evaluation of splicing localization algorithms for web images. Multimedia Tools and Applica- tions 76(4), 4801-4834 (2017) 7  39. Zhou, P., Han, X., Morariu, V.I., Davis, L.S.: Two-stream neural networks for tampered face detection. In: Computer Vision and Pattern Recognition Workshops (CVPRW), 2017 IEEE Conference on. pp. 1831-1839. IEEE (2017) 3  40. Zhu, Y., Shen, X., Chen, H.: Copy-move forgery detection based on scaled orb.  Multimedia Tools and Applications 75(6), 3221-3233 (2016) 3"}