{"1": "1. Agostinelli, S., Allison, J., Amako, K., Apostolakis, J., Araujo, H., Arce, P., Asai, M., Axen, D., Banerjee, S., Barrand, G.: Geant4a simulation toolkit. Nuclear In- struments and Methods in Physics Research Section A: Accelerators, Spectrome- ters, Detectors and Associated Equipment 506(3), 250 - 303 (2003)  2. Aides, A., Schechner, Y.Y., Holodovsky, V., Garay, M.J., Davis, A.B.: Multi sky- view 3D aerosol distribution recovery. Opt. Express 21(22), 25820-25833 (2013) 3. Andersen, A., Kak, A.: Simultaneous algebraic reconstruction technique (SART): A superior implementation of the art algorithm. Ultrasonic Imaging 6(1), 81-94 (1984)  4. Apostolakis, J., Giani, S., Maire, M., Nieminen, P., Pia, M.G., Urbn, L.: Geant4 low energy electromagnetic models for electrons and photons. CERN-OPEN-99-034 (Aug 1999)  5. Arendtsz, N.V., Hussein, E.M.A.: Energy-spectral Compton scatter imaging - Part 1: Theory and mathematics. IEEE Transactions on Nuclear Science 42, 2155-2165 (1995)  6. Biggs, F., Lighthill, R.: Analytical approximations for X-ray cross sections.  Preprint Sandia Laboratory, SAND 87-0070 (1990)  7. Bor, D., Birgul, O., Onal, U., Olgar, T.: Investigation of grid performance using  simple image quality tests. Journal of Medical Physics 41, 21-28 (2016)  8. Brusa, D., Stutz, G., Riveros, J., Salvat, F., Fernndez-Varea, J.: Fast sampling al- gorithm for the simulation of photon compton scattering. Nuclear Instruments and Methods in Physics Research, Section A: Accelerators, Spectrometers, Detectors and Associated Equipment 379(1), 167-175 (1996)  9. Buzug, T.M.: Computed Tomography. From Photon Statistics to Modern Cone-  Beam CT. Springer Heidelberg (2008)  10. Cong, W., Wang, G.: X-ray scattering tomography for biological applications. Jour-  nal of X-Ray Science and Technology 19(2), 219 - 227 (2011)  11. Cook, E., Fong, R., Horrocks, J., Wilkinson, D., Speller, R.: Energy dispersive X- ray diﬀraction as a means to identify illicit materials: a preliminary optimisation study. Applied Radiation and Isotopes 65(8), 959-967 (August 2007)  12. Geva, A., Schechner, Y., Chernyak, Y., Gupta, R.: X-ray computed tomography through scatter: Supplementary material. European Conference on Computer Vi- sion (ECCV) (2018)  13. Gkioulekas, I., Levin, A., Zickler, T.: An evaluation of computational imaging techniques for heterogeneous inverse scattering. European Conference on Computer Vision (ECCV) (2016)  14. Gkioulekas, I., Zhao, S., Bala, K., Zickler, T., Levin, A.: Inverse volume rendering  with material dictionaries. ACM Trans. Graph. 32(162) (2013)  15. Gong, H., Yan, H., Jia, X., Li, B., Wang, G., Cao, G.: X-ray scatter correction for multi-source interior computed tomography. Medical Physics 44, 71-83 (2017) 16. Gordon, R., Bender, R., Herman, G.: Algebraic reconstruction techniques (ART) for three-dimensional electron microscopy and X-ray photography. Journal of The- oretical Biology 29(3), 471-476 (1970)  17. Gu, J., Nayar, S.K., Grinspun, E., Belhumeur, P.N., Ramamoorthi, R.: Com- pressive structured light for recovering inhomogeneous participating media. IEEE Transactions on Pattern Analysis and Machine Intelligence 35(3), 1-1 (2013) 18. Heide, F., Xiao, L., Kolb, A., Hullin, M.B., Heidrich, W.: Imaging in scattering me- dia using correlation image sensors and sparse convolutional coding. Opt. Express 22(21), 26338-26350 (2014)   Xray Computed Tomography Through ScatterReferences  1. Agostinelli, S., Allison, J., Amako, K., Apostolakis, J., Araujo, H., Arce, P., Asai, M., Axen, D., Banerjee, S., Barrand, G.: Geant4a simulation toolkit. Nuclear In- struments and Methods in Physics Research Section A: Accelerators, Spectrome- ters, Detectors and Associated Equipment 506(3), 250 - 303 (2003)  2. Aides, A., Schechner, Y.Y., Holodovsky, V., Garay, M.J., Davis, A.B.: Multi sky- view 3D aerosol distribution recovery. Opt. Express 21(22), 25820-25833 (2013) 3. Andersen, A., Kak, A.: Simultaneous algebraic reconstruction technique (SART): A superior implementation of the art algorithm. Ultrasonic Imaging 6(1), 81-94 (1984)  4. Apostolakis, J., Giani, S., Maire, M., Nieminen, P., Pia, M.G., Urbn, L.: Geant4 low energy electromagnetic models for electrons and photons. CERN-OPEN-99-034 (Aug 1999)  5. Arendtsz, N.V., Hussein, E.M.A.: Energy-spectral Compton scatter imaging - Part 1: Theory and mathematics. IEEE Transactions on Nuclear Science 42, 2155-2165 (1995)  6. Biggs, F., Lighthill, R.: Analytical approximations for X-ray cross sections.  Preprint Sandia Laboratory, SAND 87-0070 (1990)  7. Bor, D., Birgul, O., Onal, U., Olgar, T.: Investigation of grid performance using  simple image quality tests. Journal of Medical Physics 41, 21-28 (2016)  8. Brusa, D., Stutz, G., Riveros, J., Salvat, F., Fernndez-Varea, J.: Fast sampling al- gorithm for the simulation of photon compton scattering. Nuclear Instruments and Methods in Physics Research, Section A: Accelerators, Spectrometers, Detectors and Associated Equipment 379(1), 167-175 (1996)  9. Buzug, T.M.: Computed Tomography. From Photon Statistics to Modern Cone-  Beam CT. Springer Heidelberg (2008)  10. Cong, W., Wang, G.: X-ray scattering tomography for biological applications. Jour-  nal of X-Ray Science and Technology 19(2), 219 - 227 (2011)  11. Cook, E., Fong, R., Horrocks, J., Wilkinson, D., Speller, R.: Energy dispersive X- ray diﬀraction as a means to identify illicit materials: a preliminary optimisation study. Applied Radiation and Isotopes 65(8), 959-967 (August 2007)  12. Geva, A., Schechner, Y., Chernyak, Y., Gupta, R.: X-ray computed tomography through scatter: Supplementary material. European Conference on Computer Vi- sion (ECCV) (2018)  13. Gkioulekas, I., Levin, A., Zickler, T.: An evaluation of computational imaging techniques for heterogeneous inverse scattering. European Conference on Computer Vision (ECCV) (2016)  14. Gkioulekas, I., Zhao, S., Bala, K., Zickler, T., Levin, A.: Inverse volume rendering  with material dictionaries. ACM Trans. Graph. 32(162) (2013)  15. Gong, H., Yan, H., Jia, X., Li, B., Wang, G., Cao, G.: X-ray scatter correction for multi-source interior computed tomography. Medical Physics 44, 71-83 (2017) 16. Gordon, R., Bender, R., Herman, G.: Algebraic reconstruction techniques (ART) for three-dimensional electron microscopy and X-ray photography. Journal of The- oretical Biology 29(3), 471-476 (1970)  17. Gu, J., Nayar, S.K., Grinspun, E., Belhumeur, P.N., Ramamoorthi, R.: Com- pressive structured light for recovering inhomogeneous participating media. IEEE Transactions on Pattern Analysis and Machine Intelligence 35(3), 1-1 (2013) 18. Heide, F., Xiao, L., Kolb, A., Hullin, M.B., Heidrich, W.: Imaging in scattering me- dia using correlation image sensors and sparse convolutional coding. Opt. Express 22(21), 26338-26350 (2014)   16  A. Geva, Y. Y. Schechner, Y. Chernyak, R. Gupta  19. Holodovsky, V., Schechner, Y.Y., Levin, A., Levis, A., Aides, A.: In-situ multi- view multi-scattering stochastic tomography. IEEE International Conference on Computational Photography (ICCP) (2016)  20. Honda, M., Kikuchi, K., Komatsu, K.I.: Method for estimating the intensity of scattered radiation using a scatter generation model. Medical Physics 18(2), 219- 226 (1991)  21. Hubbell, J.H., Gimm, H.A., Øverbø, I.: Pair, triplet, and total atomic cross sections (and mass attenuation coeﬃcients) for 1 MeV to 100 GeV photons in elements Z=1 to 100. Journal of Physical and Chemical Reference Data 9(4), 1023-1148 (1980) 22. Hussein, E.M.A.: On the intricacy of imaging with incoherently-scattered radiation.  Nuclear Inst. and Methods in Physics Research, B 263, 27-31 (2007)  23. Kawrakow, I., Rogers, D.W.O.: The EGSnrc code system: Monte carlo simulation  of electron and photon transport. NRC Publications Archive (2000)  24. Kimura, A., Tanaka, S., Aso, T., Yoshida, H., Kanematsu, N., Asai, M., Sasaki, T.: DICOM interface and visualization tool for Geant4-based dose calculation. IEEE Nuclear Science Symposium Conference Record 2, 981-984 (2005)  25. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. 3rd Interna-  tional Conference for Learning Representations (ICLR) (2015)  26. Klein, O., Nishina, Y.: ¨Uber die streuung von strahlung durch freie elektronen nach der neuen relativistischen quantendynamik von dirac. Zeitschrift f¨ur Physik 52(11), 853-868 (1929)  27. Kyriakou, Y., Riedel, T., Kalender, W.A.: Combining deterministic and Monte Carlo calculations for fast estimation of scatter intensities in CT. Physics in Medicine and Biology 51(18), 4567 (2006)  28. Kyriakou, Y., Kalender, W.A.: Eﬃciency of antiscatter grids for ﬂat-detector CT.  Physics in Medicine and Biology 52(20), 6275 (2007)  29. Levis, A., Schechner, Y.Y., Aides, A., Davis, A.B.: Airborne three-dimensional cloud tomography. IEEE International Conference on Computer Vision (ICCV) (2015)  30. Levis, A., Schechner, Y.Y., Davis, A.B.: Multiple-scattering microphysics tomog-  raphy. IEEE Computer Vision and Pattern Recognition (CVPR) (2017)  31. Lionheart, W.R.B., Hjertaker, B.T., Maad, R., Meric, I., Coban, S.B., Johansen, G.A.: Non-linearity in monochromatic transmission tomography. arXiv: 1705.05160 (2017)  32. Lo, J.Y., Floyd Jr, C.E., Baker, J.A., Ravin, C.E.: Scatter compensation in digital chest radiography using the posterior beam stop technique. Medical Physics 21(3), 435-443 (1994)  33. Mainegra-Hing, E., Kawrakow, I.: Fast Monte Carlo calculation of scatter cor- rections for CBCT images. Journal of Physics: Conference Series 102(1), 012017 (2008)  34. Mainegra-Hing, E., Kawrakow, I.: Variance reduction techniques for fast monte carlo CBCT scatter correction calculations. Physics in Medicine and Biology 55(16), 4495-4507 (2010)  35. Malden, C.H., Speller, R.D.: A CdZnTe array for the detection of explosives in bag- gage by energy-dispersive X-ray diﬀraction signatures at multiple scatter angles. Nuclear Instruments and Methods in Physics Research Section A: Accelerators, Spectrometers, Detectors and Associated Equipment 449(1), 408-415 (2000) 36. Narasimhan, S.G., Gupta, M., Donner, C., Ramamoorthi, R., Nayar, S.K., Jensen, H.W.: Acquiring scattering properties of participating media by dilution. ACM Trans. Graph. 25(3), 1003-1012 (2006)   Xray Computed Tomography Through Scatter37. Perkins, S.T., Cullen, D.E., Seltzer, S.M.: Tables and graphs of electron-interaction cross sections from 10 eV to 100 Gev derived from the LLNL evaluated electron data library (EEDL), Z = 1 to 100. Lawrence Livermore National Lab, UCRL- 50400 31 (1991)  38. Prettyman, T.H., Gardner, R.P., Russ, J.C., Verghese, K.: A combined transmis- sion and scattering tomographic approach to composition and density imaging. Applied Radiation and Isotopes 44(10-11), 1327-1341 (1993)  39. Punnoose, J., Xu, J., Sisniega, A., Zbijewski, W., Siewerdsen, J.H.: Technical note: spektr 3.0-a computational tool for X-ray spectrum modeling and analysis. Medical Physics 43(8), 4711-4717 (2016)  40. Rana, R., Akhilesh, A.S., Jain, Y.S., Shankar, A., Bednarek, D.R., Rudin, S.: Scat- ter estimation and removal of anti-scatter grid-line artifacts from anthropomorphic head phantom images taken with a high resolution image detector. Proceedings of SPIE 9783 (2016)  41. Salvat, F., Fernndez-Varea, J., Sempau, J.: Penelope2008: A code system for monte carlo simulation of electron and photon transport. Workshop proceedings: Nuclear energy agency OECD (2008)  42. Satat, G., Heshmat, B., Raviv, D., Raskar, R.: All photons imaging through volu-  metric scattering. Scientific Reports 6(33946) (2016)  43. Segars, W., Sturgeon, G., Mendonca, S., Grimes, J., Tsui, B.M.W.: 4D XCAT phantom for multimodality imaging research. Medical Physics 37, 4902-4915 (2010)  44. Seibert, J.A., Boone, J.M.: X ray scatter removal by deconvolution. Medical Physics  15(4), 567-575 (1988)  45. Sheinin, M., Schechner, Y.Y.: The next best underwater view. IEEE Computer  Vision and Pattern Recognition (CVPR) (2016)  46. Siewerdsen, J.H., Jaﬀray, D.A.: Cone-beam computed tomography with a ﬂat-panel imager: Magnitude and eﬀects of X-ray scatter. Medical Physics 28(2), 220-231 (2001)  47. Storm, L., Israel, H.I.: Photon cross sections from 1 keV to 100 MeV for elements Z=1 to Z=100. Atomic Data and Nuclear Data Tables 7(6), 565-681 (1970) 48. Swirski, Y., Schechner, Y.Y., Herzberg, B., Negahdaripour, S.: Caustereo: Range  from light in nature. Applied Optics 50(28), F89-F101 (2011)  49. Treibitz, T., Schechner, Y.Y.: Recovery limits in pointwise degradation. IEEE In-  ternational Conference on Computational Photography (ICCP) (2009)  50. Turbell, H.: Cone-beam reconstruction using filtered backprojection. Thesis (doc-  toral) - Linkping Universitet. (2001)  51. Wadeson, N., Morton, E., Lionheart, W.: Scatter in an uncollimated X-ray ct machine based on a Geant4 monte carlo simulation. Proc. SPIE 7622 (2010) 52. Watson, P.G.F., Tomic, N., Seuntjens, J., Mainegra-Hing, E.: Implementation of an eﬃcient monte carlo calculation for CBCT scatter correction: phantom study. Journal of Applied Clinical Medical Physics 16(4), 216-227 (2015)"}