{"1": "1. Aanæs, H., Jensen, R.R., Vogiatzis, G., Tola, E., Dahl, A.B.: Large-scale data for multiple-view stereopsis. International Journal of Computer Vision (IJCV) (2016) 2. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., Ghemawat, S., Goodfellow, I., Harp, A., Irving, G., Isard, M., Jia, Y., Jozefowicz, R., Kaiser, L., Kudlur, M., Levenberg, J., Man´e, D., Monga, R., Moore, S., Murray, D., Olah, C., Schuster, M., Shlens, J., Steiner, B., Sutskever, I., Talwar, K., Tucker, P., Vanhoucke, V., Vasudevan, V., Vi´egas, F., Vinyals, O., Warden, P., Wattenberg, M., Wicke, M., Yu, Y., Zheng, X.: TensorFlow: Large-scale machine learning on heterogeneous systems (2015), https://www.tensorflow.org/, software available from tensorﬂow.org  3. Campbell, N.D., Vogiatzis, G., Hern´andez, C., Cipolla, R.: Using multiple hy- potheses to improve depth-maps for multi-view stereo. European Conference on Computer Vision (ECCV) (2008)  4. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. IEEE Transactions on Pattern Analysis and Machine Intelli- gence (TPAMI) (2017)  5. Collins, R.T.: A space-sweep approach to true multi-image matching. Computer  Vision and Pattern Recognition (CVPR) (1996)  6. Fuhrmann, S., Langguth, F., Goesele, M.: Mve-a multi-view reconstruction en- vironment. Eurographics Workshop on Graphics and Cultural Heritage (GCH) (2014)  7. Furukawa, Y., Ponce, J.: Accurate, dense, and robust multiview stereopsis. IEEE  Transactions on Pattern Analysis and Machine Intelligence (TPAMI) (2010)  8. Galliani, S., Lasinger, K., Schindler, K.: Massively parallel multiview stereopsis by surface normal diﬀusion. International Conference on Computer Vision (ICCV) (2015)  9. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the kitti vision benchmark suite. Computer Vision and Pattern Recognition (CVPR) (2012) 10. Han, X., Leung, T., Jia, Y., Sukthankar, R., Berg, A.C.: Matchnet: Unifying fea- ture and metric learning for patch-based matching. Computer Vision and Pattern Recognition (CVPR) (2015)  11. Hartmann, W., Galliani, S., Havlena, M., Van Gool, L., Schindler, K.: Learned multi-patch similarity. International Conference on Computer Vision (ICCV) (2017)  12. Hirschmuller, H.: Stereo processing by semiglobal matching and mutual informa- tion. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) (2008)  13. Hirschmuller, H., Scharstein, D.: Evaluation of cost functions for stereo matching.  Computer Vision and Pattern Recognition (CVPR) (2007)  14. Ji, M., Gall, J., Zheng, H., Liu, Y., Fang, L.: Surfacenet: An end-to-end 3d neural network for multiview stereopsis. International Conference on Computer Vision (ICCV) (2017)  15. Kar, A., H¨ane, C., Malik, J.: Learning a multi-view stereo machine. Advances in  Neural Information Processing Systems (NIPS) (2017)  16. Kazhdan, M., Hoppe, H.: Screened poisson surface reconstruction. ACM Transac-  tions on Graphics (TOG) (2013)   MVSNetReferences  1. Aanæs, H., Jensen, R.R., Vogiatzis, G., Tola, E., Dahl, A.B.: Large-scale data for multiple-view stereopsis. International Journal of Computer Vision (IJCV) (2016) 2. Abadi, M., Agarwal, A., Barham, P., Brevdo, E., Chen, Z., Citro, C., Corrado, G.S., Davis, A., Dean, J., Devin, M., Ghemawat, S., Goodfellow, I., Harp, A., Irving, G., Isard, M., Jia, Y., Jozefowicz, R., Kaiser, L., Kudlur, M., Levenberg, J., Man´e, D., Monga, R., Moore, S., Murray, D., Olah, C., Schuster, M., Shlens, J., Steiner, B., Sutskever, I., Talwar, K., Tucker, P., Vanhoucke, V., Vasudevan, V., Vi´egas, F., Vinyals, O., Warden, P., Wattenberg, M., Wicke, M., Yu, Y., Zheng, X.: TensorFlow: Large-scale machine learning on heterogeneous systems (2015), https://www.tensorflow.org/, software available from tensorﬂow.org  3. Campbell, N.D., Vogiatzis, G., Hern´andez, C., Cipolla, R.: Using multiple hy- potheses to improve depth-maps for multi-view stereo. European Conference on Computer Vision (ECCV) (2008)  4. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. IEEE Transactions on Pattern Analysis and Machine Intelli- gence (TPAMI) (2017)  5. Collins, R.T.: A space-sweep approach to true multi-image matching. Computer  Vision and Pattern Recognition (CVPR) (1996)  6. Fuhrmann, S., Langguth, F., Goesele, M.: Mve-a multi-view reconstruction en- vironment. Eurographics Workshop on Graphics and Cultural Heritage (GCH) (2014)  7. Furukawa, Y., Ponce, J.: Accurate, dense, and robust multiview stereopsis. IEEE  Transactions on Pattern Analysis and Machine Intelligence (TPAMI) (2010)  8. Galliani, S., Lasinger, K., Schindler, K.: Massively parallel multiview stereopsis by surface normal diﬀusion. International Conference on Computer Vision (ICCV) (2015)  9. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the kitti vision benchmark suite. Computer Vision and Pattern Recognition (CVPR) (2012) 10. Han, X., Leung, T., Jia, Y., Sukthankar, R., Berg, A.C.: Matchnet: Unifying fea- ture and metric learning for patch-based matching. Computer Vision and Pattern Recognition (CVPR) (2015)  11. Hartmann, W., Galliani, S., Havlena, M., Van Gool, L., Schindler, K.: Learned multi-patch similarity. International Conference on Computer Vision (ICCV) (2017)  12. Hirschmuller, H.: Stereo processing by semiglobal matching and mutual informa- tion. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) (2008)  13. Hirschmuller, H., Scharstein, D.: Evaluation of cost functions for stereo matching.  Computer Vision and Pattern Recognition (CVPR) (2007)  14. Ji, M., Gall, J., Zheng, H., Liu, Y., Fang, L.: Surfacenet: An end-to-end 3d neural network for multiview stereopsis. International Conference on Computer Vision (ICCV) (2017)  15. Kar, A., H¨ane, C., Malik, J.: Learning a multi-view stereo machine. Advances in  Neural Information Processing Systems (NIPS) (2017)  16. Kazhdan, M., Hoppe, H.: Screened poisson surface reconstruction. ACM Transac-  tions on Graphics (TOG) (2013)   16  Y. Yao, Z. Luo, S. Li, T. Fang, L. Quan  17. Kendall, A., Martirosyan, H., Dasgupta, S., Henry, P.: End-to-end learning of geometry and context for deep stereo regression. Computer Vision and Pattern Recognition (CVPR) (2017)  18. Knapitsch, A., Park, J., Zhou, Q.Y., Koltun, V.: Tanks and temples: Benchmarking large-scale scene reconstruction. ACM Transactions on Graphics (TOG) (2017) 19. Kn¨obelreiter, P., Reinbacher, C., Shekhovtsov, A., Pock, T.: End-to-end training of hybrid cnn-crf models for stereo. Computer Vision and Pattern Recognition (CVPR) (2017)  20. Kutulakos, K.N., Seitz, S.M.: A theory of shape by space carving. International  Journal of Computer Vision (IJCV) (2000)  21. Langguth, F., Sunkavalli, K., Hadap, S., Goesele, M.: Shading-aware multi-view  stereo. European Conference on Computer Vision (ECCV) (2016)  22. Lhuillier, M., Quan, L.: A quasi-dense approach to surface reconstruction from uncalibrated images. IEEE Transactions on Pattern Analysis and Machine Intelli- gence (TPAMI) (2005)  23. Luo, W., Schwing, A.G., Urtasun, R.: Eﬃcient deep learning for stereo matching.  Computer Vision and Pattern Recognition (CVPR) (2016)  24. Mayer, N., Ilg, E., Hausser, P., Fischer, P., Cremers, D., Dosovitskiy, A., Brox, T.: A large dataset to train convolutional networks for disparity, optical ﬂow, and scene ﬂow estimation. Computer Vision and Pattern Recognition (CVPR) (2016) 25. Menze, M., Geiger, A.: Object scene ﬂow for autonomous vehicles. Computer Vision  and Pattern Recognition (CVPR) (2015)  26. Merrell, P., Akbarzadeh, A., Wang, L., Mordohai, P., Frahm, J.M., Yang, R., Nist´er, D., Pollefeys, M.: Real-time visibility-based fusion of depth maps. Inter- national Conference on Computer Vision (ICCV) (2007)  27. Moulon, P., Monasse, P., Marlet, R., Others: Openmvg. an open multiple view  geometry library. https://github.com/openMVG/openMVG  28. Newcombe, R.A., Izadi, S., Hilliges, O., Molyneaux, D., Kim, D., Davison, A.J., Kohi, P., Shotton, J., Hodges, S., Fitzgibbon, A.: Kinectfusion: Real-time dense surface mapping and tracking. IEEE International Symposium on Mixed and Aug- mented Reality (ISMAR) (2011)  29. OpenMVS: open multi-view stereo reconstruction library. https://github.com/  cdcseacave/openMVS  30. Pix4D: https://pix4d.com/ 31. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomed- ical image segmentation. International Conference on Medical Image Computing and Computer Assisted Intervention (MICCAI) (2015)  32. Sch¨onberger, J.L., Zheng, E., Frahm, J.M., Pollefeys, M.: Pixelwise view selec- tion for unstructured multi-view stereo. European Conference on Computer Vision (ECCV) (2016)  33. Seitz, S.M., Dyer, C.R.: Photorealistic scene reconstruction by voxel coloring. In-  ternational Journal of Computer Vision (IJCV) (1999)  34. Seki, A., Pollefeys, M.: Sgm-nets: Semi-global matching with neural networks.  Computer Vision and Pattern Recognition Workshops (CVPRW) (2017)  35. Tola, E., Strecha, C., Fua, P.: Eﬃcient large-scale multi-view stereo for ultra high-  resolution image sets. Machine Vision and Applications (MVA) (2012)  36. Vu, H.H., Labatut, P., Pons, J.P., Keriven, R.: High accuracy and visibility- consistent dense multiview stereo. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) (2012)  37. Xu, N., Price, B., Cohen, S., Huang, T.: Deep image matting. Computer Vision  and Pattern Recognition (CVPR) (2017)   MVSNet38. Yao, Y., Li, S., Zhu, S., Deng, H., Fang, T., Quan, L.: Relative camera refinement  for accurate dense reconstruction. 3D Vision (3DV) (2017)  39. Zbontar, J., LeCun, Y.: Stereo matching by training a convolutional neural network to compare image patches. Journal of Machine Learning Research (JMLR) (2016) 40. Zhang, R., Li, S., Fang, T., Zhu, S., Quan, L.: Joint camera clustering and sur- face segmentation for large-scale multi-view stereo. International Conference on Computer Vision (ICCV) (2015)"}