{"1": "1. Carranza, J., Theobalt, C., Magnor, M.A., Seidel, H.P.: Free-viewpoint video of  human actors. ACM Trans. Graph. 22(3) (2003) 569-577  2. Zitnick, C.L., Kang, S.B., Uyttendaele, M., Winder, S., Szeliski, R.: High-quality video view interpolation using a layered representation. ACM Trans. Graph. 23(3) (2004) 600-608  3. Liao, J., Lima, R.S., Nehab, D., Hoppe, H., Sander, P.V., Yu, J.: Automating image morphing using structural similarity on a halfway domain. ACM Trans. Graph. 33(5) (2014) 168:1-168:12  4. Linz, C., Lipski, C., Rogge, L., Theobalt, C., Magnor, M.: Space-time visual eﬀects as a post-production process. In: Proceedings of the 1st International Workshop on 3D Video Processing, ACM (2010) 5. Seitz, S.M., Dyer, C.R.: View morphing.  In: Proceedings of the 23rd Annual Conference on Computer Graphics and Interactive Techniques. SIGGRAPH ’96, ACM (1996) 21-30  6. Ji, D., Kwon, J., McFarland, M., Savarese, S.: Deep view morphing. IEEE Con-  ference on Computer Vision and Pattern Recognition (2017)  7. Park, E., Yang, J., Yumer, E., Ceylan, D., Berg, A.C.: Transformation-grounded In: IEEE Conference on  image generation network for novel 3d view synthesis. Computer Vision and Pattern Recognition. (2017)  8. Zhou, T., Tulsiani, S., Sun, W., Malik, J., Efros, A.A.: View synthesis by appear-  ance ﬂow. In: European Conference on Computer Vision. (2016)  9. Varol, G., Romero, J., Martin, X., Mahmood, N., Black, M.J., Laptev, I., Schmid, In: The IEEE Conference on Computer  C.: Learning from Synthetic Humans. Vision and Pattern Recognition. (2017)  10. Chang, A.X., Funkhouser, T., Guibas, L., Hanrahan, P., Huang, Q., Li, Z., Savarese, S., Savva, M., Song, S., Su, H., Xiao, J., Yi, L., Yu, F.: ShapeNet: An Information-Rich 3D Model Repository. Technical Report arXiv:1512.03012 (2015)  11. Levoy, M., Hanrahan, P.: Light field rendering. In: Proceedings of the 23rd Annual Conference on Computer Graphics and Interactive Techniques. SIGGRAPH ’96, ACM (1996) 31-42  12. Gortler, S.J., Grzeszczuk, R., Szeliski, R., Cohen, M.F.: The lumigraph. In: Pro- ceedings of the 23rd Annual Conference on Computer Graphics and Interactive Techniques. SIGGRAPH ’96, ACM (1996) 43-54  13. Penner, E., Zhang, L.: Soft 3d reconstruction for view synthesis. ACM Trans.  Graph. 36(6) (2017) 235:1-235:11  14. Rematas, K., Nguyen, C.H., Ritschel, T., Fritz, M., Tuytelaars, T.: Novel views of objects from a single image. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(8) (2017) 1576-1590  15. Lipski, C., Linz, C., Berger, K., Sellent, A., Magnor, M.: Virtual video camera: Image-based viewpoint navigation through space and time. Computer Graphics Forum (2010) 2555-2568  16. Ballan, L., Brostow, G.J., Puwein, J., Pollefeys, M.: Unstructured video-based rendering: Interactive exploration of casually captured videos. ACM Trans. Graph. 29(4) (2010) 87:1-87:11  17. Zhang, Z., Wang, L., Guo, B., Shum, H.Y.: Feature-based light field morphing.  ACM Trans. Graph. 21(3) (2002) 457-464   Learning to Dodge A BulletReferences  1. Carranza, J., Theobalt, C., Magnor, M.A., Seidel, H.P.: Free-viewpoint video of  human actors. ACM Trans. Graph. 22(3) (2003) 569-577  2. Zitnick, C.L., Kang, S.B., Uyttendaele, M., Winder, S., Szeliski, R.: High-quality video view interpolation using a layered representation. ACM Trans. Graph. 23(3) (2004) 600-608  3. Liao, J., Lima, R.S., Nehab, D., Hoppe, H., Sander, P.V., Yu, J.: Automating image morphing using structural similarity on a halfway domain. ACM Trans. Graph. 33(5) (2014) 168:1-168:12  4. Linz, C., Lipski, C., Rogge, L., Theobalt, C., Magnor, M.: Space-time visual eﬀects as a post-production process. In: Proceedings of the 1st International Workshop on 3D Video Processing, ACM (2010) 5. Seitz, S.M., Dyer, C.R.: View morphing.  In: Proceedings of the 23rd Annual Conference on Computer Graphics and Interactive Techniques. SIGGRAPH ’96, ACM (1996) 21-30  6. Ji, D., Kwon, J., McFarland, M., Savarese, S.: Deep view morphing. IEEE Con-  ference on Computer Vision and Pattern Recognition (2017)  7. Park, E., Yang, J., Yumer, E., Ceylan, D., Berg, A.C.: Transformation-grounded In: IEEE Conference on  image generation network for novel 3d view synthesis. Computer Vision and Pattern Recognition. (2017)  8. Zhou, T., Tulsiani, S., Sun, W., Malik, J., Efros, A.A.: View synthesis by appear-  ance ﬂow. In: European Conference on Computer Vision. (2016)  9. Varol, G., Romero, J., Martin, X., Mahmood, N., Black, M.J., Laptev, I., Schmid, In: The IEEE Conference on Computer  C.: Learning from Synthetic Humans. Vision and Pattern Recognition. (2017)  10. Chang, A.X., Funkhouser, T., Guibas, L., Hanrahan, P., Huang, Q., Li, Z., Savarese, S., Savva, M., Song, S., Su, H., Xiao, J., Yi, L., Yu, F.: ShapeNet: An Information-Rich 3D Model Repository. Technical Report arXiv:1512.03012 (2015)  11. Levoy, M., Hanrahan, P.: Light field rendering. In: Proceedings of the 23rd Annual Conference on Computer Graphics and Interactive Techniques. SIGGRAPH ’96, ACM (1996) 31-42  12. Gortler, S.J., Grzeszczuk, R., Szeliski, R., Cohen, M.F.: The lumigraph. In: Pro- ceedings of the 23rd Annual Conference on Computer Graphics and Interactive Techniques. SIGGRAPH ’96, ACM (1996) 43-54  13. Penner, E., Zhang, L.: Soft 3d reconstruction for view synthesis. ACM Trans.  Graph. 36(6) (2017) 235:1-235:11  14. Rematas, K., Nguyen, C.H., Ritschel, T., Fritz, M., Tuytelaars, T.: Novel views of objects from a single image. IEEE Transactions on Pattern Analysis and Machine Intelligence 39(8) (2017) 1576-1590  15. Lipski, C., Linz, C., Berger, K., Sellent, A., Magnor, M.: Virtual video camera: Image-based viewpoint navigation through space and time. Computer Graphics Forum (2010) 2555-2568  16. Ballan, L., Brostow, G.J., Puwein, J., Pollefeys, M.: Unstructured video-based rendering: Interactive exploration of casually captured videos. ACM Trans. Graph. 29(4) (2010) 87:1-87:11  17. Zhang, Z., Wang, L., Guo, B., Shum, H.Y.: Feature-based light field morphing.  ACM Trans. Graph. 21(3) (2002) 457-464   16  Shi Jin and Ruiynag Liu and Yu Ji and Jinwei Ye and Jingyi Yu  18. Beier, T., Neely, S.: Feature-based image metamorphosis. In: Proceedings of the 19th Annual Conference on Computer Graphics and Interactive Techniques. SIG- GRAPH ’92 (1992) 35-42  19. Lee, S., Wolberg, G., Shin, S.Y.: Polymorph: morphing among multiple images.  IEEE Computer Graphics and Applications 18(1) (1998) 58-71  20. Quenot, G.M.: Image matching using dynamic programming: Application to stere-  ovision and image interpolation. In: Image Communication. (1996)  21. Chaurasia, G., Sorkine-Hornung, O., Drettakis, G.: Silhouette-aware warping for image-based rendering. Computer Graphics Forum (Proceedings of the Eurograph- ics Symposium on Rendering) 30(4) (2011)  22. Germann, M., Popa, T., Keiser, R., Ziegler, R., Gross, M.: Novel-view synthesis of outdoor sport events using an adaptive view-dependent geometry. Comput. Graph. Forum 31 (2012) 325-333  23. Mahajan, D., Huang, F.C., Matusik, W., Ramamoorthi, R., Belhumeur, P.: Moving gradients: A path-based method for plausible image interpolation. ACM Trans. Graph. 28(3) (2009) 42:1-42:11  24. Dosovitskiy, A., Springenberg, J.T., Brox, T.: Learning to generate chairs with In: IEEE Conference on Computer Vision and  convolutional neural networks. Pattern Recognition. (2015)  25. Tatarchenko, M., Dosovitskiy, A., Brox, T.: Multi-view 3d models from single im- ages with a convolutional network. In: European Conference on Computer Vision. (2016)  26. Niklaus, S., Mai, L., Liu, F.: Video frame interpolation via adaptive convolution.  In: IEEE Conference on Computer Vision and Pattern Recognition. (2017)  27. Niklaus, S., Mai, L., Liu, F.: Video frame interpolation via adaptive separable convolution. In: IEEE International Conference on Computer Vision. (2017) 28. Jaderberg, M., Simonyan, K., Zisserman, A., Kavukcuoglu, K.: Spatial transformer networks. In: Proceedings of the 28th International Conference on Neural Infor- mation Processing Systems. (2015) 2017-2025  29. Flynn, J., Neulander, I., Philbin, J., Snavely, N.: Deep stereo: Learning to predict new views from the world’s imagery. In: IEEE Conference on Computer Vision and Pattern Recognition. (2016)  30. Kalantari, N.K., Wang, T.C., Ramamoorthi, R.: Learning-based view synthesis for  light field cameras. ACM Trans. Graph. 35(6) (2016) 193:1-193:10  31. Ilg, E., Mayer, N., Saikia, T., Keuper, M., Dosovitskiy, A., Brox, T.: Flownet 2.0: Evolution of optical ﬂow estimation with deep networks. In: IEEE Conference on Computer Vision and Pattern Recognition. (2017)  32. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose esti- mation. In Leibe, B., Matas, J., Sebe, N., Welling, M., eds.: European Conference on Computer Vision. (2016) 483-499  33. Loper, M., Mahmood, N., Romero, J., Pons-Moll, G., Black, M.J.: SMPL: A skinned multi-person linear model. ACM Trans. Graphics (Proc. SIGGRAPH Asia) 34(6) (2015) 248:1-248:16  34. Rematas, K., Ritschel, T., Fritz, M., Gavves, E., Tuytelaars, T.: Deep reﬂectance maps. In: IEEE Conference on Computer Vision and Pattern Recognition. (2016)"}