{"1": "1. Boykov, Y., Veksler, O., Zabih, R.: Fast approximate energy minimization via IEEE Transactions on Pattern Analysis and Machine Intelligence  graph cuts. 23(11) (November 2001) 1222-1239  2. Kolmogorov, V.: Convergent tree-reweighted message passing for energy minimiza- IEEE Transactions on Pattern Analysis and Machine Intelligence 28(10)  tion. (October 2006) 1568-1583  3. Komodakis, N., Tziritas, G.: Approximate labeling via graph cuts based on linear programming. IEEE Transactions on Pattern Analysis and Machine Intelligence 28(8) (August 2007) 1436-1453  4. Ladick´y, L., Russell, C., Kohli, P., Torr, P.H.S.: Associative hierarchical random IEEE Transactions on Pattern Analysis and Machine Intelligence 36(6)  fields. (June 2013) 1056-1077  5. Menze, M., Heipke, C., Geiger, A.: Discrete optimization for optical ﬂow.  In Gall, J., Gehler, P., Leibe, B., eds.: Proceedings of German Conference on Pattern Recognition. Volume 9358 of LNCS., Aachen, Germany, Springer (2015) 16-28 6. Chen, Q., Koltun, V.: Full ﬂow: Optical ﬂow estimation by global optimization over regular grids. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition, Las Vegas, NV, USA, IEEE (June 2015)  7. Li, M., Shekhovtsov, A., Huber, D.: Complexity of discrete energy minimization problems. In Leibe, B., Matas, J., Sebe, N., Welling, M., eds.: Proceedings of Euro- pean Conference on Computer Vision. Volume 9906 of Lecture Notes in Computer Science., Amsterdam, The Netherlands, Springer (October 2016) 834-852  8. Ishikawa, H.: Exact optimization for Markov random fields with convex priors. IEEE Transactions on Pattern Analysis and Machine Intelligence 25(10) (October 2003) 1333-1336  9. Kolmogorov, V., Zabin, R.: What energy functions can be minimized via graph cuts? IEEE Transactions on Pattern Analysis and Machine Intelligence 26(2) (February 2004) 147-159  10. Ramalingam, S., Kohli, P., Alahari, K., Torr, P.H.S.: Exact inference in multi-label CRFs with higher order cliques. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition, Anchorage, AK, USA, IEEE (June 2008)  11. Boykov, Y., Kolmogorov, V.: An experimental comparison of min-cut/max- ﬂow algorithms for energy minimization in vision. IEEE Transactions on Pattern Anal- ysis and Machine Intelligence 26(9) (September 2004) 1124-1137  12. Shekhovtsov, A., Kovtun, I., Hlav´a˘c, V.: Eﬃcient MRF deformation model for non-rigid image matching. Computer Vision and Image Understanding 112(1) (October 2008) 91-99  13. Horn, B.K., Schunck, B.G.: Determining optical ﬂow. Artificial Intelligence 17(1-  3) (August 1981) 185-203  14. Kohli, P., Shekhovtsov, A., Rother, C., Kolmogorov, V., Torr, P.H.S.: On partial optimality in multi-label MRFs. In: Proceedings of International Conference on Machine Learning, Helsinki, Finland, ACM (July 2008) 480-487  15. Kolmogorov, V., Rother, C.: Minimizing nonsubmodular functions with graph cuts-A review. IEEE Transactions on Pattern Analysis and Machine Intelligence 29(7) (July 2007) 1274-1279  16. Goldstein, T., Bresson, X., Osher, S.: Global minimization of Markov random fields Inverse Problems & Imaging 6(4) (November  with applications to optical ﬂow. 2012) 623-644   MRF Optimization with Separable Convex Prior on PosetsReferences  1. Boykov, Y., Veksler, O., Zabih, R.: Fast approximate energy minimization via IEEE Transactions on Pattern Analysis and Machine Intelligence  graph cuts. 23(11) (November 2001) 1222-1239  2. Kolmogorov, V.: Convergent tree-reweighted message passing for energy minimiza- IEEE Transactions on Pattern Analysis and Machine Intelligence 28(10)  tion. (October 2006) 1568-1583  3. Komodakis, N., Tziritas, G.: Approximate labeling via graph cuts based on linear programming. IEEE Transactions on Pattern Analysis and Machine Intelligence 28(8) (August 2007) 1436-1453  4. Ladick´y, L., Russell, C., Kohli, P., Torr, P.H.S.: Associative hierarchical random IEEE Transactions on Pattern Analysis and Machine Intelligence 36(6)  fields. (June 2013) 1056-1077  5. Menze, M., Heipke, C., Geiger, A.: Discrete optimization for optical ﬂow.  In Gall, J., Gehler, P., Leibe, B., eds.: Proceedings of German Conference on Pattern Recognition. Volume 9358 of LNCS., Aachen, Germany, Springer (2015) 16-28 6. Chen, Q., Koltun, V.: Full ﬂow: Optical ﬂow estimation by global optimization over regular grids. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition, Las Vegas, NV, USA, IEEE (June 2015)  7. Li, M., Shekhovtsov, A., Huber, D.: Complexity of discrete energy minimization problems. In Leibe, B., Matas, J., Sebe, N., Welling, M., eds.: Proceedings of Euro- pean Conference on Computer Vision. Volume 9906 of Lecture Notes in Computer Science., Amsterdam, The Netherlands, Springer (October 2016) 834-852  8. Ishikawa, H.: Exact optimization for Markov random fields with convex priors. IEEE Transactions on Pattern Analysis and Machine Intelligence 25(10) (October 2003) 1333-1336  9. Kolmogorov, V., Zabin, R.: What energy functions can be minimized via graph cuts? IEEE Transactions on Pattern Analysis and Machine Intelligence 26(2) (February 2004) 147-159  10. Ramalingam, S., Kohli, P., Alahari, K., Torr, P.H.S.: Exact inference in multi-label CRFs with higher order cliques. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition, Anchorage, AK, USA, IEEE (June 2008)  11. Boykov, Y., Kolmogorov, V.: An experimental comparison of min-cut/max- ﬂow algorithms for energy minimization in vision. IEEE Transactions on Pattern Anal- ysis and Machine Intelligence 26(9) (September 2004) 1124-1137  12. Shekhovtsov, A., Kovtun, I., Hlav´a˘c, V.: Eﬃcient MRF deformation model for non-rigid image matching. Computer Vision and Image Understanding 112(1) (October 2008) 91-99  13. Horn, B.K., Schunck, B.G.: Determining optical ﬂow. Artificial Intelligence 17(1-  3) (August 1981) 185-203  14. Kohli, P., Shekhovtsov, A., Rother, C., Kolmogorov, V., Torr, P.H.S.: On partial optimality in multi-label MRFs. In: Proceedings of International Conference on Machine Learning, Helsinki, Finland, ACM (July 2008) 480-487  15. Kolmogorov, V., Rother, C.: Minimizing nonsubmodular functions with graph cuts-A review. IEEE Transactions on Pattern Analysis and Machine Intelligence 29(7) (July 2007) 1274-1279  16. Goldstein, T., Bresson, X., Osher, S.: Global minimization of Markov random fields Inverse Problems & Imaging 6(4) (November  with applications to optical ﬂow. 2012) 623-644   16  C. Domokos, F. R. Schmidt, and D. Cremers  17. Goldluecke, B., Strekalovskiy, E., Cremers, D.: Tight convex relaxations for vector- valued labeling. SIAM Journal on Imaging Sciences 6(3) (March 2013) 1626-1664 18. Topkis, D.M.: Minimizing a submodular function on a lattice. Operations Research  26(2) (March-April 1978) 305-321  19. Li, K., Wu, X., Chen, D., Sonka, M.: Optimal surface segmentation in volumetric images - A graph-theoretic approach. IEEE Transactions on Pattern Analysis and Machine Intelligence 28(1) (November 2006) 119-134  20. Isack, H., Veksler, O., Oguz, I., Sonka, M., Boykov, Y.: Eﬃcient optimization for hierarchically-structured interacting segments (HINTS). In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition, Honolulu, HI, USA, IEEE (July 2017)  21. Carr, P., Hartley, R.: Solving multilabel graph cut problems with multilabel swap. In: Proceedings of International Conference on Digital Image Computing, Mel- bourne, Australia, IEEE (December 2009)  22. Butler, D.J., Wulﬀ, J., Stanley, G.B., Black, M.J.: A naturalistic open source In Fitzgibbon, A., Lazebnik, S., Perona, P., movie for optical ﬂow evaluation. Sato, Y., Schmid, C., eds.: Proceedings of European Conference on Computer Vision. Volume 7577 of Lecture Notes in Computer Science., Springer (October 2012) 611-625  23. Revaud, J., Weinzaepfel, P., Harchaoui, Z., Schmid, C.: EpicFlow: Edge-preserving interpolation of correspondences for optical ﬂow. In: Proceedings of IEEE Con- ference on Computer Vision and Pattern Recognition, Boston, MA, USA, IEEE (June 2015)  24. Kohli, P., Ladick´y, L., Torr, P.H.S.: Robust higher order potentials for enforcing label consistency. In: Proceedings of IEEE Conference on Computer Vision and Pattern Recognition, Anchorage, AK, USA, IEEE (2008)  25. Bailer, C., Taetz, B., Stricker, D.: Flow fields: Dense correspondence fields for highly accurate large displacement optical ﬂow estimation. In: Proceedings of IEEE International Conference on Computer Vision, Santiago, Chile, IEEE (December 2015) 4015-4023"}