{"1": "1. Hays, J., Efros, A.A.: Im2GPS: Estimating geographic information from a single  image. In: CVPR. (2008)  2. Hays, J., Efros, A.A.: Large-scale image geolocalization. In: Multimodal Location  Estimation of Videos and Images. Springer (2015) 41-62  3. Vo, N., Jacobs, N., Hays, J.: Revisiting IM2GPS in the deep learning era. In: ICCV.  4. Weyand, T., Kostrikov, I., Philbin, J.: Planet-photo geolocation with convolutional  (2017)  neural networks. In: ECCV. (2016)  TPAMI 33(1) (2011) 117-128  5. Jegou, H., Douze, M., Schmid, C.: Product quantization for nearest neighbor search.  6. Arandjelovic, R., Gronat, P., Torii, A., Pajdla, T., Sivic, J.: NetVLAD: CNN  architecture for weakly supervised place recognition. In: CVPR. (2016)  7. Kim, H.J., Dunn, E., Frahm, J.M.: Learned contextual feature reweighting for  image geo-localization. In: CVPR. (2017)  8. Baatz, G., Koeser, K., Chen, D., Grzeszczuk, R., Pollefeys, M.: Handling urban  location recognition as a 2d homothetic problem. In: ECCV. (2010)  9. Cao, S., Snavely, N.: Graph-based discriminative learning for location recognition.  IJCV 112(2) (2015) 239-254  10. Chen, D., Baatz, G., Köser, K., Tsai, S., Vedantham, R., Pylvänäinen, T., Roimela, K., Chen, X., Bach, J., Pollefeys, M., Girod, B., Grzeszczuk, R.: City-scale landmark identification on mobile devices. In: CVPR. (2011)  11. Kim, H.J., Dunn, E., Frahm, J.M.: Predicting good features for image geo-  localization using per-bundle vlad. In: ICCV. (2015)  12. Knopp, J., Sivic, J., Pajdla, T.: Avoiding confusing features in place recognition.  In: ECCV. (2010)  13. Philbin, J., Chum, O., Isard, M., Sivic, J., Zisserman, A.: Object retrieval with  large vocabularies and fast spatial matching. In: CVPR. (2007)  14. Schindler, G., Brown, M., Szeliski, R.: City-scale location recognition. In: CVPR.  (2007)  view. In: ECCV. (2010)  15. Zamir, A.R., Shah, M.: Accurate image localization based on google maps street  16. Zamir, A.R., Shah, M.: Image geo-localization based on multiple nearest neighbor  feature matching using generalized graphs. PAMI 36(8) (2014)  17. Noh, H., Araujo, A., Sim, J., Weyand, T., Han, B.: Large-scale image retrieval with  attentive deep local features. In: ICCV. (2017)  18. Irschara, A., Zach, C., Frahm, J.M., Bischof, H.: From structure-from-motion point  clouds to fast location recognition. In: CVPR. (2009)  19. Li, Y., Snavely, N., Huttenlocher, D., Fua, P.: Location recognition using prioritized  20. Li, Y., Snavely, N., Huttenlocher, D., Fua, P.: Worldwide pose estimation using 3d  21. Liu, L., Li, H., Dai, Y.: Eﬃcient global 2d-3d matching for camera localization in a  feature matching. In: ECCV. (2010)  point clouds. In: ECCV. (2012)  large-scale 3d map. In: ICCV. (2017)  2d-to-3d matching. In: ICCV. (2011)  22. Sattler, T., Leibe, B., Kobbelt, L.: Fast image-based localization using direct  23. Sattler, T., Weyand, T., Leibe, B., Kobbelt, L.: Image retrieval for image-based  localization revisited. In: BMVC. (2012)   Enhancing Image Geolocalization by Combinatorial Partitioning of MapsReferences  1. Hays, J., Efros, A.A.: Im2GPS: Estimating geographic information from a single  image. In: CVPR. (2008)  2. Hays, J., Efros, A.A.: Large-scale image geolocalization. In: Multimodal Location  Estimation of Videos and Images. Springer (2015) 41-62  3. Vo, N., Jacobs, N., Hays, J.: Revisiting IM2GPS in the deep learning era. In: ICCV.  4. Weyand, T., Kostrikov, I., Philbin, J.: Planet-photo geolocation with convolutional  (2017)  neural networks. In: ECCV. (2016)  TPAMI 33(1) (2011) 117-128  5. Jegou, H., Douze, M., Schmid, C.: Product quantization for nearest neighbor search.  6. Arandjelovic, R., Gronat, P., Torii, A., Pajdla, T., Sivic, J.: NetVLAD: CNN  architecture for weakly supervised place recognition. In: CVPR. (2016)  7. Kim, H.J., Dunn, E., Frahm, J.M.: Learned contextual feature reweighting for  image geo-localization. In: CVPR. (2017)  8. Baatz, G., Koeser, K., Chen, D., Grzeszczuk, R., Pollefeys, M.: Handling urban  location recognition as a 2d homothetic problem. In: ECCV. (2010)  9. Cao, S., Snavely, N.: Graph-based discriminative learning for location recognition.  IJCV 112(2) (2015) 239-254  10. Chen, D., Baatz, G., Köser, K., Tsai, S., Vedantham, R., Pylvänäinen, T., Roimela, K., Chen, X., Bach, J., Pollefeys, M., Girod, B., Grzeszczuk, R.: City-scale landmark identification on mobile devices. In: CVPR. (2011)  11. Kim, H.J., Dunn, E., Frahm, J.M.: Predicting good features for image geo-  localization using per-bundle vlad. In: ICCV. (2015)  12. Knopp, J., Sivic, J., Pajdla, T.: Avoiding confusing features in place recognition.  In: ECCV. (2010)  13. Philbin, J., Chum, O., Isard, M., Sivic, J., Zisserman, A.: Object retrieval with  large vocabularies and fast spatial matching. In: CVPR. (2007)  14. Schindler, G., Brown, M., Szeliski, R.: City-scale location recognition. In: CVPR.  (2007)  view. In: ECCV. (2010)  15. Zamir, A.R., Shah, M.: Accurate image localization based on google maps street  16. Zamir, A.R., Shah, M.: Image geo-localization based on multiple nearest neighbor  feature matching using generalized graphs. PAMI 36(8) (2014)  17. Noh, H., Araujo, A., Sim, J., Weyand, T., Han, B.: Large-scale image retrieval with  attentive deep local features. In: ICCV. (2017)  18. Irschara, A., Zach, C., Frahm, J.M., Bischof, H.: From structure-from-motion point  clouds to fast location recognition. In: CVPR. (2009)  19. Li, Y., Snavely, N., Huttenlocher, D., Fua, P.: Location recognition using prioritized  20. Li, Y., Snavely, N., Huttenlocher, D., Fua, P.: Worldwide pose estimation using 3d  21. Liu, L., Li, H., Dai, Y.: Eﬃcient global 2d-3d matching for camera localization in a  feature matching. In: ECCV. (2010)  point clouds. In: ECCV. (2012)  large-scale 3d map. In: ICCV. (2017)  2d-to-3d matching. In: ICCV. (2011)  22. Sattler, T., Leibe, B., Kobbelt, L.: Fast image-based localization using direct  23. Sattler, T., Weyand, T., Leibe, B., Kobbelt, L.: Image retrieval for image-based  localization revisited. In: BMVC. (2012)   16  P. H. Seo, T. Weyand, J. Sim, and B. Han  24. Sattler, T., Torii, A., Sivic, J., Pollefeys, M., Taira, H., Okutomi, M., Pajdla, T.: Are large-scale 3d models really necessary for accurate visual localization? In: CVPR. (2017)  25. Kendall, A., Cipolla, R.: Geometric loss functions for camera pose regression with  deep learning. CVPR (2017)  26. Kendall, A., Grimes, M., Cipolla, R.: PoseNet: A convolutional network for real-time  6-dof camera relocalization. In: ICCV. (2015)  27. Walch, F., Hazirbas, C., Leal-Taixé, L., Sattler, T., Hilsenbeck, S., Cremers, D.: Image-based localization using lstms for structured feature correlation. In: ICCV. (2017)  28. Avrithis, Y., Kalantidis, Y., Tolias, G., Spyrou, E.: Retrieving landmark and  non-landmark images from community photo collections. In: MM. (2010)  29. Gammeter, S., Quack, T., Van Gool, L.:  I know what you did last summer:  Object-level auto-annotation of holiday snaps. In: ICCV. (2009)  30. Johns, E., Yang, G.Z.: From images to scenes: Compressing an image cluster into a  single scene model for place recognition. In: ICCV. (2011)  31. Quack, T., Leibe, B., Van Gool, L.: World-scale mining of objects and events from  community photo collections. In: CIVR. (2008) 47-56  32. Zheng, Y.T., Zhao, M., Song, Y., Adam, H., Buddemeier, U., Bissacco, A., Brucher, F., Chua, T.S., Neven, H.: Tour the world: Building a web-scale landmark recognition engine. In: CVPR. (2009)  33. Weyand, T., Leibe, B.: Visual landmark recognition from internet photo collections:  A large-scale evaluation. CVIU 135 (2015) 1-15  34. Bergamo, A., Sinha, S.N., Torresani, L.: Leveraging structure from motion to learn  discriminative codebooks for scalable landmark classification. In: CVPR. (2013)  35. Li, Y., Crandall, D.J., Huttenlocher, D.P.: Landmark classification in large-scale  image collections. In: ICCV. (2009)  36. Gronat, P., Obozinski, G., Sivic, J., Pajdla, T.: Learning per-location classifiers for  visual place recognition. In: CVPR. (2013)  37. Workman, S., Souvenir, R., Jacobs, N.: Wide-area image geolocalization with aerial  reference imagery. In: ICCV. (2015)  38. Lin, T.Y., Belongie, S., Hays, J.: Cross-view image geolocalization. In: CVPR.  (2013)  39. Lin, T.Y., Cui, Y., Belongie, S., Hays, J.: Learning deep representations for  ground-to-aerial geolocalization. In: CVPR. (2015)  40. Tian, Y., Chen, C., Shah, M.: Cross-view image matching for geo-localization in  urban environments. In: CVPR. (2017)  41. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A.: Going deeper with convolutions. In: CVPR. (2015) 42. Szegedy, C., Vanhoucke, V., Ioﬀe, S., Shlens, J., Wojna, Z.: Rethinking the inception  architecture for computer vision. In: CVPR. (2016)  43. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: ICCV. (2009)"}