{"1": "1. Anderson, P., He, X., Buehler, C., Teney, D., Johnson, M., Gould, S., Zhang, L.: Bottom-up and top-down attention for image captioning and vqa. In: Proceedings of the IEEE Confer- ence on Computer Vision and Pattern Recognition (CVPR) (2018)  2. Argamon, S., Koppel, M., Pennebaker, J.W., Schler, J.: Mining the blogosphere: Age, gender  and the varieties of self-expression. First Monday 12(9) (2007)  3. Barocas, S., Selbst, A.D.: Big data’s disparate impact. California Law Review 104, 671  (2016)  4. Bolukbasi, T., Chang, K.W., Zou, J.Y., Saligrama, V., Kalai, A.T.: Man is to computer pro- grammer as woman is to homemaker? debiasing word embeddings. In: Advances in Neural Information Processing Systems (NIPS). pp. 4349-4357 (2016)  5. Buolamwini, J.A.: Gender shades: intersectional phenotypic and demographic evaluation of face datasets and gender classifiers. Ph.D. thesis, Massachusetts Institute of Technology (2017)  6. Burger, J.D., Henderson, J., Kim, G., Zarrella, G.: Discriminating gender on twitter. In: Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP). pp. 1301-1309. Association for Computational Linguistics (2011)  7. Caruana, R., Lou, Y., Gehrke, J., Koch, P., Sturm, M., Elhadad, N.: Intelligible models for healthcare: Predicting pneumonia risk and hospital 30-day readmission. In: Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Min- ing. pp. 1721-1730. ACM (2015)  8. Donahue, J., Anne Hendricks, L., Guadarrama, S., Rohrbach, M., Venugopalan, S., Saenko, K., Darrell, T.: Long-term recurrent convolutional networks for visual recognition and de- scription. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recog- nition (CVPR). pp. 2625-2634 (2015)  9. Dwork, C., Hardt, M., Pitassi, T., Reingold, O., Zemel, R.: Fairness through awareness. In: Proceedings of the 3rd Innovations in Theoretical Computer Science Conference. pp. 214- 226. ACM (2012)  10. Eidinger, E., Enbar, R., Hassner, T.: Age and gender estimation of unfiltered faces. IEEE  Transactions on Information Forensics and Security 9(12), 2170-2179 (2014)  11. Fong, R.C., Vedaldi, A.: Interpretable explanations of black boxes by meaningful pertur- bation. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV) (2017)  12. Gkioxari, G., Girshick, R., Malik, J.: Contextual action recognition with r* cnn. In: Pro- ceedings of the IEEE International Conference on Computer Vision (ICCV). pp. 1080-1088 (2015)  13. Gordon, J., Van Durme, B.: Reporting bias and knowledge acquisition. In: Proceedings of  the 2013 workshop on Automated Knowledge Base Construction. pp. 25-30. ACM (2013)  14. Hardt, M., Price, E., Srebro, N., et al.: Equality of opportunity in supervised learning. In:  Advances in Neural Information Processing Systems (NIPS). pp. 3315-3323 (2016)  15. Karpathy, A., Fei-Fei, L.: Deep visual-semantic alignments for generating image descrip- tions. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3128-3137 (2015)  16. Larson, B.N.: Gender as a variable in natural-language processing: Ethical considerations  (2017)  17. Lavie, M.D.A.: Meteor universal: Language specific translation evaluation for any target language. In: Proceedings of the Annual Meeting of the Association for Computational Lin- guistics (ACL). p. 376 (2014)   Overcoming Bias in Captioning ModelsReferences  1. Anderson, P., He, X., Buehler, C., Teney, D., Johnson, M., Gould, S., Zhang, L.: Bottom-up and top-down attention for image captioning and vqa. In: Proceedings of the IEEE Confer- ence on Computer Vision and Pattern Recognition (CVPR) (2018)  2. Argamon, S., Koppel, M., Pennebaker, J.W., Schler, J.: Mining the blogosphere: Age, gender  and the varieties of self-expression. First Monday 12(9) (2007)  3. Barocas, S., Selbst, A.D.: Big data’s disparate impact. California Law Review 104, 671  (2016)  4. Bolukbasi, T., Chang, K.W., Zou, J.Y., Saligrama, V., Kalai, A.T.: Man is to computer pro- grammer as woman is to homemaker? debiasing word embeddings. In: Advances in Neural Information Processing Systems (NIPS). pp. 4349-4357 (2016)  5. Buolamwini, J.A.: Gender shades: intersectional phenotypic and demographic evaluation of face datasets and gender classifiers. Ph.D. thesis, Massachusetts Institute of Technology (2017)  6. Burger, J.D., Henderson, J., Kim, G., Zarrella, G.: Discriminating gender on twitter. In: Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP). pp. 1301-1309. Association for Computational Linguistics (2011)  7. Caruana, R., Lou, Y., Gehrke, J., Koch, P., Sturm, M., Elhadad, N.: Intelligible models for healthcare: Predicting pneumonia risk and hospital 30-day readmission. In: Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Min- ing. pp. 1721-1730. ACM (2015)  8. Donahue, J., Anne Hendricks, L., Guadarrama, S., Rohrbach, M., Venugopalan, S., Saenko, K., Darrell, T.: Long-term recurrent convolutional networks for visual recognition and de- scription. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recog- nition (CVPR). pp. 2625-2634 (2015)  9. Dwork, C., Hardt, M., Pitassi, T., Reingold, O., Zemel, R.: Fairness through awareness. In: Proceedings of the 3rd Innovations in Theoretical Computer Science Conference. pp. 214- 226. ACM (2012)  10. Eidinger, E., Enbar, R., Hassner, T.: Age and gender estimation of unfiltered faces. IEEE  Transactions on Information Forensics and Security 9(12), 2170-2179 (2014)  11. Fong, R.C., Vedaldi, A.: Interpretable explanations of black boxes by meaningful pertur- bation. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV) (2017)  12. Gkioxari, G., Girshick, R., Malik, J.: Contextual action recognition with r* cnn. In: Pro- ceedings of the IEEE International Conference on Computer Vision (ICCV). pp. 1080-1088 (2015)  13. Gordon, J., Van Durme, B.: Reporting bias and knowledge acquisition. In: Proceedings of  the 2013 workshop on Automated Knowledge Base Construction. pp. 25-30. ACM (2013)  14. Hardt, M., Price, E., Srebro, N., et al.: Equality of opportunity in supervised learning. In:  Advances in Neural Information Processing Systems (NIPS). pp. 3315-3323 (2016)  15. Karpathy, A., Fei-Fei, L.: Deep visual-semantic alignments for generating image descrip- tions. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3128-3137 (2015)  16. Larson, B.N.: Gender as a variable in natural-language processing: Ethical considerations  (2017)  17. Lavie, M.D.A.: Meteor universal: Language specific translation evaluation for any target language. In: Proceedings of the Annual Meeting of the Association for Computational Lin- guistics (ACL). p. 376 (2014)   16  L.A. Hendricks*, K. Burns*, K. Saenko, T. Darrell, A. Rohrbach  18. Levi, G., Hassner, T.: Age and gender classification using convolutional neural networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition Work- shops (CVPR Workshops). pp. 34-42 (2015)  19. Lin, J.: Divergence measures based on the shannon entropy. IEEE Transactions on Informa-  tion theory 37(1), 145-151 (1991)  20. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: Proceedings of the European Conference on Computer Vision (ECCV). pp. 740-755. Springer (2014)  21. van Miltenburg, E.: Stereotyping and bias in the ﬂickr30k dataset. In: Workshop on Multi-  modal Corpora: Computer vision and language processing (2016)  22. Misra, I., Zitnick, C.L., Mitchell, M., Girshick, R.: Seeing through the human reporting bias: Visual classifiers from noisy human-centric labels. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2930-2939. IEEE (2016)  23. of the President, U.S.E.O., Podesta, J.: Big data: Seizing opportunities, preserving values.  White House, Executive Office of the President (2014)  24. Quadrianto, N., Petterson, J., Smola, A.J.: Distribution matching for transduction. In: Ad-  vances in Neural Information Processing Systems (NIPS). pp. 1500-1508 (2009)  25. Quadrianto, N., Sharmanska, V.: Recycling privileged learning and distribution matching for fairness. In: Advances in Neural Information Processing Systems (NIPS). pp. 677-688 (2017)  26. Ramanishka, V., Das, A., Zhang, J., Saenko, K.: Top-down visual saliency guided by cap- tions. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). vol. 1, p. 7 (2017)  27. Ribeiro, M.T., Singh, S., Guestrin, C.: Why should i trust you?: Explaining the predictions of any classifier. In: Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. pp. 1135-1144. ACM (2016)  28. Ross, A.S., Hughes, M.C., Doshi-Velez, F.: Right for the right reasons: Training differen- tiable models by constraining their explanations. In: Proceedings of the International Joint Conference on Artificial Intelligence (IJCAI) (2017)  29. Ryu, H.J., Adam, H., Mitchell, M.: Inclusivefacenet: Improving face attribute detection with race and gender diversity. In: Workshop on Fairness, Accountability, and Transparency in Machine Learning (FAT/ML) (2018)  30. Selvaraju, R.R., Cogswell, M., Das, A., Vedantam, R., Parikh, D., Batra, D.: Grad-cam: Vi- sual explanations from deep networks via gradient-based localization. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV) (2017)  31. Stock, P., Cisse, M.: Convnets and imagenet beyond accuracy: Explanations, bias detection,  adversarial examples and model criticism. arXiv preprint arXiv:1711.11443 (2017)  32. Szegedy, C., Vanhoucke, V., Ioffe, S., Shlens, J., Wojna, Z.: Rethinking the inception archi- tecture for computer vision. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2818-2826 (2016)  33. Tan, S., Caruana, R., Hooker, G., Lou, Y.: Detecting bias in black-box models using trans- parent model distillation. In: AAAI/ACM Conference on Artificial Intelligence, Ethics, and Society (2018)  34. Torralba, A.: Contextual modulation of target saliency. In: Advances in Neural Information  Processing Systems (NIPS). pp. 1303-1310 (2002)  35. Torralba, A., Sinha, P.: Statistical context priming for object detection. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV). vol. 1, pp. 763-770. IEEE (2001)  36. Tzeng, E., Hoffman, J., Darrell, T., Saenko, K.: Simultaneous deep transfer across do- mains and tasks. In: Proceedings of the IEEE International Conference on Computer Vision (ICCV). pp. 4068-4076. IEEE (2015)   Overcoming Bias in Captioning Models37. Vinyals, O., Toshev, A., Bengio, S., Erhan, D.: Show and tell: A neural image caption gener- ator. In: Computer Vision and Pattern Recognition (CVPR), 2015 IEEE Conference on. pp. 3156-3164. IEEE (2015)  38. Xu, J., Mei, T., Yao, T., Rui, Y.: Msr-vtt: A large video description dataset for bridging video and language. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 5288-5296. IEEE (2016)  39. Xu, K., Ba, J., Kiros, R., Cho, K., Courville, A., Salakhudinov, R., Zemel, R., Bengio, Y.: Show, attend and tell: Neural image caption generation with visual attention. In: Proceedings of the International Conference on Machine Learning (ICML)  40. Yan, X., Yan, L.: Gender classification of weblog authors. In: AAAI Spring Symposium: Computational Approaches to Analyzing Weblogs. pp. 228-230. Palo Alto, CA (2006) 41. Young, P., Lai, A., Hodosh, M., Hockenmaier, J.: From image descriptions to visual denota- tions: New similarity metrics for semantic inference over event descriptions. Transactions of the Association for Computational Linguistics (TACL) 2, 67-78 (2014)  42. Zeiler, M.D., Fergus, R.: Visualizing and understanding convolutional networks. In: Pro- ceedings of the European Conference on Computer Vision (ECCV). pp. 818-833. Springer (2014)  43. Zhang, B.H., Lemoine, B., Mitchell, M.: Mitigating unwanted biases with adversarial learn- ing. In: AAAI/ACM Conference on Artificial Intelligence, Ethics, and Society (AIES) (2018) 44. Zhang, J., Lin, Z., Brandt, J., Shen, X., Sclaroff, S.: Top-down neural attention by excitation backprop. In: Proceedings of the European Conference on Computer Vision (ECCV). pp. 543-559. Springer (2016)  45. Zhang, K., Tan, L., Li, Z., Qiao, Y.: Gender and smile classification using deep convolutional neural networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPR Workshops). pp. 34-38 (2016)  46. Zhang, X., Yu, F.X., Chang, S.F., Wang, S.: Deep transfer network: Unsupervised domain  adaptation. arXiv preprint arXiv:1503.00591 (2015)  47. Zhao, J., Wang, T., Yatskar, M., Ordonez, V., Chang, K.W.: Men also like shopping: Reduc- ing gender bias amplification using corpus-level constraints. In: Proceedings of the Confer- ence on Empirical Methods in Natural Language Processing (EMNLP) (2017)  48. Zintgraf, L.M., Cohen, T.S., Adel, T., Welling, M.: Visualizing deep neural network de- cisions: Prediction difference analysis. In: Proceedings of the International Conference on Learning Representations (ICLR) (2017)"}