{"1": "1. Grauman, K., Shakhnarovich, G., Darrell, T.: A bayesian approach to image-based  visual hull reconstruction. In: Proc. CVPR. (2003)  2. Fattal, R.: Image upsampling via imposed edge statistics. In: Proc. ACM SIG-  GRAPH. (2007)  3. Glasner, D., Bagon, S., Irani, M.: Super-resolution from a single image. In: Proc.  Intl. Conf. Computer Vision (ICCV). (2009)  4. Zhu, Y., Zhang, Y., Yuille, A.L.: Single image super-resolution using deformable patches. In: Proc. Comp. Vision and Pattern Recognition (CVPR). (2014) 2917- 2924  5. Freeman, W.T., Jones, T.R., Pasztor, E.C.: Example based super-resolution. IEEE  Comp. Graphics and Applications 2 (2002)  6. Aydin, V., Foroosh, H.: Volumetric super-resolution of multispectral data. In: Corr.  arXiv:1705.05745v1. (2017)  7. Schmidt, U., Jancsary, J., Nowozin, S., Roth, S., Rother, C.: Cascades of regression tree fields for image restoration. IEEE Trans. Pattern Anal. Machine Intelligence 38(4) (2016) 677-689  8. Vincent, P., Larochelle, H., Bengio, Y., Manzagol, P.: Extracting and composing robust features with denoising autoencoders. In: Proceedings Intl. Conf. Machine Learning (ICML). (2008) 1096-1103  9. Hayat, K.: Super-resolution via deep learning. CoRR abs/1706.09077 (2017) 10. Xie, J., Xu, L., Chen, E.: Image denoising and inpainting with deep neural networks.  In: Proc. Neural Inf. Processing Systems (NIPS). (2012) 350-358  11. Wang, Z., Liu, D., Yang, J., Han, W., Huang, T.S.: Deep networks for image super- resolution with sparse prior. In: Proc. Intl. Conf. Computer Vision (ICCV). (2015) 370-378  12. Dong, C., Loy, C.C., He, K., Tang, X.: Image super-resolution using deep convo- lutional networks. IEEE Trans. Pattern Anal. Machine Intelligence 38(2) (2016) 295-307  13. Shi, W., Caballero, J., Huszar, F., Totz, J., Aitken, A., Bishop, R., Rueckert, D., Wang, Z.: Real-time single image and video super-resolution using an eﬃcient sub- pixel convolutional neural network. In: Proc. Comp. Vision and Pattern Recognition (CVPR). (2016)  14. Jain, V., Seung, H.: Natural image denoising with convolutional networks. In: Proc.  Neural Inf. Processing Systems (NIPS). (2008) 769-776  15. Abrahamsson, S., Blom, H., Jans, D.: Multifocus structured illumination microscopy for fast volumetric super-resolution imaging. Biomedical Optics Express 8(9) (2017) 4135-4140  16. Brock, A., Lim, T., Ritchie, J.M., Weston, N.J.: Generative and discriminative  voxel modeling with convolutional neural networks  17. Felzenszwalb, P., Huttenlocher, D.: Pictorial structures for object detection. Intl.  Journal on Computer Vision 61 (2003)  18. Andriluka, M., Roth, S., Schiele, B.: Pictoral structures revisited: People detec- In: Proc. Computer Vision and Pattern  tion and articulated pose estimation. Recognition. (2009)  19. Lan, X., Huttenlocher, D.: Beyond trees: common-factor model for 2d human pose recovery. In: Proc. Intl. Conf. on Computer Vision. Volume 1. (2005) 470-477 20. Jiang, H.: Human pose estimation using consistent max-covering. In: Intl. Conf.  on Computer Vision. (2009)   Deep Autoencoder for Human Pose Estimation and Body UpscalingReferences  1. Grauman, K., Shakhnarovich, G., Darrell, T.: A bayesian approach to image-based  visual hull reconstruction. In: Proc. CVPR. (2003)  2. Fattal, R.: Image upsampling via imposed edge statistics. In: Proc. ACM SIG-  GRAPH. (2007)  3. Glasner, D., Bagon, S., Irani, M.: Super-resolution from a single image. In: Proc.  Intl. Conf. Computer Vision (ICCV). (2009)  4. Zhu, Y., Zhang, Y., Yuille, A.L.: Single image super-resolution using deformable patches. In: Proc. Comp. Vision and Pattern Recognition (CVPR). (2014) 2917- 2924  5. Freeman, W.T., Jones, T.R., Pasztor, E.C.: Example based super-resolution. IEEE  Comp. Graphics and Applications 2 (2002)  6. Aydin, V., Foroosh, H.: Volumetric super-resolution of multispectral data. In: Corr.  arXiv:1705.05745v1. (2017)  7. Schmidt, U., Jancsary, J., Nowozin, S., Roth, S., Rother, C.: Cascades of regression tree fields for image restoration. IEEE Trans. Pattern Anal. Machine Intelligence 38(4) (2016) 677-689  8. Vincent, P., Larochelle, H., Bengio, Y., Manzagol, P.: Extracting and composing robust features with denoising autoencoders. In: Proceedings Intl. Conf. Machine Learning (ICML). (2008) 1096-1103  9. Hayat, K.: Super-resolution via deep learning. CoRR abs/1706.09077 (2017) 10. Xie, J., Xu, L., Chen, E.: Image denoising and inpainting with deep neural networks.  In: Proc. Neural Inf. Processing Systems (NIPS). (2012) 350-358  11. Wang, Z., Liu, D., Yang, J., Han, W., Huang, T.S.: Deep networks for image super- resolution with sparse prior. In: Proc. Intl. Conf. Computer Vision (ICCV). (2015) 370-378  12. Dong, C., Loy, C.C., He, K., Tang, X.: Image super-resolution using deep convo- lutional networks. IEEE Trans. Pattern Anal. Machine Intelligence 38(2) (2016) 295-307  13. Shi, W., Caballero, J., Huszar, F., Totz, J., Aitken, A., Bishop, R., Rueckert, D., Wang, Z.: Real-time single image and video super-resolution using an eﬃcient sub- pixel convolutional neural network. In: Proc. Comp. Vision and Pattern Recognition (CVPR). (2016)  14. Jain, V., Seung, H.: Natural image denoising with convolutional networks. In: Proc.  Neural Inf. Processing Systems (NIPS). (2008) 769-776  15. Abrahamsson, S., Blom, H., Jans, D.: Multifocus structured illumination microscopy for fast volumetric super-resolution imaging. Biomedical Optics Express 8(9) (2017) 4135-4140  16. Brock, A., Lim, T., Ritchie, J.M., Weston, N.J.: Generative and discriminative  voxel modeling with convolutional neural networks  17. Felzenszwalb, P., Huttenlocher, D.: Pictorial structures for object detection. Intl.  Journal on Computer Vision 61 (2003)  18. Andriluka, M., Roth, S., Schiele, B.: Pictoral structures revisited: People detec- In: Proc. Computer Vision and Pattern  tion and articulated pose estimation. Recognition. (2009)  19. Lan, X., Huttenlocher, D.: Beyond trees: common-factor model for 2d human pose recovery. In: Proc. Intl. Conf. on Computer Vision. Volume 1. (2005) 470-477 20. Jiang, H.: Human pose estimation using consistent max-covering. In: Intl. Conf.  on Computer Vision. (2009)   16  M. Trumble, A. Gilbert, A. Hilton & J. Collomosse  21. Huang, P., Tejera, M., Collomosse, J., Hilton, A.: Hybrid skeletal-surface motion graphs for character animation from 4d performance capture. ACM Transactions on Graphics (ToG) (2015)  22. Loper, M., Mahmood, N., Romero, J., Pons-Moll, G., Black, M.J.: Smpl: A skinned multi-person linear model. ACM Transactions on Graphics (TOG) 34(6) (2015) 248  23. von Marcard, T., Rosenhahn, B., Black, M., Pons-Moll, G.: Sparse inertial poser: Automatic 3d human pose estimation from sparse imus. Computer Graphics Forum 36(2), Proceedings of the 38th Annual Conference of the European Association for Computer Graphics (Eurographics) (2017)  24. Malleson, C., Gilbert, A., Trumble, M., Collomosse, J., Hilton, A.: Real-time full-  body motion capture from video and imus. In: 3DV. (2017)  25. Tan, J., Budvytis, I., Cipolla, R.: Indirect deep structured learning for 3d human  body shape and pose prediction. In: BMVC. (2017)  26. Toshev, A., Szegedy, C.: Deep pose: Human pose estimation via deep neural  networks. In: Proc. CVPR. (2014)  27. Park, D., Ramanan, D.: Articulated pose estimation with tiny synthetic videos. In:  Proc. CHA-LEARN Workshop on Looking at People. (2015)  28. Cao, Z., Simon, T., Wei, S.E., Sheikh, Y.: Realtime multi-person 2d pose estimation  using part aﬃnity fields. ECCV’16 (2016)  29. Sanzari, M., Ntouskos, V., Pirri, F.: Bayesian image based 3d pose estimation. In:  European Conference on Computer Vision, Springer (2016) 566-582  30. Zhou, X., Zhu, M., Leonardos, S., Derpanis, K.G., Daniilidis, K.: Sparseness meets deepness: 3d human pose estimation from monocular video. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 4966-4975 31. Trumble, M., Gilbert, A., Hilton, A., Collomosse, J.: Deep convolutional networks for marker-less human pose estimation from multiple views. In: Proceedings of the 13th European Conference on Visual Media Production (CVMP 2016). CVMP 2016 (2016)  32. Trumble, M., Gilbert, A., Malleson, C., Hilton, A., Collomosse, J.: Total capture: 3d human pose estimation fusing video and inertial sensors. In: Proceedings of 28th British Machine Vision Conference. 1-13  33. Pavlakos, G., Zhou, X., Derpanis, K.G., Daniilidis, K.: Coarse-to-fine volumetric  prediction for single-image 3D human pose. In: CVPR. (2017)  34. Tekin, B., Katircioglu, I., Salzmann, M., Lepetit, V., Fua, P.: Structured prediction  of 3d human pose with deep neural networks. In: BMVC. (2016) 35. Zeiler, M.D.: Adadelta: an adaptive learning rate method.  arXiv preprint  arXiv:1212.5701 (2012)  36. Hochreiter, S., Schmidhuber, J.: Long short-term memory. In: Neural computation.  Volume 9., MIT Press (1997) 1735-1780  37. Sak, H., Senior, A., Beaufays, F.: Long short-term memory recurrent neural network architectures for large scale acoustic modeling. In: Fifteenth Annual Conference of the International Speech Communication Association. (2014)  38. Donahue, J., Anne Hendricks, L., Guadarrama, S., Rohrbach, M., Venugopalan, S., Saenko, K., Darrell, T.: Long-term recurrent convolutional networks for visual recognition and description. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2015) 2625-2634  39. Luo, Y., Ren, J., Wang, Z., Sun, W., Pan, J., Liu, J., Pang, J., Lin, L.: Lstm pose  machines. arXiv preprint arXiv:1712.06316 (2017)   Deep Autoencoder for Human Pose Estimation and Body Upscaling40. Ionescu, C., Papava, D., Olaru, V., Sminchisescu, C.: Human3.6m: Large scale datasets and predictive methods for 3d human sensing in natural environments. IEEE Transactions on Pattern Analysis and Machine Intelligence 36(7) (jul 2014) 1325-1339  41. Malleson, C., Volino, M., Gilbert, A., Trumble, M., Collomosse, J., Hilton, A.: Real- time full-body motion capture from video and imus. In: 2017 Fifth International Conference on 3D Vision (3DV). (2017)  42. Li, S., Zhang, W., Chan, A.B.: Maximum-margin structured learning with deep networks for 3d human pose estimation. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 2848-2856  43. Tekin, B., M´arquez-Neila, P., Salzmann, M., Fua, P.: Fusing 2d uncertainty and 3d cues for monocular body pose estimation. arXiv preprint arXiv:1611.05708 (2016) 44. Tome, D., Russell, C., Agapito, L.: Lifting from the deep: Convolutional 3d pose  estimation from a single image. arXiv preprint arXiv:1701.00295 (2017)  45. Mude Lin, Liang Lin, X.L.K.W., Cheng, H.: Recurrent 3d pose sequence machines.  In: CVPR. (2017)  46. Martinez, J., Hossain, R., Romero, J., Little, J.J.: A simple yet eﬀective baseline  for 3d human pose estimation. ICCV (2017)"}