{"1": "1. Settles, B.: Active learning literature survey. (2010) 2 2. Sener, O., Savarese, S.: Active learning for convolutional neural networks: A core-  set approach. In: ICLR. (2018) 2, 4  3. Dragon, R., Rosenhahn, B., Ostermann, J.: Multi-scale clustering of frame-to- frame correspondences for motion segmentation. In: ECCV, Springer (2012) 3 4. Ochs, P., Malik, J., Brox, T.: Segmentation of moving objects by long term video analysis. IEEE transactions on pattern analysis and machine intelligence 36(6) (2014) 1187-1200 3  5. Elhamifar, E., Vidal, R.: Sparse subspace clustering. In: CVPR, IEEE (2009) 3 6. Yang, M.Y., Ackermann, H., Lin, W., Feng, S., Rosenhahn, B.: Motion seg- arXiv preprint  mentation via global and local sparse subspace optimization. arXiv:1701.06944 (2017) 3  7. Yan, J., Pollefeys, M.: A general framework for motion segmentation: Independent, articulated, rigid, non-rigid, degenerate and non-degenerate. In: ECCV, Springer (2006) 3  8. Tsai, Y.H., Yang, M.H., Black, M.J.: Video segmentation via object ﬂow.  In:  CVPR. (2016) 3  9. Cheng, J., Tsai, Y.H., Wang, S., Yang, M.H.: Segﬂow: Joint learning for video  object segmentation and optical ﬂow. In: ICCV. (2017) 3  10. Nirkin, Y., Masi, I., Tuan, A.T., Hassner, T., Medioni, G.: On face segmentation, face swapping, and face perception. In: Automatic Face & Gesture Recognition IEEE International Conference. (2018) 3  11. Zhao, T., Nevatia, R.: Stochastic human segmentation from a static camera. In:  Motion and Video Computing, Workshop. (2002) 4  12. Zhao, T., Nevatia, R.: Bayesian human segmentation in crowded situations. In:  CVPR. (2003) 4  13. Spina, T.V., Tepper, M., Esler, A., Morellas, V., Papanikolopoulos, N., Falc˜ao, A.X., Sapiro, G.: Video human segmentation using fuzzy object models and its application to body pose estimation of toddlers for behavior studies. arXiv preprint arXiv:1305.6918 (2013) 4  14. Song, C., Huang, Y., Wang, Z., Wang, L.: 1000fps human segmentation with deep  convolutional neural networks. In: ACPR, IEEE (2015) 4  15. Guo, L.J., Cheng, T.T., Xiao, B., Zhang, R., Zhao, J.Y.: Video human segmenta- tion based on multiple-cue integration. Signal Processing: Image Communication 30 (2015) 166-177 4  16. Lu, J., Corso, J.J., et al.: Human action segmentation with hierarchical supervoxel  consistency. In: CVPR. (2015) 4  17. Tan, Y., Guo, Y., Gao, C.: Background subtraction based level sets for human seg- mentation in thermal infrared surveillance systems. Infrared Physics & Technology 61 (2013) 230-240 4  18. He, F., Guo, Y., Gao, C.: Human segmentation of infrared image for mobile robot  search. Multimedia Tools and Applications (2017) 1-14 4  19. Yarin Gal, R.I., Ghahramani, Z.: Deep bayesian active learning with image data.  In: ICML. (2017) 4  20. Colwell, S.R., Joshi, A.W.: Multi-item scale development for measuring institu- tional pressures in the context of corporate environmental action. In: IABS. (2009) 4   Leveraging Motion Priors in VideosReferences  1. Settles, B.: Active learning literature survey. (2010) 2 2. Sener, O., Savarese, S.: Active learning for convolutional neural networks: A core-  set approach. In: ICLR. (2018) 2, 4  3. Dragon, R., Rosenhahn, B., Ostermann, J.: Multi-scale clustering of frame-to- frame correspondences for motion segmentation. In: ECCV, Springer (2012) 3 4. Ochs, P., Malik, J., Brox, T.: Segmentation of moving objects by long term video analysis. IEEE transactions on pattern analysis and machine intelligence 36(6) (2014) 1187-1200 3  5. Elhamifar, E., Vidal, R.: Sparse subspace clustering. In: CVPR, IEEE (2009) 3 6. Yang, M.Y., Ackermann, H., Lin, W., Feng, S., Rosenhahn, B.: Motion seg- arXiv preprint  mentation via global and local sparse subspace optimization. arXiv:1701.06944 (2017) 3  7. Yan, J., Pollefeys, M.: A general framework for motion segmentation: Independent, articulated, rigid, non-rigid, degenerate and non-degenerate. In: ECCV, Springer (2006) 3  8. Tsai, Y.H., Yang, M.H., Black, M.J.: Video segmentation via object ﬂow.  In:  CVPR. (2016) 3  9. Cheng, J., Tsai, Y.H., Wang, S., Yang, M.H.: Segﬂow: Joint learning for video  object segmentation and optical ﬂow. In: ICCV. (2017) 3  10. Nirkin, Y., Masi, I., Tuan, A.T., Hassner, T., Medioni, G.: On face segmentation, face swapping, and face perception. In: Automatic Face & Gesture Recognition IEEE International Conference. (2018) 3  11. Zhao, T., Nevatia, R.: Stochastic human segmentation from a static camera. In:  Motion and Video Computing, Workshop. (2002) 4  12. Zhao, T., Nevatia, R.: Bayesian human segmentation in crowded situations. In:  CVPR. (2003) 4  13. Spina, T.V., Tepper, M., Esler, A., Morellas, V., Papanikolopoulos, N., Falc˜ao, A.X., Sapiro, G.: Video human segmentation using fuzzy object models and its application to body pose estimation of toddlers for behavior studies. arXiv preprint arXiv:1305.6918 (2013) 4  14. Song, C., Huang, Y., Wang, Z., Wang, L.: 1000fps human segmentation with deep  convolutional neural networks. In: ACPR, IEEE (2015) 4  15. Guo, L.J., Cheng, T.T., Xiao, B., Zhang, R., Zhao, J.Y.: Video human segmenta- tion based on multiple-cue integration. Signal Processing: Image Communication 30 (2015) 166-177 4  16. Lu, J., Corso, J.J., et al.: Human action segmentation with hierarchical supervoxel  consistency. In: CVPR. (2015) 4  17. Tan, Y., Guo, Y., Gao, C.: Background subtraction based level sets for human seg- mentation in thermal infrared surveillance systems. Infrared Physics & Technology 61 (2013) 230-240 4  18. He, F., Guo, Y., Gao, C.: Human segmentation of infrared image for mobile robot  search. Multimedia Tools and Applications (2017) 1-14 4  19. Yarin Gal, R.I., Ghahramani, Z.: Deep bayesian active learning with image data.  In: ICML. (2017) 4  20. Colwell, S.R., Joshi, A.W.: Multi-item scale development for measuring institu- tional pressures in the context of corporate environmental action. In: IABS. (2009) 4   16  Y.-T. Chen et al.  21. Brinker, K.:  Incorporating diversity in active learning with support vector ma-  chines. In: ICML. (2003) 4  22. Ducoﬀe, M., Precioso, F.: Adversarial active learning for deep networks: a margin  based approach. arXiv preprint arXiv:1802.09841 (2018) 4  23. Xianglin Li, R.G., Cheng, J.: Incorporating incremental and active learning for  scene classification. In: ICMLA. (2012) 4  24. Ehsan Elhamifar, Guillermo Sapiro, A.Y., Sastry, S.S.: A convex optimization  framework for active learning. In: ICCV. (2013) 4  25. Yang, Y., Loog, M.: A variance maximization criterion for active learning. arXiv  preprint arXiv:1706.07642 (2017) 4  26. Christoph Kading, Alexander Freytag, E.R.A.P., Denzler, J.: Large-scale active learning with approximations of expected model output changes. In: GCPR. (2016) 4  27. Kuwadekar, A., Neville, J.: Relational active learning for joint collective classifi-  cation models. In: ICML. (2011) 4  28. Sujoy Paul, J.H.B., Roy-Chowdhury, A.: Non-uniform subset selection for active  learning in structured data. In: CVPR. (2017) 4  29. Fang, M., Li, Y., Cohn, T.: Learning how to active learn: A deep reinforcement  learning approach. In: EMNLP. (2017) 4  30. Philip Bachman, A.S., Trischler, A.: Learning algorithms for active learning. In:  ICML. (2017) 4  31. Tzeng, E., Hoﬀman, J., Darrell, T., Saenko, K.: Simultaneous deep transfer across  domains and tasks. In: ICCV. (2015) 5  32. Long, M., Cao, Y., Wang, J., Jordan, M.: Learning transferable features with deep  adaptation networks. In: ICML. (2015) 5  33. Zellinger, W., Grubinger, T., Lughofer, E., Natschl¨ager, T., Saminger-Platz, S.: Central moment discrepancy (cmd) for domain-invariant representation learning. In: ICLR. (2017) 5  34. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S.,  Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS. (2014) 5  35. Liu, M.Y., Tuzel, O.: Coupled generative adversarial networks. In: NIPS. (2016)  36. Ganin, Y., Lempitsky, V.: Unsupervised domain adaptation by backpropagation.In: ICML. (2015) 5  37. Tzeng, E., Hoﬀman, J., Saenko, K., Darrell, T.: Adversarial discriminative domain  adaptation. arXiv preprint arXiv:1702.05464 (2017) 5  38. Bousmalis, K., Trigeorgis, G., Silberman, N., Krishnan, D., Erhan, D.: Domain  separation networks. In: NIPS. (2016) 5, 11, 13, 14  39. Hoﬀman, J., Wang, D., Yu, F., Darrell, T.: Fcns in the wild: Pixel-level adversarial and constraint-based adaptation. arXiv preprint arXiv:1612.02649 (2016) 5 40. Chen, Y.H., Chen, W.Y., Chen, Y.T., Tsai, B.C., Wang, Y.C.F., Sun, M.: No more discrimination: Cross city adaptation of road scene segmenters. In: ICCV. (2017) 5, 11, 13, 14  41. Zhang, Y., David, P., Gong, B.: Curriculum domain adaptation for semantic seg-  mentation of urban scenes. In: ICCV. (2017) 5  42. Sankaranarayanan, S., Balaji, Y., Jain, A., Lim, S.N., Chellappa, R.: Unsuper- vised domain adaptation for semantic segmentation with gans. arXiv preprint arXiv:1711.06969 (2017) 5  43. Ilg, E., Mayer, N., Saikia, T., Keuper, M., Dosovitskiy, A., Brox, T.: Flownet arXiv preprint  2.0: Evolution of optical ﬂow estimation with deep networks. arXiv:1612.01925 (2016) 7   Leveraging Motion Priors in Videos44. Brox, T., Malik, J.: Large displacement optical ﬂow: descriptor matching in vari-  ational motion estimation. TPAMI 33(3) (2011) 500-513 7  45. J. Weston, S.C., networks., A.B.M.: Bordes. memory networks. In: ICLR. (2015)11  46. Oh, J., Chockalingam, V., Singh, S., Lee, H.: Control of memory, active perception,  and action in minecraft. In: ICML. (2016) 7, 8  47. Fragkiadaki, K., Zhang, W., Zhang, G., Shi, J.: Two-granularity tracking: Medi- ating trajectory and detection graphs for tracking under occlusions. In: ECCV. (2012) 11  48. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomed-  ical image segmentation. In: MICCAI, Springer (2015) 11  49. Everingham, M., Eslami, S.A., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual object classes challenge: A retrospective. IJCV 111(1) (2015) 98-136 11  50. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In: ICLR. (2015)  51. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: ECCV. (2014) 11"}