{"1": "1. Achanta, R., Shaji, A., Smith, K., Lucchi, A., Fua, P., S¨usstrunk, S.: SLIC su- perpixels compared to state-of-the-art superpixel methods. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 34(11), 2274-2282 (2012) 2. Achanta, R., Susstrunk, S.: Superpixels and polygons using simple non-iterative clustering. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  3. Aljalbout, E., Golkov, V., Siddiqui, Y., Cremers, D.: Clustering with deep learning:  Taxonomy and new methods. arXiv preprint arXiv:1801.07648 (2018)  4. Arbelaez, P., Maire, M., Fowlkes, C., Malik, J.: Contour detection and hierarchical image segmentation. IEEE Transactions on Pattern Analysis and Machine Intelli- gence (TPAMI) 33(5), 898-916 (2011)  5. Van den Bergh, M., Boix, X., Roig, G., Van Gool, L.: SEEDS: Superpixels ex- tracted via energy-driven sampling. International Journal of Computer Vision (IJCV) 111(3), 298-314 (2015)  6. Van den Bergh, M., Carton, D., Van Gool, L.: Depth SEEDS: Recovering in- complete depth data using superpixels. In: IEEE Workshop on Applications of Computer Vision (WACV). pp. 363-368 (2013)  7. Butler, D.J., Wulﬀ, J., Stanley, G.B., Black, M.J.: A naturalistic open source movie for optical ﬂow evaluation. In: European Conference on Computer Vision (ECCV). pp. 611-625. Springer (2012)  8. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected CRFs. In: International Conference on Learning Representations (ICLR) (2015)  9. Comaniciu, D., Meer, P.: Mean shift: A robust approach toward feature space anal- ysis. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 24(5), 603-619 (2002)  10. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  11. Everingham, M., Eslami, S.A., Van Gool, L., Williams, C.K., Winn, J., Zisser- man, A.: The Pascal visual object classes challenge: A retrospective. International Journal of Computer Vision (IJCV) 111(1), 98-136 (2015)  12. Felzenszwalb, P.F., Huttenlocher, D.P.: Eﬃcient graph-based image segmentation.  International Journal of Computer Vision (IJCV) (2004)  13. Gadde, R., Jampani, V., Kiefel, M., Kappler, D., Gehler, P.: Superpixel convolu- tional networks using bilateral inceptions. In: European Conference on Computer Vision (ECCV) (2016)  14. Giraud, R., Ta, V.T., Papadakis, N.: SCALP: Superpixels with contour adherence using linear path. In: International Conference on Pattern Recognition (ICPR) (2016)  15. Gould, S., Rodgers, J., Cohen, D., Elidan, G., Koller, D.: Multi-class segmentation with relative location prior. International Journal of Computer Vision 80(3), 300- 316 (2008)  16. Greﬀ, K., Rasmus, A., Berglund, M., Hao, T., Valpola, H., Schmidhuber, J.: Tag- ger: Deep unsupervised perceptual grouping. In: Advances in Neural Information Processing Systems (NIPS) (2016)   Superpixel Sampling NetworksReferences  1. Achanta, R., Shaji, A., Smith, K., Lucchi, A., Fua, P., S¨usstrunk, S.: SLIC su- perpixels compared to state-of-the-art superpixel methods. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 34(11), 2274-2282 (2012) 2. Achanta, R., Susstrunk, S.: Superpixels and polygons using simple non-iterative clustering. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  3. Aljalbout, E., Golkov, V., Siddiqui, Y., Cremers, D.: Clustering with deep learning:  Taxonomy and new methods. arXiv preprint arXiv:1801.07648 (2018)  4. Arbelaez, P., Maire, M., Fowlkes, C., Malik, J.: Contour detection and hierarchical image segmentation. IEEE Transactions on Pattern Analysis and Machine Intelli- gence (TPAMI) 33(5), 898-916 (2011)  5. Van den Bergh, M., Boix, X., Roig, G., Van Gool, L.: SEEDS: Superpixels ex- tracted via energy-driven sampling. International Journal of Computer Vision (IJCV) 111(3), 298-314 (2015)  6. Van den Bergh, M., Carton, D., Van Gool, L.: Depth SEEDS: Recovering in- complete depth data using superpixels. In: IEEE Workshop on Applications of Computer Vision (WACV). pp. 363-368 (2013)  7. Butler, D.J., Wulﬀ, J., Stanley, G.B., Black, M.J.: A naturalistic open source movie for optical ﬂow evaluation. In: European Conference on Computer Vision (ECCV). pp. 611-625. Springer (2012)  8. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected CRFs. In: International Conference on Learning Representations (ICLR) (2015)  9. Comaniciu, D., Meer, P.: Mean shift: A robust approach toward feature space anal- ysis. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 24(5), 603-619 (2002)  10. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  11. Everingham, M., Eslami, S.A., Van Gool, L., Williams, C.K., Winn, J., Zisser- man, A.: The Pascal visual object classes challenge: A retrospective. International Journal of Computer Vision (IJCV) 111(1), 98-136 (2015)  12. Felzenszwalb, P.F., Huttenlocher, D.P.: Eﬃcient graph-based image segmentation.  International Journal of Computer Vision (IJCV) (2004)  13. Gadde, R., Jampani, V., Kiefel, M., Kappler, D., Gehler, P.: Superpixel convolu- tional networks using bilateral inceptions. In: European Conference on Computer Vision (ECCV) (2016)  14. Giraud, R., Ta, V.T., Papadakis, N.: SCALP: Superpixels with contour adherence using linear path. In: International Conference on Pattern Recognition (ICPR) (2016)  15. Gould, S., Rodgers, J., Cohen, D., Elidan, G., Koller, D.: Multi-class segmentation with relative location prior. International Journal of Computer Vision 80(3), 300- 316 (2008)  16. Greﬀ, K., Rasmus, A., Berglund, M., Hao, T., Valpola, H., Schmidhuber, J.: Tag- ger: Deep unsupervised perceptual grouping. In: Advances in Neural Information Processing Systems (NIPS) (2016)   16  Jampani et al.  17. Greﬀ, K., van Steenkiste, S., Schmidhuber, J.: Neural expectation maximization.  In: Advances in Neural Information Processing Systems (NIPS) (2017)  18. He, S., Lau, R.W., Liu, W., Huang, Z., Yang, Q.: SuperCNN: A superpixelwise convolutional neural network for salient object detection. International Journal of Computer Vision (IJCV) 115(3), 330-344 (2015)  19. Hershey, J.R., Chen, Z., Le Roux, J., Watanabe, S.: Deep clustering: Discriminative embeddings for segmentation and separation. In: IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP) (2016)  20. Hu, Y., Song, R., Li, Y., Rao, P., Wang, Y.: Highly accurate optical ﬂow estimation  on superpixel tree. Image and Vision Computing 52, 167-177 (2016)  21. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International Conference on Machine Learning (ICML). pp. 448-456 (2015)  22. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM Multimedia (MM). pp. 675-678 (2014)  23. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. In: Interna-  tional Conference on Learning Representations (ICLR) (2015)  24. Levinshtein, A., Stere, A., Kutulakos, K.N., Fleet, D.J., Dickinson, S.J., Siddiqi, K.: Turbopixels: Fast superpixels using geometric ﬂows. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) 31(12), 2290-2297 (2009) 25. Li, Z., Chen, J.: Superpixel segmentation using linear spectral clustering. In: IEEE  Conference on Computer Vision and Pattern Recognition (CVPR) (2015)  26. Liu, M.Y., Tuzel, O., Ramalingam, S., Chellappa, R.: Entropy rate superpixel segmentation. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2011)  27. Liu, Y.J., Yu, C.C., Yu, M.J., He, Y.: Manifold slic: A fast method to compute content-sensitive superpixels. In: IEEE Conference on Computer Vision and Pat- tern Recognition (CVPR) (2016)  28. Lu, J., Yang, H., Min, D., Do, M.N.: Patch match filter: Eﬃcient edge-aware fil- tering meets randomized search for fast correspondence field estimation. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 1854-1861 (2013)  29. Machairas, V., Faessel, M., C´ardenas-Pe˜na, D., Chabardes, T., Walter, T., De- cenci`ere, E.: Waterpixels. IEEE Transactions on Image Processing (TIP) 24(11), 3707-3716 (2015)  30. Perazzi, F., Kr¨ahenb¨uhl, P., Pritch, Y., Hornung, A.: Saliency filters: Contrast based filtering for salient region detection. In: IEEE Conference on Computer Vi- sion and Pattern Recognition (CVPR). pp. 733-740 (2012)  31. Rasmus, A., Berglund, M., Honkala, M., Valpola, H., Raiko, T.: Semi-supervised learning with ladder networks. In: Advances in Neural Information Processing Sys- tems (NIPS) (2015)  32. Ren, C.Y., Prisacariu, V.A., Reid, I.D.: gSLICr: SLIC superpixels at over 250hz.  arXiv preprint arXiv:1509.04232 (2015)  33. Ren, X., Malik, J.: Learning a classification model for segmentation. In: IEEE  Conference on Computer Vision and Pattern Recognition (CVPR) (2003)  34. Sharma, A., Tuzel, O., Liu, M.Y.: Recursive context propagation network for se- mantic scene labeling. In: Advances in Neural Information Processing Systems (NIPS) (2014)   Superpixel Sampling Networks35. Shu, G., Dehghan, A., Shah, M.: Improving an object detector and extracting regions using superpixels. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3721-3727 (2013)  36. Stutz, D., Hermans, A., Leibe, B.: Superpixels: An evaluation of the state-of-the-  art. Computer Vision and Image Understanding 166(C), 1-27 (2018)  37. Sun, D., Liu, C., Pfister, H.: Local layering for joint motion estimation and occlu- sion detection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1098-1105 (2014)  38. Tu, W.C., Liu, M.Y., Jampani, V., Sun, D., Chien, S.Y., Yang, M.H., Kautz, J.: Learning superpixels with segmentation-aware aﬃnity loss. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2018)  39. Veksler, O., Boykov, Y., Mehrani, P.: Superpixels and supervoxels in an energy optimization framework. In: European Conference on Computer Vision (ECCV) (2010)  40. Xie, J., Girshick, R., Farhadi, A.: Unsupervised deep embedding for clustering  analysis. In: International conference on machine learning (ICML) (2016)  41. Yamaguchi, K., McAllester, D., Urtasun, R.: Robust monocular epipolar ﬂow estimation. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 1862-1869 (2013)  42. Yan, J., Yu, Y., Zhu, X., Lei, Z., Li, S.Z.: Object detection by labeling superpixels. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 5107-5116 (2015)  43. Yang, C., Zhang, L., Lu, H., Ruan, X., Yang, M.H.: Saliency detection via graph- based manifold ranking. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2013)  44. Yang, F., Lu, H., Yang, M.H.: Robust superpixel tracking. IEEE Transactions on  Image Processing 23(4), 1639-1651 (2014)  45. Yao, J., Boben, M., Fidler, S., Urtasun, R.: Real-time coarse-to-fine topologically preserving segmentation. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2015)  46. Zhu, W., Liang, S., Wei, Y., Sun, J.: Saliency optimization from robust back- ground detection. In: IEEE Conference on Computer Vision and Pattern Recogni- tion (CVPR) (2014)"}