{"1": "TPAMI (2011)  1. Brown, M., Hua, G., Winder, S.: Discriminative learning of local image descriptors.  2. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  3. Chen, L.C., Papandreou, G., Schroﬀ, F., Adam, H.: Rethinking atrous convolution  for semantic image segmentation. arXiv preprint arXiv:1706.05587 (2017)  4. Dai, J., et al.: Deformable convolutional networks. In: ICCV (2017) 5. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal  visual object classes (voc) challenge. IJCV (2010)  6. Fu, C.Y., et al.: Dssd: Deconvolutional single shot detector. arXiv preprint arX-  iv:1701.06659 (2017)  7. Girshick, R.: Fast r-cnn. In: ICCV (2015) 8. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accu-  rate object detection and semantic segmentation. In: CVPR (2014)  9. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: ICCV (2017)  10. He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpassing human-  level performance on imagenet classification. In: ICCV (2015)  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  12. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: Mobilenets: Eﬃcient convolutional neural networks for mobile vision applications. arXiv preprint arXiv:1704.04861 (2017)  13. Hu, P., Ramanan, D.: Finding tiny faces. In: CVPR (2017) 14. Huang, D., Zhu, C., Wang, Y., Chen, L.: Hsog: a novel local image descriptor based on histograms of the second-order gradients. IEEE Transactions on Image Processing 23(11), 4680-4695 (2014)  15. Huang, J., et al.: Speed/accuracy trade-oﬀs for modern convolutional object de-  tectors. In: CVPR (2017)  16. Kim, K.H., Hong, S., Roh, B., Cheon, Y., Park, M.: Pvanet: Deep but lightweight neural networks for real-time object detection. arXiv preprint arXiv:1608.08021 (2016)  17. Li, Y., He, K., Sun, J., et al.: R-fcn: Object detection via region-based fully con-  18. Li, Y., Qi, H., Dai, J., Ji, X., Wei, Y.: Fully convolutional instance-aware semantic  volutional networks. In: NIPS (2016)  segmentation. In: CVPR (2017)  19. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature  pyramid networks for object detection. In: CVPR (2017)  20. Lin, T.Y., Goyal, P., Girshick, R., He, K., Doll´ar, P.: Focal loss for dense object  detection. In: ICCV (2017)  21. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: ECCV (2014) 22. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  Single shot multibox detector. In: ECCV (2016)  23. Luo, W., et al.: Understanding the eﬀective receptive field in deep convolutional  neural networks. In: NIPS (2016)  24. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified,  real-time object detection. In: CVPR (2016)   RFB Net for Accurate and Fast Object DetectionReferences  TPAMI (2011)  1. Brown, M., Hua, G., Winder, S.: Discriminative learning of local image descriptors.  2. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Se- mantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  3. Chen, L.C., Papandreou, G., Schroﬀ, F., Adam, H.: Rethinking atrous convolution  for semantic image segmentation. arXiv preprint arXiv:1706.05587 (2017)  4. Dai, J., et al.: Deformable convolutional networks. In: ICCV (2017) 5. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal  visual object classes (voc) challenge. IJCV (2010)  6. Fu, C.Y., et al.: Dssd: Deconvolutional single shot detector. arXiv preprint arX-  iv:1701.06659 (2017)  7. Girshick, R.: Fast r-cnn. In: ICCV (2015) 8. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accu-  rate object detection and semantic segmentation. In: CVPR (2014)  9. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: ICCV (2017)  10. He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpassing human-  level performance on imagenet classification. In: ICCV (2015)  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  12. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: Mobilenets: Eﬃcient convolutional neural networks for mobile vision applications. arXiv preprint arXiv:1704.04861 (2017)  13. Hu, P., Ramanan, D.: Finding tiny faces. In: CVPR (2017) 14. Huang, D., Zhu, C., Wang, Y., Chen, L.: Hsog: a novel local image descriptor based on histograms of the second-order gradients. IEEE Transactions on Image Processing 23(11), 4680-4695 (2014)  15. Huang, J., et al.: Speed/accuracy trade-oﬀs for modern convolutional object de-  tectors. In: CVPR (2017)  16. Kim, K.H., Hong, S., Roh, B., Cheon, Y., Park, M.: Pvanet: Deep but lightweight neural networks for real-time object detection. arXiv preprint arXiv:1608.08021 (2016)  17. Li, Y., He, K., Sun, J., et al.: R-fcn: Object detection via region-based fully con-  18. Li, Y., Qi, H., Dai, J., Ji, X., Wei, Y.: Fully convolutional instance-aware semantic  volutional networks. In: NIPS (2016)  segmentation. In: CVPR (2017)  19. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature  pyramid networks for object detection. In: CVPR (2017)  20. Lin, T.Y., Goyal, P., Girshick, R., He, K., Doll´ar, P.: Focal loss for dense object  detection. In: ICCV (2017)  21. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: ECCV (2014) 22. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  Single shot multibox detector. In: ECCV (2016)  23. Luo, W., et al.: Understanding the eﬀective receptive field in deep convolutional  neural networks. In: NIPS (2016)  24. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified,  real-time object detection. In: CVPR (2016)   16  Songtao Liu, Di Huang, and Yunhong Wang  25. Redmon, J., Farhadi, A.: Yolo9000: Better, faster, stronger. In: CVPR (2017) 26. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de-  tection with region proposal networks. In: NIPS (2015)  27. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., et al.: Imagenet large scale visual recog- nition challenge. IJCV (2015)  28. Shen, Z., Liu, Z., Li, J., Jiang, Y.G., Chen, Y., Xue, X.: Dsod: Learning deeply  supervised object detectors from scratch. In: ICCV (2017)  29. Simonyan, K., Vedaldi, A., Zisserman, A.: Learning local feature descriptors using  30. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  convex optimisation. TPAMI (2014)  image recognition. In: NIPS (2014)  31. Szegedy, C., Ioﬀe, S., Vanhoucke, V., Alemi, A.A.: Inception-v4, inception-resnet  and the impact of residual connections on learning. In: AAAI (2017)  32. Szegedy, C., Vanhoucke, V., Ioﬀe, S., Shlens, J., Wojna, Z.: Rethinking the incep-  tion architecture for computer vision. In: CVPR (2016)  33. Szegedy, C., et al.: Going deeper with convolutions. In: CVPR (2015) 34. Tola, E., Lepetit, V., Fua, P.: A fast local descriptor for dense matching. In: CVPR  (2008)  35. Uijlings, J.R., Van De Sande, K.E., Gevers, T., Smeulders, A.W.: Selective search  for object recognition. IJCV (2013)  36. Wandell, B.A., Winawer, J.: Computational neuroimaging and population recep-  tive fields. Trends in Cognitive Sciences (2015)  37. Weng, D., Wang, Y., Gong, M., Tao, D., Wei, H., Huang, D.: Derf: distinctive eﬃcient robust features from the biological modeling of the p ganglion cells. IEEE Transactions on Image Processing 24(8), 2287-2302 (2015)  38. Winder, S.A., Brown, M.: Learning local image descriptors. In: CVPR (2007) 39. Zhang, X., Zhou, X., Lin, M., Sun, J.: Shuﬄenet: An extremely eﬃcient convolu- tional neural network for mobile devices. arXiv preprint arXiv:1707.01083 (2017)"}