{"1": "1. Absil, P.A., Mahony, R., Sepulchre, R.: Riemannian geometry of grassmann man- ifolds with a view on algorithmic computation. Acta Applicandae Mathematica 80(2), 199-220 (2004)  2. Absil, P.A., Mahony, R., Sepulchre, R.: Optimization algorithms on matrix mani-  folds. Princeton University Press (2009)  3. Adams, H., Emerson, T., Kirby, M., Neville, R., Peterson, C., Shipman, P., Chep- ushtanova, S., Hanson, E., Motta, F., Ziegelmeier, L.: Persistence images: A stable vector representation of persistent homology. Journal of Machine Learning Re- search 18(8), 1-35 (2017)  4. Ali, S., Basharat, A., Shah, M.: Chaotic invariants for human action recognition. In: IEEE 11th International Conference on Computer Vision (ICCV). pp. 1-8 (2007) 5. Anirudh, R., Venkataraman, V., Natesan Ramamurthy, K., Turaga, P.: A rieman- nian framework for statistical analysis of topological persistence diagrams. In: The IEEE Conference on Computer Vision and Pattern Recognition Workshops. pp. 68-76 (2016)  6. Aubry, M., Schlickewei, U., Cremers, D.: The wave kernel signature: A quantum mechanical approach to shape analysis. In: IEEE International Conference on Com- puter Vision Workshops (ICCV Workshops). pp. 1626-1633 (2011)  7. Bagherinia, H., Manduchi, R.: A theory of color barcodes. In: IEEE Interna- tional Conference on Computer Vision Workshops (ICCV Workshops). pp. 806-813 (2011)  8. Basri, R., Hassner, T., Zelnik-Manor, L.: Approximate nearest subspace search. IEEE Transactions on Pattern Analysis and Machine Intelligence 33(2), 266-278 (2011)  9. Begelfor, E., Werman, M.: Aﬃne invariance revisited. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). vol. 2, pp. 2087-2094. IEEE (2006)  10. Bendich, P., Marron, J.S., Miller, E., Pieloch, A., Skwerer, S.: Persistent homology analysis of brain artery trees. The Annals of Applied Statistics 10(1), 198-218 (2016)  11. Bertsekas, D.P.: A new algorithm for the assignment problem. Mathematical Pro-  gramming 21(1), 152-171 (1981)  12. Bubenik, P.: Statistical topological data analysis using persistence landscapes. The  Journal of Machine Learning Research 16(1), 77-102 (2015)  13. Chikuse, Y.: Statistics on special manifolds, vol. 174. Springer Science & Business  Media (2012)  14. Chintakunta, H., Gentimis, T., Gonzalez-Diaz, R., Jimenez, M.J., Krim, H.: An entropy-based persistence barcode. Pattern Recognition 48(2), 391-401 (2015) 15. Chung, M.K., Bubenik, P., Kim, P.T.: Persistence diagrams of cortical surface data. In: International Conference on Information Processing in Medical Imaging. pp. 386-397. Springer (2009)   Perturbation Robust Representations of Topological Persistence DiagramsThis work was supported in part by ARO grant number W911NF-17-1-0293 and NSF CAREER award 1452163.  Acknowledgments  References  1. Absil, P.A., Mahony, R., Sepulchre, R.: Riemannian geometry of grassmann man- ifolds with a view on algorithmic computation. Acta Applicandae Mathematica 80(2), 199-220 (2004)  2. Absil, P.A., Mahony, R., Sepulchre, R.: Optimization algorithms on matrix mani-  folds. Princeton University Press (2009)  3. Adams, H., Emerson, T., Kirby, M., Neville, R., Peterson, C., Shipman, P., Chep- ushtanova, S., Hanson, E., Motta, F., Ziegelmeier, L.: Persistence images: A stable vector representation of persistent homology. Journal of Machine Learning Re- search 18(8), 1-35 (2017)  4. Ali, S., Basharat, A., Shah, M.: Chaotic invariants for human action recognition. In: IEEE 11th International Conference on Computer Vision (ICCV). pp. 1-8 (2007) 5. Anirudh, R., Venkataraman, V., Natesan Ramamurthy, K., Turaga, P.: A rieman- nian framework for statistical analysis of topological persistence diagrams. In: The IEEE Conference on Computer Vision and Pattern Recognition Workshops. pp. 68-76 (2016)  6. Aubry, M., Schlickewei, U., Cremers, D.: The wave kernel signature: A quantum mechanical approach to shape analysis. In: IEEE International Conference on Com- puter Vision Workshops (ICCV Workshops). pp. 1626-1633 (2011)  7. Bagherinia, H., Manduchi, R.: A theory of color barcodes. In: IEEE Interna- tional Conference on Computer Vision Workshops (ICCV Workshops). pp. 806-813 (2011)  8. Basri, R., Hassner, T., Zelnik-Manor, L.: Approximate nearest subspace search. IEEE Transactions on Pattern Analysis and Machine Intelligence 33(2), 266-278 (2011)  9. Begelfor, E., Werman, M.: Aﬃne invariance revisited. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). vol. 2, pp. 2087-2094. IEEE (2006)  10. Bendich, P., Marron, J.S., Miller, E., Pieloch, A., Skwerer, S.: Persistent homology analysis of brain artery trees. The Annals of Applied Statistics 10(1), 198-218 (2016)  11. Bertsekas, D.P.: A new algorithm for the assignment problem. Mathematical Pro-  gramming 21(1), 152-171 (1981)  12. Bubenik, P.: Statistical topological data analysis using persistence landscapes. The  Journal of Machine Learning Research 16(1), 77-102 (2015)  13. Chikuse, Y.: Statistics on special manifolds, vol. 174. Springer Science & Business  Media (2012)  14. Chintakunta, H., Gentimis, T., Gonzalez-Diaz, R., Jimenez, M.J., Krim, H.: An entropy-based persistence barcode. Pattern Recognition 48(2), 391-401 (2015) 15. Chung, M.K., Bubenik, P., Kim, P.T.: Persistence diagrams of cortical surface data. In: International Conference on Information Processing in Medical Imaging. pp. 386-397. Springer (2009)   16  A. Som et al.  16. Cohen-Steiner, D., Edelsbrunner, H., Harer, J.: Stability of persistence diagrams.  Discrete & Computational Geometry 37(1), 103-120 (2007)  17. Cohen-Steiner, D., Edelsbrunner, H., Harer, J., Mileyko, Y.: Lipschitz functions have Lp-stable persistence. Foundations of Computational Mathematics 10(2), 127-139 (2010)  18. Cormen, T.H., Leiserson, C.E., Rivest, R.L., Stein, C.: Introduction to Algorithms,  2nd edition. The MIT Press (2001)  19. Dabaghian, Y., M´emoli, F., Frank, L., Carlsson, G.: A topological paradigm for hippocampal spatial map formation using persistent homology. PLoS Computa- tional Biology 8(8), 1-14 (2012)  20. De Silva, V., Morozov, D., Vejdemo-Johansson, M.: Dualities in persistent (co)  homology. Inverse Problems 27(12), 124003 (2011)  21. Dey, T.K., Mandal, S., Varcho, W.:  Improved Image Classification using Topological Persistence. In: Hullin, M., Klein, R., Schultz, T., Yao, A. (eds.) Vision, Modeling & Visualization. The Eurographics Association (2017). https://doi.org/10.2312/vmv.20171272  22. Draper, B., Kirby, M., Marks, J., Marrinan, T., Peterson, C.: A ﬂag representation for finite collections of subspaces of mixed dimensions. Linear Algebra and its Applications 451, 15-32 (2014)  23. Edelman, A., Arias, T.A., Smith, S.T.: The geometry of algorithms with orthog- onality constraints. SIAM Journal on Matrix Analysis and Applications 20(2), 303-353 (1998)  24. Edelsbrunner, H., Harer, J.: Computational topology: an introduction. American  Mathematical Society (2010)  25. Edelsbrunner, H., Letscher, D., Zomorodian, A.: Topological persistence and sim-  plification. Discrete & Computational Geometry 28(4), 511-533 (2002)  26. Emrani, S., Gentimis, T., Krim, H.: Persistent homology of delay em- beddings IEEE Signal Pro- application to wheeze detection. cess. Lett. 21(4), 459-463 (2014). https://doi.org/10.1109/LSP.2014.2305700, https://doi.org/10.1109/LSP.2014.2305700  and its  framework for 27. Emrani, S., Saponas, T.S., Morris, D., Krim, H.: A novel pulse pressure wave analysis using persistent homology. IEEE Signal Pro- cess. Lett. 22(11), 1879-1883 (2015). https://doi.org/10.1109/LSP.2015.2441068, https://doi.org/10.1109/LSP.2015.2441068  28. Gopalan, R., Taheri, S., Turaga, P., Chellappa, R.: A blur-robust descriptor with applications to face recognition. IEEE Transactions on Pattern Analysis and Ma- chine Intelligence 34(6), 1220-1226 (2012)  29. Hamm, J., Lee, D.D.: Grassmann discriminant analysis: a unifying view on subspace-based learning. In: Proceedings of the International Conference on Ma- chine Learning (ICML). pp. 376-383. ACM (2008)  30. Harandi, M.T., Salzmann, M., Jayasumana, S., Hartley, R., Li, H.: Expanding the family of grassmannian kernels: An embedding perspective. In: European Confer- ence on Computer Vision (ECCV). pp. 408-423. Springer (2014)  31. Heath, K., Gelfand, N., Ovsjanikov, M., Aanjaneya, M., Guibas, L.J.: Image webs: Computing and exploiting connectivity in image collections. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2010)  32. Hofer, C., Kwitt, R., Niethammer, M., Uhl, A.: Deep learning with topological  signatures. arXiv preprint arXiv:1707.04041 (2017)  33. Ji-guang, S.: Perturbation of angles between linear subspaces. Journal of Compu-  tational Mathematics pp. 58-61 (1987)   Perturbation Robust Representations of Topological Persistence Diagrams34. Junejo, I.N., Dexter, E., Laptev, I., Perez, P.: View-independent action recogni- tion from temporal self-similarities. IEEE transactions on Pattern Analysis and Machine Intelligence 33(1), 172-185 (2011)  35. Kerber, M., Morozov, D., Nigmetov, A.: Geometry helps to compare persistence  diagrams. Journal of Experimental Algorithmics (JEA) 22(1), 1-4 (2017)  36. Kokkinos, I., Bronstein, M., Yuille, A.: Dense scale invariant descriptors for images  and surfaces. Ph.D. thesis, INRIA (2012)  37. Krim, H., Gentimis, T., Chintakunta, H.: Discovering the whole by the coarse: A topological paradigm for data IEEE Signal Pro- cess. Mag. 33(2), 95-104 (2016). https://doi.org/10.1109/MSP.2015.2510703, https://doi.org/10.1109/MSP.2015.2510703  analysis.  38. Kusano, G., Hiraoka, Y., Fukumizu, K.: Persistence weighted gaussian kernel for topological data analysis. In: International Conference on Machine Learning (ICML). pp. 2004-2013 (2016)  39. Li, C., Shi, Z., Liu, Y., Xu, B.: Grassmann manifold based shape matching and retrieval under partial occlusions. In: International Symposium on Optoelectronic Technology and Application: Image Processing and Pattern Recognition (2014) 40. Li, C., Ovsjanikov, M., Chazal, F.: Persistence-based structural recognition. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 1995- 2002 (2014)  41. Lian, Z., Godil, A., Fabry, T., Furuya, T., Hermans, J., Ohbuchi, R., Shu, C., Smeets, D., Suetens, P., Vandermeulen, D., et al.: Shrec’10 track: Non-rigid 3d shape retrieval. Eurographics Workshop on 3D Object Retrieval (3DOR) 10, 101- 108 (2010)  42. Liu, X., Srivastava, A., Gallivan, K.: Optimal linear representations of images for object recognition. In: IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR) (2003)  43. Luo, D., Huang, H.: Video motion segmentation using new adaptive manifold de- noising model. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2014)  44. Masci, J., Boscaini, D., Bronstein, M., Vandergheynst, P.: Geodesic convolutional neural networks on riemannian manifolds. In: IEEE International Conference on Computer Vision Workshops (ICCVW). pp. 37-45 (2015)  45. Mileyko, Y., Mukherjee, S., Harer, J.: Probability measures on the space of persis-  tence diagrams. Inverse Problems 27(12) (2011)  46. Monti, F., Boscaini, D., Masci, J., Rodol`a, E., Svoboda, J., Bronstein, M.M.: Ge- ometric deep learning on graphs and manifolds using mixture model cnns. IEEE International Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  47. Osada, R., Funkhouser, T., Chazelle, B., Dobkin, D.: Shape distributions. ACM  Transactions on Graphics (TOG) 21(4), 807-832 (2002)  48. Pachauri, D., Hinrichs, C., Chung, M.K., Johnson, S.C., Singh, V.: Topology-based kernels with application to inference problems in alzheimer’s disease. IEEE trans- actions on Medical Imaging 30(10), 1760-1770 (2011)  49. Perea, J.A., Harer, J.: Sliding windows and persistence: An application of topologi- cal methods to signal analysis. Foundations of Computational Mathematics 15(3), 799-838 (2015)  50. Rahmani, H., Mian, A., Shah, M.: Learning a deep model for human action recog- nition from novel viewpoints. IEEE Transactions on Pattern Analysis and Machine Intelligence (2017)   18  A. Som et al.  51. Reininghaus, J., Huber, S., Bauer, U., Kwitt, R.: A stable multi-scale kernel for topological machine learning. In: IEEE Conference on Computer Vision and Pat- tern Recognition (CVPR) (2015)  52. Rouse, D., Watkins, A., Porter, D., Harer, J., Bendich, P., Strawn, N., Munch, E., DeSena, J., Clarke, J., Gilbert, J., et al.: Feature-aided multiple hypothesis tracking using topological and statistical behavior classifiers. In: SPIE Defense+Security (2015)  53. Scarselli, F., Gori, M., Tsoi, A.C., Hagenbuchner, M., Monfardini, G.: The graph neural network model. IEEE Transactions on Neural Networks 20(1), 61-80 (2009) 54. Seversky, L.M., Davis, S., Berger, M.: On time-series topological data analysis: New data and opportunities. In: DiﬀCVML 2016, held in conjunction with IEEE Confer- ence on Computer Vision and Pattern Recognition Workshops, CVPR Workshops 2016, Las Vegas, NV, USA, June 26 - July 1, 2016. pp. 1014-1022 (2016)  55. Sharafuddin, E., Jiang, N., Jin, Y., Zhang, Z.L.: Know your enemy, know yourself: Block-level network behavior profiling and tracking. In: IEEE Global Telecommu- nications Conference (GLOBECOM 2010). pp. 1-6 (2010)  56. da Silva, N.P., Costeira, J.P.: The normalized subspace inclusion: Robust cluster- ing of motion subspaces. In: IEEE International Conference on Computer Vision (ICCV). pp. 1444-1450. IEEE (2009)  57. Singh, G., Memoli, F., Ishkhanov, T., Sapiro, G., Carlsson, G., Ringach, D.L.: Topological analysis of population activity in visual cortex. Journal of Vision (2008) 58. Som, A., Krishnamurthi, N., Venkataraman, V., Ramamurthy, K.N., Turaga, P.: Multiscale evolution of attractor-shape descriptors for assessing parkinson’s dis- ease severity. In: IEEE Global Conference on Signal and Information Processing (GlobalSIP) (2017)  59. Som, A., Krishnamurthi, N., Venkataraman, V., Turaga, P.: Attractor-shape de- scriptors for balance impairment assessment in parkinson’s disease. In: IEEE Con- ference on Engineering in Medicine and Biology Society (EMBC). pp. 3096-3100 (2016)  60. Sun, J., Ovsjanikov, M., Guibas, L.: A concise and provably informative multi- scale signature based on heat diﬀusion. In: Computer Graphics Forum. vol. 28, pp. 1383-1392. Wiley Online Library (2009)  61. Sun, X., Wang, L., Feng, J.: Further results on the subspace distance. Pattern  Recognition 40(1), 328-329 (2007)  62. Takens, F.: Detecting strange attractors in turbulence. In: Dynamical Systems and  Turbulence, vol. 898, pp. 366-381 (1981)  63. Tralie, C.J., Perea, J.A.: (quasi) periodicity quantification in video data, using  topology. SIAM Journal on Imaging Sciences 11(2), 1049-1077 (2018)  64. Turaga, P., Veeraraghavan, A., Srivastava, A., Chellappa, R.: Statistical computa- tions on grassmann and stiefel manifolds for image and video-based recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence 33(11), 2273- 2286 (2011)  65. Turner, K., Mileyko, Y., Mukherjee, S., Harer, J.: Fr´echet means for distributions of persistence diagrams. Discrete & Computational Geometry 52(1), 44-70 (2014) 66. Venkataraman, V., Ramamurthy, K.N., Turaga, P.: Persistent homology of attrac- tors for action recognition. In: IEEE International Conference on Image Processing (ICIP). pp. 4150-4154. IEEE (2016)  67. Wang, L., Wang, X., Feng, J.: Subspace distance analysis with application to adap- tive bayesian algorithm for face recognition. Pattern Recognition 39(3), 456-464 (2006)   Perturbation Robust Representations of Topological Persistence Diagrams68. Weinland, D., Boyer, E., Ronfard, R.: Action recognition from arbitrary views using 3d exemplars. In: IEEE International Conference on Computer Vision (ICCV). pp. 1-7. IEEE (2007)  69. Wong, Y.C.: Diﬀerential geometry of grassmann manifolds. Proceedings of the  National Academy of Sciences 57(3), 589-594 (1967)  70. Yan, J., Pollefeys, M.: A general framework for motion segmentation: Indepen- dent, articulated, rigid, non-rigid, degenerate and non-degenerate. In: European Conference on Computer Vision (ECCV). pp. 94-106. Springer (2006)  71. Ye, K., Lim, L.H.: Schubert varieties and distances between subspaces of diﬀerent dimensions. SIAM Journal on Matrix Analysis and Applications 37(3), 1176-1197 (2016)  72. Yi, L., Su, H., Guo, X., Guibas, L.: Syncspeccnn: Synchronized spectral cnn for 3d shape segmentation. IEEE International Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  73. Zomorodian, A.: Fast construction of the vietoris-rips complex. Computers &  Graphics 34(3), 263-271 (2010)"}