{"1": "1. Edwards, H., Storkey, A.J.: Censoring Representations with an Adversary.  In:  International Conference in Learning Representations. ICLR2016 (2016)  2. Louizos, C., Swersky, K., Li, Y., Welling, M., Zemel, R.S.: The Variational Fair Autoencoder. In: International Conference in Learning Representations. ICLR2016 (2016)  3. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet Classification with Deep Con- volutional Neural Networks. In: Proceedings of the 25th International Conference on Neural Information Processing Systems - Volume 1. NIPS’12 (2012) 1097-1105 4. Goodfellow, I.J., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, In: NIPS. (2014)  S., Courville, A.C., Bengio, Y.: Generative Adversarial Nets. 2672-2680  5. Radford, A., Metz, L., Chintala, S.: Unsupervised Representation Learning with Deep Convolutional Generative Adversarial Networks. In: International Conference in Learning Representations. ICLR2016 (2016)  6. Xiao, T., Hong, J., Ma, J.: DNA-GAN: Learning Disentangled Representations from  Multi-Attribute Images. arXiv preprint arXiv:1711.05415 (2017)  7. Mathieu, M., Zhao, J.J., Sprechmann, P., Ramesh, A., LeCun, Y.: Disentangling Factors of Variation in Deep Representation using Adversarial Training. In: NIPS. (2016) 5041-5049  8. Szab´o, A., Hu, Q., Portenier, T., Zwicker, M., Favaro, P.: Challenges in Disentan- gling Independent Factors of Variation. arXiv preprint arXiv:1711.02245 (2017) In: International  9. Kingma, D.P., Welling, M.: Auto-Encoding Variational Bayes.  Conference in Learning Representations. ICLR2014 (2014)  10. He, D., Xia, Y., Qin, T., Wang, L., Yu, N., Liu, T., Ma, W.: Dual Learning for Machine Translation. In: Advances in Neural Information Processing Systems 29. (2016) 820-828  11. Zhou, T., Kr¨ahenb¨uhl, P., Aubry, M., Huang, Q., Efros, A.A.: Learning Dense In: CVPR, IEEE Computer  Correspondence via 3D-Guided Cycle Consistency. Society (2016) 117-126  12. Godard, C., Mac Aodha, O., Brostow, G.J.: Unsupervised Monocular Depth Esti-  mation with Left-Right Consistency. In: CVPR. (2017)  13. Zhu, J., Park, T., Isola, P., Efros, A.A.: Unpaired Image-to-Image Translation Using Cycle-Consistent Adversarial networks. In: ICCV, IEEE Computer Society (2017) 2242-2251  14. Hoﬀman, J., Tzeng, E., Park, T., Zhu, J., Isola, P., Saenko, K., Efros, A.A., Darrell, T.: CyCADA: Cycle-Consistent Adversarial Domain Adaptation. arXiv preprint arXiv:1711.03213 (2017)  15. Ghahramani, Z.: Factorial Learning and the EM Algorithm. In: Proceedings of the 7th International Conference on Neural Information Processing Systems. NIPS’94, Cambridge, MA, USA, MIT Press (1994) 617-624  16. Tenenbaum, J.B., Freeman, W.T.: Separating Style and Content with Bilinear  Models. Neural Computation 12(6) (2000) 1247-1283  17. Desjardins, G., Courville, A.C., Bengio, Y.: Disentangling Factors of Variation via  Generative Entangling. arXiv preprint arXiv:1210.5474 (2012)  18. Reed, S.E., Sohn, K., Zhang, Y., Lee, H.: Learning to Disentangle Factors of Variation with Manifold Interaction. In: ICML. Volume 32 of JMLR Workshop and Conference Proceedings., JMLR.org (2014) 1431-1439   Disentangling Factors of Variation with Cycle-Consistent VAEsReferences  1. Edwards, H., Storkey, A.J.: Censoring Representations with an Adversary.  In:  International Conference in Learning Representations. ICLR2016 (2016)  2. Louizos, C., Swersky, K., Li, Y., Welling, M., Zemel, R.S.: The Variational Fair Autoencoder. In: International Conference in Learning Representations. ICLR2016 (2016)  3. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet Classification with Deep Con- volutional Neural Networks. In: Proceedings of the 25th International Conference on Neural Information Processing Systems - Volume 1. NIPS’12 (2012) 1097-1105 4. Goodfellow, I.J., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, In: NIPS. (2014)  S., Courville, A.C., Bengio, Y.: Generative Adversarial Nets. 2672-2680  5. Radford, A., Metz, L., Chintala, S.: Unsupervised Representation Learning with Deep Convolutional Generative Adversarial Networks. In: International Conference in Learning Representations. ICLR2016 (2016)  6. Xiao, T., Hong, J., Ma, J.: DNA-GAN: Learning Disentangled Representations from  Multi-Attribute Images. arXiv preprint arXiv:1711.05415 (2017)  7. Mathieu, M., Zhao, J.J., Sprechmann, P., Ramesh, A., LeCun, Y.: Disentangling Factors of Variation in Deep Representation using Adversarial Training. In: NIPS. (2016) 5041-5049  8. Szab´o, A., Hu, Q., Portenier, T., Zwicker, M., Favaro, P.: Challenges in Disentan- gling Independent Factors of Variation. arXiv preprint arXiv:1711.02245 (2017) In: International  9. Kingma, D.P., Welling, M.: Auto-Encoding Variational Bayes.  Conference in Learning Representations. ICLR2014 (2014)  10. He, D., Xia, Y., Qin, T., Wang, L., Yu, N., Liu, T., Ma, W.: Dual Learning for Machine Translation. In: Advances in Neural Information Processing Systems 29. (2016) 820-828  11. Zhou, T., Kr¨ahenb¨uhl, P., Aubry, M., Huang, Q., Efros, A.A.: Learning Dense In: CVPR, IEEE Computer  Correspondence via 3D-Guided Cycle Consistency. Society (2016) 117-126  12. Godard, C., Mac Aodha, O., Brostow, G.J.: Unsupervised Monocular Depth Esti-  mation with Left-Right Consistency. In: CVPR. (2017)  13. Zhu, J., Park, T., Isola, P., Efros, A.A.: Unpaired Image-to-Image Translation Using Cycle-Consistent Adversarial networks. In: ICCV, IEEE Computer Society (2017) 2242-2251  14. Hoﬀman, J., Tzeng, E., Park, T., Zhu, J., Isola, P., Saenko, K., Efros, A.A., Darrell, T.: CyCADA: Cycle-Consistent Adversarial Domain Adaptation. arXiv preprint arXiv:1711.03213 (2017)  15. Ghahramani, Z.: Factorial Learning and the EM Algorithm. In: Proceedings of the 7th International Conference on Neural Information Processing Systems. NIPS’94, Cambridge, MA, USA, MIT Press (1994) 617-624  16. Tenenbaum, J.B., Freeman, W.T.: Separating Style and Content with Bilinear  Models. Neural Computation 12(6) (2000) 1247-1283  17. Desjardins, G., Courville, A.C., Bengio, Y.: Disentangling Factors of Variation via  Generative Entangling. arXiv preprint arXiv:1210.5474 (2012)  18. Reed, S.E., Sohn, K., Zhang, Y., Lee, H.: Learning to Disentangle Factors of Variation with Manifold Interaction. In: ICML. Volume 32 of JMLR Workshop and Conference Proceedings., JMLR.org (2014) 1431-1439   16  A.H. Jha et al.  19. Tang, Y., Salakhutdinov, R., Hinton, G.E.: Deep Lambertian Networks. In: ICML,  icml.cc / Omnipress (2012)  20. Kulkarni, T.D., Whitney, W.F., Kohli, P., Tenenbaum, J.B.: Deep Convolutional Inverse Graphics Network. In: Proceedings of the 28th International Conference on Neural Information Processing Systems - Volume 2. NIPS’15, Cambridge, MA, USA, MIT Press (2015) 2539-2547  21. Tran, L., Yin, X., Liu, X.: Disentangled Representation Learning GAN for Pose- In: The IEEE Conference on Computer Vision and  Invariant Face Recognition. Pattern Recognition (CVPR). (July 2017)  22. Donahue, C., Balsubramani, A., McAuley, J., Lipton, Z.C.: Semantically Decom- In: International  posing the Latent Spaces of Generative Adversarial Networks. Conference in Learning Representations. ICLR2018 (2018)  23. Berthelot, D., Schumm, T., Metz, L.: BEGAN: boundary equilibrium generative  adversarial networks. arXiv preprint arXiv:1703.10717 (2017)  24. Reed, S.E., Zhang, Y., Zhang, Y., Lee, H.: Deep Visual Analogy-Making. In: NIPS.  (2015) 1252-1260  25. Makhzani, A., Shlens, J., Jaitly, N., Goodfellow, I.: Adversarial autoencoders. In:  International Conference on Learning Representations. (2016)  26. Hu, Q., Szab´o, A., Portenier, T., Zwicker, M., Favaro, P.: Disentangling Factors  of Variation by Mixing Them. arXiv preprint arXiv:1711.07410 (2017)  27. Bouchacourt, D., Tomioka, R., Nowozin, S.: Multi-Level Variational Autoencoder: Learning Disentangled Representations From Grouped Observations. In: Proceed- ings of the Thirty-Second AAAI Conference on Artificial Intelligence, New Orleans, Louisiana, USA, February 2-7, 2018. (2018)  28. Lecun, Y., Bottou, L., Bengio, Y., Haﬀner, P.: Gradient-based Learning Applied  to Document Recognition. In: Proceedings of the IEEE. (1998) 2278-2324 29. http://lpc.opengameart.org/: Liberated Pixel Cup Accessed: 2018-02-21. 30. Hinterstoisser, S., Lepetit, V., Ilic, S., Holzer, S., Bradski, G., Konolige, K., Navab, N.: Model Based Training, Detection and Pose Estimation of Texture-less 3D Ob- jects in Heavily Cluttered Scenes. In: Proceedings of the 11th Asian Conference on Computer Vision - Volume Part I. ACCV’12, Berlin, Heidelberg, Springer-Verlag (2013) 548-562  31. Wohlhart, P., Lepetit, V.: Learning Descriptors for Object Recognition and 3D  Pose Estimation. In: CVPR, IEEE Computer Society (2015) 3109-3118  32. Paszke, A., Gross, S., Chintala, S., Chanan, G., Yang, E., DeVito, Z., Lin, Z., Desmaison, A., Antiga, L., Lerer, A.: Automatic Diﬀerentiation in PyTorch. (2017) 33. van der Maaten, L., Hinton, G.: Visualizing High-Dimensional Data using t-SNE.  Journal of Machine Learning Research 9: 2579-2605 (Nov 2008)"}