{"1": "1. Balntas, V., Doumanoglou, A., Sahin, C., Sock, J., Kouskouridas, R., Kim, T.K.: Pose guided  rgbd feature learning for 3d object pose estimation. In: CVPR (2017)  2. Brachmann, E., Krull, A., Michel, F., Gumhold, S., Shotton, J., Rother, C.: Learning 6d object  pose estimation using 3d object coordinates. In: ECCV. Springer (2014)  3. Brachmann, E., Krull, A., Michel, F., Gumhold, S., Shotton, J., Rother, C.: Learning 6d object  pose estimation using 3d object coordinates. In: ECCV. Springer (2014)  4. Brachmann, E., Michel, F., Krull, A., Ying Yang, M., Gumhold, S., et al.: Uncertainty-driven  6d pose estimation of objects and scenes from a single rgb image. In: CVPR (2016)  5. Chirikjian, G.S., Mahony, R., Ruan, S., Trumpf, J.: Pose changes from a different point of  view. Journal of Mechanisms and Robotics (2018)  6. Doumanoglou, A., Kouskouridas, R., Malassiotis, S., Kim, T.K.: Recovering 6d object pose  and predicting next-best-view in the crowd. In: CVPR (2016)  7. Erkent, ¨O., Shukla, D., Piater, J.: Integration of probabilistic pose estimates from multiple  8. F. Tombari, S.S., Stefano, L.D.: A combined texture-shape descriptor for enhanced 3d feature  9. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for Autonomous Driving? The KITTI Vision  views. In: ECCV. Springer (2016)  matching. ICIP (2011)  Benchmark Suite. In: CVPR (2012)  10. Girshick, R.: Fast r-cnn. arXiv preprint arXiv:1504.08083 (2015) 11. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: ICCV. IEEE (2017) 12. Hinterstoisser, S., Lepetit, V., Ilic, S., Holzer, S., Bradski, G., Konolige, K., Navab, N.: Model based training, detection and pose estimation of texture-less 3d objects in heavily cluttered scenes. In: Computer Vision-ACCV 2012. Springer (2013)  13. Ioffe, S., Szegedy, C.: Batch Normalization: Accelerating Deep Network Training by Reducing  Internal Covariate Shift. JMLR (2015)  14. Izadi, S., Kim, D., Hilliges, O., Molyneaux, D., Newcombe, R., Kohli, P., Shotton, J., et al.: Kinectfusion: real-time 3d reconstruction and interaction using a moving depth camera. In: ACM symposium on User interface software and technology. ACM (2011)  15. Johns, E., Leutenegger, S., Davison, A.J.: Pairwise decomposition of image sequences for  active multi-view recognition. In: CVPR. IEEE (2016)  16. Kehl, W., Manhardt, F., Tombari, F., Ilic, S., Navab, N.: Ssd-6d: Making rgb-based 3d detection  and 6d pose estimation great again. In: CVPR (2017)  17. Kehl, W., Milletari, F., Tombari, F., Ilic, S., Navab, N.: Deep learning of local rgb-d patches for 3d object detection and 6d pose estimation. In: ECCV. pp. 205-220. Springer (2016) 18. Krizhevsky, A., Sutskever, I., Hinton, G.E.: ImageNet Classification with Deep Convolutional  Neural Networks. In: NIPS (2012)  19. Krull, A., Brachmann, E., Michel, F., Ying Yang, M., Gumhold, S., Rother, C.: Learning  analysis-by-synthesis for 6d pose estimation in rgb-d images. In: ICCV (2015)  20. Lai, K., Bo, L., Ren, X., Fox, D.: Detection-based object labeling in 3d scenes. In: ICRA.  IEEE (2012)  21. Levine, S., Pastor, P., Krizhevsky, A., Quillen, D.: Learning hand-eye coordination for robotic grasping with large-scale data collection. In: International Symposium on Experimental Robotics. pp. 173-184. Springer (2016)  22. Li, C., Boheren, J., Carlson, E., Hager, G.D.: Hierarchical semantic parsing for object pose  estimation in densely cluttered scenes. In: ICRA (2016)  23. Li, C., Xiao, H., Tateno, K., Tombari, F., Navab, N., Hager, G.D.: Incremental scene under-  standing on dense slam. In: IROS. IEEE (2016)   Multi-View Multi-Class Object Pose EstimationReferences  1. Balntas, V., Doumanoglou, A., Sahin, C., Sock, J., Kouskouridas, R., Kim, T.K.: Pose guided  rgbd feature learning for 3d object pose estimation. In: CVPR (2017)  2. Brachmann, E., Krull, A., Michel, F., Gumhold, S., Shotton, J., Rother, C.: Learning 6d object  pose estimation using 3d object coordinates. In: ECCV. Springer (2014)  3. Brachmann, E., Krull, A., Michel, F., Gumhold, S., Shotton, J., Rother, C.: Learning 6d object  pose estimation using 3d object coordinates. In: ECCV. Springer (2014)  4. Brachmann, E., Michel, F., Krull, A., Ying Yang, M., Gumhold, S., et al.: Uncertainty-driven  6d pose estimation of objects and scenes from a single rgb image. In: CVPR (2016)  5. Chirikjian, G.S., Mahony, R., Ruan, S., Trumpf, J.: Pose changes from a different point of  view. Journal of Mechanisms and Robotics (2018)  6. Doumanoglou, A., Kouskouridas, R., Malassiotis, S., Kim, T.K.: Recovering 6d object pose  and predicting next-best-view in the crowd. In: CVPR (2016)  7. Erkent, ¨O., Shukla, D., Piater, J.: Integration of probabilistic pose estimates from multiple  8. F. Tombari, S.S., Stefano, L.D.: A combined texture-shape descriptor for enhanced 3d feature  9. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for Autonomous Driving? The KITTI Vision  views. In: ECCV. Springer (2016)  matching. ICIP (2011)  Benchmark Suite. In: CVPR (2012)  10. Girshick, R.: Fast r-cnn. arXiv preprint arXiv:1504.08083 (2015) 11. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: ICCV. IEEE (2017) 12. Hinterstoisser, S., Lepetit, V., Ilic, S., Holzer, S., Bradski, G., Konolige, K., Navab, N.: Model based training, detection and pose estimation of texture-less 3d objects in heavily cluttered scenes. In: Computer Vision-ACCV 2012. Springer (2013)  13. Ioffe, S., Szegedy, C.: Batch Normalization: Accelerating Deep Network Training by Reducing  Internal Covariate Shift. JMLR (2015)  14. Izadi, S., Kim, D., Hilliges, O., Molyneaux, D., Newcombe, R., Kohli, P., Shotton, J., et al.: Kinectfusion: real-time 3d reconstruction and interaction using a moving depth camera. In: ACM symposium on User interface software and technology. ACM (2011)  15. Johns, E., Leutenegger, S., Davison, A.J.: Pairwise decomposition of image sequences for  active multi-view recognition. In: CVPR. IEEE (2016)  16. Kehl, W., Manhardt, F., Tombari, F., Ilic, S., Navab, N.: Ssd-6d: Making rgb-based 3d detection  and 6d pose estimation great again. In: CVPR (2017)  17. Kehl, W., Milletari, F., Tombari, F., Ilic, S., Navab, N.: Deep learning of local rgb-d patches for 3d object detection and 6d pose estimation. In: ECCV. pp. 205-220. Springer (2016) 18. Krizhevsky, A., Sutskever, I., Hinton, G.E.: ImageNet Classification with Deep Convolutional  Neural Networks. In: NIPS (2012)  19. Krull, A., Brachmann, E., Michel, F., Ying Yang, M., Gumhold, S., Rother, C.: Learning  analysis-by-synthesis for 6d pose estimation in rgb-d images. In: ICCV (2015)  20. Lai, K., Bo, L., Ren, X., Fox, D.: Detection-based object labeling in 3d scenes. In: ICRA.  IEEE (2012)  21. Levine, S., Pastor, P., Krizhevsky, A., Quillen, D.: Learning hand-eye coordination for robotic grasping with large-scale data collection. In: International Symposium on Experimental Robotics. pp. 173-184. Springer (2016)  22. Li, C., Boheren, J., Carlson, E., Hager, G.D.: Hierarchical semantic parsing for object pose  estimation in densely cluttered scenes. In: ICRA (2016)  23. Li, C., Xiao, H., Tateno, K., Tombari, F., Navab, N., Hager, G.D.: Incremental scene under-  standing on dense slam. In: IROS. IEEE (2016)   16  C. Li, J. Bai and G. Hager  24. Li, C., Zia, M.Z., Tran, Q.H., Yu, X., Hager, G.D., Chandraker, M.: Deep supervision with  shape concepts for occlusion-aware 3d object parsing. CVPR (2017)  25. Massa, F., Marlet, R., Aubry, M.: Crafting a multi-task cnn for viewpoint estimation. BMVC  (2016)  26. Michel, F., Kirillov, A., Brachmann, E., Krull, A., Gumhold, S., Savchynskyy, B., Rother, C.:  Global hypothesis generation for 6d object pose estimation. ICCV (2017)  27. Mousavian, A., Anguelov, D., Flynn, J., Koˇseck´a, J.: 3d bounding box estimation using deep  learning and geometry. In: CVPR. IEEE (2017)  28. Papazov, C., Burschka, D.: An efficient ransac for 3d object recognition in noisy and occluded  scenes. In: Computer Vision-ACCV 2010 (2011)  29. Pillai, S., Leonard, J.: Monocular slam supported object recognition. In: RSS (2015) 30. Rad, M., Lepetit, V.: Bb8: A scalable, accurate, robust to partial occlusion method for  predicting the 3d poses of challenging objects without using depth. In: ICCV (2017)  31. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object detection with  32. Rusu, R.B.: Semantic 3d object maps for everyday manipulation in human living environments.  region proposal networks. In: NIPS (2015)  KI-K¨unstliche Intelligenz (2010)  33. Salas-Moreno, R., Newcombe, R., Strasdat, H., Kelly, P., Davison, A.: Slam++: Simultaneous  localisation and mapping at the level of objects. In: CVPR (2013)  34. Su, H., Maji, S., Kalogerakis, E., Learned-Miller, E.: Multi-view convolutional neural net-  works for 3d shape recognition. In: CVPR. pp. 945-953 (2015)  35. Su, H., Qi, C.R., Li, Y., Guibas, L.J.: Render for CNN: Viewpoint estimation in images using  CNNs trained with Rendered 3D model views. In: ICCV (2015)  36. Tateno, K., Tombari, F., Laina, I., Navab, N.: Cnn-slam: Real-time dense monocular slam  with learned depth prediction. CVPR (2017)  37. Tejani, A., Tang, D., Kouskouridas, R., Kim, T.K.: Latent-class hough forests for 3d object  detection and pose estimation. In: ECCV. Springer (2014)  38. Tekin, B., Sinha, S.N., Fua, P.: Real-time seamless single shot 6d object pose prediction. arXiv  preprint arXiv:1711.08848 (2017)  39. Tjaden, H., Schwanecke, U., Sch¨omer, E.: Real-time monocular pose estimation of 3d objects  using temporally consistent local color histograms. In: CVPR (2017)  40. Weichao Qiu, Fangwei Zhong, Y.Z.S.Q.Z.X.T.S.K.Y.W.A.Y.: Unrealcv: Virtual worlds for  computer vision. ACM Multimedia Open Source Software Competition (2017)  41. Wohlhart, P., Lepetit, V.: Learning descriptors for object recognition and 3d pose estimation.  In: CVPR (2015)  42. Xiang, Y., Kim, W., Chen, W., Ji, J., Choy, C., Su, H., Mottaghi, R., Guibas, L., Savarese, S.:  Objectnet3d: A large scale database for 3d object recognition. In: ECCV (2016)  43. Xiang, Y., Mottaghi, R., Savarese, S.: Beyond PASCAL: A Benchmark for 3D Object Detec-  tion in the Wild. In: WACV (2014)  44. Xiang, Y., Schmidt, T., Narayanan, V., Fox, D.: PoseCNN: A convolutional neural network for 6d object pose estimation in cluttered scenes. arXiv preprint arXiv:1711.00199 (2017) 45. Yan, Y., Chirikjian, G.S.: Almost-uniform sampling of rotations for conformational searches  in robotics and structural biology. In: ICRA (2012)  46. Yang, Y., Ramanan, D.: Articulated pose estimation with ﬂexible mixtures-of-parts. In: CVPR  (2011)  47. Zeng, A., Yu, K.T., Song, S., Suo, D., Walker, E., Rodriguez, A., Xiao, J.: Multi-view self- supervised deep learning for 6d pose estimation in the amazon picking challenge. In: ICRA. IEEE (2017)"}