{"1": "1. Bevilacqua, M., Roumy, A., Guillemot, C., Alberi-Morel, M.L.: Low-complexity single-image super-resolution based on nonnegative neighbor embedding. In: BMVC (2012)  2. Bluche, T.: Joint line segmentation and transcription for end-to-end handwritten  paragraph recognition. In: NIPS (2016)  3. Cao, C., Liu, X., Yang, Y., Yu, Y., Wang, J., Wang, Z., Huang, Y., Wang, L., Huang, C., Xu, W., Ramanan, D., Huang, T.S.: Look and think twice: Capturing top-down visual attention with feedback convolutional neural networks. In: ICCV (2015)  4. Dong, C., Loy, C.C., He, K., Tang, X.: Learning a deep convolutional network for  image super-resolution. In: ECCV. pp. 184-199 (2014)  5. Dong, C., Loy, C.C., He, K., Tang, X.: Image super-resolution using deep convo-  lutional networks. TPAMI 38(2), 295-307 (2016)  6. Dong, C., Loy, C.C., Tang, X.: Accelerating the super-resolution convolutional  neural network. In: ECCV. pp. 391-407. Springer (2016)  7. Dumoulin, V., Shlens, J., Kudlur, M.: A learned representation for artistic style.  8. Freeman, W.T., Pasztor, E.C., Carmichael, O.T.: Learning low-level vision. IJCV  In: ICLR (2017)  (2000)  9. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S.,  Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  10. Haris, M., Shakhnarovich, G., Ukita, N.: Deep back-projection networks for super-  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  resolution. In: CVPR (2018)  In: CVPR (2016)  arXiv:1709.01507 (2017)  self-exemplars. In: CVPR (2015)  networks. In: NIPS (2015)  12. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks. arXiv preprint  13. Huang, J.B., Singh, A., Ahuja, N.: Single image super-resolution from transformed  14. Jaderberg, M., Simonyan, K., Zisserman, A., Kavukcuoglu, K.: Spatial transformer  15. Johnson, J., Alahi, A., Fei-Fei, L.: Perceptual losses for real-time style transfer and  super-resolution. In: ECCV. pp. 694-711. Springer (2016)  16. Kim, J., Kwon Lee, J., Mu Lee, K.: Accurate image super-resolution using very  deep convolutional networks. In: CVPR (2016)  17. Kim, J., Kwon Lee, J., Mu Lee, K.: Deeply-recursive convolutional network for  image super-resolution. In: CVPR (2016)  18. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In: ICLR (2014) 19. Lai, W.S., Huang, J.B., Ahuja, N., Yang, M.H.: Deep laplacian pyramid networks  for fast and accurate super-resolution. In: CVPR (2017)  20. Lai, W.S., Huang, J.B., Ahuja, N., Yang, M.H.: Fast and accurate image super-  resolution with deep laplacian pyramid networks. arXiv:1710.01992 (2017)  21. Ledig, C., Theis, L., Husz´ar, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A., Tejani, A., Totz, J., Wang, Z., Shi, W.: Photo-realistic single image super- resolution using a generative adversarial network. In: CVPR (2017)  22. Li, K., Wu, Z., Peng, K.C., Ernst, J., Fu, Y.: Tell me where to look: Guided  attention inference network. In: CVPR (2018)   Image Super-Resolution Using Very Deep RCANReferences  1. Bevilacqua, M., Roumy, A., Guillemot, C., Alberi-Morel, M.L.: Low-complexity single-image super-resolution based on nonnegative neighbor embedding. In: BMVC (2012)  2. Bluche, T.: Joint line segmentation and transcription for end-to-end handwritten  paragraph recognition. In: NIPS (2016)  3. Cao, C., Liu, X., Yang, Y., Yu, Y., Wang, J., Wang, Z., Huang, Y., Wang, L., Huang, C., Xu, W., Ramanan, D., Huang, T.S.: Look and think twice: Capturing top-down visual attention with feedback convolutional neural networks. In: ICCV (2015)  4. Dong, C., Loy, C.C., He, K., Tang, X.: Learning a deep convolutional network for  image super-resolution. In: ECCV. pp. 184-199 (2014)  5. Dong, C., Loy, C.C., He, K., Tang, X.: Image super-resolution using deep convo-  lutional networks. TPAMI 38(2), 295-307 (2016)  6. Dong, C., Loy, C.C., Tang, X.: Accelerating the super-resolution convolutional  neural network. In: ECCV. pp. 391-407. Springer (2016)  7. Dumoulin, V., Shlens, J., Kudlur, M.: A learned representation for artistic style.  8. Freeman, W.T., Pasztor, E.C., Carmichael, O.T.: Learning low-level vision. IJCV  In: ICLR (2017)  (2000)  9. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S.,  Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  10. Haris, M., Shakhnarovich, G., Ukita, N.: Deep back-projection networks for super-  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  resolution. In: CVPR (2018)  In: CVPR (2016)  arXiv:1709.01507 (2017)  self-exemplars. In: CVPR (2015)  networks. In: NIPS (2015)  12. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks. arXiv preprint  13. Huang, J.B., Singh, A., Ahuja, N.: Single image super-resolution from transformed  14. Jaderberg, M., Simonyan, K., Zisserman, A., Kavukcuoglu, K.: Spatial transformer  15. Johnson, J., Alahi, A., Fei-Fei, L.: Perceptual losses for real-time style transfer and  super-resolution. In: ECCV. pp. 694-711. Springer (2016)  16. Kim, J., Kwon Lee, J., Mu Lee, K.: Accurate image super-resolution using very  deep convolutional networks. In: CVPR (2016)  17. Kim, J., Kwon Lee, J., Mu Lee, K.: Deeply-recursive convolutional network for  image super-resolution. In: CVPR (2016)  18. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. In: ICLR (2014) 19. Lai, W.S., Huang, J.B., Ahuja, N., Yang, M.H.: Deep laplacian pyramid networks  for fast and accurate super-resolution. In: CVPR (2017)  20. Lai, W.S., Huang, J.B., Ahuja, N., Yang, M.H.: Fast and accurate image super-  resolution with deep laplacian pyramid networks. arXiv:1710.01992 (2017)  21. Ledig, C., Theis, L., Husz´ar, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A., Tejani, A., Totz, J., Wang, Z., Shi, W.: Photo-realistic single image super- resolution using a generative adversarial network. In: CVPR (2017)  22. Li, K., Wu, Z., Peng, K.C., Ernst, J., Fu, Y.: Tell me where to look: Guided  attention inference network. In: CVPR (2018)   16  Yulun Zhang et al.  23. Lim, B., Son, S., Kim, H., Nah, S., Lee, K.M.: Enhanced deep residual networks  for single image super-resolution. In: CVPRW (2017)  24. Martin, D., Fowlkes, C., Tal, D., Malik, J.: A database of human segmented natural images and its application to evaluating segmentation algorithms and measuring ecological statistics. In: ICCV (2001)  25. Matsui, Y., Ito, K., Aramaki, Y., Fujimoto, A., Ogawa, T., Yamasaki, T., Aizawa, K.: Sketch-based manga retrieval using manga109 dataset. Multimedia Tools and Applications (2017)  26. Miech, A., Laptev, I., Sivic, J.: Learnable pooling with context gating for video  classification. arXiv preprint arXiv:1706.06905 (2017)  27. Nair, V., Hinton, G.E.: Rectified linear units improve restricted boltzmann ma-  chines. In: ICML (2010)  28. Paszke, A., Gross, S., Chintala, S., Chanan, G., Yang, E., DeVito, Z., Lin, Z., Desmaison, A., Antiga, L., Lerer, A.: Automatic diﬀerentiation in pytorch (2017) 29. Peleg, T., Elad, M.: A statistical prediction model based on sparse representations  for single image super-resolution. TIP 23(6), 2569-2582 (2014)  30. P´erez-Pellitero, E., Salvador, J., Ruiz-Hidalgo, J., Rosenhahn, B.: Psyco: Manifold  span reduction for super resolution. In: CVPR (2016)  31. Sajjadi, M.S., Sch¨olkopf, B., Hirsch, M.: Enhancenet: Single image super-resolution  through automated texture synthesis. In: ICCV (2017)  32. Shi, W., Caballero, J., Husz´ar, F., Totz, J., Aitken, A.P., Bishop, R., Rueckert, D., Wang, Z.: Real-time single image and video super-resolution using an eﬃcient sub-pixel convolutional neural network. In: CVPR (2016)  33. Shi, W., Caballero, J., Ledig, C., Zhuang, X., Bai, W., Bhatia, K., de Marvao, A.M.S.M., Dawes, T., ORegan, D., Rueckert, D.: Cardiac image super-resolution with global correspondence using multi-atlas patchmatch. In: MICCAI (2013) 34. Tai, Y., Yang, J., Liu, X.: Image super-resolution via deep recursive residual net-  35. Tai, Y., Yang, J., Liu, X., Xu, C.: Memnet: A persistent memory network for image  work. In: CVPR (2017)  restoration. In: ICCV (2017)  36. Timofte, R., Agustsson, E., Van Gool, L., Yang, M.H., Zhang, L., Lim, B., Son, S., Kim, H., Nah, S., Lee, K.M., et al.: Ntire 2017 challenge on single image super- resolution: Methods and results. In: CVPRW (2017)  37. Timofte, R., Rothe, R., Van Gool, L.: Seven ways to improve example-based single  image super resolution. In: CVPR (2016)  38. Wang, F., Jiang, M., Qian, C., Yang, S., Li, C., Zhang, H., Wang, X., Tang, X.:  Residual attention network for image classification. In: CVPR (2017)  39. Wang, Z., Liu, D., Yang, J., Han, W., Huang, T.: Deep networks for image super-  resolution with sparse prior. In: ICCV (2015)  40. Wang, Z., Bovik, A.C., Sheikh, H.R., Simoncelli, E.P.: Image quality assessment:  from error visibility to structural similarity. TIP 13(4), 600-612 (2004)  41. Zeyde, R., Elad, M., Protter, M.: On single image scale-up using sparse-  representations. In: Proc. 7th Int. Conf. Curves Surf. (2010)  42. Zhang, K., Zuo, W., Gu, S., Zhang, L.: Learning deep cnn denoiser prior for image  restoration. In: CVPR (2017)  43. Zhang, K., Zuo, W., Zhang, L.: Learning a single convolutional super-resolution  network for multiple degradations. In: CVPR (2018)  44. Zhang, Y., Tian, Y., Kong, Y., Zhong, B., Fu, Y.: Residual dense network for image  super-resolution. In: CVPR (2018)  45. Zou, W.W., Yuen, P.C.: Very low resolution face recognition problem. TIP 21(1),  327-340 (2012)"}