{"1": "1. Endo, Y., Kanamori, Y., Mitani, J.: Deep reverse tone mapping. ACM Transactions  on Graphics (TOG) 36(6) (2017) 177  2. Lee, S., An, G.H., Kang, S.J.: Deep chain hdri: Reconstructing a high dy- arXiv preprint  namic range image from a single low dynamic range image. arXiv:1801.06277 (2018)  3. Eilertsen, G., Kronander, J., Denes, G., Mantiuk, R.K., Unger, J.: HDR image reconstruction from a single exposure using deep CNNs. ACM Transactions on Graphics (TOG) 36(6) (2017) 178  4. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., In: Advances in neural  Courville, A., Bengio, Y.: Generative adversarial nets. information processing systems. (2014) 2672-2680  5. Salimans, T., Goodfellow, I., Zaremba, W., Cheung, V., Radford, A., Chen, X.: Improved techniques for training gans. In: Advances in Neural Information Pro- cessing Systems. (2016) 2234-2242  6. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con-  ditional adversarial networks  7. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation  using cycle-consistent adversarial networks. arXiv preprint (2017)  8. Kim, T., Cha, M., Kim, H., Lee, J.K., Kim, J.: Learning to discover cross-domain relations with generative adversarial networks. arXiv preprint arXiv:1703.05192 (2017)   14  Lee et al.  5 Conclusion  We proposed the deep neural network architecture based on the GAN architec- ture to solve the inverse tone mapping problem, reconstructing missing signals from a single LDR image. Moreover, we trained this CNN-based neural network to infer the relation between relative exposure values using a conditional GAN structure. Therefore, the proposed method generated an HDR image recovered in a saturated (or dark) region of a given LDR image. This network diﬀered from existing networks [1, 2], in that it converted an LDR image into a non-linear LDR image corresponding to +1 or −1 exposure stops. This property led the architecture to generate images with varying exposure levels without additional networks and training process. In addition, we constructed a relatively simple network structure by changing the deep structure eﬀect of deep chain HDRI into a recursive structure.  Acknowledgements  This research was supported by the National Research Foundation of Korea (NRF) grant funded by the Korea government (MSIT) (No. 2018R1D1A1B07048421) and Korea Electric Power Corporation. (Grant number R17XA05-28). We thank Yong Deok Ahn and members of the Sogang Vision and Display Lab. for helpful discussions.  References  1. Endo, Y., Kanamori, Y., Mitani, J.: Deep reverse tone mapping. ACM Transactions  on Graphics (TOG) 36(6) (2017) 177  2. Lee, S., An, G.H., Kang, S.J.: Deep chain hdri: Reconstructing a high dy- arXiv preprint  namic range image from a single low dynamic range image. arXiv:1801.06277 (2018)  3. Eilertsen, G., Kronander, J., Denes, G., Mantiuk, R.K., Unger, J.: HDR image reconstruction from a single exposure using deep CNNs. ACM Transactions on Graphics (TOG) 36(6) (2017) 178  4. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., In: Advances in neural  Courville, A., Bengio, Y.: Generative adversarial nets. information processing systems. (2014) 2672-2680  5. Salimans, T., Goodfellow, I., Zaremba, W., Cheung, V., Radford, A., Chen, X.: Improved techniques for training gans. In: Advances in Neural Information Pro- cessing Systems. (2016) 2234-2242  6. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con-  ditional adversarial networks  7. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation  using cycle-consistent adversarial networks. arXiv preprint (2017)  8. Kim, T., Cha, M., Kim, H., Lee, J.K., Kim, J.: Learning to discover cross-domain relations with generative adversarial networks. arXiv preprint arXiv:1703.05192 (2017)   Deep Recursive HDRI9. Maaten, L.v.d., Hinton, G.: Visualizing data using t-SNE. Journal of machine  learning research 9(Nov) (2008) 2579-2605  10. Rempel, A.G., Trentacoste, M., Seetzen, H., Young, H.D., Heidrich, W., White- head, L., Ward, G.: Ldr2hdr: on-the-ﬂy reverse tone mapping of legacy video and photographs. In: ACM transactions on graphics (TOG). Volume 26., ACM (2007) 39  11. Meylan, L., Daly, S., Ssstrunk, S.: The reproduction of specular highlights on high dynamic range displays. In: Color and Imaging Conference. Volume 2006., Society for Imaging Science and Technology (2006) 333-338  12. Wang, T.H., Chiu, C.W., Wu, W.C., Wang, J.W., Lin, C.Y., Chiu, C.T., Liou, J.J.: Pseudo-Multiple-Exposure-Based Tone Fusion With Local Region Adjust- ment. IEEE Transactions on Multimedia 17(4) (April 2015) 470-484  13. Hirakawa, K., Simon, P.M.: Single-shot high dynamic range imaging with conven- tional camera hardware. In: Computer Vision (ICCV), 2011 IEEE International Conference on, IEEE (2011) 1339-1346  14. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Advances in neural information processing systems. (2012) 1097-1105  15. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2016) 770-778  16. Mao, X.J., Shen, C., Yang, Y.B.:  Image restoration using convolutional auto- encoders with symmetric skip connections. arXiv preprint arXiv:1606.08921 (2016) 17. Li, H., Xu, Z., Taylor, G., Goldstein, T.: Visualizing the loss landscape of neural  nets. arXiv preprint arXiv:1712.09913 (2017)  18. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein gan.  arXiv preprint  arXiv:1701.07875 (2017)  19. Mao, X., Li, Q., Xie, H., Lau, R.Y., Wang, Z., Smolley, S.P.: Least squares gener- ative adversarial networks. In: 2017 IEEE International Conference on Computer Vision (ICCV), IEEE (2017) 2813-2821  20. Nowozin, S., Cseke, B., Tomioka, R.:  using variational divergence minimization. Processing Systems. (2016) 271-279  f-gan: Training generative neural samplers In: Advances in Neural Information  21. Ledig, C., Theis, L., Husz´ar, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A.P., Tejani, A., Totz, J., Wang, Z., et al.: Photo-realistic single image super- resolution using a generative adversarial network. In: CVPR. Volume 2. (2017) 4  22. Mirza, M., Osindero, S.: Conditional generative adversarial nets. arXiv preprint  arXiv:1411.1784 (2014)  23. Ronneberger, O., P.Fischer, Brox, T.: U-Net: Convolutional Networks for Biomed- ical Image Segmentation. In: Medical Image Computing and Computer-Assisted Intervention (MICCAI). Volume 9351 of LNCS., Springer (2015) 234-241  24. He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpassing human- level performance on imagenet classification. In: Proceedings of the IEEE interna- tional conference on computer vision. (2015) 1026-1034  25. Li, C., Wand, M.: Precomputed real-time texture synthesis with markovian gener- ative adversarial networks. In: European Conference on Computer Vision, Springer (2016) 702-716  26. Laﬀerty, J., McCallum, A., Pereira, F.C.: Conditional random fields: Probabilistic  models for segmenting and labeling sequence data. (2001)   16  Lee et al.  27. Maas, A.L., Hannun, A.Y., Ng, A.Y.: Rectifier nonlinearities improve neural net-  work acoustic models  28. Zhao, H., Gallo, O., Frosio, I., Kautz, J.: Loss functions for image restoration with neural networks. IEEE Transactions on Computational Imaging 3(1) (2017) 47-57 29. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  30. Nemoto, H., Korshunov, P., Hanhart, P., Ebrahimi, T.: Visual attention in ldr and hdr images. In: 9th International Workshop on Video Processing and Quality Metrics for Consumer Electronics (VPQM). Number EPFL-CONF-203873 (2015) 31. Debevec, P.E., Malik, J.: Recovering high dynamic range radiance maps from  photographs. In: ACM SIGGRAPH 2008 classes, ACM (2008) 31  32. Reinhard, E., Stark, M., Shirley, P., Ferwerda, J.: Photographic tone reproduction for digital images. ACM transactions on graphics (TOG) 21(3) (2002) 267-276 33. Kim, M.H., Kautz, J.: Consistent Tone Reproduction. In: Proc. the Tenth IASTED International Conference on Computer Graphics and Imaging (CGIM 2008), Inns- bruck, Austria, IASTED/ACTA Press (2008) 152-159  34. Banterle, F., Artusi, A., Debattista, K., Chalmers, A.: Advanced high dynamic  range imaging. CRC press (2017)  35. Mantiuk, R., Kim, K.J., Rempel, A.G., Heidrich, W.: HDR-VDP-2: A calibrated visual metric for visibility and quality predictions in all luminance conditions. In: ACM Transactions on Graphics (TOG). Volume 30., ACM (2011) 40  36. Masia, B., Agustin, S., Fleming, R.W., Sorkine, O., Gutierrez, D.: Evaluation of reverse tone mapping through varying exposure conditions. ACM transactions on graphics (TOG) 28(5) (2009) 160"}