{"1": "1. Bossard, L., Guillaumin, M., Gool, L.V.: Food-101 - mining discriminative compo-  nents with random forests. In: ECCV (2014)  2. Branson, S., Van Horn, G., Belongie, S., Perona, P.: Bird species categorization  using pose normalized deep convolutional nets. In: BMVC (2014)  3. Branson, S., Van Horn, G., Wah, C., Perona, P., Belongie, S.: The ignorant led by the blind: A hybrid human-machine vision system for fine-grained categorization. Int. J. Comput. Vis. 108(1-2), 3-29 (2014)  4. Bromley, J., Guyon, I., LeCun, Y., S¨ackinger, E., Shah, R.: Signature verification  using a “Siamese” time delay neural network. In: NIPS (1994)  5. Collobert, R., Kavukcuoglu, K., Farabet, C.: Torch7: A matlab-like environment  for machine learning. In: BigLearn, NIPS workshop (2011)  6. Cui, Y., Zhou, F., Lin, Y., Belongie, S.: Fine-grained categorization and dataset bootstrapping using deep metric learning with humans in the loop. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1153- 1162 (2016)  7. Cui, Y., Zhou, F., Wang, J., Liu, X., Lin, Y., Belongie, S.: Kernel pooling for  convolutional neural networks. In: CVPR (2017)  8. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: CVPR (2009)  9. Farrell, R., Oza, O., Zhang, N., Morariu, V.I., Darrell, T., Davis, L.S.: Birdlets: Subordinate categorization using volumetric primitives and pose-normalized ap- pearance. In: ICCV (2011)  10. Fu, J., Zheng, H., Mei, T.: Look closer to see better: recurrent attention convolu-  tional neural network for fine-grained image recognition. In: CVPR (2017)  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  12. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural Comput. 9(8),  In: CVPR (2016)  1735-1780 (1997)  arXiv:1709.01507 (2017)  NIPS (2015)  13. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks. arXiv preprint  14. Jaderberg, M., Simonyan, K., Zisserman, A.: Spatial transformer networks. In:  15. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM MM (2014)  16. Khosla, A., Jayadevaprakash, N., Yao, B., Li, F.F.: Novel dataset for fine-grained image categorization: Stanford dogs. In: CVPR Workshops on Fine-Grained Visual Categorization (2011)  17. Krause, J., Gebru, T., Deng, J., Li, L.J., Fei-Fei, L.: Learning features and parts  for fine-grained recognition. In: ICPR (2014)  18. Krause, J., Jin, H., Yang, J., Fei-Fei, L.: Fine-grained recognition without part  annotations. In: CVPR (2015)  19. Krause, J., Sapp, B., Howard, A., Zhou, H., Toshev, A., Duerig, T., Philbin, J., Fei- Fei, L.: The unreasonable eﬀectiveness of noisy data for fine-grained recognition. In: ECCV (2016)  20. Krause, J., Stark, M., Deng, J., Fei-Fei, L.: 3D object representations for fine- grained categorization. In: ICCV Workshops on 3D Representation and Recogni- tion (2013)   Multi-Attention Multi-Class Constraint for Fine-grained Image RecognitionReferences  1. Bossard, L., Guillaumin, M., Gool, L.V.: Food-101 - mining discriminative compo-  nents with random forests. In: ECCV (2014)  2. Branson, S., Van Horn, G., Belongie, S., Perona, P.: Bird species categorization  using pose normalized deep convolutional nets. In: BMVC (2014)  3. Branson, S., Van Horn, G., Wah, C., Perona, P., Belongie, S.: The ignorant led by the blind: A hybrid human-machine vision system for fine-grained categorization. Int. J. Comput. Vis. 108(1-2), 3-29 (2014)  4. Bromley, J., Guyon, I., LeCun, Y., S¨ackinger, E., Shah, R.: Signature verification  using a “Siamese” time delay neural network. In: NIPS (1994)  5. Collobert, R., Kavukcuoglu, K., Farabet, C.: Torch7: A matlab-like environment  for machine learning. In: BigLearn, NIPS workshop (2011)  6. Cui, Y., Zhou, F., Lin, Y., Belongie, S.: Fine-grained categorization and dataset bootstrapping using deep metric learning with humans in the loop. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1153- 1162 (2016)  7. Cui, Y., Zhou, F., Wang, J., Liu, X., Lin, Y., Belongie, S.: Kernel pooling for  convolutional neural networks. In: CVPR (2017)  8. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: CVPR (2009)  9. Farrell, R., Oza, O., Zhang, N., Morariu, V.I., Darrell, T., Davis, L.S.: Birdlets: Subordinate categorization using volumetric primitives and pose-normalized ap- pearance. In: ICCV (2011)  10. Fu, J., Zheng, H., Mei, T.: Look closer to see better: recurrent attention convolu-  tional neural network for fine-grained image recognition. In: CVPR (2017)  11. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  12. Hochreiter, S., Schmidhuber, J.: Long short-term memory. Neural Comput. 9(8),  In: CVPR (2016)  1735-1780 (1997)  arXiv:1709.01507 (2017)  NIPS (2015)  13. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks. arXiv preprint  14. Jaderberg, M., Simonyan, K., Zisserman, A.: Spatial transformer networks. In:  15. Jia, Y., Shelhamer, E., Donahue, J., Karayev, S., Long, J., Girshick, R., Guadar- rama, S., Darrell, T.: Caﬀe: Convolutional architecture for fast feature embedding. In: ACM MM (2014)  16. Khosla, A., Jayadevaprakash, N., Yao, B., Li, F.F.: Novel dataset for fine-grained image categorization: Stanford dogs. In: CVPR Workshops on Fine-Grained Visual Categorization (2011)  17. Krause, J., Gebru, T., Deng, J., Li, L.J., Fei-Fei, L.: Learning features and parts  for fine-grained recognition. In: ICPR (2014)  18. Krause, J., Jin, H., Yang, J., Fei-Fei, L.: Fine-grained recognition without part  annotations. In: CVPR (2015)  19. Krause, J., Sapp, B., Howard, A., Zhou, H., Toshev, A., Duerig, T., Philbin, J., Fei- Fei, L.: The unreasonable eﬀectiveness of noisy data for fine-grained recognition. In: ECCV (2016)  20. Krause, J., Stark, M., Deng, J., Fei-Fei, L.: 3D object representations for fine- grained categorization. In: ICCV Workshops on 3D Representation and Recogni- tion (2013)   16  Ming Sun, Yuchen Yuan, Feng Zhou and Errui Ding  21. Li, Z., Yang, Y., Liu, X., Wen, S., Xu, W.: Dynamic computational time for visual  attention. arXiv preprint arXiv:1703.10332 (2017)  22. Lin, D., Shen, X., Lu, C., Jia, J.: Deep LAC: Deep localization, alignment and  classification for fine-grained recognition. In: CVPR (2015)  23. Lin, T.Y., RoyChowdhury, A., Maji, S.: Bilinear CNN models for fine-grained  visual recognition. In: ICCV (2015)  24. Lin, Y., Morariu, V.I., Hsu, W.H., Davis, L.S.: Jointly optimizing 3D model fitting  and fine-grained classification. In: ECCV (2014)  25. Liu, J., Kanazawa, A., Jacobs, D.W., Belhumeur, P.N.: Dog breed classification  using part localization. In: ECCV (2012)  26. Liu, X., Xia, T., Wang, J., Yang, Y., Zhou, F., Lin, Y.: Fully convolutional attention networks for fine-grained recognition. arXiv preprint arXiv:1603.06765 (2017) 27. Mnih, V., Heess, N., Graves, A., Kavukcuoglu, K.: Recurrent models of visual  attention. In: NIPS (2014)  of classes. In: ICVGIP (2008)  dogs. In: ICCV (2011)  28. Nilsback, M., Zisserman, A.: Automated ﬂower classification over a large number  29. Parkhi, O.M., Vedaldi, A., Jawahar, C., Zisserman, A.: The truth about cats and  30. Perronnin, F., Larlus, D.: Fisher vectors meet neural networks: A hybrid classifi-  31. Rosenfeld, A., Ullman, S.: Visual concept recognition and localization via iterative  cation architecture. In: CVPR (2015)  introspection. In: ACCV (2016)  32. Salakhutdinov, R., Hinton, G.E.: Learning a nonlinear embedding by preserving  class neighbourhood structure. In: AISTATS (2007)  33. Schroﬀ, F., Kalenichenko, D., Philbin, J.: FaceNet: A unified embedding for face  recognition and clustering. In: CVPR (2015)  34. Simon, M., Gao, Y., Darrell, T., Denzler, J., Rodner, E.: Generalized orderless pooling performs implicit salient matching. arXiv preprint arXiv:1705.00487 (2017) 35. Simon, M., Rodner, E.: Neural activation constellations: Unsupervised part model  discovery with convolutional networks. In: ICCV (2015)  36. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)  37. Sohn, K.: Improved deep metric learning with multi-class n-pair loss objective. In:  NIPS (2016)  38. Van Horn, G., Mac Aodha, O., Song, Y., Shepard, A., Adam, H., Perona, P., Be- longie, S.: The iNaturalist challenge 2017 dataset. arXiv preprint arXiv:1707.06642 (2017)  39. Wah, C., Branson, S., Welinder, P., Perona, P., Belongie, S.: The Caltech-UCSD birds-200-2011 dataset. Tech. Rep. CNS-TR-2011-001, California Institute of Tech- nology (2011)  40. Wang, D., Shen, Z., Shao, J., Zhang, W., Xue, X., Zhang, Z.: Multiple granularity  descriptors for fine-grained categorization. In: ICCV (2015)  41. Wang, F., Jiang, M., Qian, C., Yang, S., Li, C., Zhang, H., Wang, X., Tang, X.:  Residual attention network for image classification. In: CVPR (2017)  42. Wang, J., Zhou, F., Wen, S., Liu, X., Lin, Y.: Deep metric learning with angular  loss. In: ICCV (2017)  43. Wang, J., Song, Y., Leung, T., Rosenberg, C., Wang, J., Philbin, J., Chen, B., Wu, Y.: Learning fine-grained image similarity with deep ranking. In: CVPR (2014) 44. Wang, Y., Choi, J., Morariu, V., Davis, L.S.: Mining discriminative triplets of  patches for fine-grained classification. In: CVPR (2016)   Multi-Attention Multi-Class Constraint for Fine-grained Image Recognition45. Wilber, M., Kwak, I.S., Kriegman, D., Belongie, S.: Learning concept embeddings  with combined human-machine expertise. In: ICCV (2015)  46. Zeiler, M.D., Fergus, R.: Visualizing and understanding convolutional networks.  In: ECCV (2014)  47. Zhang, H., Xu, T., Elhoseiny, M., Huang, X., Zhang, S., Elgammal, A., Metaxas, D.: SPDA-CNN: Unifying semantic part detection and abstraction for fine-grained recognition. In: CVPR (2016)  48. Zhang, N., Donahue, J., Girshick, R., Darrell, T.: Part-based R-CNNs for fine-  grained category detection. In: ECCV (2014)  49. Zhang, N., Paluri, M., Ranzato, M., Darrell, T., Bourdev, L.: Panda: Pose aligned  networks for deep attribute modeling. In: CVPR (2014)  50. Zhang, X., Zhou, F., Lin, Y., Zhang, S.: Embedding label structures for fine-grained feature representation. In: Proceedings of the IEEE Conference on Computer Vi- sion and Pattern Recognition. pp. 1114-1123 (2016)  51. Zhang, X., Xiong, H., Zhou, W., Lin, W., Tian, Q.: Picking deep filter responses  for fine-grained image recognition. In: CVPR (2016)  52. Zhao, B., Wu, X., Feng, J., Peng, Q., Yan, S.: Diversified visual attention networks for fine-grained object classification. IEEE Trans. Multimedia 19(6), 1245-1256 (2017)  53. Zheng, H., Fu, J., Mei, T., Luo, J.: Learning multi-attention convolutional neural  network for fine-grained image recognition. In: ICCV (2017)  54. Zhou, B., Khosla, A., Lapedriza, `A., Oliva, A., Torralba, A.: Object detectors  emerge in deep scene CNNs. In: ICLR (2014)  55. Zhou, B., Khosla, A., Lapedriza, A., Oliva, A., Torralba, A.: Learning deep features  for discriminative localization. In: CVPR (2016)  56. Zhou, B., Lapedriza, A., Xiao, J., Torralba, A., Oliva, A.: Learning deep features  for scene recognition using places database. In: NIPS (2014)  57. Zhou, F., Lin, Y.: Fine-grained image classification by exploring bipartite-graph  labels. In: CVPR (2016)  58. Zhu, Y., Zhou, Y., Ye, Q., Qiu, Q., Jiao, J.: Soft proposal networks for weakly  supervised object localization. In: ICCV (2017)"}