{"1": "1. Abdullah Jamal, M., Li, H., Gong, B.: Deep face detector adaptation without negative transfer or catastrophic forgetting. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2018)  2. Appel, R., Fuchs, T., Doll´ar, P., Perona, P.: Quickly boosting decision trees- pruning underachieving features early. In: International Conference on Machine Learning. pp. 594-602 (2013)  3. Athalye, A., Sutskever, I.: Synthesizing robust adversarial examples. arXiv preprint  arXiv:1707.07397 (2017)  4. Blum, A., Mitchell, T.: Combining labeled and unlabeled data with co-training. In: Proceedings of the eleventh annual conference on Computational learning theory. pp. 92-100. ACM (1998)  5. Brazil, G., Yin, X., Liu, X.: Illuminating pedestrians via simultaneous detection &  segmentation. arXiv preprint arXiv:1706.08564 (2017)  6. Cai, Z., Fan, Q., Feris, R.S., Vasconcelos, N.: A unified multi-scale deep convolu- tional neural network for fast object detection. In: European Conference on Com- puter Vision. pp. 354-370. Springer (2016)  7. Cai, Z., Saberian, M., Vasconcelos, N.: Learning complexity-aware cascades for deep pedestrian detection. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 3361-3369 (2015)  8. Chang, H.S., Learned-Miller, E., McCallum, A.: Active bias: Training more accu- rate neural networks by emphasizing high variance samples. In: Advances in Neural Information Processing Systems. pp. 1003-1013 (2017)  9. Chapelle, O., Scholkopf, B., Zien, A.: Semi-supervised learning (chapelle, o. et al., eds.; 2006)[book reviews]. IEEE Transactions on Neural Networks 20(3), 542-542 (2009)  10. Dalal, N., Triggs, B.: Histograms of oriented gradients for human detection. In: CVPR. pp. 886-893 (2005). https://doi.org/10.1109/CVPR.2005.177, http://dx. doi.org/10.1109/CVPR.2005.177  11. Doll´ar, P., Tu, Z., Perona, P., Belongie, S.: Integral channel features (2009) 12. Doll´ar, P., Wojek, C., Schiele, B., Perona, P.: Pedestrian detection: A benchmark. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on. pp. 304-311. IEEE (2009) 13. Doll´ar, P., Zitnick, C.L.: Fast  edge detection using structured forests. (2015). http://dx.doi.org/10.1109/  1558-1570  37(8),  Intell.  IEEE Trans. Pattern Anal. Mach. https://doi.org/10.1109/TPAMI.2014.2377715, TPAMI.2014.2377715  14. Du, X., El-Khamy, M., Lee, J., Davis, L.: Fused dnn: A deep neural network fusion approach to fast and robust pedestrian detection. In: Applications of Computer Vision (WACV), 2017 IEEE Winter Conference on. pp. 953-961. IEEE (2017) 15. Farfade, S.S., Saberian, M.J., Li, L.: Multi-view face detection us- ing deep convolutional neural networks. ICMR. pp. 643-650 (2015). https://doi.org/10.1145/2671188.2749408, http://doi.acm.org/10.1145/2671188. 2749408  In:  16. Felzenszwalb, P.F., Girshick, R.B., McAllester, D., Ramanan, D.: Object detection with discriminatively trained part-based models. IEEE transactions on pattern analysis and machine intelligence 32(9), 1627-1645 (2010)  17. Friedman, J., Hastie, T., Tibshirani, R., et al.: Additive logistic regression: a statis- tical view of boosting (with discussion and a rejoinder by the authors). The annals of statistics 28(2), 337-407 (2000)   Unsupervised Hard Example Mining from Videos for Object DetectionReferences  1. Abdullah Jamal, M., Li, H., Gong, B.: Deep face detector adaptation without negative transfer or catastrophic forgetting. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2018)  2. Appel, R., Fuchs, T., Doll´ar, P., Perona, P.: Quickly boosting decision trees- pruning underachieving features early. In: International Conference on Machine Learning. pp. 594-602 (2013)  3. Athalye, A., Sutskever, I.: Synthesizing robust adversarial examples. arXiv preprint  arXiv:1707.07397 (2017)  4. Blum, A., Mitchell, T.: Combining labeled and unlabeled data with co-training. In: Proceedings of the eleventh annual conference on Computational learning theory. pp. 92-100. ACM (1998)  5. Brazil, G., Yin, X., Liu, X.: Illuminating pedestrians via simultaneous detection &  segmentation. arXiv preprint arXiv:1706.08564 (2017)  6. Cai, Z., Fan, Q., Feris, R.S., Vasconcelos, N.: A unified multi-scale deep convolu- tional neural network for fast object detection. In: European Conference on Com- puter Vision. pp. 354-370. Springer (2016)  7. Cai, Z., Saberian, M., Vasconcelos, N.: Learning complexity-aware cascades for deep pedestrian detection. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 3361-3369 (2015)  8. Chang, H.S., Learned-Miller, E., McCallum, A.: Active bias: Training more accu- rate neural networks by emphasizing high variance samples. In: Advances in Neural Information Processing Systems. pp. 1003-1013 (2017)  9. Chapelle, O., Scholkopf, B., Zien, A.: Semi-supervised learning (chapelle, o. et al., eds.; 2006)[book reviews]. IEEE Transactions on Neural Networks 20(3), 542-542 (2009)  10. Dalal, N., Triggs, B.: Histograms of oriented gradients for human detection. In: CVPR. pp. 886-893 (2005). https://doi.org/10.1109/CVPR.2005.177, http://dx. doi.org/10.1109/CVPR.2005.177  11. Doll´ar, P., Tu, Z., Perona, P., Belongie, S.: Integral channel features (2009) 12. Doll´ar, P., Wojek, C., Schiele, B., Perona, P.: Pedestrian detection: A benchmark. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on. pp. 304-311. IEEE (2009) 13. Doll´ar, P., Zitnick, C.L.: Fast  edge detection using structured forests. (2015). http://dx.doi.org/10.1109/  1558-1570  37(8),  Intell.  IEEE Trans. Pattern Anal. Mach. https://doi.org/10.1109/TPAMI.2014.2377715, TPAMI.2014.2377715  14. Du, X., El-Khamy, M., Lee, J., Davis, L.: Fused dnn: A deep neural network fusion approach to fast and robust pedestrian detection. In: Applications of Computer Vision (WACV), 2017 IEEE Winter Conference on. pp. 953-961. IEEE (2017) 15. Farfade, S.S., Saberian, M.J., Li, L.: Multi-view face detection us- ing deep convolutional neural networks. ICMR. pp. 643-650 (2015). https://doi.org/10.1145/2671188.2749408, http://doi.acm.org/10.1145/2671188. 2749408  In:  16. Felzenszwalb, P.F., Girshick, R.B., McAllester, D., Ramanan, D.: Object detection with discriminatively trained part-based models. IEEE transactions on pattern analysis and machine intelligence 32(9), 1627-1645 (2010)  17. Friedman, J., Hastie, T., Tibshirani, R., et al.: Additive logistic regression: a statis- tical view of boosting (with discussion and a rejoinder by the authors). The annals of statistics 28(2), 337-407 (2000)   16  Jin et al.  18. Geman, S., Graﬃgne, C.: Markov random field image models and their applica- tions to computer vision. In: Proceedings of the international congress of mathe- maticians. vol. 1, p. 2 (1986)  19. Girshick, R.B.:  Fast R-CNN.  In:  https://doi.org/10.1109/ICCV.2015.169, 2015.169  ICCV.  pp.  (2015). http://dx.doi.org/10.1109/ICCV.  1440-1448  20. Girshick, R.B., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accurate object detection and semantic segmentation. In: CVPR. pp. 580- 587 (2014). https://doi.org/10.1109/CVPR.2014.81, http://dx.doi.org/10.1109/ CVPR.2014.81  21. He, K., Zhang, X., Ren, S., Sun, J.: Spatial pyramid pooling in deep convolutional  networks for visual recognition. In: ECCV. pp. 346-361 (2014)  22. Hosang, J., Omran, M., Benenson, R., Schiele, B.: Taking a deeper look at pedes- trians. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 4073-4082 (2015)  23. Hu, P., Ramanan, D.: Finding tiny faces. In: 2017 IEEE Conference on Computer  Vision and Pattern Recognition (CVPR). pp. 1522-1530. IEEE (2017)  24. Jain, V., Learned-Miller, E.: FDDB: A benchmark for face detection in un- constrained settings. Tech. Rep. UM-CS-2010-009, University of Massachusetts, Amherst (2010)  25. Jiang, H., Learned-Miller, E.: Face detection with the faster r-cnn. In: Automatic Face & Gesture Recognition (FG 2017), 2017 12th IEEE International Conference on. pp. 650-657. IEEE (2017)  26. Jin, S., Su, H., Stauﬀer, C., Learned-Miller, E.: End-to-end face detection and cast  grouping in movies using erdos-renyi clustering. In: ICCV (2017)  27. Kalal, Z., Matas, J., Mikolajczyk, K.: Pn learning: Bootstrapping binary classifiers by structural constraints. In: Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on. pp. 49-56. IEEE (2010)  28. Kl¨aser, A., Marsza lek, M., Schmid, C., Zisserman, A.: Human focused action lo- calization in video. In: European Conference on Computer Vision. pp. 219-233. Springer (2010)  29. Li, H., Lin, Z., Shen, X., Brandt, J., Hua, G.: A convolutional neu- In: CVPR. pp. 5325-5334 (2015). ral network cascade for face detection. https://doi.org/10.1109/CVPR.2015.7299170, http://dx.doi.org/10.1109/CVPR. 2015.7299170  30. Li, J., Liang, X., Shen, S., Xu, T., Feng, J., Yan, S.: Scale-aware fast r-cnn for  pedestrian detection. IEEE Transactions on Multimedia (2017)  31. Li, Y., Sun, B., Wu, T., Wang, Y., Gao, W.: Face detection with end-to-end in- tegration of a convnet and a 3d model. ECCV abs/1606.00850 (2016), http: //dblp.uni-trier.de/db/journals/corr/corr1606.html#LiSWW016  32. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature  pyramid networks for object detection. In: CVPR. vol. 1, p. 4 (2017)  33. Lin, T.Y., Goyal, P., Girshick, R., He, K., Doll´ar, P.: Focal loss for dense object  detection. arXiv preprint arXiv:1708.02002 (2017)  34. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd: Single shot multibox detector. In: European conference on computer vision. pp. 21-37. Springer (2016)  35. Loshchilov, I., Hutter, F.: Online batch selection for faster training of neural net-  works. arXiv preprint arXiv:1511.06343 (2015)   Unsupervised Hard Example Mining from Videos for Object Detection36. Lu, J., Sibai, H., Fabry, E., Forsyth, D.: No need to worry about adversarial exam- ples in object detection in autonomous vehicles. arXiv preprint arXiv:1707.03501 (2017)  37. Luo, Y., Boix, X., Roig, G., Poggio, T., Zhao, Q.: Foveation-based mechanisms  alleviate adversarial examples. arXiv preprint arXiv:1511.06292 (2015)  38. Ozerov, A., Vigouroux, J.R., Chevallier, L., P´erez, P.: On evaluating face tracks in movies. In: Image Processing (ICIP), 2013 20th IEEE International Conference on. pp. 3003-3007. IEEE (2013)  39. Ranjan, R., Patel, V.M., Chellappa, R.: A deep pyramid deformable part model for face detection. In: BTAS. pp. 1-8. IEEE (2015), http://dblp.uni-trier.de/db/ conf/btas/btas2015.html#RanjanPC15  40. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified, real-time object detection. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 779-788 (2016)  41. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: Towards real-time object detection with region proposal networks. IEEE Trans. Pattern Anal. Mach. Intell. (2016)  42. Ren,  S., He, K., Girshick, R.B., detection object 91-99 pp.  real-time In:  wards works. 5638-faster-r-cnn-towards-real-time-object-detection-with-region-proposal-networks  to- net- http://papers.nips.cc/paper/  Faster R-CNN:  Sun, with  proposal  (2015),  region  NIPS.  J.:  43. Rosenberg, C., Hebert, M., Schneiderman, H.: Semi-supervised self-training of ob-  ject detection models (2005)  44. Rowley, H.A., Baluja, S., Kanade, T.: Neural network-based face detection. IEEE Transactions on pattern analysis and machine intelligence 20(1), 23-38 (1998) 45. Sch¨olkopf, B., Smola, A.J.: Learning with kernels: support vector machines, regu-  larization, optimization, and beyond. MIT press (2002)  46. Shrivastava, A., Gupta, A., Girshick, R.: Training region-based object detectors with online hard example mining. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 761-769 (2016)  47. Simo-Serra, E., Trulls, E., Ferraz, L., Kokkinos, I., Moreno-Noguer, F.: Fracking  deep convolutional image descriptors. CoRR, abs/1412.6537 2 (2014)  48. Singh, K.K., Xiao, F., Lee, Y.J.: Track and transfer: Watching videos to simulate strong human supervision for weakly-supervised object detection. In: CVPR. vol. 1, p. 2 (2016)  49. Sonntag, D., Barz, M., Zacharias, J., Stauden, S., Rahmani, V., F´othi, ´A., L˝orincz, A.: Fine-tuning deep cnn models on specific ms coco categories. arXiv preprint arXiv:1709.01476 (2017)  50. Stalder, S., Grabner, H., Van Gool, L.: Cascaded confidence filtering for improved tracking-by-detection. In: European Conference on Computer Vision. pp. 369-382. Springer (2010)  51. Sun, X., Wu, P., Hoi, S.C.: Face detection using deep learning: An improved faster  rcnn approach. arXiv preprint arXiv:1701.08289 (2017)  52. Sung, K.K., Poggio, T.: Learning and example selection for object and pattern  detection (1994)  53. Sutton, C., McCallum, A.: An introduction to conditional random fields for rela- tional learning, vol. 2. Introduction to statistical relational learning. MIT Press (2006)  54. Tang, K., Ramanathan, V., Fei-Fei, L., Koller, D.: Shifting weights: Adapting ob- ject detectors from image to video. In: Advances in Neural Information Processing Systems. pp. 638-646 (2012)   18  Jin et al.  55. Wan, S., Chen, Z., Zhang, T., Zhang, B., Wong, K.k.: Bootstrapping face detection  with hard negative examples. arXiv preprint arXiv:1608.02236 (2016)  56. Wang, X., Shrivastava, A., Gupta, A.: A-fast-rcnn: Hard positive generation via  adversary for object detection (2017)  57. Wang, Y., Ji, X., Zhou, Z., Wang, H., Li, Z.: Detecting faces using region-based  fully convolutional networks. arXiv preprint arXiv:1709.05256 (2017)  58. WESTON, J.: Large-scale semi-supervised learning 59. Yang, B., Nevatia, R.: An online learned crf model for multi-target tracking. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on. pp. 2034-2041. IEEE (2012)  60. Yang, S., Luo, P., Loy, C.C., Tang, X.: From facial parts  responses to 3676- 3684 (2015). https://doi.org/10.1109/ICCV.2015.419, http://dx.doi.org/10.1109/ ICCV.2015.419  face detection: A deep learning  ICCV. pp.  approach.  In:  61. Yang, S., Luo, P., Loy, C.C., Tang, X.: WIDER FACE: A face detection benchmark.  In: CVPR (2016)  62. Yu, J., Jiang, Y., Wang, Z., Cao, Z., Huang, T.: Unitbox: An advanced object detection network. In: Proceedings of the 2016 ACM on Multimedia Conference. pp. 516-520. ACM (2016)  63. Zhang, K., Zhang, Z., Li, Z., Qiao, Y.: Joint face detection and alignment using multitask cascaded convolutional networks. IEEE Signal Processing Letters 23(10), 1499-1503 (2016)  64. Zhang, L., Lin, L., Liang, X., He, K.: Is faster r-cnn doing well for pedestrian detection? In: European Conference on Computer Vision. pp. 443-457. Springer (2016)  65. Zhang, S., Benenson, R., Omran, M., Hosang, J., Schiele, B.: How far are we from solving pedestrian detection? In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1259-1267 (2016)  66. Zhang, S., Zhu, X., Lei, Z., Shi, H., Wang, X., Li, S.Z.: S3fd: Single shot scale-  invariant face detector. arXiv preprint arXiv:1708.05237 (2017)  67. Zitnick, C.L., Doll´ar, P.: Edge boxes: Locating object proposals from edges. In:  European Conference on Computer Vision. pp. 391-405. Springer (2014)"}