{"1": "1. Zhang, X., Sugano, Y., Bulling, A.: Everyday eye contact detection using unsuper- vised gaze target discovery. In: Proc. of the ACM Symposium on User Interface Software and Technology (UIST). (2017) 193-203  2. Sugano, Y., Zhang, X., Bulling, A.: Aggregaze: Collective estimation of audience attention on public displays. In: Proc. of the ACM Symposium on User Interface Software and Technology (UIST). (2016) 821-831  3. Sun, X., Yao, H., Ji, R., Liu, X.M.: Toward statistical modeling of saccadic eye- Image Processing IEEE Transactions on 23(11)  movement and visual saliency. (2014) 4649  4. Cheng, Q., Agrafiotis, D., Achim, A., Bull, D.: Gaze location prediction for broad- cast football video. IEEE Transactions on Image Processing 22(12) (2013) 4918- 4929  5. Hansen, D., Ji, Q.: In the eye of the beholder: A survey of models for eyes and  gaze. IEEE Trans. on PAMI 32(3) (2010) 478-500  6. Zhang, X., Sugano, Y., Fritz, M., Bulling, A.: Appearance-based gaze estimation in the wild. In: IEEE Conference on Computer Vision and Pattern Recognition. (2015) 4511-4520  7. Zhu, W., Deng, H.: Monocular free-head 3d gaze tracking with deep learning and geometry constraints. In: The IEEE International Conference on Computer Vision (ICCV). (2017)  8. Lepetit, V., Moreno-Noguer, F., Fua, P.: Epnp: An accurate o(n) solution to the  pnp problem. International Journal of Computer Vision 81(2) (2008) 155  9. Morimoto, C., Mimica, M.: Eye gaze tracking techniques for interactive applica-  tions. CVIU 98(1) (2005) 4-24  10. Guestrin, E., Eizenman, M.: General theory of remote gaze estimation using the pupil center and corneal reﬂections. IEEE Trans. on Biomedical Engineering 53(6) (2006) 1124-1133  11. Zhu, Z., Ji, Q.: Novel eye gaze tracking techniques under natural head movement.  IEEE Transactions on Biomedical Engineering 54(12) (2007) 2246 -2260  12. Nakazawa, A., Nitschke, C.: Point of gaze estimation through corneal surface reﬂection in an active illumination environment. In: ECCV. (2012) 159-172 13. Valenti, R., Sebe, N., Gevers, T.: Combining head pose and eye location informa- tion for gaze estimation. IEEE Transactions on Image Processing A Publication of the IEEE Signal Processing Society 21(2) (2012) 802-815  14. Jeni, L.A., Cohn, J.F.: Person-independent 3d gaze estimation using face frontal- ization. In: Computer Vision and Pattern Recognition Workshops. (2016) 792-800 15. Funes Mora, K.A., Odobez, J.M.: Geometric generative gaze estimation (g3e) for remote rgb-d cameras. In: IEEE Computer Vision and Pattern Recognition Conference. (2014) 1773-1780  16. Xiong, X., Liu, Z., Cai, Q., Zhang, Z.: Eye gaze tracking using an rgbd camera: a comparison with a rgb solution. The 4th International Workshop on Pervasive Eye Tracking and Mobile Eye-Based Interaction (PETMEI 2014) (2014) 1113-1121 17. Wang, K., Ji, Q.: Real time eye gaze tracking with 3d deformable eye-face model. In: The IEEE International Conference on Computer Vision (ICCV). (2017) 18. Duchowski, A.T.: A breadth-first survey of eye-tracking applications. Behavior  Research Methods Instruments & Computers 34(4) (2002) 455-470  19. Tan, K., Kriegman, D., Ahuja, N.: Appearance-based eye gaze estimation.  In:  WACV. (2002) 191-195   15  References  1. Zhang, X., Sugano, Y., Bulling, A.: Everyday eye contact detection using unsuper- vised gaze target discovery. In: Proc. of the ACM Symposium on User Interface Software and Technology (UIST). (2017) 193-203  2. Sugano, Y., Zhang, X., Bulling, A.: Aggregaze: Collective estimation of audience attention on public displays. In: Proc. of the ACM Symposium on User Interface Software and Technology (UIST). (2016) 821-831  3. Sun, X., Yao, H., Ji, R., Liu, X.M.: Toward statistical modeling of saccadic eye- Image Processing IEEE Transactions on 23(11)  movement and visual saliency. (2014) 4649  4. Cheng, Q., Agrafiotis, D., Achim, A., Bull, D.: Gaze location prediction for broad- cast football video. IEEE Transactions on Image Processing 22(12) (2013) 4918- 4929  5. Hansen, D., Ji, Q.: In the eye of the beholder: A survey of models for eyes and  gaze. IEEE Trans. on PAMI 32(3) (2010) 478-500  6. Zhang, X., Sugano, Y., Fritz, M., Bulling, A.: Appearance-based gaze estimation in the wild. In: IEEE Conference on Computer Vision and Pattern Recognition. (2015) 4511-4520  7. Zhu, W., Deng, H.: Monocular free-head 3d gaze tracking with deep learning and geometry constraints. In: The IEEE International Conference on Computer Vision (ICCV). (2017)  8. Lepetit, V., Moreno-Noguer, F., Fua, P.: Epnp: An accurate o(n) solution to the  pnp problem. International Journal of Computer Vision 81(2) (2008) 155  9. Morimoto, C., Mimica, M.: Eye gaze tracking techniques for interactive applica-  tions. CVIU 98(1) (2005) 4-24  10. Guestrin, E., Eizenman, M.: General theory of remote gaze estimation using the pupil center and corneal reﬂections. IEEE Trans. on Biomedical Engineering 53(6) (2006) 1124-1133  11. Zhu, Z., Ji, Q.: Novel eye gaze tracking techniques under natural head movement.  IEEE Transactions on Biomedical Engineering 54(12) (2007) 2246 -2260  12. Nakazawa, A., Nitschke, C.: Point of gaze estimation through corneal surface reﬂection in an active illumination environment. In: ECCV. (2012) 159-172 13. Valenti, R., Sebe, N., Gevers, T.: Combining head pose and eye location informa- tion for gaze estimation. IEEE Transactions on Image Processing A Publication of the IEEE Signal Processing Society 21(2) (2012) 802-815  14. Jeni, L.A., Cohn, J.F.: Person-independent 3d gaze estimation using face frontal- ization. In: Computer Vision and Pattern Recognition Workshops. (2016) 792-800 15. Funes Mora, K.A., Odobez, J.M.: Geometric generative gaze estimation (g3e) for remote rgb-d cameras. In: IEEE Computer Vision and Pattern Recognition Conference. (2014) 1773-1780  16. Xiong, X., Liu, Z., Cai, Q., Zhang, Z.: Eye gaze tracking using an rgbd camera: a comparison with a rgb solution. The 4th International Workshop on Pervasive Eye Tracking and Mobile Eye-Based Interaction (PETMEI 2014) (2014) 1113-1121 17. Wang, K., Ji, Q.: Real time eye gaze tracking with 3d deformable eye-face model. In: The IEEE International Conference on Computer Vision (ICCV). (2017) 18. Duchowski, A.T.: A breadth-first survey of eye-tracking applications. Behavior  Research Methods Instruments & Computers 34(4) (2002) 455-470  19. Tan, K., Kriegman, D., Ahuja, N.: Appearance-based eye gaze estimation.  In:  WACV. (2002) 191-195   16  Y. Cheng, F. Lu and X. Zhang  20. Baluja, S., Pomerleau, D.: Non-Intrusive Gaze Tracking Using Artificial Neural  Networks. Carnegie Mellon University (1994)  21. Xu, L.Q., Machin, D., Sheppard, P.: A novel approach to real-time non-intrusive  gaze finding. In: BMVC. (1998) 428-437  22. Lu, F., Sugano, Y., Okabe, T., Sato, Y.: Adaptive linear regression for appearance- based gaze estimation. Pattern Analysis and Machine Intelligence, IEEE Transac- tions on 36(10) (2014) 2033-2046  23. Williams, O., Blake, A., Cipolla, R.: Sparse and semi-supervised visual mapping  with the S3GP. In: CVPR. (2006) 230-237  24. Schneider, T., Schauerte, B., Stiefelhagen, R.: Manifold alignment for person inde- pendent appearance-based gaze estimation. In: International Conference on Pat- tern Recognition (ICPR). (2014) 1167-1172  25. Lu, F., Chen, X., Sato, Y.: Appearance-based gaze estimation via uncalibrated gaze pattern recovery. IEEE Transactions on Image Processing 26(4) (2017) 1543-1553 26. Sugano, Y., Matsushita, Y., Sato, Y., Koike, H.: Appearance-based gaze estimation IEEE Transactions on Human-  with online calibration from mouse operations. Machine Systems 45(6) (2015) 750-760  27. Mora, K.A.F., Monay, F., Odobez, J.M.: Eyediap:a database for the development and evaluation of gaze estimation algorithms from rgb and rgb-d cameras. In: Symposium on Eye Tracking Research and Applications. (2014) 255-258  28. Wood, E., Morency, L.P., Robinson, P., Bulling, A.: Learning an appearance-based gaze estimator from one million synthesised images. In: Biennial ACM Symposium on Eye Tracking Research & Applications. (2016) 131-138  29. Krafka, K., Khosla, A., Kellnhofer, P., Kannan, H., Bhandarkar, S., Matusik, W., Torralba, A.: Eye tracking for everyone. In: Computer Vision and Pattern Recog- nition. (2016) 2176-2184  30. Zhang, X., Sugano, Y., Fritz, M., Bulling, A.: Its written all over your face: Full-face appearance-based gaze estimation. In: Proc. of the IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW). (2017)  31. Lu, F., Sugano, Y., Okabe, T., Sato, Y.: Head pose-free appearance-based gaze sensing via eye image synthesis. In: International Conference on Pattern Recogni- tion. (2012) 1008-1011  32. Sugano, Y., Matsushita, Y., Sato, Y.: Appearance-based gaze estimation using IEEE Transactions on Pattern Analysis & Machine Intelligence  visual saliency. 35(2) (2013) 329  33. Krizhevsky, A., Sutskever, I., Hinton, G.E.:  Imagenet classification with deep In: Advances in Neural Information Processing  convolutional neural networks. Systems. (2012)  34. Sugano, Y., Matsushita, Y., Sato, Y.: Learning-by-synthesis for appearance-based 3d gaze estimation. In: Computer Vision and Pattern Recognition. (2014) 1821- 1828"}