{"1": "1. Blum, A., Laﬀerty, J., Rwebangira, M.R., Reddy, R.: Semi-supervised learning us- ing randomized mincuts. In: International Conference on Machine Learning (2004) 2. Blum, A., Mitchell, T.: Combining labeled and unlabeled data with co-training. In: Proceedings of the eleventh annual conference on Computational learning theory. ACM (1998)  3. Chapelle, O., Zien, A., Ghahramani, C.Z., et al.: Semi-supervised classification by low density separation. In: Tenth International Workshop on Artificial Intelligence and Statistics (2005)  4. Chapelle, O., Schlkopf, B., Zien, A.: Semi-supervised learning. The MIT Press  (2010)  5. Dumoulin, V., Belghazi, I., Poole, B., Lamb, A., Arjovsky, M., Mastropietro, O., Courville, A.: Adversarially learned inference. In: International Conference on Learning Representation (2017)  6. Fergus, R., Weiss, Y., Torralba, A.: Semi-supervised learning in gigantic image  collections. In: Advances in Neural Information Processing Systems (2009)  7. Ginsburg, H.P., Opper, S.: Piaget’s theory of intellectual development. Prentice-  Hall, Inc (1988)  8. Grandvalet, Y., Bengio, Y.: Semi-supervised learning by entropy minimization. In:  Advances in Neural Information Processing Systems (2005)  9. Haeusser, P., Mordvintsev, A., Cremers, D.: Learning by association-a versatile semi-supervised training method for neural networks. In: IEEE Conference on Computer Vision and Pattern Recognition (2017)  10. Joachims, T.: Transductive inference for text classification using support vector  machines. In: International Conference on Machine Learning (1999)  11. Kaiser,  L., Nachum, O., Roy, A., Bengio, S.: Learning to remember rare events.  In: International Conference on Learning Representation (2017)  12. Kingma, D.P., Mohamed, S., Rezende, D.J., Welling, M.: Semi-supervised learn- ing with deep generative models. In: Advances in Neural Information Processing Systems (2014)  13. Krizhevsky, A., Hinton, G.: Learning multiple layers of features from tiny images.  Technical report, University of Toronto (2009)  14. Laine, S., Aila, T.: Temporal ensembling for semi-supervised learning. In: Interna-  tional Conference on Learning Representation (2017)  15. Lee, D.H.: Pseudo-label: The simple and eﬃcient semi-supervised learning method for deep neural networks. In: ICML Workshop on Challenges in Representation Learning (2013)  16. Maaløe, L., Sønderby, C.K., Sønderby, S.K., Winther, O.: Auxiliary deep generative  models. In: International Conference on Machine Learning (2016)  17. Maaten, L.v.d., Hinton, G.: Visualizing data using t-sne. The Journal of Machine  Learning Research (2008)  18. Miller, A., Fisch, A., Dodge, J., Karimi, A.H., Bordes, A., Weston, J.: Key-value memory networks for directly reading documents. In: Proceedings of the 2016 Con- ference on Empirical Methods in Natural Language Processing (2016)  19. Miyato, T., Maeda, S.i., Koyama, M., Nakae, K., Ishii, S.: Distributional smoothing with virtual adversarial training. In: International Conference on Learning Repre- sentation (2016)  20. Netzer, Y., Wang, T., Coates, A., Bissacco, A., Wu, B., Ng, A.Y.: Reading digits in natural images with unsupervised feature learning. In: NIPS workshop on deep learning and unsupervised feature learning (2011)   Semi-Supervised Deep Learning with MemoryReferences  1. Blum, A., Laﬀerty, J., Rwebangira, M.R., Reddy, R.: Semi-supervised learning us- ing randomized mincuts. In: International Conference on Machine Learning (2004) 2. Blum, A., Mitchell, T.: Combining labeled and unlabeled data with co-training. In: Proceedings of the eleventh annual conference on Computational learning theory. ACM (1998)  3. Chapelle, O., Zien, A., Ghahramani, C.Z., et al.: Semi-supervised classification by low density separation. In: Tenth International Workshop on Artificial Intelligence and Statistics (2005)  4. Chapelle, O., Schlkopf, B., Zien, A.: Semi-supervised learning. The MIT Press  (2010)  5. Dumoulin, V., Belghazi, I., Poole, B., Lamb, A., Arjovsky, M., Mastropietro, O., Courville, A.: Adversarially learned inference. In: International Conference on Learning Representation (2017)  6. Fergus, R., Weiss, Y., Torralba, A.: Semi-supervised learning in gigantic image  collections. In: Advances in Neural Information Processing Systems (2009)  7. Ginsburg, H.P., Opper, S.: Piaget’s theory of intellectual development. Prentice-  Hall, Inc (1988)  8. Grandvalet, Y., Bengio, Y.: Semi-supervised learning by entropy minimization. In:  Advances in Neural Information Processing Systems (2005)  9. Haeusser, P., Mordvintsev, A., Cremers, D.: Learning by association-a versatile semi-supervised training method for neural networks. In: IEEE Conference on Computer Vision and Pattern Recognition (2017)  10. Joachims, T.: Transductive inference for text classification using support vector  machines. In: International Conference on Machine Learning (1999)  11. Kaiser,  L., Nachum, O., Roy, A., Bengio, S.: Learning to remember rare events.  In: International Conference on Learning Representation (2017)  12. Kingma, D.P., Mohamed, S., Rezende, D.J., Welling, M.: Semi-supervised learn- ing with deep generative models. In: Advances in Neural Information Processing Systems (2014)  13. Krizhevsky, A., Hinton, G.: Learning multiple layers of features from tiny images.  Technical report, University of Toronto (2009)  14. Laine, S., Aila, T.: Temporal ensembling for semi-supervised learning. In: Interna-  tional Conference on Learning Representation (2017)  15. Lee, D.H.: Pseudo-label: The simple and eﬃcient semi-supervised learning method for deep neural networks. In: ICML Workshop on Challenges in Representation Learning (2013)  16. Maaløe, L., Sønderby, C.K., Sønderby, S.K., Winther, O.: Auxiliary deep generative  models. In: International Conference on Machine Learning (2016)  17. Maaten, L.v.d., Hinton, G.: Visualizing data using t-sne. The Journal of Machine  Learning Research (2008)  18. Miller, A., Fisch, A., Dodge, J., Karimi, A.H., Bordes, A., Weston, J.: Key-value memory networks for directly reading documents. In: Proceedings of the 2016 Con- ference on Empirical Methods in Natural Language Processing (2016)  19. Miyato, T., Maeda, S.i., Koyama, M., Nakae, K., Ishii, S.: Distributional smoothing with virtual adversarial training. In: International Conference on Learning Repre- sentation (2016)  20. Netzer, Y., Wang, T., Coates, A., Bissacco, A., Wu, B., Ng, A.Y.: Reading digits in natural images with unsupervised feature learning. In: NIPS workshop on deep learning and unsupervised feature learning (2011)   16  Y. Chen, X. Zhu, S. Gong  21. Nigam, K., Ghani, R.: Analyzing the eﬀectiveness and applicability of co-training. In: Proceedings of the ninth international conference on Information and knowledge management. ACM (2000)  22. Pereyra, G., Tucker, G., Chorowski, J., Kaiser,  L., Hinton, G.: Regularizing neural networks by penalizing confident output distributions. In: International Conference on Learning Representation (2017)  23. Ranzato, M., Szummer, M.: Semi-supervised learning of compact document repre- sentations with deep networks. In: International Conference on Machine Learning (2008)  24. Rasmus, A., Berglund, M., Honkala, M., Valpola, H., Raiko, T.: Semi-supervised learning with ladder networks. In: Advances in Neural Information Processing Sys- tems (2015)  25. Rosenberg, C., Hebert, M., Schneiderman, H.: Semi-supervised self-training of ob- ject detection models. In: Seventh IEEE Workshop on Applications of Computer Vision. Citeseer (2005)  26. Sajjadi, M., Javanmardi, M., Tasdizen, T.: Regularization with stochastic trans- formations and perturbations for deep semi-supervised learning. In: Advances in Neural Information Processing Systems (2016)  27. Salimans, T., Goodfellow, I., Zaremba, W., Cheung, V., Radford, A., Chen, X.: Im- proved techniques for training gans. In: Advances in Neural Information Processing Systems (2016)  28. Santoro, A., Bartunov, S., Botvinick, M., Wierstra, D., Lillicrap, T.: Meta-learning with memory-augmented neural networks. In: International Conference on Machine Learning (2016)  29. Shi, M., Zhang, B.: Semi-supervised learning improves gene expression-based pre-  diction of cancer recurrence. Bioinformatics 27(21) (2011)  30. Springenberg, J.T.: Unsupervised and semi-supervised learning with categorical generative adversarial networks. In: International Conference on Learning Repre- sentation (2016)  31. Sukhbaatar, S., Weston, J., Fergus, R., et al.: End-to-end memory networks. In:  Advances in Neural Information Processing Systems (2015)  32. Tarvainen, A., Valpola, H.: Mean teachers are better role models: Weight-averaged consistency targets improve semi-supervised deep learning results. In: Advances in Neural Information Processing Systems (2017)  33. Wen, Y., Zhang, K., Li, Z., Qiao, Y.: A discriminative feature learning approach for deep face recognition. In: European Conference on Computer Vision (2016) 34. Weston, J., Chopra, S., Bordes, A.: Memory networks. In: International Conference  on Learning Representation (2014)  35. Weston, J., Ratle, F., Mobahi, H., Collobert, R.: Deep learning via semi-supervised  embedding. In: International Conference on Machine Learning (2008)  36. Zhou, D., Bousquet, O., Lal, T.N., Weston, J., Sch¨olkopf, B.: Learning with local and global consistency. In: Advances in Neural Information Processing Systems (2004)  37. Zhu, X.: Semi-supervised learning literature survey. Computer Science, University  of Wisconsin-Madison 2(3), 4 (2006)  38. Zhu, X., Ghahramani, Z.: Learning from labeled and unlabeled data with label propagation. Technical Report CMU-CALD-02-107, Carnegie Mellon University (2002)  39. Zhu, X., Ghahramani, Z., Laﬀerty, J.D.: Semi-supervised learning using gaussian fields and harmonic functions. In: International Conference on Machine Learning (2003)"}