{"1": "1. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., Kudlur, M., Levenberg, J., Monga, R., Moore, S., Murray, D., Steiner, B., Tucker, P., Vasudevan, V., Warden, P., Wicke, M., Yu, Y., Zheng, X.: TensorFlow: Large-scale machine learning on heterogeneous systems. In: OSDI (2016)  2. Bhagavatula, C., Zhu, C., Luu, K., Savvides, M.: Faster Than Real-time Facial Alignment: A 3D Spatial Transformer Network Approach in Unconstrained Poses. In: ICCV (2017)  3. Bibby, C., Reid, I.: Robust Real-Time Visual Tracking using Pixel-Wise Posteriors.  In: ECCV (2008)  4. Brachmann, E., Krull, A., Michel, F., Gumhold, S., Shotton, J., Rother, C.: Learn- ing 6D Object Pose Estimation using 3D Object Coordinates. In: ECCV (2014) 5. Brachmann, E., Michel, F., Krull, A., Yang, M.Y., Gumhold, S., Rother, C.: Uncertainty-Driven 6D Pose Estimation of Objects and Scenes from a Single RGB Image. In: CVPR (2016)  6. Brox, T., Rosenhahn, B., Gall, J., Cremers, D.: Combined Region and Motion-  Based 3D Tracking of Rigid and Articulated Objects. TPAMI (2010)  7. Choi, C., Christensen, H.: RGB-D Object Tracking: A Particle Filter Approach on  GPU. In: IROS (2013)  8. Dambreville, S., Sandhu, R., Yezzi, A., Tannenbaum, A.: A Geometric Approach to Joint 2D Region-Based Segmentation and 3D Pose Estimation Using a 3D Shape Prior. SIAM Journal on Imaging Sciences (2010)  9. Drummond, T., Cipolla, R.: Real-time visual tracking of complex structures.  TPAMI (2002)  10. Garon, M., Lalonde, J.F.: Deep 6-DOF Tracking. In: ISMAR (2017) 11. Hexner, J., Hagege, R.R.: 2D-3D Pose Estimation of Heterogeneous Objects Using  a Region Based Approach. IJCV (2016)  12. Hinterstoisser, S., Lepetit, V., Ilic, S., Holzer, S., Bradski, G., Konolige, K., Navab, N.: Model based training, detection and pose estimation of texture-less 3D objects in heavily cluttered scenes. In: ACCV (2012)  13. Hinterstoisser, S., Lepetit, V., Wohlhart, P., Konolige, K.: On pre-trained image  features and synthetic images for deep learning. CoRR (2017)  14. Hodan, T., Matas, J., Obdrzalek, S.: On Evaluation of 6D Object Pose Estimation.  In: ECCV Workshop (2016)  15. Holloway, R.L.: Registration error analysis for augmented reality. Presence:  Teleoper. Virtual Environ. 6(4), 413-432 (Aug 1997)  16. Jaderberg, M., Simonyan, K., Zisserman, A., Kavukcuoglu, K.: Spatial Transformer  Networks. In: NIPS (2015)  17. Kehl, W., Manhardt, F., Ilic, S., Tombari, F., Navab, N.: SSD-6D: Making RGB- Based 3D Detection and 6D Pose Estimation Great Again. In: ICCV (2017) 18. Kehl, W., Tombari, F., Ilic, S., Navab, N.: Real-Time 3D Model Tracking in Color  and Depth on a Single CPU Core. In: CVPR (2017)  19. Kendall, A., Cipolla, R.: Geometric loss functions for camera pose regression with  deep learning. In: CVPR (2017)  20. Kendall, A., Grimes, M., Cipolla, R.: PoseNet: A Convolutional Network for Real-  Time 6-DOF Camera Relocalization. In: ICCV (2015)  21. Krull, A., Michel, F., Brachmann, E., Gumhold, S., Ihrke, S., Rother, C.: 6-DOF Model Based Tracking via Object Coordinate Regression. In: ACCV (2014)   Deep Model-Based 6D Pose Refinement in RGBReferences  1. Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghe- mawat, S., Irving, G., Isard, M., Kudlur, M., Levenberg, J., Monga, R., Moore, S., Murray, D., Steiner, B., Tucker, P., Vasudevan, V., Warden, P., Wicke, M., Yu, Y., Zheng, X.: TensorFlow: Large-scale machine learning on heterogeneous systems. In: OSDI (2016)  2. Bhagavatula, C., Zhu, C., Luu, K., Savvides, M.: Faster Than Real-time Facial Alignment: A 3D Spatial Transformer Network Approach in Unconstrained Poses. In: ICCV (2017)  3. Bibby, C., Reid, I.: Robust Real-Time Visual Tracking using Pixel-Wise Posteriors.  In: ECCV (2008)  4. Brachmann, E., Krull, A., Michel, F., Gumhold, S., Shotton, J., Rother, C.: Learn- ing 6D Object Pose Estimation using 3D Object Coordinates. In: ECCV (2014) 5. Brachmann, E., Michel, F., Krull, A., Yang, M.Y., Gumhold, S., Rother, C.: Uncertainty-Driven 6D Pose Estimation of Objects and Scenes from a Single RGB Image. In: CVPR (2016)  6. Brox, T., Rosenhahn, B., Gall, J., Cremers, D.: Combined Region and Motion-  Based 3D Tracking of Rigid and Articulated Objects. TPAMI (2010)  7. Choi, C., Christensen, H.: RGB-D Object Tracking: A Particle Filter Approach on  GPU. In: IROS (2013)  8. Dambreville, S., Sandhu, R., Yezzi, A., Tannenbaum, A.: A Geometric Approach to Joint 2D Region-Based Segmentation and 3D Pose Estimation Using a 3D Shape Prior. SIAM Journal on Imaging Sciences (2010)  9. Drummond, T., Cipolla, R.: Real-time visual tracking of complex structures.  TPAMI (2002)  10. Garon, M., Lalonde, J.F.: Deep 6-DOF Tracking. In: ISMAR (2017) 11. Hexner, J., Hagege, R.R.: 2D-3D Pose Estimation of Heterogeneous Objects Using  a Region Based Approach. IJCV (2016)  12. Hinterstoisser, S., Lepetit, V., Ilic, S., Holzer, S., Bradski, G., Konolige, K., Navab, N.: Model based training, detection and pose estimation of texture-less 3D objects in heavily cluttered scenes. In: ACCV (2012)  13. Hinterstoisser, S., Lepetit, V., Wohlhart, P., Konolige, K.: On pre-trained image  features and synthetic images for deep learning. CoRR (2017)  14. Hodan, T., Matas, J., Obdrzalek, S.: On Evaluation of 6D Object Pose Estimation.  In: ECCV Workshop (2016)  15. Holloway, R.L.: Registration error analysis for augmented reality. Presence:  Teleoper. Virtual Environ. 6(4), 413-432 (Aug 1997)  16. Jaderberg, M., Simonyan, K., Zisserman, A., Kavukcuoglu, K.: Spatial Transformer  Networks. In: NIPS (2015)  17. Kehl, W., Manhardt, F., Ilic, S., Tombari, F., Navab, N.: SSD-6D: Making RGB- Based 3D Detection and 6D Pose Estimation Great Again. In: ICCV (2017) 18. Kehl, W., Tombari, F., Ilic, S., Navab, N.: Real-Time 3D Model Tracking in Color  and Depth on a Single CPU Core. In: CVPR (2017)  19. Kendall, A., Cipolla, R.: Geometric loss functions for camera pose regression with  deep learning. In: CVPR (2017)  20. Kendall, A., Grimes, M., Cipolla, R.: PoseNet: A Convolutional Network for Real-  Time 6-DOF Camera Relocalization. In: ICCV (2015)  21. Krull, A., Michel, F., Brachmann, E., Gumhold, S., Ihrke, S., Rother, C.: 6-DOF Model Based Tracking via Object Coordinate Regression. In: ACCV (2014)   16  F. Manhardt, W. Kehl, N. Navab and F. Tombari  22. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.y., Berg, A.C.: SSD  : Single Shot MultiBox Detector. In: ECCV (2016)  23. Park, Y., Lepetit, V.: Multiple 3d object tracking for augmented reality. In: ISMAR  (2008)  24. Pauwels, K., Rubio, L., Diaz, J., Ros, E.: Real-time model-based rigid object pose estimation and tracking combining dense and sparse visual cues. In: CVPR (2013) 25. Pavlakos, G., Zhou, X., Chan, A., Derpanis, K.G., Daniilidis, K.: 6-DoF Object  Pose from Semantic Keypoints. In: ICRA (2017)  26. Prisacariu, V.A., Murray, D.W., Reid, I.D.: Real-Time 3D Tracking and Recon-  struction on Mobile Phones. TVCG (2015)  27. Prisacariu, V.A., Reid, I.D.: PWP3D: Real-Time Segmentation and Tracking of  3D Objects. IJCV (2012)  28. Rad, M., Lepetit, V.: BB8: A scalable, accurate, robust to partial occlusion method for predicting the 3d poses of challenging objects without using depth. In: ICCV. pp. 3848-3856 (2017)  29. Rosenhahn, B., Brox, T., Cremers, D., Seidel, H.P.: A comparison of shape match-  ing methods for contour based pose estimation. LNCS (2006)  30. Schmaltz, C., Rosenhahn, B., Brox, T., Cremers, D., Weickert, J., Wietzke, L.,  Sommer, G.: Region-Based Pose Tracking. In: IbPRIA (2007)  31. Schmaltz, C., Rosenhahn, B., Brox, T., Weickert, J.: Region-based pose tracking  with occlusions using 3D models. MVA (2012)  32. Seo, B.K., Park, H., Park, J.I., Hinterstoisser, S., Ilic, S.: Optimal local searching for fast and robust textureless 3D object tracking in highly cluttered backgrounds. In: TVCG (2014)  33. Szegedy, C., Ioﬀe, S., Vanhoucke, V., Alemi, A.A.: Inception-v4, inception-resnet and the impact of residual connections on learning. In: ICLR Workshop (2016) 34. Tan, D.J., Tombari, F., Ilic, S., Navab, N.: A Versatile Learning-based 3D Temporal  Tracker : Scalable , Robust , Online. In: ICCV (2015)  35. Tateno, K., Kotake, D., Uchiyama, S.: Model-based 3D Object Tracking with On-  line Texture Update. In: MVA (2009)  36. Tejani, A., Tang, D., Kouskouridas, R., Kim, T.k.: Latent-class hough forests for  3D object detection and pose estimation. In: ECCV (2014)  37. Tjaden, H., Schwanecke, U., Schoemer, E.: Real-Time Monocular Segmentation  and Pose Tracking of Multiple Objects. In: ECCV (2016)  38. Tjaden, H., Schwanecke, U., Sch¨omer, E.: Real-Time Monocular Pose Estimation of 3D Objects using Temporally Consistent Local Color Histograms. In: ICCV (2017)  39. Ummenhofer, B., Zhou, H., Uhrig, J., Mayer, N., Ilg, E., Dosovitskiy, A., Brox, T.: DeMoN: Depth and Motion Network for Learning Monocular Stereo. In: CVPR (2017)  40. Vacchetti, L., Lepetit, V., Fua, P.: Stable Real-Time 3D Tracking Using Online  and Oﬄine Information. TPAMI (2004)  41. Wang, S., Clark, R., Wen, H., Trigoni, N.: DeepVO: Towards End to End Visual Odometry with Deep Recurrent Convolutional Neural Networks. In: ICRA (2017) 42. Wu, J., Xue, T., Lim, J.J., Tian, Y., Tenenbaum, J.B., Torralba, A., Freeman,  W.T.: Single Image 3D Interpreter Network. In: ECCV (2016)  43. Zhou, T., Brown, M., Snavely, N., Lowe, D.G.: Unsupervised Learning of Depth  and Ego-Motion from Video. In: CVPR (2017)"}