{"1": "1. Zhu, L., Fu, C.W., Brown, M.S., Heng, P.A.: A non-local low-rank framework for  ultrasound speckle reduction. In: CVPR. (2017) 5650-5658 1  2. Granados, M., Kim, K., Tompkin, J., Theobalt, C.: Automatic noise modeling for  ghost-free hdr reconstruction. ACM Trans. Graph. 32(6) (2013) 1-10 1  3. Nguyen, A., Yosinski, J., Clune, J.: Deep neural networks are easily fooled: High confidence predictions for unrecognizable images. In: CVPR. (2015) 427-436 1 4. Elad, M., Aharon, M.: Image denoising via sparse and redundant representations over learned dictionaries. IEEE Transactions on Image Processing 15(12) (2006) 3736-3745 1, 2, 3, 4  5. Mairal, J., Elad, M., Sapiro, G.: Sparse representation for color image restoration.  IEEE Transactions on Image Processing, 17(1) (2008) 53-69 1, 2, 3, 4  6. Buades, A., Coll, B., Morel, J.M.: A non-local algorithm for image denoising. In:  CVPR. (2005) 60-65 1, 2, 4  7. Dabov, K., Foi, A., Katkovnik, V., Egiazarian, K.: Image denoising by sparse 3-D transform-domain collaborative filtering. IEEE Transactions on Image Processing 16(8) (2007) 2080-2095 1, 2, 4, 10  8. Dabov, K., Foi, A., Katkovnik, V., Egiazarian, K.: Color image denoising via sparse 3D collaborative filtering with grouping constraint in luminance-chrominance space. In: ICIP, IEEE (2007) 313-316 1, 2, 4, 11  9. Dabov, K., Foi, A., Katkovnik, V., Egiazarian, K.: Bm3d image denoising with  shape-adaptive principal component analysis. In: SPARS. (2009) 1, 2, 4, 10 10. Mairal, J., Bach, F., Ponce, J., Sapiro, G., Zisserman, A.: Non-local sparse models  for image restoration. In: ICCV. (2009) 2272-2279 1, 2, 3, 4, 10  11. Dong, W., Zhang, L., Shi, G., Li, X.: Nonlocally centralized sparse representation for image restoration. IEEE Transactions on Image Processing 22(4) (2013) 1620- 1630 1, 2, 3, 4, 10  12. Dong, W., Shi, G., Li, X.: Nonlocal image restoration with bilateral variance estimation: A low-rank approach. IEEE Transactions on Image Processing 22(2) (2013) 700-711 1, 2, 4  13. Gu, S., Zhang, L., Zuo, W., Feng, X.: Weighted nuclear norm minimization with application to image denoising. In: CVPR, IEEE (2014) 2862-2869 1, 2, 4, 10 14. Xu, J., Zhang, L., Zuo, W., Zhang, D., Feng, X.: Patch group based nonlocal self-similarity prior learning for image denoising. In ICCV (2015) 244-252 1, 2, 3, 4  15. Roth, S., Black, M.J.: Fields of experts. International Journal of Computer Vision  82(2) (2009) 205-229 1, 2, 4  16. Zoran, D., Weiss, Y.: From learning models of natural image patches to whole  image restoration. In: ICCV. (2011) 479-486 1, 2, 4  17. Burger, H.C., Schuler, C.J., Harmeling, S.:  Image denoising: Can plain neural  networks compete with BM3D? In CVPR (2012) 2392-2399 1, 2  18. Schmidt, U., Roth, S.: Shrinkage fields for eﬀective image restoration. In: CVPR.  (June 2014) 2774-2781 1, 2  19. Chen, Y., Yu, W., Pock, T.: On learning optimized reaction diﬀusion processes for  eﬀective image restoration. In CVPR (2015) 5261-5269 1, 2, 10, 11  20. Zhang, K., Zuo, W., Chen, Y., Meng, D., Zhang, L.: Beyond a Gaussian denoiser: Residual learning of deep cnn for image denoising. IEEE Transactions on Image Processing (2017) 1, 2, 10, 11   Trilateral Weighted Sparse Coding Scheme for Real-World Image DenoisingReferences  1. Zhu, L., Fu, C.W., Brown, M.S., Heng, P.A.: A non-local low-rank framework for  ultrasound speckle reduction. In: CVPR. (2017) 5650-5658 1  2. Granados, M., Kim, K., Tompkin, J., Theobalt, C.: Automatic noise modeling for  ghost-free hdr reconstruction. ACM Trans. Graph. 32(6) (2013) 1-10 1  3. Nguyen, A., Yosinski, J., Clune, J.: Deep neural networks are easily fooled: High confidence predictions for unrecognizable images. In: CVPR. (2015) 427-436 1 4. Elad, M., Aharon, M.: Image denoising via sparse and redundant representations over learned dictionaries. IEEE Transactions on Image Processing 15(12) (2006) 3736-3745 1, 2, 3, 4  5. Mairal, J., Elad, M., Sapiro, G.: Sparse representation for color image restoration.  IEEE Transactions on Image Processing, 17(1) (2008) 53-69 1, 2, 3, 4  6. Buades, A., Coll, B., Morel, J.M.: A non-local algorithm for image denoising. In:  CVPR. (2005) 60-65 1, 2, 4  7. Dabov, K., Foi, A., Katkovnik, V., Egiazarian, K.: Image denoising by sparse 3-D transform-domain collaborative filtering. IEEE Transactions on Image Processing 16(8) (2007) 2080-2095 1, 2, 4, 10  8. Dabov, K., Foi, A., Katkovnik, V., Egiazarian, K.: Color image denoising via sparse 3D collaborative filtering with grouping constraint in luminance-chrominance space. In: ICIP, IEEE (2007) 313-316 1, 2, 4, 11  9. Dabov, K., Foi, A., Katkovnik, V., Egiazarian, K.: Bm3d image denoising with  shape-adaptive principal component analysis. In: SPARS. (2009) 1, 2, 4, 10 10. Mairal, J., Bach, F., Ponce, J., Sapiro, G., Zisserman, A.: Non-local sparse models  for image restoration. In: ICCV. (2009) 2272-2279 1, 2, 3, 4, 10  11. Dong, W., Zhang, L., Shi, G., Li, X.: Nonlocally centralized sparse representation for image restoration. IEEE Transactions on Image Processing 22(4) (2013) 1620- 1630 1, 2, 3, 4, 10  12. Dong, W., Shi, G., Li, X.: Nonlocal image restoration with bilateral variance estimation: A low-rank approach. IEEE Transactions on Image Processing 22(2) (2013) 700-711 1, 2, 4  13. Gu, S., Zhang, L., Zuo, W., Feng, X.: Weighted nuclear norm minimization with application to image denoising. In: CVPR, IEEE (2014) 2862-2869 1, 2, 4, 10 14. Xu, J., Zhang, L., Zuo, W., Zhang, D., Feng, X.: Patch group based nonlocal self-similarity prior learning for image denoising. In ICCV (2015) 244-252 1, 2, 3, 4  15. Roth, S., Black, M.J.: Fields of experts. International Journal of Computer Vision  82(2) (2009) 205-229 1, 2, 4  16. Zoran, D., Weiss, Y.: From learning models of natural image patches to whole  image restoration. In: ICCV. (2011) 479-486 1, 2, 4  17. Burger, H.C., Schuler, C.J., Harmeling, S.:  Image denoising: Can plain neural  networks compete with BM3D? In CVPR (2012) 2392-2399 1, 2  18. Schmidt, U., Roth, S.: Shrinkage fields for eﬀective image restoration. In: CVPR.  (June 2014) 2774-2781 1, 2  19. Chen, Y., Yu, W., Pock, T.: On learning optimized reaction diﬀusion processes for  eﬀective image restoration. In CVPR (2015) 5261-5269 1, 2, 10, 11  20. Zhang, K., Zuo, W., Chen, Y., Meng, D., Zhang, L.: Beyond a Gaussian denoiser: Residual learning of deep cnn for image denoising. IEEE Transactions on Image Processing (2017) 1, 2, 10, 11   16  J. Xu, L. Zhang, and D. Zhang  21. Liu, C., Szeliski, R., Kang, S.B., Zitnick, C.L., Freeman, W.T.: Automatic estima- tion and removal of noise from a single image. IEEE TPAMI 30(2) (2008) 299-314 1, 2, 4  22. Lebrun, M., Colom, M., Morel, J.M.: Multiscale image blind denoising. Transactions on Image Processing 24(10) (2015) 3149-3161 1, 2, 3, 11  IEEE  23. Zhu, F., Chen, G., Heng, P.A.: From noise modeling to blind image denoising. In  CVPR (June 2016) 1, 2, 3  24. Nam, S., Hwang, Y., Matsushita, Y., Kim, S.J.: A holistic approach to cross- channel image noise modeling and its application to image denoising. In CVPR (2016) 1683-1691 1, 2, 3, 4, 10, 11, 12, 13  25. ABSoft, N.: Neat Image. https://ni.neatvideo.com/home 1, 2, 3, 11 26. Xu, J., Zhang, L., Zhang, D., Feng, X.: Multi-channel weighted nuclear norm  minimization for real color image denoising. In: ICCV. (2017) 1, 2, 3, 11  27. Xu, J., Ren, D., Zhang, L., Zhang, D.: Patch group based bayesian learning for blind image denoising. Asian Conference on Computer Vision (ACCV) New Trends in Image Restoration and Enhancement Workshop (2016) 79-95 2  28. Xu, J., Zhang, L., Zhang, D.: External prior guided internal prior learning for real-world noisy image denoising. IEEE Transactions on Image Processing 27(6) (June 2018) 2996-3010 2  29. Pl¨otz, T., Roth, S.: Benchmarking denoising algorithms with real photographs. In:  CVPR. (2017) 2, 3, 4, 5, 10, 11, 12, 13, 14  30. Kervrann, C., Boulanger, J., Coup´e, P.: Bayesian non-local means filter, image redundancy and adaptive dictionaries for noise removal. International Conference on Scale Space and Variational Methods in Computer Vision (2007) 520-532 3 31. Wright, J., Yang, A., Ganesh, A., Sastry, S., Ma, Y.: Robust face recognition via  sparse representation. IEEE TPAMI 31(2) (2009) 210-227 3  32. Yang, J., Yu, K., Gong, Y., Huang, T.: Linear spatial pyramid matching using  sparse coding for image classification. In CVPR (2009) 1794-1801 3  33. Yang, J., Wright, J., Huang, T., Ma, Y.: Image super-resolution via sparse rep- IEEE Transactions on Image Processing 19(11) (2010) 2861-2873  resentation. 3  34. Boyd, S., Parikh, N., Chu, E., Peleato, B., Eckstein, J.: Distributed optimization and statistical learning via the alternating direction method of multipliers. Found. Trends Mach. Learn. 3(1) (January 2011) 1-122 3, 6  35. Tibshirani, R.: Regression shrinkage and selection via the lasso. Journal of the  Royal Statistical Society. Series B (Methodological) (1996) 267-288 4  36. Khashabi, D., Nowozin, S., Jancsary, J., Fitzgibbon, A.W.: Joint demosaicing and denoising via learned nonparametric random fields. IEEE Transactions on Image Processing 23(12) (2014) 4968-4981 4, 5  37. Eckart, C., Young, G.: The approximation of one matrix by another of lower rank.  Psychometrika 1(3) (1936) 211-218 4  38. Leung, B., Jeon, G., Dubois, E.: Least-squares luma-chroma demultiplexing al- gorithm for bayer demosaicking. IEEE Transactions on Image Processing 20(7) (2011) 1885-1894 5  39. McCullagh, P.: Generalized linear models. European Journal of Operational Re-  search 16(3) (1984) 285-292 5  40. Eckstein, J., Bertsekas, D.P.: On the Douglas-Rachford splitting method and the proximal point algorithm for maximal monotone operators. Mathematical Programming 55(1) (1992) 293-318 6  41. Simoncini, V.: Computational methods for linear matrix equations. SIAM Review  58(3) (2016) 377-441 7   Trilateral Weighted Sparse Coding Scheme for Real-World Image Denoising42. Bartels, R.H., Stewart, G.W.: Solution of the matrix equation AX + XB = C.  Commun. ACM 15(9) (1972) 820-826 9  43. Golub, G., Van Loan, C.: Matrix Computations (3rd Ed.). Johns Hopkins Univer-  sity Press (1996) 9  44. Bareiss, E.: Sylvesters identity and multistep integer-preserving gaussian elimina-  tion. Mathematics of Computation 22(103) (1968) 565-578 9  45. Liu, X., Tanaka, M., Okutomi, M.: Single-image noise level estimation for blind denoising. IEEE Transactions on Image Processing 22(12) (2013) 5226-5237 9 46. Chen, G., Zhu, F., Pheng, A.H.: An eﬃcient statistical method for image noise  level estimation. In ICCV (December 2015) 9, 11  47. Sutour, C., Deledalle, C.A., Aujol, J.F.: Estimation of the noise level function based on a nonparametric detection of homogeneous image regions. SIAM Journal on Imaging Sciences 8(4) (2015) 2622-2661 9  48. Wang, Z., Bovik, A.C., Sheikh, H.R., Simoncelli, E.P.: Image quality assessment: from error visibility to structural similarity. IEEE Transactions on Image Process- ing 13(4) (2004) 600-612 10, 11  49. Lebrun, M., Colom, M., Morel, J.M.: The noise clinic: a blind image denoising algorithm. http://www.ipol.im/pub/art/2015/125/ Accessed 01 28, 2015. 10, 11, 12  50. Xu, J., Li, H., Liang, Z., Zhang, D., Zhang, L.: Real-world noisy image denoising:  A new benchmark. CoRR abs/1804.02603 (2018) 11"}