{"1": "1. Ancuti, C.O., Ancuti, C., De Vleeschouwer, C., Bekaert, P.: Color balance and fusion for underwater image enhancement. IEEE Transactions on Image Processing 27(1), 379-393 (2018)  2. Berman, D., Treibitz, T., Avidan, S.: Non-local image dehazing. In: IEEE Conference on  Computer Vision and Pattern Recognition (2016)  3. Butler, D.J., Wulff, J., Stanley, G.B., Black, M.J.: A naturalistic open source movie for optical  ﬂow evaluation. In: European Conference on Computer Vision (2012)  4. Cai, B., Xu, X., Jia, K., Qing, C., Tao, D.: Dehazenet: An end-to-end system for single image  haze removal. IEEE Transactions on Image Processing 25(11), 5187-5198 (2016)  5. Chen, C., Do, M.N., Wang, J.: Robust image and video dehazing with visual artifact sup- pression via gradient residual minimization. In: European Conference on Computer Vision (2016)  6. Donoho, D.L.: De-noising by soft-thresholding. IEEE Transactions on Information Theory  7. Fattal, R.: Single image dehazing. ACM Transactions on Graphics (TOG) 27(3), 72 (2008) 8. Fattal, R.: Dehazing using color-lines. ACM transactions on graphics (TOG) 34(1), 13  41(3), 613-627 (1995)  (2014)  9. Geman, D., Reynolds, G.: Constrained restoration and the recovery of discontinuities. IEEE  Transactions on Pattern Analysis and Machine Intelligence 14(3), 367-383 (1992)  10. Geman, D., Yang, C.: Nonlinear image recovery with half-quadratic regularization. IEEE  Transactions on Image Processing 4(7), 932-946 (1995)  11. He, K., Sun, J., Tang, X.: Single image haze removal using dark channel prior. In: IEEE  Conference on Computer Vision and Pattern Recognition (2009)  12. He, K., Sun, J., Tang, X.: Guided image filtering. In: European Conference on Computer  Vision (2010)  13. Krishnan, D., Fergus, R.: Fast image deconvolution using hyper-laplacian priors. In: Ad-  vances in Neural Information Processing Systems (2009)  14. Li, B., Peng, X., Wang, Z., Xu, J., Feng, D.: Aod-net: All-in-one dehazing network. In: IEEE  International Conference on Computer Vision (2017)  15. Li, R., Pan, J., Li, Z., Tang, J.: Single image dehazing via conditional generative adversarial  network. In: IEEE Conference on Computer Vision and Pattern Recognition (2018)  16. Li, Y., Tan, R.T., Brown, M.S.: Nighttime haze removal with glow and multiple light colors. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 226-234 (2015)  17. Meinhardt, T., Moller, M., Hazirbas, C., Cremers, D.: Learning proximal operators: Using denoising networks for regularizing inverse imaging problems. In: IEEE International Con- ference on Computer Vision (2017)  18. Meng, G., Wang, Y., Duan, J., Xiang, S., Pan, C.: Efficient image dehazing with boundary constraint and contextual regularization. In: IEEE International Conference on Computer Vision (2013)  19. Nishino, K., Kratz, L., Lombardi, S.: Bayesian defogging. International Journal of Computer  Vision 98(3), 263-278 (2012)  20. Ren, W., Liu, S., Zhang, H., Pan, J., Cao, X., Yang, M.H.: Single image dehazing via multi-  scale convolutional neural networks. In: European Conference on Computer Vision (2016)  21. Ren, W., Ma, L., Zhang, J., Pan, J., Cao, X., Liu, W., Yang, M.H.: Gated fusion network for single image dehazing. In: IEEE Conference on Computer Vision and Pattern Recognition (2018)   Proximal Dehaze-NetReferences  1. Ancuti, C.O., Ancuti, C., De Vleeschouwer, C., Bekaert, P.: Color balance and fusion for underwater image enhancement. IEEE Transactions on Image Processing 27(1), 379-393 (2018)  2. Berman, D., Treibitz, T., Avidan, S.: Non-local image dehazing. In: IEEE Conference on  Computer Vision and Pattern Recognition (2016)  3. Butler, D.J., Wulff, J., Stanley, G.B., Black, M.J.: A naturalistic open source movie for optical  ﬂow evaluation. In: European Conference on Computer Vision (2012)  4. Cai, B., Xu, X., Jia, K., Qing, C., Tao, D.: Dehazenet: An end-to-end system for single image  haze removal. IEEE Transactions on Image Processing 25(11), 5187-5198 (2016)  5. Chen, C., Do, M.N., Wang, J.: Robust image and video dehazing with visual artifact sup- pression via gradient residual minimization. In: European Conference on Computer Vision (2016)  6. Donoho, D.L.: De-noising by soft-thresholding. IEEE Transactions on Information Theory  7. Fattal, R.: Single image dehazing. ACM Transactions on Graphics (TOG) 27(3), 72 (2008) 8. Fattal, R.: Dehazing using color-lines. ACM transactions on graphics (TOG) 34(1), 13  41(3), 613-627 (1995)  (2014)  9. Geman, D., Reynolds, G.: Constrained restoration and the recovery of discontinuities. IEEE  Transactions on Pattern Analysis and Machine Intelligence 14(3), 367-383 (1992)  10. Geman, D., Yang, C.: Nonlinear image recovery with half-quadratic regularization. IEEE  Transactions on Image Processing 4(7), 932-946 (1995)  11. He, K., Sun, J., Tang, X.: Single image haze removal using dark channel prior. In: IEEE  Conference on Computer Vision and Pattern Recognition (2009)  12. He, K., Sun, J., Tang, X.: Guided image filtering. In: European Conference on Computer  Vision (2010)  13. Krishnan, D., Fergus, R.: Fast image deconvolution using hyper-laplacian priors. In: Ad-  vances in Neural Information Processing Systems (2009)  14. Li, B., Peng, X., Wang, Z., Xu, J., Feng, D.: Aod-net: All-in-one dehazing network. In: IEEE  International Conference on Computer Vision (2017)  15. Li, R., Pan, J., Li, Z., Tang, J.: Single image dehazing via conditional generative adversarial  network. In: IEEE Conference on Computer Vision and Pattern Recognition (2018)  16. Li, Y., Tan, R.T., Brown, M.S.: Nighttime haze removal with glow and multiple light colors. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 226-234 (2015)  17. Meinhardt, T., Moller, M., Hazirbas, C., Cremers, D.: Learning proximal operators: Using denoising networks for regularizing inverse imaging problems. In: IEEE International Con- ference on Computer Vision (2017)  18. Meng, G., Wang, Y., Duan, J., Xiang, S., Pan, C.: Efficient image dehazing with boundary constraint and contextual regularization. In: IEEE International Conference on Computer Vision (2013)  19. Nishino, K., Kratz, L., Lombardi, S.: Bayesian defogging. International Journal of Computer  Vision 98(3), 263-278 (2012)  20. Ren, W., Liu, S., Zhang, H., Pan, J., Cao, X., Yang, M.H.: Single image dehazing via multi-  scale convolutional neural networks. In: European Conference on Computer Vision (2016)  21. Ren, W., Ma, L., Zhang, J., Pan, J., Cao, X., Liu, W., Yang, M.H.: Gated fusion network for single image dehazing. In: IEEE Conference on Computer Vision and Pattern Recognition (2018)   16  D. Yang and J. Sun  22. Rick Chang, J.H., Li, C.L., Poczos, B., Vijaya Kumar, B.V.K., Sankaranarayanan, A.C.: One network to solve them all - solving linear inverse problems using deep projection models. In: IEEE International Conference on Computer Vision (2017)  23. Scharstein, D., Szeliski, R.: High-accuracy stereo depth maps using structured light. In: IEEE  Conference on Computer Vision and Pattern Recognition (2003)  24. Scharstein, D., Hirschm¨uller, H., Kitajima, Y., Krathwohl, G., Neˇsi´c, N., Wang, X., Westling, P.: High-resolution stereo datasets with subpixel-accurate ground truth. In: German Confer- ence on Pattern Recognition (2014)  25. Scharstein, D., Pal, C.: Learning conditional random fields for stereo. In: IEEE Conference  on Computer Vision and Pattern Recognition (2007)  26. Silberman, N., Hoiem, D., Kohli, P., Fergus, R.: Indoor segmentation and support inference  from rgbd images. In: European Conference on Computer Vision (2012)  27. Tan, R.T.: Visibility in bad weather from a single image. In: IEEE Conference on Computer  Vision and Pattern Recognition (2008)  28. Tan, R.T., Pettersson, N., Petersson, L.: Visibility enhancement for roads with foggy or hazy  scenes. In: IEEE Intelligent Vehicles Symposium (2007)  29. Tang, K., Yang, J., Wang, J.: Investigating haze-relevant features in a learning framework for image dehazing. In: IEEE Conference on Computer Vision and Pattern Recognition (2014) 30. Tarel, J.P., Hautiere, N.: Fast visibility restoration from a single color or gray level image.  In: IEEE International Conference on Computer Vision (2009)  31. Tripathi, A., Mukhopadhyay, S.: Single image fog removal using anisotropic diffusion. IET  Image Processing 6(7), 966-975 (2012)  32. Wang, Y., Yang, J., Yin, W., Zhang, Y.: A new alternating minimization algorithm for total variation image reconstruction. SIAM Journal on Imaging Sciences 1(3), 248-272 (2008) 33. Yang, Y., Sun, J., Li, H., Xu, Z.: Deep admm-net for compressive sensing mri. In: Advances  in Neural Information Processing Systems (2016)  34. Zhang, H., Patel, V.M.: Densely connected pyramid dehazing network. In: IEEE Conference  on Computer Vision and Pattern Recognition (2018)  35. Zhang, J., Pan, J., Lai, W.S., Lau, R.W.H., Yang, M.H.: Learning fully convolutional net- works for iterative non-blind deconvolution. In: IEEE Conference on Computer Vision and Pattern Recognition (2017)  36. Zhang, K., Zuo, W., Gu, S., Zhang, L.: Learning deep cnn denoiser prior for image restora-  tion. In: IEEE Conference on Computer Vision and Pattern Recognition (2017)  37. Zhang, Y., Ding, L., Sharma, G.: Hazerd: an outdoor scene dataset and benchmark for single  image dehazing. In: IEEE International Conference on Image Processing (2017)  38. Zhu, Q., Mai, J., Shao, L.: A fast single image haze removal algorithm using color attenuation  prior. IEEE Transactions on Image Processing 24(11), 3522-3533 (2015)"}