{"1": "1. Ramalingam, S., Bouaziz, S., Sturm, P.: Pose estimation using both points and lines for geo-localization. In: IEEE Int’l Conf. on Robotics and Automation (ICRA). (2011) 4716-4723  2. Kuang, Y., Astrom, K.: Pose estimation with unknown focal length using points, In: IEEE Int’l Conf. on Computer Vision (ICCV). (2013)  directions and lines. 529-536  3. Haralick, R., Lee, C.N., Ottenberg, K., Nolle, M.: Review and analysis of solutions of the three point perspective pose estimation problem. Int’l J. of Computer Vision (IJCV) 13(3) (1994) 331-356  4. Gao, X.S., Hou, X.R., Tang, J., Cheng, H.F.: Complete solution classification IEEE Trans. on Pattern Analysis and  for the perspective-three-point problem. Machine Intelligence (T-PAMI) 25(8) (2003) 930-943  5. Kneip, L., Scaramuzza, D., Siegwart, R.: A novel parametrization of the perspective-three-point problem for a direct computation of absolute camera posi- tion and orientation. In: IEEE Conf. on Computer Vision and Patter Recognition (CVPR). (2011) 2969-2976  6. Ke, T., Roumeliotis, S.I.: An efcient algebraic solution to the perspective-three- In: IEEE Conf. on Computer Vision and Pattern Recognition  point problem. (CVPR). (2017) 4618-4626  7. Wang, P., Xu, G., Wang, Z., Cheng, Y.: An eﬃcient solution to the perspective- three-point pose problem. Computer Vision and Image Understanding (CVIU) 166 (2018) 81-87  8. Dhome, M., Richetin, M., Lapreste, J.T., Rives, G.: Determination of the attitude of 3D objects from a single perspective view. IEEE Trans. on Pattern Analysis and Machine Intelligence (T-PAMI) 11(12) (1989) 1265-1278  9. Chen, H.H.: Pose determination from line-to-plane correspondences: existence con- dition and closed-form solutions. In: IEEE Int’l Conf. on Computer Vision (ICCV). (1990) 374-378  10. Lee, G.H., Lin, B., Pollefeys, M., Fraundorfer, F.: Minimal solutions for the multi- camera pose estimation problem. The International Journal of Robotics Research (IJRR) 34(7) (2015) 837-848  11. Lee, G.H.: A minimal solution for non-perspective pose estimation from line cor- respondences. In: European Conf. on Computer Vision (ECCV). (2016) 170-185 12. Chen, C.S., Chang, W.Y.: On pose recovery for generalized visual sensors. IEEE  Trans. on Pattern Analysis and Machine Intelligence 26(7) (2004) 848-861  13. Nister, D.: A minimal solution to the generalised 3-point pose problem. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). Volume 1. (2004) 560-567  14. Miraldo, P., Araujo, H.: A simple and robust solution to the minimal general pose In: IEEE Int’l Conf. on Robotics and Automation (ICRA). (2014)  estimation. 2119-2125  15. Ansar, A., Daniilidis, K.: Linear pose estimation using points or lines. IEEE Trans. on Pattern Analysis and Machine Intelligence (T-PAMI) 25(5) (2003) 578-589 16. Vakhitov, A., Funke, J., Moreno-Noguer, F.: Accurate and linear time pose esti- mation from points and lines. In: European Conf. on Computer Vision (ECCV). (2016) 583-599  17. Grossberg, M.D., Nayar, S.K.: A general imaging model and a method for finding its parameters. In: IEEE Int’l Conf. on Computer Vision (ICCV). Volume 2. (2001) 108-115   Multi-Perspective Pose Estimation using Points and LinesReferences  1. Ramalingam, S., Bouaziz, S., Sturm, P.: Pose estimation using both points and lines for geo-localization. In: IEEE Int’l Conf. on Robotics and Automation (ICRA). (2011) 4716-4723  2. Kuang, Y., Astrom, K.: Pose estimation with unknown focal length using points, In: IEEE Int’l Conf. on Computer Vision (ICCV). (2013)  directions and lines. 529-536  3. Haralick, R., Lee, C.N., Ottenberg, K., Nolle, M.: Review and analysis of solutions of the three point perspective pose estimation problem. Int’l J. of Computer Vision (IJCV) 13(3) (1994) 331-356  4. Gao, X.S., Hou, X.R., Tang, J., Cheng, H.F.: Complete solution classification IEEE Trans. on Pattern Analysis and  for the perspective-three-point problem. Machine Intelligence (T-PAMI) 25(8) (2003) 930-943  5. Kneip, L., Scaramuzza, D., Siegwart, R.: A novel parametrization of the perspective-three-point problem for a direct computation of absolute camera posi- tion and orientation. In: IEEE Conf. on Computer Vision and Patter Recognition (CVPR). (2011) 2969-2976  6. Ke, T., Roumeliotis, S.I.: An efcient algebraic solution to the perspective-three- In: IEEE Conf. on Computer Vision and Pattern Recognition  point problem. (CVPR). (2017) 4618-4626  7. Wang, P., Xu, G., Wang, Z., Cheng, Y.: An eﬃcient solution to the perspective- three-point pose problem. Computer Vision and Image Understanding (CVIU) 166 (2018) 81-87  8. Dhome, M., Richetin, M., Lapreste, J.T., Rives, G.: Determination of the attitude of 3D objects from a single perspective view. IEEE Trans. on Pattern Analysis and Machine Intelligence (T-PAMI) 11(12) (1989) 1265-1278  9. Chen, H.H.: Pose determination from line-to-plane correspondences: existence con- dition and closed-form solutions. In: IEEE Int’l Conf. on Computer Vision (ICCV). (1990) 374-378  10. Lee, G.H., Lin, B., Pollefeys, M., Fraundorfer, F.: Minimal solutions for the multi- camera pose estimation problem. The International Journal of Robotics Research (IJRR) 34(7) (2015) 837-848  11. Lee, G.H.: A minimal solution for non-perspective pose estimation from line cor- respondences. In: European Conf. on Computer Vision (ECCV). (2016) 170-185 12. Chen, C.S., Chang, W.Y.: On pose recovery for generalized visual sensors. IEEE  Trans. on Pattern Analysis and Machine Intelligence 26(7) (2004) 848-861  13. Nister, D.: A minimal solution to the generalised 3-point pose problem. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). Volume 1. (2004) 560-567  14. Miraldo, P., Araujo, H.: A simple and robust solution to the minimal general pose In: IEEE Int’l Conf. on Robotics and Automation (ICRA). (2014)  estimation. 2119-2125  15. Ansar, A., Daniilidis, K.: Linear pose estimation using points or lines. IEEE Trans. on Pattern Analysis and Machine Intelligence (T-PAMI) 25(5) (2003) 578-589 16. Vakhitov, A., Funke, J., Moreno-Noguer, F.: Accurate and linear time pose esti- mation from points and lines. In: European Conf. on Computer Vision (ECCV). (2016) 583-599  17. Grossberg, M.D., Nayar, S.K.: A general imaging model and a method for finding its parameters. In: IEEE Int’l Conf. on Computer Vision (ICCV). Volume 2. (2001) 108-115   16  P. Miraldo, T. Dias, and S. Ramalingam  18. Sturm, P., Ramalingam, S.: A generic concept for camera calibration. In: European  Conf. on Computer Vision (ECCV). (2004) 1-13  19. Miraldo, P., Araujo, H., Queiro, J.: Point-based calibration using a parametric representation of general imaging models. In: IEEE Int’l Conf. on Computer Vision (ICCV). (2011) 2304-2311  20. Sturm, P., Ramalingam, S., Tardif, J.P., Gasparini, S., Barreto, J.: Camera models and fundamental concepts used in geometric computer vision. Foundations and trends in computer graphics and computer vision 2(1-2) (2011) 1-183  21. Schweighofer, G., Pinz, A.: Globally optimal O(n) solution to the pnp problem for general camera models. In: British Machine Vision Conf. (BMVC). (2008) 1-8 22. Miraldo, P., Araujo, H., Gonalves, N.: Pose estimation for general cameras using lines. IEEE Trans. on Cybernetics, 45(10):2156-2164 45(10) (2015) 2156-2164 23. Caglioti, V., Gasparini, S.: On the localization of straight lines in 3D space from single 2D images. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). Volume 1. (2005) 1129-1134  24. Swaminathan, R., Wu, A., Dong, H.: Depth from distortions. In: Workshop on Omnidirectional Vision, Camera Networks and Non-classical Cameras (OMNIVIS). (2008)  25. Bermudez-Cameo, J., Barreto, J.P., Lopez-Nicolas, G., Guerrero, J.J.: Minimal solution for computing pairs of lines in non-central cameras. In: Asian Conf. on Computer Vision (ACCV). (2014) 585-597  26. Camposeco, F., Cohen, A., Pollefeys, M., Sattler, T.: Hybrid pose estimation. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). (2018) 136-144 27. Bujnak, M., Kukelova, Z., Pajdla, T.: New eﬃcient solution to the absolute pose problem for camera with unknown focal length and radial distortion. In: Asian Conf. on Computer Vision (ACCV). (2011) 11-24  28. Micusik, B., Wildenauer, H.: Minimal solution for uncalibrated absolute pose problem with a known vanishing point. In: IEEE Int’l Conf. on 3D Vision (3DV). (2013) 143-150  29. Kukelova, Z., Bujnak, M., Pajdla, T.: Real-time solution to the absolute pose problem with unknown radial distortion and focal length. In: IEEE Int’l Conf. on Computer Vision (ICCV). (2013) 2816-2823  30. Kuang, Y., Solem, J.E., Kahl, F., Astrom, K.: Minimal solvers for relative pose with a single unknown radial distortion. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). (2014) 33-40  31. Wu, C.: P3.5P: pose estimation with unknown focal length. In: IEEE Conf. on  Computer Vision and Pattern Recognition (CVPR). (2015) 2440-2448  32. Kukelova, Z., Bujnak, M., Pajdla, T.: Closed-form solutions to minimal absolute pose problems with known vertical direction. In: Asian Conf. on Computer Vision (ACCV). (2010) 216-229  33. Sweeney, C., Flynn, J., Nuernberger, B., Turk, M., Hollerer, T.: Eﬃcient com- In: IEEE Int’l  putation of absolute pose for gravity-aware augmented reality. Symposium on Mixed and Augmented Reality (ISMAR). (2015) 19-24  34. Micusik, B., Wildenauer, H.: Minimal solution for uncalibrated absolute pose problem with a known vanishing point. In: IEEE Int’l Conf. on 3D Vision (3DV). (2013) 143-150  35. Camposeco, F., Sattler, T., Pollefeys, M.: Minimal solvers for generalized pose and scale estimation from two rays and one point. In: European Conf. on Computer Vision (ECCV). (2016) 202-218   Multi-Perspective Pose Estimation using Points and Lines36. Sweeney, C., Fragoso, V., H¨ollerer, T., Turk, M.: gDLS: A scalable solution to the generalized pose and scale problem. In: European Conf. on Computer Vision (ECCV). (2014) 16-31  37. Ventura, J., Arth, C., Reitmayr, G., Schmalstieg, D.: A minimal solution to the generalized pose-and-scale problem. In: IEEE Conf. on Computer Vision and Pat- tern Recognition (CVPR). (2014) 422-429  38. Haner, S., Astrom, K.: Absolute pose for cameras under ﬂat refractive interfaces. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). (2015) 1428-1436  39. Albl, C., Kukelova, Z., Pajdla, T.: R6P - Rolling shutter absolute pose problem. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). (2015) 2292-2300  40. Hartley, R., Zisserman, A.: Multiple view in Geometry in Computer Vision. 2 edn.  Cambridge Univ. Press (2004)  41. Ma, Y., Soatto, S., Kosecka, J., Sastry, S.S.: An Invitation to 3-D Vision: From  Images to Geometric Models. 1 edn. Springer-Verlag New York (2003)  42. Pottmann, H., Wallner, J.: Computational Line Geometry. 1 edn. Springer-Verlag  Berlin Heidelberg (2001)  43. Cox, D.A., Little, J., O’Shea, D.: Ideals, Varieties, and Algorithms: An Introduction to Computational Algebraic Geometry and Commutative Algebra. 4 edn. Springer International Publishing (2015)  44. Stew´enius, H.: Gr¨obner Basis Methods for Minimal Problems in Computer Vision. PhD thesis, Centre for Mathematical Sciences, Lund University, Box 118, SE-221 00 Lund, Sweden (2005)  45. Kukelova, Z., Bujnak, M., Pajdla, T.: Automatic generator of minimal problem  solvers. In: European Conf. on Computer Vision (ECCV). (2008) 302-315  46. Kukelova, Z., Bujnak, M., Pajdla, T.: Polynomial eigenvalue solutions to mini- mal problems in computer vision. IEEE Trans. on Pattern Analysis and Machine Intelligence (T-PAMI) 7(34) (2012) 1381-1393  47. Larsson, V., Astrom, K.: Uncovering symmetries in polynomial systems. In: Eu-  ropean Conf. on Computer Vision (ECCV). (2016) 252-267  48. Larsson, V., Astrom, K., Oskarsson, M.: Polynomial solvers for saturated ideals.  In: IEEE Int’l Conf. on Computer Vision (ICCV). (2017) 2307-2316  49. Fischler, M.A., Bolles, R.C.: Random Sample Consensus: A paradigm for model fitting with applications to image analysis and automated cartography. Commun. ACM 24(6) (1981) 381-395  50. Nister, D.: Preemptive ransac for live structure and motion estimation. In: IEEE  Int’l Conf. on Computer Vision (ICCV). Volume 1. (2003) 199-206  51. Hofer, M., Maurer, M., Bischof, H.: Eﬃcient 3D scene abstraction using line seg-  ments. Computer Vision and Image Understanding 157 (2017) 167-178  52. Sch¨ops, T., Sch¨onberger, J.L., Galliani, S., Sattler, T., Schindler, K., Pollefeys, M.,  Geiger, A.: ETH3D Benchmark. https://www.eth3d.net/ Accessed: 2018-07-24.  53. Wu, C., Agarwal, S., Curless, B., Seitz, S.M.: Multicore bundle adjustment. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). (2011) 3057- 3064  54. Wu, C., Agarwal, S., Curless, B., Seitz, S.M.: Towards linear-time incremental structure from motion. In: IEEE Int’l Conf. on 3D Vision (3DV). (2013) 127-134"}