{"1": "1. Bell, S., Lawrence Zitnick, C., Bala, K., Girshick, R.: Inside-outside net: Detecting objects in context with skip pooling and recurrent neural networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2874- 2883 (2016)  2. Bodla, N., Singh, B., Chellappa, R., Davis, L.S.: Improving object detection with  one line of code. arXiv preprint arXiv:1704.04503 (2017)  3. Cai, Z., Vasconcelos, N.: Cascade r-cnn: Delving into high quality object detection.  arXiv preprint arXiv:1712.00726 (2017)  4. Dalal, N., Triggs, B.: Histograms of oriented gradients for human detection. In: Computer Vision and Pattern Recognition, 2005. CVPR 2005. IEEE Computer Society Conference on. vol. 1, pp. 886-893. IEEE (2005)  5. Doll´ar, P., Appel, R., Belongie, S., Perona, P.: Fast feature pyramids for object detection. IEEE Transactions on Pattern Analysis and Machine Intelligence 36(8), 1532-1545 (2014)  6. Gidaris, S., Komodakis, N.: Object detection via a multi-region and semantic segmentation-aware cnn model. In: Proceedings of the IEEE International Confer- ence on Computer Vision. pp. 1134-1142 (2015)  7. Gidaris, S., Komodakis, N.: Attend refine repeat: Active box proposal generation  via in-out localization. arXiv preprint arXiv:1606.04446 (2016)  8. Girshick, R.: Fast r-cnn. In: The IEEE International Conference on Computer  Vision (ICCV) (December 2015)  9. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accurate object detection and semantic segmentation. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2014)  10. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: The IEEE International  Conference on Computer Vision (ICCV) (2017)  11. Hosang, J., Benenson, R., Schiele, B.: Learning non-maximum suppression. arXiv  preprint (2017)  12. Hu, H., Gu, J., Zhang, Z., Dai, J., Wei, Y.: Relation networks for object detection.  arXiv preprint arXiv:1711.11575 (2017)  13. Hu, H., Lan, S., Jiang, Y., Cao, Z., Sha, F.: Fastmask: Segment multi-scale object candidates in one shot. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 991-999 (2017)  14. Huang, L., Yang, Y., Deng, Y., Yu, Y.: Densebox: Unifying landmark localization  with end to end object detection. arXiv preprint arXiv:1509.04874 (2015)  15. Li, J., Liang, X., Li, J., Wei, Y., Xu, T., Feng, J., Yan, S.: Multi-stage object detection with group recursive learning. IEEE Transactions on Multimedia (2017) 16. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature pyramid networks for object detection. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  17. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision. pp. 740-755. Springer (2014)  18. Najibi, M., Rastegari, M., Davis, L.S.: G-cnn: an iterative grid based object de- tector. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2369-2377 (2016)  19. Pinheiro, P.O., Collobert, R., Doll´ar, P.: Learning to segment object candidates. In:  Advances in Neural Information Processing Systems. pp. 1990-1998 (2015)   Acquisition of Localization Confidence for Accurate Object DetectionReferences  1. Bell, S., Lawrence Zitnick, C., Bala, K., Girshick, R.: Inside-outside net: Detecting objects in context with skip pooling and recurrent neural networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2874- 2883 (2016)  2. Bodla, N., Singh, B., Chellappa, R., Davis, L.S.: Improving object detection with  one line of code. arXiv preprint arXiv:1704.04503 (2017)  3. Cai, Z., Vasconcelos, N.: Cascade r-cnn: Delving into high quality object detection.  arXiv preprint arXiv:1712.00726 (2017)  4. Dalal, N., Triggs, B.: Histograms of oriented gradients for human detection. In: Computer Vision and Pattern Recognition, 2005. CVPR 2005. IEEE Computer Society Conference on. vol. 1, pp. 886-893. IEEE (2005)  5. Doll´ar, P., Appel, R., Belongie, S., Perona, P.: Fast feature pyramids for object detection. IEEE Transactions on Pattern Analysis and Machine Intelligence 36(8), 1532-1545 (2014)  6. Gidaris, S., Komodakis, N.: Object detection via a multi-region and semantic segmentation-aware cnn model. In: Proceedings of the IEEE International Confer- ence on Computer Vision. pp. 1134-1142 (2015)  7. Gidaris, S., Komodakis, N.: Attend refine repeat: Active box proposal generation  via in-out localization. arXiv preprint arXiv:1606.04446 (2016)  8. Girshick, R.: Fast r-cnn. In: The IEEE International Conference on Computer  Vision (ICCV) (December 2015)  9. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich feature hierarchies for accurate object detection and semantic segmentation. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2014)  10. He, K., Gkioxari, G., Doll´ar, P., Girshick, R.: Mask r-cnn. In: The IEEE International  Conference on Computer Vision (ICCV) (2017)  11. Hosang, J., Benenson, R., Schiele, B.: Learning non-maximum suppression. arXiv  preprint (2017)  12. Hu, H., Gu, J., Zhang, Z., Dai, J., Wei, Y.: Relation networks for object detection.  arXiv preprint arXiv:1711.11575 (2017)  13. Hu, H., Lan, S., Jiang, Y., Cao, Z., Sha, F.: Fastmask: Segment multi-scale object candidates in one shot. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 991-999 (2017)  14. Huang, L., Yang, Y., Deng, Y., Yu, Y.: Densebox: Unifying landmark localization  with end to end object detection. arXiv preprint arXiv:1509.04874 (2015)  15. Li, J., Liang, X., Li, J., Wei, Y., Xu, T., Feng, J., Yan, S.: Multi-stage object detection with group recursive learning. IEEE Transactions on Multimedia (2017) 16. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature pyramid networks for object detection. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  17. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision. pp. 740-755. Springer (2014)  18. Najibi, M., Rastegari, M., Davis, L.S.: G-cnn: an iterative grid based object de- tector. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2369-2377 (2016)  19. Pinheiro, P.O., Collobert, R., Doll´ar, P.: Learning to segment object candidates. In:  Advances in Neural Information Processing Systems. pp. 1990-1998 (2015)   16  B. Jiang, R. Luo, J. Mao, T. Xiao, and Y. Jiang  20. Pinheiro, P.O., Lin, T.Y., Collobert, R., Doll´ar, P.: Learning to refine object segments. In: European Conference on Computer Vision. pp. 75-91. Springer (2016) 21. Rajaram, R.N., Ohn-Bar, E., Trivedi, M.M.: Refinenet: Iterative refinement for accurate object localization. In: Intelligent Transportation Systems (ITSC), 2016 IEEE 19th International Conference on. pp. 1528-1533. IEEE (2016)  22. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object detec- tion with region proposal networks. In: Advances in neural information processing systems. pp. 91-99 (2015)  23. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object detection with region proposal networks. In: Cortes, C., Lawrence, in Neu- N.D., Lee, D.D., Sugiyama, M., Garnett, R. ral Information Processing Systems 28, pp. 91-99. Curran Associates, Inc. (2015), http://papers.nips.cc/paper/5638-faster-r-cnn-towards-real-time-object- detection-with-region-proposal-networks.pdf  (eds.) Advances  24. Rothe, R., Guillaumin, M., Van Gool, L.: Non-maximum suppression for object detection by passing messages between windows. In: Asian Conference on Computer Vision. pp. 290-306. Springer (2014)  25. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., Berg, A.C., Fei-Fei, L.: ImageNet Large Scale Visual Recognition Challenge. International Journal of Computer Vision (IJCV) 115(3), 211-252 (2015). https://doi.org/10.1007/s11263-015-0816-y  26. Taigman, Y., Yang, M., Ranzato, M., Wolf, L.: Deepface: Closing the gap to human- level performance in face verification. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 1701-1708 (2014)  27. Toshev, A., Szegedy, C.: Deeppose: Human pose estimation via deep neural networks. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 1653-1660 (2014)  28. Uijlings, J.R., Van De Sande, K.E., Gevers, T., Smeulders, A.W.: Selective search for object recognition. International journal of computer vision 104(2), 154-171 (2013)  29. Wang, X., Xiao, T., Jiang, Y., Shao, S., Sun, J., Shen, C.: Repulsion loss: Detecting  pedestrians in a crowd. arXiv preprint arXiv:1711.07752 (2017)  30. Wu, J., Lu, E., Kohli, P., Freeman, W.T., Tenenbaum, J.B.: Learning to see physics via visual de-animation. In: Advances in Neural Information Processing Systems (2017)  31. Yang, B., Yan, J., Lei, Z., Li, S.Z.: Craft objects from images. arXiv preprint  arXiv:1604.03239 (2016)  32. Yu, J., Jiang, Y., Wang, Z., Cao, Z., Huang, T.: Unitbox: An advanced object detection network. In: Proceedings of the 2016 ACM on Multimedia Conference. pp. 516-520. ACM (2016)  33. Zitnick, C.L., Doll´ar, P.: Edge boxes: Locating object proposals from edges. In:  European Conference on Computer Vision. pp. 391-405. Springer (2014)"}