{"1": "1. Agustsson, E., Timofte, R.: Ntire 2017 challenge on single image super-resolution: Dataset and study. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) Workshops (2017)  2. Arbelaez, P., Maire, M., Fowlkes, C., Malik, J.: Contour detection and hierarchical image segmentation. IEEE transactions on pattern analysis and machine intelli- gence 33(5), 898-916 (2011)  3. Bevilacqua, M., Roumy, A., Guillemot, C., Alberi-Morel, M.: Low-complexity single-image super-resolution based on nonnegative neighbor embedding. In: Pro- ceedings of the British Machine Vision Conference (BMVC) (2012)  4. Choi, J.S., Kim, M.: A deep convolutional neural network with selection units for super-resolution. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) Workshops (2017)  5. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large- scale hierarchical image database. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) (2009)  6. Dong, C., Loy, C.C., He, K., Tang, X.: Learning a deep convolutional network for image super-resolution. In: Proceedings of the European Conference on Computer Vision (ECCV) (2014)  7. Dong, C., Loy, C.C., Tang, X.: Accelerating the super-resolution convolutional neural network. In: Proceedings of the European Conference on Computer Vision (ECCV) (2016)  8. Fan, Y., Shi, H., Yu, J., Liu, D., Han, W., Yu, H., Wang, Z., Wang, X., Huang, T.S.: Balanced two-stage residual networks for image super-resolution. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) Workshops (2017)  9. Girshick, R.: Fast r-cnn. In: Proceedings of the International Conference on Com-  puter Vision (ICCV) (2015)  10. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward neural networks. In: Proceedings of the International Conference on Artificial In- telligence and Statistics (2010)  11. Han, S., Mao, H., Dally, W.J.: Deep compression: Compressing deep neural net- works with pruning, trained quantization and huﬀman coding. Proceedings of the International Conference on Learning Representations (ICLR) (2016)  12. He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpassing human- level performance on imagenet classification. In: Proceedings of the International Conference on Computer Vision (ICCV) (2015)  13. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  14. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  15. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks. In: Proceedings of the European Conference on Computer Vision (ECCV) (2016) 16. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: Mobilenets: Eﬃcient convolutional neural networks for mobile vision applications. arXiv preprint arXiv:1704.04861 (2017)   Fast, Accurate, and Lightweight Super-Resolution with CARNReferences  1. Agustsson, E., Timofte, R.: Ntire 2017 challenge on single image super-resolution: Dataset and study. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) Workshops (2017)  2. Arbelaez, P., Maire, M., Fowlkes, C., Malik, J.: Contour detection and hierarchical image segmentation. IEEE transactions on pattern analysis and machine intelli- gence 33(5), 898-916 (2011)  3. Bevilacqua, M., Roumy, A., Guillemot, C., Alberi-Morel, M.: Low-complexity single-image super-resolution based on nonnegative neighbor embedding. In: Pro- ceedings of the British Machine Vision Conference (BMVC) (2012)  4. Choi, J.S., Kim, M.: A deep convolutional neural network with selection units for super-resolution. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) Workshops (2017)  5. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large- scale hierarchical image database. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) (2009)  6. Dong, C., Loy, C.C., He, K., Tang, X.: Learning a deep convolutional network for image super-resolution. In: Proceedings of the European Conference on Computer Vision (ECCV) (2014)  7. Dong, C., Loy, C.C., Tang, X.: Accelerating the super-resolution convolutional neural network. In: Proceedings of the European Conference on Computer Vision (ECCV) (2016)  8. Fan, Y., Shi, H., Yu, J., Liu, D., Han, W., Yu, H., Wang, Z., Wang, X., Huang, T.S.: Balanced two-stage residual networks for image super-resolution. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) Workshops (2017)  9. Girshick, R.: Fast r-cnn. In: Proceedings of the International Conference on Com-  puter Vision (ICCV) (2015)  10. Glorot, X., Bengio, Y.: Understanding the diﬃculty of training deep feedforward neural networks. In: Proceedings of the International Conference on Artificial In- telligence and Statistics (2010)  11. Han, S., Mao, H., Dally, W.J.: Deep compression: Compressing deep neural net- works with pruning, trained quantization and huﬀman coding. Proceedings of the International Conference on Learning Representations (ICLR) (2016)  12. He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpassing human- level performance on imagenet classification. In: Proceedings of the International Conference on Computer Vision (ICCV) (2015)  13. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  14. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  15. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks. In: Proceedings of the European Conference on Computer Vision (ECCV) (2016) 16. Howard, A.G., Zhu, M., Chen, B., Kalenichenko, D., Wang, W., Weyand, T., An- dreetto, M., Adam, H.: Mobilenets: Eﬃcient convolutional neural networks for mobile vision applications. arXiv preprint arXiv:1704.04861 (2017)   16  Namhyuk Ahn, Byungkon Kang, and Kyung-Ah Sohn  17. Huang, G., Liu, Z., van der Maaten, L., Weinberger, K.Q.: Densely connected convolutional networks. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  18. Huang, J.B., Singh, A., Ahuja, N.: Single image super-resolution from transformed self-exemplars. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) (2015)  19. Iandola, F.N., Han, S., Moskewicz, M.W., Ashraf, K., Dally, W.J., Keutzer, K.: Squeezenet: Alexnet-level accuracy with 50x fewer parameters and¡ 0.5 mb model size. arXiv preprint arXiv:1602.07360 (2016)  20. Kim, J., Kwon Lee, J., Mu Lee, K.: Accurate image super-resolution using very deep convolutional networks. In: Proceedings of the Conference on Computer Vi- sion and Pattern Recognition (CVPR) (2016)  21. Kim, J., Kwon Lee, J., Mu Lee, K.: Deeply-recursive convolutional network for image super-resolution. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  22. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. Proceedings of the International Conference on Learning Representations (ICLR) (2015) 23. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Proceedings of the Conference on Neural Informa- tion Processing Systems (NIPS) (2012)  24. Lai, W.S., Huang, J.B., Ahuja, N., Yang, M.H.: Deep laplacian pyramid networks for fast and accurate super-resolution. In: Proceedings of the Conference on Com- puter Vision and Pattern Recognition (CVPR) (2017)  25. Lee, J., Nam, J.: Multi-level and multi-scale feature aggregation using pretrained convolutional neural networks for music auto-tagging. IEEE Signal Processing Let- ters 24(8), 1208-1212 (2017)  26. Lim, B., Son, S., Kim, H., Nah, S., Lee, K.M.: Enhanced deep residual networks for single image super-resolution. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) Workshops (2017)  27. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd: Single shot multibox detector. In: Proceedings of the European Conference on Computer Vision (ECCV) (2016)  28. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) (2015)  29. Martin, D., Fowlkes, C., Tal, D., Malik, J.: A database of human segmented natural images and its application to evaluating segmentation algorithms and measuring ecological statistics. In: Proceedings of the International Conference on Computer Vision (ICCV) (2001)  30. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic seg- mentation. In: Proceedings of the International Conference on Computer Vision (ICCV) (2015)  31. Ren, H., El-Khamy, M., Lee, J.: Image super resolution based on fusing multi- ple convolution neural networks. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) Workshops (2017)  32. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomedi- cal image segmentation. In: Proceedings of the International Conference on Medical Image Computing and Computer-Assisted Intervention (2015)  33. Shi, W., Caballero, J., Husz´ar, F., Totz, J., Aitken, A.P., Bishop, R., Rueckert, D., Wang, Z.: Real-time single image and video super-resolution using an eﬃcient sub-   Fast, Accurate, and Lightweight Super-Resolution with CARNpixel convolutional neural network. In: Proceedings of the Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  34. Sifre, L., Mallat, S.: Rigid-motion scattering for image classification. Ph.D. thesis,  Citeseer (2014)  35. Tai, Y., Yang, J., Liu, X.: Image super-resolution via deep recursive residual net- work. In: Proceedings of the Conference on Computer Vision and Pattern Recog- nition (CVPR) (2017)  36. Tai, Y., Yang, J., Liu, X., Xu, C.: Memnet: A persistent memory network for image restoration. In: Proceedings of the International Conference on Computer Vision (ICCV) (2017)  37. Tong, T., Li, G., Liu, X., Gao, Q.: Image super-resolution using dense skip connec- tions. In: Proceedings of the International Conference on Computer Vision (ICCV) (2017)  38. Wang, Z., Bovik, A.C., Sheikh, H.R., Simoncelli, E.P.: Image quality assessment: from error visibility to structural similarity. IEEE transactions on image processing 13(4), 600-612 (2004)  39. Yang, J., Wright, J., Huang, T.S., Ma, Y.: Image super-resolution via sparse rep- resentation. IEEE transactions on image processing 19(11), 2861-2873 (2010) 40. Zhang, R., Isola, P., Efros, A.A.: Colorful image colorization. In: Proceedings of  the European Conference on Computer Vision (ECCV) (2016)"}