{"1": "1. Alameda-Pineda, X., Staiano, J., Subramanian, R., Batrinca, L., Ricci, E., Lepri, B., Lanz, O., Sebe, N.: Salsa: A novel dataset for multimodal group behavior analysis. IEEE Transactions on Pattern Analysis and Machine Intelligence 38(8), 1707-1720 (2016)  2. Andriluka, M., Roth, S., Schiele, B.: People-tracking-by-detection and people- detection-by-tracking. In: Computer Vision and Pattern Recognition, 2008. CVPR 2008. IEEE Conference on. pp. 1-8. IEEE (2008)  3. Andriyenko, A., Schindler, K.: Globally optimal multi-target tracking on a hexag-  onal lattice. In: ECCV. pp. 466-479 (2010)  4. Andriyenko, A., Schindler, K., Roth, S.: Discrete-continuous optimization for  multi-target tracking. In: CVPR. pp. 1926-1933 (2012)  5. Ba, S.O., Hung, H., Odobez, J.M.: Visual activity context for focus of attention estimation in dynamic meetings. In: Multimedia and Expo, 2009. ICME 2009. IEEE International Conference on. pp. 1424-1427. IEEE (2009)  6. Ba, S.O., Odobez, J.M.: Probabilistic head pose tracking evaluation in single and multiple camera setups. In: Multimodal Technologies for Perception of Humans, pp. 276-286. Springer (2008)  7. Ba, S.O., Odobez, J.M.: Recognizing visual focus of attention from head pose in natural meetings. Systems, Man, and Cybernetics, Part B: Cybernetics, IEEE Transactions on 39(1), 16-33 (2009)  8. Ba, S.O., Odobez, J.M.: Multiperson visual focus of attention from head pose and meeting contextual cues. Pattern Analysis and Machine Intelligence, IEEE Transactions on 33(1), 101-116 (2011)  9. Benfold, B., Reid, I.: Stable multi-target tracking in real-time surveillance video.  10. Benfold, B., Reid, I.: Guiding visual surveillance by tracking human attention. In:  In: CVPR. pp. 3457-3464 (2011)  BMVC. pp. 1-11 (2009)  11. Beymer, D.J.: Face recognition under varying pose. In: Computer Vision and Pat- tern Recognition, 1994. Proceedings CVPR’94., 1994 IEEE Computer Society Con- ference on. pp. 756-761. IEEE (1994)  12. Blanz, V., Vetter, T.: Face recognition based on fitting a 3D morphable model. Pattern Analysis and Machine Intelligence, IEEE Transactions on 25(9), 1063- 1074 (2003)  13. Brau, E., Guan, J., Simek, K., Del Pero, L., Dawson, C.R., Barnard, K.: Bayesian 3D tracking from monocular video. In: Computer Vision (ICCV), 2013 IEEE In- ternational Conference on. pp. 3368-3375. IEEE (2013)  14. Chen, C., Heili, A., Odobez, J.M.: A joint estimation of head and body orientation cues in surveillance video. In: Computer Vision Workshops (ICCV Workshops), 2011 IEEE International Conference on. pp. 860-867. IEEE (2011)  15. Chen, C., Odobez, J.M.: We are not contortionists: coupled adaptive learning for head and body orientation estimation in surveillance video. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on. pp. 1544-1551. IEEE (2012)  16. Cristani, M., Bazzani, L., Paggetti, G., Fossati, A., Tosato, D., Bue, A.D., Menegaz, G., Murino, V.: Social interaction discovery by statistical analysis of f-formations. In: BMVC (2011 of Conference)  17. Dehghan, A., Assari, S.M., Shah, M.: Gmmcp tracker: Globally optimal generalized maximum multi clique problem for multiple object tracking. In: CVPR. vol. 1, p. 2 (2015)   Multiple-gaze geometryReferences  1. Alameda-Pineda, X., Staiano, J., Subramanian, R., Batrinca, L., Ricci, E., Lepri, B., Lanz, O., Sebe, N.: Salsa: A novel dataset for multimodal group behavior analysis. IEEE Transactions on Pattern Analysis and Machine Intelligence 38(8), 1707-1720 (2016)  2. Andriluka, M., Roth, S., Schiele, B.: People-tracking-by-detection and people- detection-by-tracking. In: Computer Vision and Pattern Recognition, 2008. CVPR 2008. IEEE Conference on. pp. 1-8. IEEE (2008)  3. Andriyenko, A., Schindler, K.: Globally optimal multi-target tracking on a hexag-  onal lattice. In: ECCV. pp. 466-479 (2010)  4. Andriyenko, A., Schindler, K., Roth, S.: Discrete-continuous optimization for  multi-target tracking. In: CVPR. pp. 1926-1933 (2012)  5. Ba, S.O., Hung, H., Odobez, J.M.: Visual activity context for focus of attention estimation in dynamic meetings. In: Multimedia and Expo, 2009. ICME 2009. IEEE International Conference on. pp. 1424-1427. IEEE (2009)  6. Ba, S.O., Odobez, J.M.: Probabilistic head pose tracking evaluation in single and multiple camera setups. In: Multimodal Technologies for Perception of Humans, pp. 276-286. Springer (2008)  7. Ba, S.O., Odobez, J.M.: Recognizing visual focus of attention from head pose in natural meetings. Systems, Man, and Cybernetics, Part B: Cybernetics, IEEE Transactions on 39(1), 16-33 (2009)  8. Ba, S.O., Odobez, J.M.: Multiperson visual focus of attention from head pose and meeting contextual cues. Pattern Analysis and Machine Intelligence, IEEE Transactions on 33(1), 101-116 (2011)  9. Benfold, B., Reid, I.: Stable multi-target tracking in real-time surveillance video.  10. Benfold, B., Reid, I.: Guiding visual surveillance by tracking human attention. In:  In: CVPR. pp. 3457-3464 (2011)  BMVC. pp. 1-11 (2009)  11. Beymer, D.J.: Face recognition under varying pose. In: Computer Vision and Pat- tern Recognition, 1994. Proceedings CVPR’94., 1994 IEEE Computer Society Con- ference on. pp. 756-761. IEEE (1994)  12. Blanz, V., Vetter, T.: Face recognition based on fitting a 3D morphable model. Pattern Analysis and Machine Intelligence, IEEE Transactions on 25(9), 1063- 1074 (2003)  13. Brau, E., Guan, J., Simek, K., Del Pero, L., Dawson, C.R., Barnard, K.: Bayesian 3D tracking from monocular video. In: Computer Vision (ICCV), 2013 IEEE In- ternational Conference on. pp. 3368-3375. IEEE (2013)  14. Chen, C., Heili, A., Odobez, J.M.: A joint estimation of head and body orientation cues in surveillance video. In: Computer Vision Workshops (ICCV Workshops), 2011 IEEE International Conference on. pp. 860-867. IEEE (2011)  15. Chen, C., Odobez, J.M.: We are not contortionists: coupled adaptive learning for head and body orientation estimation in surveillance video. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on. pp. 1544-1551. IEEE (2012)  16. Cristani, M., Bazzani, L., Paggetti, G., Fossati, A., Tosato, D., Bue, A.D., Menegaz, G., Murino, V.: Social interaction discovery by statistical analysis of f-formations. In: BMVC (2011 of Conference)  17. Dehghan, A., Assari, S.M., Shah, M.: Gmmcp tracker: Globally optimal generalized maximum multi clique problem for multiple object tracking. In: CVPR. vol. 1, p. 2 (2015)   16  E. Brau, J. Guan, T. Jeﬀries, and K. Barnard  18. Del Pero, L., Guan, J., Brau, E., Schlecht, J., Barnard, K.: Sampling bedrooms.  CVPR pp. 2009-2016 (2011)  19. Duﬀner, S., Garcia, C.: Visual focus of attention estimation with unsupervised incremental learning. IEEE Transactions on Circuits and Systems for Video Tech- nology 26(12), 2264-2272 (2016)  20. Felzenszwalb, P., Girshick, R., McAllester, D., Ramanan, D.: Object detection with  discriminatively trained part-based models. IEEE PAMI (2009)  21. Gee, A., Cipolla, R.: Determining the gaze of faces in images. Image and Vision  Computing 12(10), 639-647 (1994)  22. Gu, L., Kanade, T.: 3D alignment of face in a single image. In: Computer Vision and Pattern Recognition, 2006 IEEE Computer Society Conference on. vol. 1, pp. 1305-1312. IEEE (2006)  23. Hartley, R., Zisserman, A.: Multiple View Geometry in Computer Vision. Cam-  bridge University Press (2000)  24. Hastie, T., Tibshirani, R., Friedman, J.: The elements of statistical learning; data mining, inference, and prediction. Springer series in statistics, Springer-Verlag, New York (2001)  25. Horprasert, T., Yacoob, Y., Davis, L.S.: Computing 3d head orientation from a monocular image sequence. In: 25th Annual AIPR Workshop on Emerging Ap- plications of Computer Vision. pp. 244-252. International Society for Optics and Photonics (1997)  26. Huang, J., Shao, X., Wechsler, H.: Face pose discrimination using support vector machines (svm). In: Pattern Recognition, 1998. Proceedings. Fourteenth Interna- tional Conference on. vol. 1, pp. 154-156. IEEE (1998)  27. Huang, Y., Duan, D., Cui, J., Davoine, F., Wang, L., Zha, H.: Joint estimation of head pose and visual focus of attention. In: Image Processing (ICIP), 2014 IEEE International Conference on. pp. 3332-3336. IEEE (2014)  28. Isard, M., MacCormick, J.: Bramble: A bayesian multiple-blob tracker. In: ICCV.  pp. 34-41 (2001)  29. Jayagopi, D.B., Sheikhi, S., Klotz, D., Wienke, J., Odobez, J.M., Wrede, S., Khali- dov, V., Nguyen, L., Wrede, B., Gatica-Perez, D.: The vernissage corpus: A mul- timodal human-robot-interaction dataset. Tech. rep. (2012)  30. Kitani, K.M., Ziebart, B.D., Bagnell, J.A., Hebert, M.: Activity forecasting. In:  ECCV (2012 of Conference)  31. Kuo, C., Huang, C., Nevatia, R.: Multi-target tracking by on-line learned discrim-  inative appearance models. In: CVPR. pp. 685-692 (2010)  32. La Cascia, M., Sclaroﬀ, S., Athitsos, V.: Fast, reliable head tracking under varying illumination: An approach based on registration of texture-mapped 3d models. Pattern Analysis and Machine Intelligence, IEEE Transactions on 22(4), 322-336 (2000)  33. Li, Y., Gong, S., Liddell, H.: Support vector regression and classification based multi-view face detection and recognition. In: Automatic Face and Gesture Recog- nition, 2000. Proceedings. Fourth IEEE International Conference on. pp. 300-305. IEEE (2000)  34. Li, Y., Gong, S., Sherrah, J., Liddell, H.: Support vector machine based multi- view face detection and recognition. Image and Vision Computing 22(5), 413-427 (2004)  35. Liu, C.: Exploring New Representations and Applications for Motion Analysis.  Ph.D. thesis, M.I.T. (2009)   Multiple-gaze geometry36. Mass´e, B., Ba, S., Horaud, R.: Simultaneous estimation of gaze direction and visual focus of attention for multi-person-to-robot interaction. In: Multimedia and Expo (ICME), 2016 IEEE International Conference on. pp. 1-6. IEEE (2016)  37. Milan, A., Leal-Taix´e, L., Schindler, K., Reid, I.: Joint tracking and segmentation of multiple targets. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5397-5406 (2015)  38. Murphy-Chutorian, E., Trivedi, M.M.: Head pose estimation in computer vision: A survey. Pattern Analysis and Machine Intelligence, IEEE Transactions on 31(4), 607-626 (2009)  39. Niyogi, S., Freeman, W.T.: Example-based head tracking. In: Automatic Face and Gesture Recognition, 1996., Proceedings of the Second International Conference on. pp. 374-378. IEEE (1996)  40. Oh, S.: Bayesian formulation of data association and markov chain monte carlo data association. In: Robotics: Science and Systems Conference (RSS) Workshop Inside Data association (2008)  41. Oh, S., Russell, S., Sastry, S.: Markov chain Monte Carlo data association for  general multiple target tracking problems. (2004)  42. Otsuka, K., Takemae, Y., Yamato, J.: A probabilistic inference of multiparty- conversation structure based on markov-switching models of gaze patterns, head directions, and utterances. In: Proceedings of the 7th international conference on Multimodal interfaces. pp. 191-198. ACM (2005)  43. Otsuka, K., Yamato, J., Takemae, Y., Murase, H.: Conversation scene analysis with dynamic bayesian network basedon visual head tracking. In: Multimedia and Expo, 2006 IEEE International Conference on. pp. 949-952. IEEE (2006)  44. Pirsiavash, H., Ramanan, D., Fowlkes, C.: Globally-optimal greedy algorithms for  tracking a variable number of objects. CVPR pp. 1201-1208 (2011)  45. Sankaranarayanan, K., Chang, M.C., Krahnstoever, N.: Tracking gaze direction from far-field surveillance cameras. In: Applications of Computer Vision (WACV), 2011 IEEE Workshop on. pp. 519-526. IEEE (2011)  46. Segal, A.V., Reid, I.: Latent data association: Bayesian model selection for multi- target tracking. In: Computer Vision (ICCV), 2013 IEEE International Conference on. pp. 2904-2911. IEEE (2013)  47. Sheikhi, S., Odobez, J.M.: Recognizing the visual focus of attention for human robot interaction. In: International Workshop on Human Behavior Understanding. pp. 99-112. Springer (2012)  48. Smith, K., Ba, S.O., Gatica-Perez, D., Odobez, J.M.: Tracking the multi person wandering visual focus of attention. In: Proceedings of the 8th international con- ference on Multimodal interfaces. pp. 265-272. ACM (2006)  49. Smith, K., Ba, S.O., Odobez, J.M., Gatica-Perez, D.: Tracking the visual focus of attention for a varying number of wandering people. Pattern Analysis and Machine Intelligence, IEEE Transactions on 30(7), 1212-1229 (2008)  50. Stiefelhagen, R., Bernardin, K., Bowers, R., Garofolo, J., Mostefa, D., Soundarara- jan, P.: The CLEAR 2006 evaluation. In: Proceedings of the 1st international eval- uation conference on Classification of events, activities and relationships. pp. 1-44. CLEAR’06, Berlin, Heidelberg (2007)  51. Stiefelhagen, R., Yang, J., Waibel, A.: Modeling focus of attention for meeting indexing. In: Proceedings of the seventh ACM international conference on Multi- media (Part 1). pp. 3-10. ACM (1999)  52. Stiefelhagen, R., Yang, J., Waibel, A.: Modeling focus of attention for meeting indexing based on multiple cues. Neural Networks, IEEE Transactions on 13(4), 928-938 (2002)   18  E. Brau, J. Guan, T. Jeﬀries, and K. Barnard  53. Stiefelhagen, R., Zhu, J.: Head orientation and gaze direction in meetings. In: CHI’02 Extended Abstracts on Human Factors in Computing Systems. pp. 858- 859. ACM (2002)  54. Tang, S., Andres, B., Andriluka, M., Schiele, B.: Subgraph decomposition for multi- target tracking. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 50330-5041 (2015)  55. Titsias, M.K., Lawrence, N.D., Rattray, M.: Eﬃcient sampling for Gaussian Pro- cess inference using control variables. In: Advances in Neural Information Process- ing Systems. vol. 21, pp. 1681-1688. Curran Associates, Inc., Vancouver, British Columbia, Canada (2008)  56. Valenti, R., Sebe, N., Gevers, T.: Combining head pose and eye location informa- tion for gaze estimation. Image Processing, IEEE Transactions on 21(2), 802-815 (2012)  57. Voit, M., Nickel, K., Stiefelhagen, R.: Head pose estimation in single-and multi-view environments-results on the CLEAR07 benchmarks. In: Multimodal Technologies for Perception of Humans, pp. 307-316. Springer (2008)  58. Voit, M., Stiefelhagen, R.: Deducing the visual focus of attention from head pose estimation in dynamic multi-view meeting scenarios. In: Proceedings of the 10th international conference on Multimodal interfaces. pp. 173-180. ACM (2008) 59. Voit, M., Stiefelhagen, R.: 3D user-perspective, voxel-based estimation of visual focus of attention in dynamic meeting scenarios. In: International Conference on Multimodal Interfaces and the Workshop on Machine Learning for Multimodal Interaction. p. 51. ACM (2010)  60. Vondrick, C., Patterson, D., Ramanan, D.: Eﬃciently scaling up crowd- sourced video annotation. International Journal of Computer Vision pp. 1-21, http://dx.doi.org/10.1007/s11263-012-0564-1, 10.1007/s11263-012-0564-1  61. Wei, P., Zhao, Y., Zheng, N., Zhu, S.C.: Modeling 4d human-object interactions for joint event segmentation, recognition, and object localization. IEEE Trans Pattern Anal Mach Intell. (2016)  62. Wu, Y., Toyama, K.: Wide-range, person-and illumination-insensitive head orien- tation estimation. In: Automatic Face and Gesture Recognition, 2000. Proceedings. Fourth IEEE International Conference on. pp. 183-188. IEEE (2000)  63. Xiao, J., Moriyama, T., Kanade, T., Cohn, J.F.: Robust full-motion recovery of head by dynamic templates and re-registration techniques. International Journal of Imaging Systems and Technology 13(1), 85-94 (2003)  64. Xie, D., Todorovicy, S., Zhu, S.C.: Inferring “dark matter and “dark energy from  videos. In: ICCV (2013 of Conference)  65. Yang, R., Zhang, Z.: Model-based head pose tracking with stereovision. In: Auto- matic Face and Gesture Recognition, 2002. Proceedings. Fifth IEEE International Conference on. pp. 255-260. IEEE (2002)  66. Yi, Y., Xu, H.: Hierarchical data association framework with occlusion handling for multiple targets tracking. Signal Processing Letters, IEEE 21(3), 288-291 (2014) 67. Y¨ucel, Z., Salah, A.A., Mericli, C., Meri¸cli, T., Valenti, R., Gevers, T.: Joint atten- tion by gaze interpolation and saliency. IEEE Transactions on cybernetics 43(3), 829-842 (2013)  68. Zen, G., Lepri, B., Ricci, E., Lanz, O.: Space speaks: towards socially and person- ality aware visual surveillance. In: 1st ACM international workshop on Multimodal pervasive video analysis. pp. 37-42. ACM, Firenze, Italy (2010 of Conference) 69. Zhang, L., Li, Y., Nevatia, R.: Global data association for multi-object tracking using network ﬂows. In: Computer Vision and Pattern Recognition, 2008. CVPR 2008. IEEE Conference on. pp. 1-8. IEEE (2008)   Multiple-gaze geometry70. Zhao, G., Chen, L., Song, J., Chen, G.: Large head movement tracking using sift- based registration. In: Proceedings of the 15th international conference on Multi- media. pp. 807-810. ACM (2007)  71. Zhu, X., Ramanan, D.: Face detection, pose estimation, and landmark localization in the wild. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on. pp. 2879-2886. IEEE (2012)"}