{"1": "1. Bojarski, M., Testa, D.D., Dworakowski, D., Firner, B., Flepp, B., Goyal, P., Jackel, L.D., Monfort, M., Muller, U., Zhang, J., Zhang, X., Zhao, J., Zieba, K.: End to end learning for self-driving cars. arXiv:1604.07316 (2016)  2. Bresson, G., Alsayed, Z., Yu, L., Glaser, S.: Simultaneous localization and mapping: A sur- vey of current trends in autonomous driving. IEEE Trans. on Intelligent Vehicles (2017) 3. Chen, C., Seff, A., Kornhauser, A.L., Xiao, J.: DeepDriving: Learning affordance for direct perception in autonomous driving. In: International Conference on Computer Vision (ICCV) (2015)  4. Codevilla, F., M¨uller, M., L´opez, A., Koltun, V., Dosovitskiy, A.: End-to-end driving via conditional imitation learning. In: International Conference on Robotics and Automation (ICRA) (2018)  5. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The Cityscapes dataset for semantic urban scene understanding. In: Computer Vision and Pattern Recognition (CVPR) (2016)  6. Dosovitskiy, A., Ros, G., Codevilla, F., L´opez, A., Koltun, V.: CARLA: An open urban driv-  ing simulator. In: Conference on Robot Learning (CoRL) (2017)  7. Ebrahimi, S., Rohrbach, A., Darrell, T.: Gradient-free policy architecture search and adapta-  tion. In: Conference on Robot Learning (CoRL) (2017)  8. Fernando, T., Denman, S., Sridharan, S., Fookes, C.: Going deeper: Autonomous steering with neural memory networks. In: International Conference on Computer Vision (ICCV) Workshops (2017)  9. Gaidon, A., Wang, Q., Cabon, Y., Vig, E.: Virtual worlds as proxy for multi-object tracking  analysis. In: Computer Vision and Pattern Recognition (CVPR) (2016)  10. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? The KITTI vision  benchmark suite. In: Computer Vision and Pattern Recognition (CVPR) (2012)  11. Hubschneider, C., Bauer, A., Weber, M., Zollner, J.M.: Adding navigation to the equation: Turning decisions for end-to-end vehicle control. In: Intelligent Transportation Systems Con- ference (ITSC) Workshops (2017)  12. Jin, X., Xiao, H., Shen, X., Yang, J., Lin, Z., Chen, Y., Jie, Z., Feng, J., Yan, S.: Predicting scene parsing and motion dynamics in the future. In: Neural Information Processing Systems (NIPS) (2017)  13. Kahn, G., Villaﬂor, A., Pong, V., Abbeel, P., Levine, S.: Uncertainty-aware reinforcement  learning for collision avoidance. arXiv:1702.01182 (2017)  14. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. In: International Confer-  ence on Learning Representation (ICLR) (2015)  15. LeCun, Y., Muller, U., Ben, J., Cosatto, E., Flepp, B.: Off-road obstacle avoidance through  end-to-end learning. In: Neural Information Processing Systems (NIPS) (2005)  16. Maddern, W., Pascoe, G., Linegar, C., Newman, P.: 1 Year, 1000km: The Oxford RobotCar  Dataset. The International Journal of Robotics Research (IJRR) (2017)  17. Paden, B., C´ap, M., Yong, S.Z., Yershov, D.S., Frazzoli, E.: A survey of motion planning and control techniques for self-driving urban vehicles. IEEE Trans. on Intelligent Vehicles (2016)  18. Pomerleau, D.: ALVINN: An autonomous land vehicle in a neural network. In: Neural In-  formation Processing Systems (NIPS) (1988)  19. Richter, S.R., Hayder, Z., Koltun, V.: Playing for benchmarks. In: International Conference  on Computer Vision (ICCV) (2017)  20. Richter, S.R., Vineet, V., Roth, S., Koltun, V.: Playing for data: Ground truth from computer  games. In: European Conference on Computer Vision (ECCV) (2016)   On Ofﬂine Evaluation of Vision-based Driving ModelsReferences  1. Bojarski, M., Testa, D.D., Dworakowski, D., Firner, B., Flepp, B., Goyal, P., Jackel, L.D., Monfort, M., Muller, U., Zhang, J., Zhang, X., Zhao, J., Zieba, K.: End to end learning for self-driving cars. arXiv:1604.07316 (2016)  2. Bresson, G., Alsayed, Z., Yu, L., Glaser, S.: Simultaneous localization and mapping: A sur- vey of current trends in autonomous driving. IEEE Trans. on Intelligent Vehicles (2017) 3. Chen, C., Seff, A., Kornhauser, A.L., Xiao, J.: DeepDriving: Learning affordance for direct perception in autonomous driving. In: International Conference on Computer Vision (ICCV) (2015)  4. Codevilla, F., M¨uller, M., L´opez, A., Koltun, V., Dosovitskiy, A.: End-to-end driving via conditional imitation learning. In: International Conference on Robotics and Automation (ICRA) (2018)  5. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The Cityscapes dataset for semantic urban scene understanding. In: Computer Vision and Pattern Recognition (CVPR) (2016)  6. Dosovitskiy, A., Ros, G., Codevilla, F., L´opez, A., Koltun, V.: CARLA: An open urban driv-  ing simulator. In: Conference on Robot Learning (CoRL) (2017)  7. Ebrahimi, S., Rohrbach, A., Darrell, T.: Gradient-free policy architecture search and adapta-  tion. In: Conference on Robot Learning (CoRL) (2017)  8. Fernando, T., Denman, S., Sridharan, S., Fookes, C.: Going deeper: Autonomous steering with neural memory networks. In: International Conference on Computer Vision (ICCV) Workshops (2017)  9. Gaidon, A., Wang, Q., Cabon, Y., Vig, E.: Virtual worlds as proxy for multi-object tracking  analysis. In: Computer Vision and Pattern Recognition (CVPR) (2016)  10. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? The KITTI vision  benchmark suite. In: Computer Vision and Pattern Recognition (CVPR) (2012)  11. Hubschneider, C., Bauer, A., Weber, M., Zollner, J.M.: Adding navigation to the equation: Turning decisions for end-to-end vehicle control. In: Intelligent Transportation Systems Con- ference (ITSC) Workshops (2017)  12. Jin, X., Xiao, H., Shen, X., Yang, J., Lin, Z., Chen, Y., Jie, Z., Feng, J., Yan, S.: Predicting scene parsing and motion dynamics in the future. In: Neural Information Processing Systems (NIPS) (2017)  13. Kahn, G., Villaﬂor, A., Pong, V., Abbeel, P., Levine, S.: Uncertainty-aware reinforcement  learning for collision avoidance. arXiv:1702.01182 (2017)  14. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. In: International Confer-  ence on Learning Representation (ICLR) (2015)  15. LeCun, Y., Muller, U., Ben, J., Cosatto, E., Flepp, B.: Off-road obstacle avoidance through  end-to-end learning. In: Neural Information Processing Systems (NIPS) (2005)  16. Maddern, W., Pascoe, G., Linegar, C., Newman, P.: 1 Year, 1000km: The Oxford RobotCar  Dataset. The International Journal of Robotics Research (IJRR) (2017)  17. Paden, B., C´ap, M., Yong, S.Z., Yershov, D.S., Frazzoli, E.: A survey of motion planning and control techniques for self-driving urban vehicles. IEEE Trans. on Intelligent Vehicles (2016)  18. Pomerleau, D.: ALVINN: An autonomous land vehicle in a neural network. In: Neural In-  formation Processing Systems (NIPS) (1988)  19. Richter, S.R., Hayder, Z., Koltun, V.: Playing for benchmarks. In: International Conference  on Computer Vision (ICCV) (2017)  20. Richter, S.R., Vineet, V., Roth, S., Koltun, V.: Playing for data: Ground truth from computer  games. In: European Conference on Computer Vision (ECCV) (2016)   16  F. Codevilla, A. M. L´opez, V. Koltun, and A.Dosovitskiy  21. Ros, G., Ramos, S., Granados, M., Bakhtiary, A., V´azquez, D., L´opez, A.M.: Vision-based ofﬂine-online perception paradigm for autonomous driving. In: Winter conf. on Applications of Computer Vision (WACV) (2015)  22. Ros, G., Sellart, L., Materzynska, J., V´azquez, D., L´opez, A.M.: The SYNTHIA dataset: A large collection of synthetic images for semantic segmentation of urban scenes. In: Computer Vision and Pattern Recognition (CVPR) (2016)  23. Santana, E., Hotz, G.: Learning a driving simulator. arXiv:1608.01230 (2016) 24. Schneider, L., Cordts, M., Rehfeld, T., Pfeiffer, D., Enzweiler, M., Franke, U., Pollefeys, M., Roth, S.: Semantic stixels: Depth is not enough. In: Intelligent Vehicles Symposium (IV) (2016)  25. Udacity: https://github.com/udacity/self-driving-car 26. Wymann, B., Espi´e, E., Guionneau, C., Dimitrakakis, C., Coulom, R., Sumner, A.: TORCS,  The Open Racing Car Simulator. http://www.torcs.org  27. Xu, H., Gao, Y., Yu, F., Darrell, T.: End-to-end learning of driving models from large-scale  video datasets. In: Computer Vision and Pattern Recognition (CVPR) (2017)  28. Zhu, Z., Liang, D., Zhang, S., Huang, X., Li, B., Hu, S.: Traffic-sign detection and classifi-  cation in the wild. In: Computer Vision and Pattern Recognition (CVPR) (2016)"}