{"1": "1. Alahi, A., Ortiz, R., Vandergheynst, P.: FREAK: fast retina keypoint. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2012) 2. Bekios-Calfa, J., Buenaposada, J.M., Baumela, L.: Robust gender recognition by exploiting facial attributes dependencies. Pattern Recognition Letters (PRL) 36, 228-234 (2014)  3. Belhumeur, P.N., Jacobs, D.W., Kriegman, D.J., Kumar, N.: Localizing parts of faces using a consensus of exemplars. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2011)  4. Blanz, V., Vetter, T.: Face recognition based on fitting a 3d morphable model.  IEEE Trans. on Pattern Analysis and Machine Intelligence (TPAMI) (2003)  5. Bulat, A., Tzimiropoulos, G.: Binarized convolutional landmark localizers for hu- man pose estimation and face alignment with limited resources. In: Proc. Interna- tional Conference on Computer Vision (ICCV) (2017)  6. Burgos-Artizzu, X.P., Perona, P., Dollar, P.: Robust face landmark estimation under occlusion. In: Proc. International Conference on Computer Vision (ICCV) (2013)  7. Cao, X., Wei, Y., Wen, F., Sun, J.: Face alignment by explicit shape regression. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2012)  8. Cootes, T.F., Edwards, G.J., Taylor, C.J.: Active appearance models. In: Proc.  European Conference on Computer Vision (ECCV) (1998)  9. Dantone, M., Gall, J., Fanelli, G., Gool, L.V.: Real-time facial feature detection using conditional regression forests. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2012)  10. David, P., DeMenthon, D., Duraiswami, R., Samet, H.: Softposit: Simultaneous pose and correspondence determination. International Journal of Computer Vision (IJCV) 59(3), 259-284 (2004)  11. Deng, J., Liu, Q., Yang, J., Tao, D.: CSR: multi-view, multi-scale and multi- component cascade shape regression. Image and Vision Computing (IVC) 47, 19- 26 (2016)  12. Dollar, P., Welinder, P., Perona, P.: Cascaded pose regression. In: Proc. IEEE  Conference on Computer Vision and Pattern Recognition (CVPR) (2010)  13. Fan, H., Zhou, E.: Approaching human level facial landmark localization by deep  learning. Image and Vision Computing (IVC) 47, 27-35 (2016)  14. Feng, Z., Kittler, J., Christmas, W.J., Huber, P., Wu, X.: Dynamic attention- controlled cascaded shape regression exploiting training data augmentation and fuzzy-set sample weighting. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  15. Hastie, T., Tibshirani, R., Friedman, J.H.: The Elements of Statistical Learning.  Springer (2009)  16. Honari, S., Yosinski, J., Vincent, P., Pal, C.J.: Recombinator networks: Learning coarse-to-fine feature aggregation. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  17. Jourabloo, A., Ye, M., Liu, X., Ren, L.: Pose-invariant face alignment with a single CNN. In: Proc. International Conference on Computer Vision (ICCV) (2017) 18. Kazemi, V., Sullivan, J.: One millisecond face alignment with an ensemble of regres- sion trees. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2014)   A Deeply-initialized Coarse-to-fine Ensemble for Face AlignmentReferences  1. Alahi, A., Ortiz, R., Vandergheynst, P.: FREAK: fast retina keypoint. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2012) 2. Bekios-Calfa, J., Buenaposada, J.M., Baumela, L.: Robust gender recognition by exploiting facial attributes dependencies. Pattern Recognition Letters (PRL) 36, 228-234 (2014)  3. Belhumeur, P.N., Jacobs, D.W., Kriegman, D.J., Kumar, N.: Localizing parts of faces using a consensus of exemplars. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2011)  4. Blanz, V., Vetter, T.: Face recognition based on fitting a 3d morphable model.  IEEE Trans. on Pattern Analysis and Machine Intelligence (TPAMI) (2003)  5. Bulat, A., Tzimiropoulos, G.: Binarized convolutional landmark localizers for hu- man pose estimation and face alignment with limited resources. In: Proc. Interna- tional Conference on Computer Vision (ICCV) (2017)  6. Burgos-Artizzu, X.P., Perona, P., Dollar, P.: Robust face landmark estimation under occlusion. In: Proc. International Conference on Computer Vision (ICCV) (2013)  7. Cao, X., Wei, Y., Wen, F., Sun, J.: Face alignment by explicit shape regression. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2012)  8. Cootes, T.F., Edwards, G.J., Taylor, C.J.: Active appearance models. In: Proc.  European Conference on Computer Vision (ECCV) (1998)  9. Dantone, M., Gall, J., Fanelli, G., Gool, L.V.: Real-time facial feature detection using conditional regression forests. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2012)  10. David, P., DeMenthon, D., Duraiswami, R., Samet, H.: Softposit: Simultaneous pose and correspondence determination. International Journal of Computer Vision (IJCV) 59(3), 259-284 (2004)  11. Deng, J., Liu, Q., Yang, J., Tao, D.: CSR: multi-view, multi-scale and multi- component cascade shape regression. Image and Vision Computing (IVC) 47, 19- 26 (2016)  12. Dollar, P., Welinder, P., Perona, P.: Cascaded pose regression. In: Proc. IEEE  Conference on Computer Vision and Pattern Recognition (CVPR) (2010)  13. Fan, H., Zhou, E.: Approaching human level facial landmark localization by deep  learning. Image and Vision Computing (IVC) 47, 27-35 (2016)  14. Feng, Z., Kittler, J., Christmas, W.J., Huber, P., Wu, X.: Dynamic attention- controlled cascaded shape regression exploiting training data augmentation and fuzzy-set sample weighting. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  15. Hastie, T., Tibshirani, R., Friedman, J.H.: The Elements of Statistical Learning.  Springer (2009)  16. Honari, S., Yosinski, J., Vincent, P., Pal, C.J.: Recombinator networks: Learning coarse-to-fine feature aggregation. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  17. Jourabloo, A., Ye, M., Liu, X., Ren, L.: Pose-invariant face alignment with a single CNN. In: Proc. International Conference on Computer Vision (ICCV) (2017) 18. Kazemi, V., Sullivan, J.: One millisecond face alignment with an ensemble of regres- sion trees. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2014)   16  R. Valle, J.M. Buenaposada, A. Vald´es and L. Baumela  19. Kowalski, M., Naruniec, J.: Face alignment using k-cluster regression forests with weighted splitting. IEEE Signal Processing Letters 23(11), 1567-1571 (2016) 20. Kowalski, M., Naruniec, J., Trzcinski, T.: Deep alignment network: A convolutional neural network for robust face alignment. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW) (2017)  21. Lee, D., Park, H., Yoo, C.D.: Face alignment using cascade gaussian process regres- sion trees. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2015)  22. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S.E., Fu, C., Berg, A.C.: SSD: single shot multibox detector. In: Proc. European Conference on Computer Vision (ECCV) (2016)  23. Lv, J., Shao, X., Xing, J., Cheng, C., Zhou, X.: A deep regression architecture with two-stage re-initialization for high performance facial landmark detection. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  24. Ren, S., Cao, X., Wei, Y., Sun, J.: Face alignment at 3000 fps via regressing local binary features. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2014)  25. Soltanpour, S., Boufama, B., Wu, Q.M.J.: A survey of local feature methods for  3D face recognition. Pattern Recognition (PR) 72, 391-406 (2017)  26. Sun, Y., Wang, X., Tang, X.: Deep convolutional network cascade for facial point detection. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2013)  27. Trigeorgis, G., Snape, P., Nicolaou, M.A., Antonakos, E., Zafeiriou, S.: Mnemonic descent method: A recurrent process applied for end-to-end face alignment. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  28. Wu, Y., Ji, Q.: Robust facial landmark detection under significant head poses and occlusion. In: Proc. International Conference on Computer Vision (ICCV) (2015) 29. Xiao, S., Feng, J., Liu, L., Nie, X., Wang, W., Yan, S., Kassim, A.A.: Recurrent 3d- 2d dual learning for large-pose facial landmark detection. In: Proc. International Conference on Computer Vision (ICCV) (2017)  30. Xiao, S., Feng, J., Xing, J., Lai, H., Yan, S., Kassim, A.A.: Robust facial land- mark detection via recurrent attentive-refinement networks. In: Proc. European Conference on Computer Vision (ECCV) (2016)  31. Xiong, X., la Torre, F.D.: Supervised descent method and its applications to face alignment. In: Proc. IEEE Conference on Computer Vision and Pattern Recogni- tion (CVPR) (2013)  32. Xiong, X., la Torre, F.D.: Global supervised descent method. In: Proc. IEEE Con-  ference on Computer Vision and Pattern Recognition (CVPR) (2015)  33. Yang, J., Liu, Q., Zhang, K.: Stacked hourglass network for robust facial land- mark localisation. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW) (2017)  34. Yu, X., Zhou, F., Chandraker, M.: Deep deformation network for object landmark localization. In: Proc. European Conference on Computer Vision (ECCV) (2016) 35. Zafeiriou, S., Trigeorgis, G., Chrysos, G., Deng, J., Shen, J.: The menpo facial landmark localisation challenge: A step towards the solution. In: Proc. IEEE Con- ference on Computer Vision and Pattern Recognition Workshops (CVPRW) (2017) 36. Zhang, Z., Luo, P., Loy, C.C., Tang, X.: Facial landmark detection by deep multi- task learning. In: Proc. European Conference on Computer Vision (ECCV) (2014)   A Deeply-initialized Coarse-to-fine Ensemble for Face Alignment37. Zhu, S., Li, C., Change, C., Tang, X.: Unconstrained face alignment via cascaded compositional learning. In: Proc. IEEE Conference on Computer Vision and Pat- tern Recognition (CVPR) (2016)  38. Zhu, S., Li, C., Loy, C.C., Tang, X.: Face alignment by coarse-to-fine shape search- ing. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2015)"}