{"1": "1. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2016) 770-778  2. Zhou, B., Zhao, H., Puig, X., Fidler, S., Barriuso, A., Torralba, A.: Scene parsing  through ade20k dataset. In: Proc. CVPR. (2017)  3. Hu, R., Doll´ar, P., He, K., Darrell, T., Girshick, R.: Learning to segment every  thing. arXiv preprint arXiv:1711.10370 (2017)  4. Cimpoi, M., Maji, S., Kokkinos, I., Mohamed, S., Vedaldi, A.: Describing textures in the wild. In: Computer Vision and Pattern Recognition (CVPR), 2014 IEEE Conference on, IEEE (2014) 3606-3613  5. Liu, C., Sharan, L., Adelson, E.H., Rosenholtz, R.: Exploring features in a bayesian  framework for material recognition. In: Proc. CVPR  6. Bell, S., Upchurch, P., Snavely, N., Bala, K.: Opensurfaces: A richly annotated catalog of surface appearance. ACM Transactions on Graphics (TOG) 32(4) (2013) 111  7. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Advances in neural information processing systems. (2012) 1097-1105  8. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. (2015)  9. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A., et al.: Going deeper with convolutions, Cvpr (2015) 10. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. In: International Conference on Learning Representations (ICLR). (2014)  11. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic In: Proceedings of the IEEE conference on computer vision and  segmentation. pattern recognition. (2015) 3431-3440  12. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmen- tation. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 1520-1528  13. Zeiler, M.D., Taylor, G.W., Fergus, R.: Adaptive deconvolutional networks for In: Computer Vision (ICCV), 2011 IEEE  mid and high level feature learning. International Conference on, IEEE (2011) 2018-2025  14. Yu, F., Koltun, V.: Multi-scale context aggregation by dilated convolutions. In:  International Conference on Learning Representations (ICLR). (2016)  15. Lin, G., Milan, A., Shen, C., Reid, I.: Refinenet: Multi-path refinement networks for high-resolution semantic segmentation. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017)  16. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). (2017) 2881- 2890  17. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The International journal of computer  pascal visual object classes (voc) challenge. vision 88(2) (2010) 303-338  18. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2016) 3213-3223   Unified Perceptual Parsing for Scene UnderstandingReferences  1. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2016) 770-778  2. Zhou, B., Zhao, H., Puig, X., Fidler, S., Barriuso, A., Torralba, A.: Scene parsing  through ade20k dataset. In: Proc. CVPR. (2017)  3. Hu, R., Doll´ar, P., He, K., Darrell, T., Girshick, R.: Learning to segment every  thing. arXiv preprint arXiv:1711.10370 (2017)  4. Cimpoi, M., Maji, S., Kokkinos, I., Mohamed, S., Vedaldi, A.: Describing textures in the wild. In: Computer Vision and Pattern Recognition (CVPR), 2014 IEEE Conference on, IEEE (2014) 3606-3613  5. Liu, C., Sharan, L., Adelson, E.H., Rosenholtz, R.: Exploring features in a bayesian  framework for material recognition. In: Proc. CVPR  6. Bell, S., Upchurch, P., Snavely, N., Bala, K.: Opensurfaces: A richly annotated catalog of surface appearance. ACM Transactions on Graphics (TOG) 32(4) (2013) 111  7. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Advances in neural information processing systems. (2012) 1097-1105  8. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. (2015)  9. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A., et al.: Going deeper with convolutions, Cvpr (2015) 10. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Semantic image segmentation with deep convolutional nets and fully connected crfs. In: International Conference on Learning Representations (ICLR). (2014)  11. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic In: Proceedings of the IEEE conference on computer vision and  segmentation. pattern recognition. (2015) 3431-3440  12. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmen- tation. In: Proceedings of the IEEE International Conference on Computer Vision. (2015) 1520-1528  13. Zeiler, M.D., Taylor, G.W., Fergus, R.: Adaptive deconvolutional networks for In: Computer Vision (ICCV), 2011 IEEE  mid and high level feature learning. International Conference on, IEEE (2011) 2018-2025  14. Yu, F., Koltun, V.: Multi-scale context aggregation by dilated convolutions. In:  International Conference on Learning Representations (ICLR). (2016)  15. Lin, G., Milan, A., Shen, C., Reid, I.: Refinenet: Multi-path refinement networks for high-resolution semantic segmentation. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2017)  16. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). (2017) 2881- 2890  17. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The International journal of computer  pascal visual object classes (voc) challenge. vision 88(2) (2010) 303-338  18. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: Proceedings of the IEEE conference on computer vision and pattern recognition. (2016) 3213-3223   16  T. Xiao, Y. Liu, B. Zhou, Y. Jiang, J. Sun  19. Keeler, J.D., Rumelhart, D.E., Leow, W.K.: Integrated segmentation and recog- nition of hand-printed numerals. In: Advances in neural information processing systems. (1991) 557-563  20. Kokkinos, I., Maragos, P.: An expectation maximization approach to the synergy between image segmentation and object categorization. In: Computer Vision, 2005. ICCV 2005. Tenth IEEE International Conference on. Volume 1., IEEE (2005) 617-624  21. Maire, M., Stella, X.Y., Perona, P.: Object detection and segmentation from joint embedding of parts and pixels. In: Computer Vision (ICCV), 2011 IEEE Interna- tional Conference on, IEEE (2011) 2142-2149  22. Elhoseiny, M., El-Gaaly, T., Bakry, A., Elgammal, A.: Convolutional models for joint object categorization and pose estimation. arXiv preprint arXiv:1511.05175 (2015)  23. Eigen, D., Fergus, R.: Predicting depth, surface normals and semantic labels with In: Proceedings of the IEEE  a common multi-scale convolutional architecture. International Conference on Computer Vision. (2015) 2650-2658  24. Teichmann, M., Weber, M., Zoellner, M., Cipolla, R., Urtasun, R.: Multi- net: Real-time joint semantic reasoning for autonomous driving. arXiv preprint arXiv:1612.07695 (2016)  25. Kokkinos, I.: Ubernet: Training a universal convolutional neural network for low-, mid-, and high-level vision using diverse datasets and limited memory. In: IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). (2017)  26. Bau, D., Zhou, B., Khosla, A., Oliva, A., Torralba, A.: Network dissection: Quan- tifying interpretability of deep visual representations. In: Proc. CVPR. (2017) 27. Mottaghi, R., Chen, X., Liu, X., Cho, N.G., Lee, S.W., Fidler, S., Urtasun, R., Yuille, A.: The role of context for object detection and semantic segmentation in the wild. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2014)  28. Chen, X., Mottaghi, R., Liu, X., Fidler, S., Urtasun, R., Yuille, A.: Detect what you can: Detecting and representing objects using holistic models and body parts. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (2014) 29. Zhou, B., Bau, D., Oliva, A., Torralba, A.: Interpreting deep visual representa- tions via network dissection. In: IEEE Trans. on Pattern Analysis and Machine Intelligence. (2018)  30. Zhou, B., Lapedriza, A., Xiao, J., Torralba, A., Oliva, A.: Learning deep features for scene recognition using places database. In: Advances in neural information processing systems. (2014) 487-495  31. Lin, T.Y., Doll´ar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature  pyramid networks for object detection. In: CVPR. Volume 1. (2017) 4  32. Zhou, B., Khosla, A., Lapedriza, A., Oliva, A., Torralba, A.: Object detectors emerge in deep scene cnns. International Conference on Learning Representations (ICLR) (2015)  33. Zhou, B., Khosla, A., Lapedriza, A., Oliva, A., Torralba, A.: Learning deep fea- tures for discriminative localization. In: Computer Vision and Pattern Recognition (CVPR), 2016 IEEE Conference on, IEEE (2016) 2921-2929  34. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by reducing internal covariate shift. In: International conference on machine learning. (2015) 448-456  35. Nair, V., Hinton, G.E.: Rectified linear units improve restricted boltzmann ma- chines. In: Proceedings of the 27th international conference on machine learning (ICML-10). (2010) 807-814   Unified Perceptual Parsing for Scene Understanding36. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Semantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  37. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on, IEEE (2009) 248-255  38. Ioﬀe, S.: Batch renormalization: Towards reducing minibatch dependence in batch- normalized models. In: Advances in Neural Information Processing Systems. (2017) 1942-1950  39. Peng, C., Xiao, T., Li, Z., Jiang, Y., Zhang, X., Jia, K., Yu, G., Sun, J.: Megdet: A large mini-batch object detector. arXiv preprint arXiv:1711.07240 (2017) 40. Xie, S., Girshick, R., Doll´ar, P., Tu, Z., He, K.: Aggregated residual transformations for deep neural networks. In: Computer Vision and Pattern Recognition (CVPR), 2017 IEEE Conference on, IEEE (2017) 5987-5995  41. Zeiler, M.D., Fergus, R.: Visualizing and understanding convolutional networks.  In: European conference on computer vision, Springer (2014) 818-833  42. Badrinarayanan, V., Kendall, A., Cipolla, R.:  Segnet: A deep convolutional encoder-decoder architecture for image segmentation. IEEE transactions on pat- tern analysis and machine intelligence 39(12) (2017) 2481-2495  43. Kirillov, A., He, K., Girshick, R., Doll´ar, P.: Mscoco challenge 2017: stuﬀ segmen-  44. Brandes, U., Robins, G., McCranie, A., Wasserman, S.: What is network science?  tation, team fair. (2017)  Network science 1(1) (2013) 1-15"}