{"1": "1. Ammar, H.B., Eaton, E., Ruvolo, P., Taylor, M.: Online multi-task learning for  policy gradient methods. In: ICML. pp. 1206-1214 (2014)  2. Bae, S.H., Yoon, K.J.: Confidence-based data association and discriminative deep  appearance learning for robust online multi-object tracking. TPAMI (2017)  3. Ban, Y., Ba, S., Alameda-Pineda, X., Horaud, R.: Tracking multiple persons based  on a variational bayesian model. In: ECCV. pp. 52-67 (2016)  4. Bernardin, K., Stiefelhagen, R.: Evaluating multiple object tracking performance:  the clear mot metrics. EURASIP 2008(1), 246309 (2008)  5. Butt, A.A., Collins, R.T.: Multi-target tracking by lagrangian relaxation to min-  cost network ﬂow. In: CVPR. pp. 1846-1853 (2013)  6. Cao, Q., Lin, L., Shi, Y., Liang, X., Li, G.: Attention-aware face hallucination via  deep reinforcement learning. In: CVPR. pp. 690-698 (2017)  7. Choi, W.: Near-online multi-target tracking with aggregated local ﬂow descriptor.  In: ICCV. pp. 3029-3037 (2015)  8. Chu, Q., Ouyang, W., Li, H., Wang, X., Liu, B., Yu, N.: Online multi-object track- ing using cnn-based single object tracker with spatial-temporal attention mecha- nism. In: ICCV. pp. 4836-4845 (2017)  9. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: CVPR. pp. 248-255 (2009)  10. Fagot-Bouquet, L., Audigier, R., Dhome, Y., Lerasle, F.: Improving multi-frame data association with sparse representations for robust near-online multi-object tracking. In: ECCV. pp. 774-790 (2016)  11. Geiger, A., Lauer, M., Wojek, C., Stiller, C., Urtasun, R.: 3d traﬃc scene under-  standing from movable platforms. TPAMI 36(5), 1012-1025 (2014)  12. Gu, S., Lillicrap, T., Sutskever, I., Levine, S.: Continuous deep q-learning with  model-based acceleration. In: ICML. pp. 2829-2838 (2016)  13. Henschel, R., Leal-Taix´e, L., Cremers, D., Rosenhahn, B.: Improvements to frank- wolfe optimization for multi-detector multi-object tracking. arXiv preprint arX- iv:1705.08314 (2017)  14. Hong Yoon, J., Lee, C.R., Yang, M.H., Yoon, K.J.: Online multi-object tracking via structural constraint event aggregation. In: CVPR. pp. 1392-1400 (2016) 15. Huang, C., Lucey, S., Ramanan, D.: Learning policies for adaptive tracking with  deep feature cascades. In: ICCV. pp. 105-114 (2017)  16. Kamalapurkar, R., Andrews, L., Walters, P., Dixon, W.E.: Model-based reinforce- ment learning for infinite-horizon approximate optimal tracking. TNNLS 28(3), 753-758 (2017)  17. Keuper, M., Tang, S., Zhongjie, Y., Andres, B., Brox, T., Schiele, B.: A multi-cut formulation for joint segmentation and tracking of multiple objects. arXiv preprint arXiv:1607.06317 (2016)  18. Kim, C., Li, F., Ciptadi, A., Rehg, J.M.: Multiple hypothesis tracking revisited.  In: ICCV. pp. 4696-4704 (2015)  19. Kim, D.Y., Jeon, M.: Data fusion of radar and image measurements for multi- object tracking via kalman filtering. Information Sciences 278, 641-652 (2014) 20. Kong, X., Xin, B., Wang, Y., Hua, G.: Collaborative deep reinforcement learning  for joint object search. In: CVPR. pp. 1695-1704 (2017)  21. Le, N., Heili, A., Odobez, J.M.: Long-term time-sensitive costs for crf-based track-  ing by detection. In: ECCV. pp. 43-51 (2016)   Collaborative Deep Reinforcement Learning for Multi-Object TrackingReferences  1. Ammar, H.B., Eaton, E., Ruvolo, P., Taylor, M.: Online multi-task learning for  policy gradient methods. In: ICML. pp. 1206-1214 (2014)  2. Bae, S.H., Yoon, K.J.: Confidence-based data association and discriminative deep  appearance learning for robust online multi-object tracking. TPAMI (2017)  3. Ban, Y., Ba, S., Alameda-Pineda, X., Horaud, R.: Tracking multiple persons based  on a variational bayesian model. In: ECCV. pp. 52-67 (2016)  4. Bernardin, K., Stiefelhagen, R.: Evaluating multiple object tracking performance:  the clear mot metrics. EURASIP 2008(1), 246309 (2008)  5. Butt, A.A., Collins, R.T.: Multi-target tracking by lagrangian relaxation to min-  cost network ﬂow. In: CVPR. pp. 1846-1853 (2013)  6. Cao, Q., Lin, L., Shi, Y., Liang, X., Li, G.: Attention-aware face hallucination via  deep reinforcement learning. In: CVPR. pp. 690-698 (2017)  7. Choi, W.: Near-online multi-target tracking with aggregated local ﬂow descriptor.  In: ICCV. pp. 3029-3037 (2015)  8. Chu, Q., Ouyang, W., Li, H., Wang, X., Liu, B., Yu, N.: Online multi-object track- ing using cnn-based single object tracker with spatial-temporal attention mecha- nism. In: ICCV. pp. 4836-4845 (2017)  9. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: CVPR. pp. 248-255 (2009)  10. Fagot-Bouquet, L., Audigier, R., Dhome, Y., Lerasle, F.: Improving multi-frame data association with sparse representations for robust near-online multi-object tracking. In: ECCV. pp. 774-790 (2016)  11. Geiger, A., Lauer, M., Wojek, C., Stiller, C., Urtasun, R.: 3d traﬃc scene under-  standing from movable platforms. TPAMI 36(5), 1012-1025 (2014)  12. Gu, S., Lillicrap, T., Sutskever, I., Levine, S.: Continuous deep q-learning with  model-based acceleration. In: ICML. pp. 2829-2838 (2016)  13. Henschel, R., Leal-Taix´e, L., Cremers, D., Rosenhahn, B.: Improvements to frank- wolfe optimization for multi-detector multi-object tracking. arXiv preprint arX- iv:1705.08314 (2017)  14. Hong Yoon, J., Lee, C.R., Yang, M.H., Yoon, K.J.: Online multi-object tracking via structural constraint event aggregation. In: CVPR. pp. 1392-1400 (2016) 15. Huang, C., Lucey, S., Ramanan, D.: Learning policies for adaptive tracking with  deep feature cascades. In: ICCV. pp. 105-114 (2017)  16. Kamalapurkar, R., Andrews, L., Walters, P., Dixon, W.E.: Model-based reinforce- ment learning for infinite-horizon approximate optimal tracking. TNNLS 28(3), 753-758 (2017)  17. Keuper, M., Tang, S., Zhongjie, Y., Andres, B., Brox, T., Schiele, B.: A multi-cut formulation for joint segmentation and tracking of multiple objects. arXiv preprint arXiv:1607.06317 (2016)  18. Kim, C., Li, F., Ciptadi, A., Rehg, J.M.: Multiple hypothesis tracking revisited.  In: ICCV. pp. 4696-4704 (2015)  19. Kim, D.Y., Jeon, M.: Data fusion of radar and image measurements for multi- object tracking via kalman filtering. Information Sciences 278, 641-652 (2014) 20. Kong, X., Xin, B., Wang, Y., Hua, G.: Collaborative deep reinforcement learning  for joint object search. In: CVPR. pp. 1695-1704 (2017)  21. Le, N., Heili, A., Odobez, J.M.: Long-term time-sensitive costs for crf-based track-  ing by detection. In: ECCV. pp. 43-51 (2016)   16  Liangliang Ren, Jiwen Lu, Zifeng Wang, Qi Tian,Jie Zhou  22. Leal-Taix´e, L., Milan, A., Reid, I., Roth, S., Schindler, K.: Motchallenge 2015: Towards a benchmark for multi-target tracking. arXiv preprint arXiv:1504.01942 (2015)  23. Levinkov, E., Uhrig, J., Tang, S., Omran, M., Insafutdinov, E., Kirillov, A., Rother, C., Brox, T., Schiele, B., Andres, B.: Joint graph decomposition & node labeling: Problem, algorithms, applications. In: CVPR. pp. 6012-6020 (2017)  24. Li, Y., Huang, C., Nevatia, R.: Learning to associate: Hybridboosted multi-target  tracker for crowded scene. In: CVPR. pp. 2953-2960 (2009)  25. Liang, X., Lee, L., Xing, E.P.: Deep variation-structured reinforcement learning for visual relationship and attribute detection. arXiv preprint arXiv:1703.03054 (2017)  26. Liu, S., Zhu, Z., Ye, N., Guadarrama, S., Murphy, K.: Optimization of image description metrics using policy gradient methods. arXiv preprint arXiv:1612.00370 (2016)  27. Maksai, A., Wang, X., Fleuret, F., Fua, P.: Non-markovian globally consistent  multi-object tracking. In: ICCV. pp. 2544-2554 (2017)  28. Milan, A., Leal-Taix´e, L., Reid, I., Roth, S., Schindler, K.: Mot16: A benchmark  for multi-object tracking. arXiv preprint arXiv:1603.00831 (2016)  29. Mnih, V., Kavukcuoglu, K., Silver, D., Graves, A., Antonoglou, I., Wierstra, D., Riedmiller, M.: Playing atari with deep reinforcement learning. arXiv preprint arXiv:1312.5602 (2013)  30. Mnih, V., Kavukcuoglu, K., Silver, D., Rusu, A.A., Veness, J., Bellemare, M.G., Graves, A., Riedmiller, M., Fidjeland, A.K., Ostrovski, G., et al.: Human-level control through deep reinforcement learning. Nature 518(7540), 529-533 (2015)  31. Nam, H., Han, B.: Learning multi-domain convolutional neural networks for visual  tracking. In: CVPR. pp. 4293-4302 (2016)  32. Okuma, K., Taleghani, A., De Freitas, N., Little, J.J., Lowe, D.G.: A boosted particle filter: Multitarget detection and tracking. In: ECCV. pp. 28-39 (2004) 33. Rao, Y., Lu, J., Zhou, J.: Attention-aware deep reinforcement learning for video  face recognition. In: ICCV. pp. 3931-3940 (2017)  34. Sadeghian, A., Alahi, A., Savarese, S.: Tracking the untrackable: Learning to track multiple cues with long-term dependencies. arXiv preprint arXiv:1701.01909 (2017) 35. Sanchez-Matilla, R., Poiesi, F., Cavallaro, A.: Multi-target tracking with strong  and weak detections. In: ECCVW. vol. 5, p. 18 (2016)  36. Shu, G., Dehghan, A., Oreifej, O., Hand, E., Shah, M.: Part-based multiple-person  tracking with partial occlusion handling. In: CVPR. pp. 1815-1821 (2012)  37. Silver, D., Lever, G., Heess, N., Degris, T., Wierstra, D., Riedmiller, M.: Deter-  ministic policy gradient algorithms. In: ICML. pp. 387-395 (2014)  38. Son, J., Baek, M., Cho, M., Han, B.: Multi-object tracking with quadruplet con-  volutional neural networks. In: ICCV. pp. 5620-5629 (2017)  39. Supancic, III, J., Ramanan, D.: Tracking as online decision-making: Learning a policy from streaming videos with reinforcement learning. In: ICCV. pp. 322-331 (2017)  40. Tang, S., Andres, B., Andriluka, M., Schiele, B.: Multi-person tracking by multicut  and deep matching. In: ECCV. pp. 100-111 (2016)  41. Tang, S., Andriluka, M., Andres, B., Schiele, B.: Multiple people tracking by lifted  multicut and person reidentification. In: ICCV. pp. 3539-3548 (2017)  42. Van Hasselt, H., Guez, A., Silver, D.: Deep reinforcement learning with double  q-learning. In: AAAI. pp. 2094-2100 (2016)  43. Vedaldi, A., Lenc, K.: Matconvnet: Convolutional neural networks for matlab. In:  ACMMM. pp. 689-692 (2015)   Collaborative Deep Reinforcement Learning for Multi-Object Tracking44. Wang, S., Fowlkes, C.C.: Learning optimal parameters for multi-target tracking  with contextual interactions. IJCV 122(3), 484-501 (2017)  45. Wen, L., Lei, Z., Lyu, S., Li, S.Z., Yang, M.H.: Exploiting hierarchical dense struc- tures on hypergraphs for multi-object tracking. TPAMI 38(10), 1983-1996 (2016) 46. Wu, Z., Thangali, A., Sclaroﬀ, S., Betke, M.: Coupling detection and data associ-  ation for multiple object tracking. In: CVPR. pp. 1948-1955 (2012)  47. Xiang, Y., Alahi, A., Savarese, S.: Learning to track: Online multi-object tracking  by decision making. In: ICCV. pp. 4705-4713 (2015)  48. Yang, B., Nevatia, R.: Multi-target tracking by online learning of non-linear motion  patterns and robust appearance models. In: CVPR. pp. 1918-1925 (2012)  49. Yang, B., Nevatia, R.: An online learned crf model for multi-target tracking. In:  CVPR. pp. 2034-2041 (2012)  50. Yu, L., Zhang, W., Wang, J., Yu, Y.: Seqgan: Sequence generative adversarial nets  with policy gradient. In: AAAI. pp. 2852-2858 (2017)  51. Yun, S., Choi, J., Yoo, Y., Yun, K., Young Choi, J.: Action-decision networks for visual tracking with deep reinforcement learning. In: CVPR. pp. 2711-2720 (2017) 52. Zamir, A.R., Dehghan, A., Shah, M.: Gmcp-tracker: Global multi-object tracking  using generalized minimum clique graphs. In: ECCV, pp. 343-356 (2012)  53. Zhang, D., Maei, H., Wang, X., Wang, Y.F.: Deep reinforcement learning for visual  object tracking in videos. arXiv preprint arXiv:1701.08936 (2017)  54. Zhang, L., Li, Y., Nevatia, R.: Global data association for multi-object tracking  using network ﬂows. In: CVPR. pp. 1-8 (2008)"}