{"1": "1. http://image-net.org/challenges/LSVRC/2015/results#vid 2. Ba, J., Mnih, V., Kavukcuoglu, K.: Multiple object recognition with visual atten-  tion. arXiv preprint arXiv:1412.7755 (2014)  3. Ba, J.L., Kiros, J.R., Hinton, G.E.: Layer normalization. arXiv preprint  arXiv:1607.06450 (2016)  4. Ballas, N., Yao, L., Pal, C., Courville, A.: Delving deeper into convolutional net-  works for learning video representations. In: ICLR (2016)  5. Brox, T., Malik, J.: Large displacement optical ﬂow: descriptor matching in vari-  ational motion estimation. PAMI 33(3), 500-513 (2011)  6. Carreira, J., Agrawal, P., Fragkiadaki, K., Malik, J.: Human pose estimation with  iterative error feedback. In: CVPR (2016)  7. Chen, X., Gupta, A.: Spatial memory for context reasoning in object detection. In:  ICCV (2017)  8. Coifman, B., Beymer, D., Mclauchlan, P., Malik, J.: A realtime computer vision system for vehicle tracking and traﬃc surveillance. Transportation Research C 6C 4, 271-288 (1998)  9. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully  10. Dalal, N., Triggs, B., Schmid, C.: Human detection using oriented histograms of  convolutional networks. In: NIPS (2016)  ﬂow and appearance. In: ECCV (2006)  11. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A Large-Scale  Hierarchical Image Database. In: CVPR (2009)  12. Donahue, J., Anne Hendricks, L., Guadarrama, S., Rohrbach, M., Venugopalan, S., Saenko, K., Darrell, T.: Long-term recurrent convolutional networks for visual recognition and description. In: CVPR (2015)  13. Dosovitskiy, A., Fischer, P., Ilg, E., Hausser, P., Hazrba, C., Golkov, V., Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: ICCV (2015)  14. Feichtenhofer, C., Pinz, A., Zisserman, A.: Detect to track and track to detect. In:  ICCV (2017)  15. Fragkiadaki, K., Levine, S., Felsen, P., Malik, J.: Recurrent network models for  human dynamics. In: ICCV (2015)  16. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich Feature Hierarchies for Ac-  curate Object Detection and Semantic Segmentation. In: CVPR (2014)  17. Girshick, R.: Fast R-CNN. In: ICCV (2015) 18. Han, P., Yuan, W., Lu, Z., Wen, J.R.: Video detection by learning with deep  representation and spatio-temporal context (2015)  19. Han, W., Khorrami, P., Paine, T.L., Ramachandran, P., Babaeizadeh, M., Shi, H., Li, J., Yan, S., Huang, T.S.: Seq-nms for video object detection. arXiv preprint arXiv:1602.08465 (2016)  20. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  21. Huang, X., Belongie, S.J.: Arbitrary style transfer in real-time with adaptive in-  stance normalization. In: ICCV (2017)  22. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. arXiv preprint arXiv:1502.03167 (2015)  23. Jones, M., Snow, D.: Pedestrian detection using boosted features over many frames.  In: ICPR (2008)   Video Object Detection with an Aligned Spatial-Temporal MemoryReferences  1. http://image-net.org/challenges/LSVRC/2015/results#vid 2. Ba, J., Mnih, V., Kavukcuoglu, K.: Multiple object recognition with visual atten-  tion. arXiv preprint arXiv:1412.7755 (2014)  3. Ba, J.L., Kiros, J.R., Hinton, G.E.: Layer normalization. arXiv preprint  arXiv:1607.06450 (2016)  4. Ballas, N., Yao, L., Pal, C., Courville, A.: Delving deeper into convolutional net-  works for learning video representations. In: ICLR (2016)  5. Brox, T., Malik, J.: Large displacement optical ﬂow: descriptor matching in vari-  ational motion estimation. PAMI 33(3), 500-513 (2011)  6. Carreira, J., Agrawal, P., Fragkiadaki, K., Malik, J.: Human pose estimation with  iterative error feedback. In: CVPR (2016)  7. Chen, X., Gupta, A.: Spatial memory for context reasoning in object detection. In:  ICCV (2017)  8. Coifman, B., Beymer, D., Mclauchlan, P., Malik, J.: A realtime computer vision system for vehicle tracking and traﬃc surveillance. Transportation Research C 6C 4, 271-288 (1998)  9. Dai, J., Li, Y., He, K., Sun, J.: R-fcn: Object detection via region-based fully  10. Dalal, N., Triggs, B., Schmid, C.: Human detection using oriented histograms of  convolutional networks. In: NIPS (2016)  ﬂow and appearance. In: ECCV (2006)  11. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A Large-Scale  Hierarchical Image Database. In: CVPR (2009)  12. Donahue, J., Anne Hendricks, L., Guadarrama, S., Rohrbach, M., Venugopalan, S., Saenko, K., Darrell, T.: Long-term recurrent convolutional networks for visual recognition and description. In: CVPR (2015)  13. Dosovitskiy, A., Fischer, P., Ilg, E., Hausser, P., Hazrba, C., Golkov, V., Smagt, P., Cremers, D., Brox, T.: Flownet: Learning optical ﬂow with convolutional networks. In: ICCV (2015)  14. Feichtenhofer, C., Pinz, A., Zisserman, A.: Detect to track and track to detect. In:  ICCV (2017)  15. Fragkiadaki, K., Levine, S., Felsen, P., Malik, J.: Recurrent network models for  human dynamics. In: ICCV (2015)  16. Girshick, R., Donahue, J., Darrell, T., Malik, J.: Rich Feature Hierarchies for Ac-  curate Object Detection and Semantic Segmentation. In: CVPR (2014)  17. Girshick, R.: Fast R-CNN. In: ICCV (2015) 18. Han, P., Yuan, W., Lu, Z., Wen, J.R.: Video detection by learning with deep  representation and spatio-temporal context (2015)  19. Han, W., Khorrami, P., Paine, T.L., Ramachandran, P., Babaeizadeh, M., Shi, H., Li, J., Yan, S., Huang, T.S.: Seq-nms for video object detection. arXiv preprint arXiv:1602.08465 (2016)  20. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  21. Huang, X., Belongie, S.J.: Arbitrary style transfer in real-time with adaptive in-  stance normalization. In: ICCV (2017)  22. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. arXiv preprint arXiv:1502.03167 (2015)  23. Jones, M., Snow, D.: Pedestrian detection using boosted features over many frames.  In: ICPR (2008)   16  F. Xiao and Y. J. Lee  24. Kang, K., Li, H., Xiao, T., Ouyang, W., Yan, J., Liu, X., Wang, X.: Object detec-  tion in videos with tubelet proposal networks. In: CVPR (2017)  25. Kang, K., Li, H., Yan, J., Zeng, X., Yang, B., Xiao, T., Zhang, C., Wang, Z., Wang, R., Wang, X., et al.: T-cnn: Tubelets with convolutional neural networks for object detection from videos. TCSVT (2017)  26. Karpathy, A., Toderici, G., Shetty, S., Leung, T., Sukthankar, R., Fei-Fei, L.: Large- scale video classification with convolutional neural networks. In: CVPR (2014) 27. Kiros, R., Salakhutdinov, R., Zemel, R.S.: Unifying visual-semantic embeddings with multimodal neural language models. arXiv preprint arXiv:1411.2539 (2014) 28. Krizhevsky, A., Sutskever, I., Hinton, G.: Imagenet Classification with Deep Con-  volutional Neural Networks. In: NIPS (2012)  29. Lee, B., Erdenee, E., Jin, S., Nam, M.Y., Jung, Y.G., Rhee, P.K.: Multi-class  multi-object tracking using changing point detection. In: ECCV (2016)  30. Li, Y., Zhu, J., Hoi, S.C.: Reliable patch trackers: Robust visual tracking by ex-  ploiting reliable patches. In: CVPR (2015)  31. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd:  Single shot multibox detector. In: ECCV (2016)  32. Mnih, V., Heess, N., Graves, A., et al.: Recurrent models of visual attention. In:  33. Nam, H., Han, B.: Learning multi-domain convolutional neural networks for visual  NIPS (2014)  tracking. In: CVPR (2016)  34. Ouyang, W., Luo, P., Zeng, X., Qiu, S., Tian, Y., Li, H., Yang, S., Wang, Z., Xiong, Y., Qian, C., et al.: Deepid-net: multi-stage and deformable deep convolutional neural networks for object detection. arXiv preprint arXiv:1409.3505 (2014) 35. Park, D., Zitnick, C.L., Ramanan, D., Dollar, P.: Exploring Weak Stabilization for  Motion Feature Extraction. In: CVPR (2013)  36. Pinheiro, P.O., Collobert, R., Dollar, P.: Learning to segment object candidates.  In: NIPS (2015)  37. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified,  real-time object detection. In: CVPR (2016)  38. Ren, S., He, K., Girshick, R., Sun, J.: Faster R-CNN: Towards real-time object  detection with region proposal networks. In: NIPS (2015)  39. Sermanet, P., Eigen, D., Zhang, X., Mathieu, M., Fergus, R., LeCun, Y.: Overfeat: Integrated recognition, localization and detection using convolutional networks. In: ICLR (2014)  40. Shrivastava, A., Gupta, A.: Contextual priming and feedback for faster r-cnn. In:  41. Tokmakov, P., Alahari, K., Schmid, C.: Learning video object segmentation with  ECCV (2016)  visual memory. In: ICCV (2017)  42. Tran, D., Bourdev, L., Fergus, R., Torresani, L., Paluri, M.: Learning spatiotem-  poral features with 3d convolutional networks. In: ICCV (2015)  43. Tripathi, S., Lipton, Z.C., Belongie, S., Nguyen, T.: Context matters: Refin- ing object detection in video with recurrent neural networks. arXiv preprint arXiv:1607.04648 (2016)  44. Vinyals, O., Toshev, A., Bengio, S., Erhan, D.: Show and tell: A neural image  caption generator. In: CVPR (2015)  45. Viola, P., Jones, M., Snow, D.: Detecting Pedestrians Using Patterns of Motion  and Appearance. IJCV 63(2), 153-161 (2005)  46. Wren, C., Azarbayejani, A., Darrell, T., Pentland, A.: Pfinder: Real-time tracking  of the human body. PAMI 19, 780-785 (1997)   Video Object Detection with an Aligned Spatial-Temporal Memory47. Xu, K., Ba, J., Kiros, R., Courville, A., Salakhutdinov, R., Zemel, R., Bengio, Y.: Show, attend and tell: Neural image caption generation with visual attention. arXiv preprint arXiv:1502.03044 (2015)  48. Yang, B., Yan, J., Lei, Z., Li, S.Z.: Craft objects from images. In: CVPR (2016) 49. Zheng, S., Jayasumana, S., Romera-Paredes, B., Vineet, V., Su, Z., Du, D., Huang, C., Torr, P.H.: Conditional random fields as recurrent neural networks. In: CVPR (2015)  50. Zhu, X., Dai, J., Yuan, L., Wei, Y.: Towards high performance video object detec-  tion. CVPR (2018)  51. Zhu, X., Wang, Y., Dai, J., Yuan, L., Wei, Y.: Flow-guided feature aggregation for  video object detection. ICCV (2017)"}