{"1": "computing (2010) 2  view approach. 2  1. Poppe, R.: A survey on vision-based human action recognition. Image and vision  2. Gavrila, D.M., Davis, L.S.: 3-d model-based tracking of humans in action: a multi- In: Computer Vision and Pattern Recognition (CVPR). (1996)  3. Junejo, I.N., Dexter, E., Laptev, I., P´erez, P.: Cross-view action recognition from temporal self-similarities. In: European Conference on Computer Vision, Springer (2008) 293-306 2  4. Seitz, S.M., Curless, B., Diebel, J., Scharstein, D., Szeliski, R.: A comparison and evaluation of multi-view stereo reconstruction algorithms. In: Computer vision and pattern recognition (CVPR). (2006) 2  5. Furukawa, Y., Ponce, J.: Accurate, dense, and robust multiview stereopsis. IEEE transactions on pattern analysis and machine intelligence 32(8) (2010) 1362-1376 2  6. Choy, C.B., Xu, D., Gwak, J., Chen, K., Savarese, S.: 3d-r2n2: A unified approach for single and multi-view 3d object reconstruction. In: European Conference on Computer Vision (ECCV). (2016) 2, 4  7. Fan, H., Su, H., Guibas, L.: A point set generation network for 3d object recon- struction from a single image. In: Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 2, 4  Image-based 3d modelling: A review. The Pho-  8. Remondino, F., El-Hakim, S.: togrammetric Record (2006) 2  9. Zwicker, M., Pauly, M., Knoll, O., Gross, M.: Pointshop 3d: An interactive system for point-based surface editing. In: ACM Transactions on Graphics (TOG). (2002) 2  10. Seitz, S.M., Dyer, C.R.: View morphing. In: Special Interest Group on GRAPHics  and Interactive Techniques (SIGGRAPH). (1996) 2  11. Chen, S.E.: Quicktime vr: An image-based approach to virtual environment navi- gation. In: Special Interest Group on GRAPHics and Interactive Techniques (SIG- GRAPH). (1995) 2  12. Szeliski, R., Shum, H.Y.: Creating full view panoramic image mosaics and environ- ment maps. In: Special Interest Group on GRAPHics and Interactive Techniques (SIGGRAPH). (1997) 2  13. Forsyth, D., Ponce, J.: Computer vision: a modern approach. Pearson (2011) 2,  3, 4  14. Sturm, P., Triggs, B.: A factorization based algorithm for multi-image projective  structure and motion. (1996) 2, 3, 4  15. Montemerlo, M., Thrun, S., Koller, D., Wegbreit, B., et al.: Fastslam: A factored In: Aaai/iaai.  solution to the simultaneous localization and mapping problem. (2002) 2, 3, 4  16. Durrant-Whyte, H., Bailey, T.: Simultaneous localization and mapping: part i.  IEEE robotics & automation magazine (2006) 2, 3, 4  17. Debevec, P.E., Taylor, C.J., Malik, J.: Modeling and rendering architecture from photographs: A hybrid geometry-and image-based approach. In: Proceedings of the 23rd annual conference on Computer graphics and interactive techniques. (1996) 2  18. Chang, A.X., Funkhouser, T., Guibas, L., Hanrahan, P., Huang, Q., Li, Z., Savarese, S., Savva, M., Song, S., Su, H., Xiao, J., Yi, L., Yu, F.: Shapenet: An   Multi-view to Novel view: Synthesizing Views via Self-Learned ConfidenceReferences  computing (2010) 2  view approach. 2  1. Poppe, R.: A survey on vision-based human action recognition. Image and vision  2. Gavrila, D.M., Davis, L.S.: 3-d model-based tracking of humans in action: a multi- In: Computer Vision and Pattern Recognition (CVPR). (1996)  3. Junejo, I.N., Dexter, E., Laptev, I., P´erez, P.: Cross-view action recognition from temporal self-similarities. In: European Conference on Computer Vision, Springer (2008) 293-306 2  4. Seitz, S.M., Curless, B., Diebel, J., Scharstein, D., Szeliski, R.: A comparison and evaluation of multi-view stereo reconstruction algorithms. In: Computer vision and pattern recognition (CVPR). (2006) 2  5. Furukawa, Y., Ponce, J.: Accurate, dense, and robust multiview stereopsis. IEEE transactions on pattern analysis and machine intelligence 32(8) (2010) 1362-1376 2  6. Choy, C.B., Xu, D., Gwak, J., Chen, K., Savarese, S.: 3d-r2n2: A unified approach for single and multi-view 3d object reconstruction. In: European Conference on Computer Vision (ECCV). (2016) 2, 4  7. Fan, H., Su, H., Guibas, L.: A point set generation network for 3d object recon- struction from a single image. In: Conference on Computer Vision and Pattern Recognition (CVPR). (2017) 2, 4  Image-based 3d modelling: A review. The Pho-  8. Remondino, F., El-Hakim, S.: togrammetric Record (2006) 2  9. Zwicker, M., Pauly, M., Knoll, O., Gross, M.: Pointshop 3d: An interactive system for point-based surface editing. In: ACM Transactions on Graphics (TOG). (2002) 2  10. Seitz, S.M., Dyer, C.R.: View morphing. In: Special Interest Group on GRAPHics  and Interactive Techniques (SIGGRAPH). (1996) 2  11. Chen, S.E.: Quicktime vr: An image-based approach to virtual environment navi- gation. In: Special Interest Group on GRAPHics and Interactive Techniques (SIG- GRAPH). (1995) 2  12. Szeliski, R., Shum, H.Y.: Creating full view panoramic image mosaics and environ- ment maps. In: Special Interest Group on GRAPHics and Interactive Techniques (SIGGRAPH). (1997) 2  13. Forsyth, D., Ponce, J.: Computer vision: a modern approach. Pearson (2011) 2,  3, 4  14. Sturm, P., Triggs, B.: A factorization based algorithm for multi-image projective  structure and motion. (1996) 2, 3, 4  15. Montemerlo, M., Thrun, S., Koller, D., Wegbreit, B., et al.: Fastslam: A factored In: Aaai/iaai.  solution to the simultaneous localization and mapping problem. (2002) 2, 3, 4  16. Durrant-Whyte, H., Bailey, T.: Simultaneous localization and mapping: part i.  IEEE robotics & automation magazine (2006) 2, 3, 4  17. Debevec, P.E., Taylor, C.J., Malik, J.: Modeling and rendering architecture from photographs: A hybrid geometry-and image-based approach. In: Proceedings of the 23rd annual conference on Computer graphics and interactive techniques. (1996) 2  18. Chang, A.X., Funkhouser, T., Guibas, L., Hanrahan, P., Huang, Q., Li, Z., Savarese, S., Savva, M., Song, S., Su, H., Xiao, J., Yi, L., Yu, F.: Shapenet: An   16  Sun et al.  information-rich 3d model repository. Technical Report arXiv:1512.03012 [cs.GR] (2015) 2, 4, 7, 8, 9  19. Tatarchenko, M., Dosovitskiy, A., Brox, T.: Single-view to multi-view: Reconstruct- ing unseen views with a convolutional network. CoRR abs/1511.06702 (2015) 2, 4, 7, 8, 10, 11, 12, 13, 14  20. Yang, J., Reed, S.E., Yang, M.H., Lee, H.: Weakly-supervised disentangling with recurrent transformations for 3d view synthesis. In: Advances in Neural Informa- tion Processing Systems. (2015) 1099-1107 2, 4  21. Rematas, K., Nguyen, C.H., Ritschel, T., Fritz, M., Tuytelaars, T.: Novel views of objects from a single image. IEEE transactions on pattern analysis and machine intelligence (2017) 2  22. Zhou, T., Tulsiani, S., Sun, W., Malik, J., Efros, A.A.: View synthesis by appear- ance ﬂow. In: European Conference on Computer Vision (ECCV). (2016) 2, 4, 5, 6, 7, 8, 10, 11, 12, 13, 14  23. Park, E., Yang, J., Yumer, E., Ceylan, D., Berg, A.C.: Transformation-grounded image generation network for novel 3d view synthesis. In: CVPR. (2017) 2, 4, 7, 8, 10, 11  24. Flynn, J., Neulander, I., Philbin, J., Snavely, N.: Deepstereo: Learning to predict new views from the world’s imagery. In: Computer Vision and Pattern Recognition (CVPR). (2016) 3  25. Ji, D., Kwon, J., McFarland, M., Savarese, S.: Deep view morphing. In: Computer  Vision and Pattern Recognition (CVPR). (2017) 3  26. Zhou, T., Krahenbuhl, P., Aubry, M., Huang, Q., Efros, A.A.: Learning dense correspondence via 3d-guided cycle consistency. In: Computer Vision and Pattern Recognition (CVPR). (2016) 3  27. Godard, C., Mac Aodha, O., Brostow, G.J.: Unsupervised monocular depth esti- mation with left-right consistency. In: Computer Vision and Pattern Recognition (CVPR). (2017) 3  28. Ren, Z., Yan, J., Ni, B., Liu, B., Yang, X., Zha, H.: Unsupervised deep learning  for optical ﬂow estimation. In: AAAI. (2017) 1495-1501 3  29. Liu, C., Yuen, J., Torralba, A., Sivic, J., Freeman, W.T.: Sift ﬂow: Dense cor- respondence across diﬀerent scenes. In: European conference on computer vision (ECCV). (2008) 3  30. Dosovitskiy, A., Springenberg, J.T., Tatarchenko, M., Brox, T.: Learning to gen- erate chairs, tables and cars with convolutional networks. IEEE transactions on pattern analysis and machine intelligence (PAMI) (2017) 4  31. Huang, R., Zhang, S., Li, T., He, R.: Beyond face rotation: Global and local perception gan for photorealistic and identity preserving frontal view synthesis. arXiv preprint arXiv:1704.04086 (2017) 4  32. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con- ditional adversarial networks. arXiv preprint arXiv:1611.07004 (2016) 4, 13 33. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation us- ing cycle-consistent adversarial networks. arXiv preprint arXiv:1703.10593 (2017) 4  34. Liu, M.Y., Breuel, T., Kautz, J.: Unsupervised image-to-image translation net-  works. arXiv preprint arXiv:1703.00848 (2017) 4  35. Kim, T., Cha, M., Kim, H., Lee, J., Kim, J.: Learning to discover cross-domain relations with generative adversarial networks. arXiv preprint arXiv:1703.05192 (2017) 4  36. Jaderberg, M., Simonyan, K., Zisserman, A., et al.: Spatial transformer networks.  In: Advances in Neural Information Processing Systems (NIPS). (2015) 5   Multi-view to Novel view: Synthesizing Views via Self-Learned Confidence37. Xingjian, S., Chen, Z., Wang, H., Yeung, D.Y., Wong, W.k., Woo, W.c.: Convo- lutional lstm network: A machine learning approach for precipitation nowcasting. In: Advances in Neural Information Processing Systems. (2015) 802-810 6  38. Mao, X., Li, Q., Xie, H., Lau, R.Y., Wang, Z., Smolley, S.P.: Least squares gener-  ative adversarial networks. In: ICCV. (2017) 6  39. Gal, Y., Ghahramani, Z.: Dropout as a bayesian approximation: Representing model uncertainty in deep learning. In: international conference on machine learn- ing. (2016) 7  40. Kendall, A., Gal, Y.: What uncertainties do we need in bayesian deep learning for computer vision? In: Advances in Neural Information Processing Systems. (2017) 7  41. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the In: Conference on Computer Vision and Pattern  kitti vision benchmark suite. Recognition (CVPR). (2012) 7, 11, 12  42. Ros, G., Sellart, L., Materzynska, J., Vazquez, D., Lopez, A.M.: The synthia dataset: A large collection of synthetic images for semantic segmentation of urban scenes. In: Computer Vision and Pattern Recognition (CVPR). (2016) 7, 9, 11, 12, 13  43. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 3431-3440 9, 13  44. Salimans, T., Goodfellow, I., Zaremba, W., Cheung, V., Radford, A., Chen, X.: Improved techniques for training gans. In: Advances in Neural Information Pro- cessing Systems. (2016) 2234-2242 13  45. Everingham, M., Eslami, S.M.A., Van Gool, L., Williams, C.K.I., Winn, J., Zisser- man, A.: The pascal visual object classes challenge: A retrospective. International Journal of Computer Vision (2015) 13"}