{"1": "1. Chen, X., Kundu, K., Zhu, Y., Berneshawi, A.G., Ma, H., Fidler, S., Urtasun, R.: 3d object proposals for accurate object class detection. In: Advances in Neural Information Processing Systems. (2015) 424-432  2. Chen, X., Kundu, K., Zhang, Z., Ma, H., Fidler, S., Urtasun, R.: Monocular 3d object detection for autonomous driving. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 2147-2156  3. Qin, T., Li, P., Shen, S.: Vins-mono: A robust and versatile monocular visual-  inertial state estimator. arXiv preprint arXiv:1708.03852 (2017)  4. Mur-Artal, R., Tard´os, J.D.: ORB-SLAM2: an open-source SLAM system for IEEE Transactions on Robotics 33(5)  monocular, stereo and RGB-D cameras. (2017) 1255-1262  5. Engel, J., Sch¨ops, T., Cremers, D.: Lsd-slam: Large-scale direct monocular slam.  In: European Conference on Computer Vision, Springer (2014) 834-849  6. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object detec- tion with region proposal networks. In: Advances in neural information processing systems. (2015) 91-99  7. Frost, D.P., K¨ahler, O., Murray, D.W.: Object-aware bundle adjustment for cor- recting monocular scale drift. In: Robotics and Automation (ICRA), 2016 IEEE International Conference on, IEEE (2016) 4770-4776  8. Sucar, E., Hayet, J.B.: Probabilistic global scale estimation for monoslam based on generic object detection. In: Computer Vision and Pattern Recognition Workshops (CVPRW). (2017)  9. Bowman, S.L., Atanasov, N., Daniilidis, K., Pappas, G.J.: Probabilistic data as- In: Robotics and Automation (ICRA), 2017 IEEE  sociation for semantic slam. International Conference on, IEEE (2017) 1722-1729  10. Atanasov, N., Zhu, M., Daniilidis, K., Pappas, G.J.: Semantic localization via the matrix permanent. In: Proceedings of Robotics: Science and Systems. Volume 2. (2014)  11. Pillai, S., Leonard, J.J.: Monocular slam supported object recognition. In: Pro-  ceedings of Robotics: Science and Systems. Volume 2. (2015)  12. Dong, J., Fei, X., Soatto, S.: Visual-inertial-semantic scene representation for 3-d  object detection. arXiv preprint arXiv:1606.03968 (2016)  13. Civera, J., G´alvez-L´opez, D., Riazuelo, L., Tard´os, J.D., Montiel, J.: Towards In: Intelligent Robots and Systems  semantic slam using a monocular camera. (IROS), 2011 IEEE/RSJ International Conference on, IEEE (2011) 1277-1284 14. Salas-Moreno, R.F., Newcombe, R.A., Strasdat, H., Kelly, P.H., Davison, A.J.: Slam++: Simultaneous localisation and mapping at the level of objects. In: Com- puter Vision and Pattern Recognition (CVPR), 2013 IEEE Conference on, IEEE (2013) 1352-1359  15. G´alvez-L´opez, D., Salas, M., Tard´os, J.D., Montiel, J.: Real-time monocular object  slam. Robotics and Autonomous Systems 75 (2016) 435-449  16. Bao, S.Y., Savarese, S.: Semantic structure from motion. In: Computer Vision and Pattern Recognition (CVPR), 2011 IEEE Conference on, IEEE (2011) 2025-2032 17. Bao, S.Y., Bagra, M., Chao, Y.W., Savarese, S.: Semantic structure from motion with points, regions, and objects. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 2703-2710  18. Kundu, A., Li, Y., Dellaert, F., Li, F., Rehg, J.M.: Joint semantic segmentation and 3d reconstruction from monocular video. In: European Conference on Computer Vision, Springer (2014) 703-718   Semantic 3D Object and Ego-motion TrackingReferences  1. Chen, X., Kundu, K., Zhu, Y., Berneshawi, A.G., Ma, H., Fidler, S., Urtasun, R.: 3d object proposals for accurate object class detection. In: Advances in Neural Information Processing Systems. (2015) 424-432  2. Chen, X., Kundu, K., Zhang, Z., Ma, H., Fidler, S., Urtasun, R.: Monocular 3d object detection for autonomous driving. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 2147-2156  3. Qin, T., Li, P., Shen, S.: Vins-mono: A robust and versatile monocular visual-  inertial state estimator. arXiv preprint arXiv:1708.03852 (2017)  4. Mur-Artal, R., Tard´os, J.D.: ORB-SLAM2: an open-source SLAM system for IEEE Transactions on Robotics 33(5)  monocular, stereo and RGB-D cameras. (2017) 1255-1262  5. Engel, J., Sch¨ops, T., Cremers, D.: Lsd-slam: Large-scale direct monocular slam.  In: European Conference on Computer Vision, Springer (2014) 834-849  6. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object detec- tion with region proposal networks. In: Advances in neural information processing systems. (2015) 91-99  7. Frost, D.P., K¨ahler, O., Murray, D.W.: Object-aware bundle adjustment for cor- recting monocular scale drift. In: Robotics and Automation (ICRA), 2016 IEEE International Conference on, IEEE (2016) 4770-4776  8. Sucar, E., Hayet, J.B.: Probabilistic global scale estimation for monoslam based on generic object detection. In: Computer Vision and Pattern Recognition Workshops (CVPRW). (2017)  9. Bowman, S.L., Atanasov, N., Daniilidis, K., Pappas, G.J.: Probabilistic data as- In: Robotics and Automation (ICRA), 2017 IEEE  sociation for semantic slam. International Conference on, IEEE (2017) 1722-1729  10. Atanasov, N., Zhu, M., Daniilidis, K., Pappas, G.J.: Semantic localization via the matrix permanent. In: Proceedings of Robotics: Science and Systems. Volume 2. (2014)  11. Pillai, S., Leonard, J.J.: Monocular slam supported object recognition. In: Pro-  ceedings of Robotics: Science and Systems. Volume 2. (2015)  12. Dong, J., Fei, X., Soatto, S.: Visual-inertial-semantic scene representation for 3-d  object detection. arXiv preprint arXiv:1606.03968 (2016)  13. Civera, J., G´alvez-L´opez, D., Riazuelo, L., Tard´os, J.D., Montiel, J.: Towards In: Intelligent Robots and Systems  semantic slam using a monocular camera. (IROS), 2011 IEEE/RSJ International Conference on, IEEE (2011) 1277-1284 14. Salas-Moreno, R.F., Newcombe, R.A., Strasdat, H., Kelly, P.H., Davison, A.J.: Slam++: Simultaneous localisation and mapping at the level of objects. In: Com- puter Vision and Pattern Recognition (CVPR), 2013 IEEE Conference on, IEEE (2013) 1352-1359  15. G´alvez-L´opez, D., Salas, M., Tard´os, J.D., Montiel, J.: Real-time monocular object  slam. Robotics and Autonomous Systems 75 (2016) 435-449  16. Bao, S.Y., Savarese, S.: Semantic structure from motion. In: Computer Vision and Pattern Recognition (CVPR), 2011 IEEE Conference on, IEEE (2011) 2025-2032 17. Bao, S.Y., Bagra, M., Chao, Y.W., Savarese, S.: Semantic structure from motion with points, regions, and objects. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 2703-2710  18. Kundu, A., Li, Y., Dellaert, F., Li, F., Rehg, J.M.: Joint semantic segmentation and 3d reconstruction from monocular video. In: European Conference on Computer Vision, Springer (2014) 703-718   16  P. Li, T. Qin, and S. Shen  19. Vineet, V., Miksik, O., Lidegaard, M., Nießner, M., Golodetz, S., Prisacariu, V.A., K¨ahler, O., Murray, D.W., Izadi, S., P´erez, P., et al.: Incremental dense seman- tic stereo fusion for large-scale semantic scene reconstruction. In: Robotics and Automation (ICRA), 2015 IEEE International Conference on, IEEE (2015) 75-82 20. Li, X., Belaroussi, R.: Semi-dense 3d semantic mapping from monocular slam.  arXiv preprint arXiv:1611.04144 (2016)  21. McCormac, J., Handa, A., Davison, A., Leutenegger, S.: Semanticfusion: Dense 3d semantic mapping with convolutional neural networks. In: Robotics and Automa- tion (ICRA), 2017 IEEE International Conference on, IEEE (2017) 4628-4635 22. Bao, S.Y., Chandraker, M., Lin, Y., Savarese, S.: Dense object reconstruction with In: Computer Vision and Pattern Recognition (CVPR), 2013  semantic priors. IEEE Conference on, IEEE (2013) 1264-1271  23. Zia, M.Z., Stark, M., Schiele, B., Schindler, K.: Detailed 3d representations for ob- ject recognition and modeling. IEEE transactions on pattern analysis and machine intelligence 35(11) (2013) 2608-2623  24. Xiang, Y., Choi, W., Lin, Y., Savarese, S.: Data-driven 3d voxel patterns for object category recognition. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 1903-1911  25. Mousavian, A., Anguelov, D., Flynn, J., Koˇseck´a, J.: 3d bounding box estimation using deep learning and geometry. In: Computer Vision and Pattern Recognition (CVPR), 2017 IEEE Conference on, IEEE (2017) 5632-5640  26. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified, real-time object detection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 779-788  27. Rublee, E., Rabaud, V., Konolige, K., Bradski, G.: Orb: An eﬃcient alternative to sift or surf. In: Computer Vision (ICCV), 2011 IEEE international conference on, IEEE (2011) 2564-2571  28. Gu, T.:  Improved Trajectory Planning for On-Road Self-Driving Vehicles Via Combined Graph Search, Optimization & Topology Analysis. PhD thesis, Carnegie Mellon University (2017)  29. Geiger, A., Lenz, P., Urtasun, R.: Are we ready for autonomous driving? the In: Conference on Computer Vision and Pattern  kitti vision benchmark suite. Recognition (CVPR). (2012)  30. Geiger, A., Lenz, P., Stiller, C., Urtasun, R.: Vision meets robotics: The kitti  dataset. International Journal of Robotics Research (IJRR) (2013)  31. Cordts, M., Omran, M., Ramos, S., Scharw¨achter, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset. In: CVPR Workshop on the Future of Datasets in Vision. Volume 1. (2015) 3  32. Sturm, J., Engelhard, N., Endres, F., Burgard, W., Cremers, D.: A benchmark for the evaluation of rgb-d slam systems. In: Intelligent Robots and Systems (IROS), 2012 IEEE/RSJ International Conference on, IEEE (2012) 573-580"}