{"1": "1. Busta, M., Neumann, L., Matas, J.: Fastext: Eﬃcient unconstrained scene text detector (2015). In: IEEE International Conference on Computer Vision (ICCV). vol. 1  2. Cho, H., Sung, M., Jun, B.: Canny text detector: Fast and robust scene text lo- calization algorithm. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3566-3573 (2016)  3. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on. pp. 248-255. IEEE (2009)  4. Epshtein, B., Ofek, E., Wexler, Y.: Detecting text in natural scenes with stroke width transform. In: Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on. pp. 2963-2970. IEEE (2010)  5. Gupta, A., Vedaldi, A., Zisserman, A.: Synthetic data for text localisation in natu- ral images. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2016)  6. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016)  7. He, P., Huang, W., He, T., Zhu, Q., Qiao, Y., Li, X.: Single shot text detector with regional attention. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017)  8. He, T., Huang, W., Qiao, Y., Yao, J.: Accurate text localization in natural image with cascaded convolutional text network. arXiv preprint arXiv:1603.09423 (2016) 9. He, T., Huang, W., Qiao, Y., Yao, J.: Text-attentional convolutional neural network for scene text detection. IEEE transactions on image processing 25(6), 2529-2541 (2016)  10. He, T., Tian, Z., Huang, W., Shen, C., Qiao, Y., Sun, C.: An end-to-end textspotter with explicit alignment and attention. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5020-5029 (2018)  11. He, W., Zhang, X.Y., Yin, F., Liu, C.L.: Deep direct regression for multi-oriented scene text detection. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017)  12. Hu, H., Zhang, C., Luo, Y., Wang, Y., Han, J., Ding, E.: Wordsup: Exploiting word annotations for character based text detection. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017)  13. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected convolutional networks. In: Proceedings of the IEEE conference on computer vision and pattern recognition. vol. 1, p. 3 (2017)  14. Huang, L., Yang, Y., Deng, Y., Yu, Y.: Densebox: Unifying landmark localization  with end to end object detection. arXiv preprint arXiv:1509.04874 (2015)  15. Huang, W., Qiao, Y., Tang, X.: Robust scene text detection with convolution neural network induced mser trees. In: European Conference on Computer Vision. pp. 497-511. Springer (2014)  16. Jaderberg, M., Vedaldi, A., Zisserman, A.: Deep features for text spotting. In:  European conference on computer vision. pp. 512-528. Springer (2014)  17. Jiang, Y., Zhu, X., Wang, X., Yang, S., Li, W., Wang, H., Fu, P., Luo, Z.: R2cnn: Rotational region cnn for orientation robust scene text detection. arXiv preprint arXiv:1706.09579 (2017)   Scene Text Detection through Border and BootstrappingReferences  1. Busta, M., Neumann, L., Matas, J.: Fastext: Eﬃcient unconstrained scene text detector (2015). In: IEEE International Conference on Computer Vision (ICCV). vol. 1  2. Cho, H., Sung, M., Jun, B.: Canny text detector: Fast and robust scene text lo- calization algorithm. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3566-3573 (2016)  3. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on. pp. 248-255. IEEE (2009)  4. Epshtein, B., Ofek, E., Wexler, Y.: Detecting text in natural scenes with stroke width transform. In: Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on. pp. 2963-2970. IEEE (2010)  5. Gupta, A., Vedaldi, A., Zisserman, A.: Synthetic data for text localisation in natu- ral images. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (June 2016)  6. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 770-778 (2016)  7. He, P., Huang, W., He, T., Zhu, Q., Qiao, Y., Li, X.: Single shot text detector with regional attention. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017)  8. He, T., Huang, W., Qiao, Y., Yao, J.: Accurate text localization in natural image with cascaded convolutional text network. arXiv preprint arXiv:1603.09423 (2016) 9. He, T., Huang, W., Qiao, Y., Yao, J.: Text-attentional convolutional neural network for scene text detection. IEEE transactions on image processing 25(6), 2529-2541 (2016)  10. He, T., Tian, Z., Huang, W., Shen, C., Qiao, Y., Sun, C.: An end-to-end textspotter with explicit alignment and attention. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5020-5029 (2018)  11. He, W., Zhang, X.Y., Yin, F., Liu, C.L.: Deep direct regression for multi-oriented scene text detection. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017)  12. Hu, H., Zhang, C., Luo, Y., Wang, Y., Han, J., Ding, E.: Wordsup: Exploiting word annotations for character based text detection. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017)  13. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected convolutional networks. In: Proceedings of the IEEE conference on computer vision and pattern recognition. vol. 1, p. 3 (2017)  14. Huang, L., Yang, Y., Deng, Y., Yu, Y.: Densebox: Unifying landmark localization  with end to end object detection. arXiv preprint arXiv:1509.04874 (2015)  15. Huang, W., Qiao, Y., Tang, X.: Robust scene text detection with convolution neural network induced mser trees. In: European Conference on Computer Vision. pp. 497-511. Springer (2014)  16. Jaderberg, M., Vedaldi, A., Zisserman, A.: Deep features for text spotting. In:  European conference on computer vision. pp. 512-528. Springer (2014)  17. Jiang, Y., Zhu, X., Wang, X., Yang, S., Li, W., Wang, H., Fu, P., Luo, Z.: R2cnn: Rotational region cnn for orientation robust scene text detection. arXiv preprint arXiv:1706.09579 (2017)   16  Chuhui Xue, Shijian Lu, Fangneng Zhan  18. Kang, L., Li, Y., Doermann, D.: Orientation robust text line detection in natural images. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 4034-4041 (2014)  19. Karatzas, D., Gomez-Bigorda, L., Nicolaou, A., Ghosh, S., Bagdanov, A., Iwa- mura, M., Matas, J., Neumann, L., Chandrasekhar, V.R., Lu, S., et al.: Icdar 2015 competition on robust reading. In: Document Analysis and Recognition (ICDAR), 2015 13th International Conference on. pp. 1156-1160. IEEE (2015)  20. Karatzas, D., Shafait, F., Uchida, S., Iwamura, M., i Bigorda, L.G., Mestre, S.R., Mas, J., Mota, D.F., Almazan, J.A., De Las Heras, L.P.: Icdar 2013 robust reading competition. In: Document Analysis and Recognition (ICDAR), 2013 12th Inter- national Conference on. pp. 1484-1493. IEEE (2013)  21. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  22. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con- volutional neural networks. In: Advances in neural information processing systems. pp. 1097-1105 (2012)  23. Liao, M., Shi, B., Bai, X., Wang, X., Liu, W.: Textboxes: A fast text detector with  a single deep neural network. In: AAAI. pp. 4161-4167 (2017)  24. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S., Fu, C.Y., Berg, A.C.: Ssd: Single shot multibox detector. In: European conference on computer vision. pp. 21-37. Springer (2016)  25. Liu, Y., Jin, L.: Deep matching prior network: Toward tighter multi-oriented text detection. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017)  26. Liu, Z., Lin, G., Yang, S., Feng, J., Lin, W., Goh, W.L.: Learning markov clustering networks for scene text detection. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2018)  27. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 3431-3440 (2015)  28. Lu, S., Chen, T., Tian, S., Lim, J.H., Tan, C.L.: Scene text extraction based on edges and support vector regression. International Journal on Document Analysis and Recognition (IJDAR) 18(2), 125-135 (2015)  29. Milletari, F., Navab, N., Ahmadi, S.A.: V-net: Fully convolutional neural networks for volumetric medical image segmentation. In: 3D Vision (3DV), 2016 Fourth International Conference on. pp. 565-571. IEEE (2016)  30. Nayef, N., Chazalon, J., Khlif, W., Luqman, M.M., Burie, J.C., Liu, C.l., Ogier, J.M., Yin, F., Bizid, I., Choi, H., et al.: Icdar2017 robust reading challenge on multi-lingual scene text detection and script identification-rrc-mlt. In: 2017 14th IAPR International Conference on Document Analysis and Recognition (ICDAR). pp. 1454-1459. IEEE (2017)  31. Neumann, L., Matas, J.: Real-time scene text localization and recognition. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on. pp. 3538-3545. IEEE (2012)  32. Polzounov, A., Ablavatski, A., Escalera, S., Lu, S., Cai, J.: Wordfence: Text detec- tion in natural images with border awareness. In: Image Processing (ICIP), 2017 IEEE International Conference on. pp. 1222-1226. IEEE (2017)  33. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified, real-time object detection. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 779-788 (2016)   Scene Text Detection through Border and Bootstrapping34. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object detec- tion with region proposal networks. In: Advances in neural information processing systems. pp. 91-99 (2015)  35. Shi, B., Bai, X., Belongie, S.: Detecting oriented text in natural images by linking segments. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017)  36. Shi, B., Yao, C., Liao, M., Yang, M., Xu, P., Cui, L., Belongie, S., Lu, S., Bai, X.: Icdar2017 competition on reading chinese text in the wild (rctw-17). In: Document Analysis and Recognition (ICDAR), 2017 14th IAPR International Conference on. vol. 1, pp. 1429-1434. IEEE (2017)  37. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale  image recognition. arXiv preprint arXiv:1409.1556 (2014)  38. Tian, S., Lu, S., Li, C.: Wetext: Scene text detection under weak supervision. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017) 39. Tian, S., Pan, Y., Huang, C., Lu, S., Yu, K., Lim Tan, C.: Text ﬂow: A unified text detection system in natural scene images. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 4651-4659 (2015)  40. Tian, Z., Huang, W., He, T., He, P., Qiao, Y.: Detecting text in natural image with connectionist text proposal network. In: European Conference on Computer Vision. pp. 56-72. Springer (2016)  41. Wang, K., Babenko, B., Belongie, S.: End-to-end scene text recognition. In: Com- puter Vision (ICCV), 2011 IEEE International Conference on. pp. 1457-1464. IEEE (2011)  42. Wu, Y., Natarajan, P.: Self-organized text detection with minimal post-processing via border learning. In: The IEEE International Conference on Computer Vision (ICCV) (Oct 2017)  43. Yao, C., Bai, X., Liu, W.: A unified framework for multioriented text detection and recognition. IEEE Transactions on Image Processing 23(11), 4737-4749 (2014) 44. Yao, C., Bai, X., Liu, W., Ma, Y., Tu, Z.: Detecting texts of arbitrary orientations in natural images. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on. pp. 1083-1090. IEEE (2012)  45. Yao, C., Bai, X., Sang, N., Zhou, X., Zhou, S., Cao, Z.: Scene text detection via  holistic, multi-channel prediction. arXiv preprint arXiv:1606.09002 (2016)  46. Ye, Q., Doermann, D.: Text detection and recognition in imagery: A survey. IEEE transactions on pattern analysis and machine intelligence 37(7), 1480-1500 (2015) 47. Yin, X.C., Pei, W.Y., Zhang, J., Hao, H.W.: Multi-orientation scene text detec- tion with adaptive clustering. IEEE transactions on pattern analysis and machine intelligence 37(9), 1930-1937 (2015)  48. Yu, J., Jiang, Y., Wang, Z., Cao, Z., Huang, T.: Unitbox: An advanced object detection network. In: Proceedings of the 2016 ACM on Multimedia Conference. pp. 516-520. ACM (2016)  49. Zhang, Z., Shen, W., Yao, C., Bai, X.: Symmetry-based text line detection in natural scenes, 2015. In: IEEE Computer Vision and Pattern Recognition (CVPR). vol. 1, p. 3  50. Zhang, Z., Zhang, C., Shen, W., Yao, C., Liu, W., Bai, X.: Multi-oriented text de- tection with fully convolutional networks. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 4159-4167 (2016)  51. Zhong, Z., Zheng, L., Kang, G., Li, S., Yang, Y.: Random erasing data augmenta-  tion. arXiv preprint arXiv:1708.04896 (2017)   18  Chuhui Xue, Shijian Lu, Fangneng Zhan  52. Zhou, X., Yao, C., Wen, H., Wang, Y., Zhou, S., He, W., Liang, J.: East: An eﬃcient and accurate scene text detector. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (July 2017)  53. Zhu, Y., Yao, C., Bai, X.: Scene text detection and recognition: Recent advances  and future trends. Frontiers of Computer Science 10(1), 19-36 (2016)"}