{"1": "1. Agustsson, E., Timofte, R.: Ntire 2017 challenge on single image super-resolution: Dataset and study. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW). pp. 1122-1131 (2017)  2. Asus Xtion Pro Live: https://www.asus.com/3D-Sensor/Xtion_PRO_LIVE/ 3. Blum, M., Springenberg, J.T., Wülfing, J., Riedmiller, M.: A learned feature de- scriptor for object recognition in rgb-d data. In: Proc. IEEE International Confer- ence on Robotics and Automation (ICRA). pp. 1298-1303 (2012)  4. Bruhn, A., Weickert, J., Schnörr, C.: Lucas/kanade meets horn/schunck: Combin- ing local and global optic ﬂow methods. International Journal of Computer Vision (IJCV) 61(3), 211-231 (2005)  5. Chen, L., Lin, H., Li, S.: Depth image enhancement for kinect using region grow- ing and bilateral filter. In: Proc. International Conference on Pattern Recognition (ICPR). pp. 3070-3073 (2012)  6. Dai, A., Chang, A.X., Savva, M., Halber, M., Funkhouser, T., Nießner, M.: Scannet: Richly-annotated 3d reconstructions of indoor scenes. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2432-2443 (2017) 7. Dai, A., Nießner, M., Zollhöfer, M., Izadi, S., Theobalt, C.: Bundlefusion: Real- time globally consistent 3d reconstruction using on-the-ﬂy surface reintegration. ACM Transactions on Graphics (ToG) 36(3), 24 (2017)  8. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A Large- Scale Hierarchical Image Database. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 248 - 255 (2009)  9. Denton, E.L., Chintala, S., Fergus, R., et al.: Deep generative image models using a laplacian pyramid of adversarial networks. In: Proc. Advances in Neural Infor- mation Processing Systems (NIPS). pp. 1486-1494 (2015)  10. Dong, C., Loy, C.C., He, K., Tang, X.: Learning a deep convolutional network for image super-resolution. In: Proc. European Conference on Computer Vision (ECCV). pp. 184-199 (2014)  11. Eitel, A., Springenberg, J.T., Spinello, L., Riedmiller, M., Burgard, W.: Multi- modal deep learning for robust rgb-d object recognition. In: Proc. IEEE/RSJ In- ternational Conference on Intelligent Robots and Systems (IROS). pp. 681-687 (2015)  12. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial nets. In: Proc. Advances in Neural Information Processing Systems (NIPS). pp. 2672-2680 (2014)  13. Gu, S., Zuo, W., Guo, S., Chen, Y., Chen, C., Zhang, L.: Learning dynamic guid- ance for depth image enhancement. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 712-721 (2017)  14. Gupta, S., Girshick, R., Arbeláez, P., Malik, J.: Learning rich features from rgb-d images for object detection and segmentation. In: Proc. European Conference on Computer Vision (ECCV). pp. 345-360 (2014)  15. Han, Y., Lee, J.Y., Kweon, I.S.: High quality shape from a single rgb-d image under uncalibrated natural illumination. In: Proc. IEEE International Conference on Computer Vision (ICCV). pp. 1617-1624 (2013)  16. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 770-778 (2016)   Reconstruction-based Dataset for Depth Image Enhancement Using CNNReferences  1. Agustsson, E., Timofte, R.: Ntire 2017 challenge on single image super-resolution: Dataset and study. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW). pp. 1122-1131 (2017)  2. Asus Xtion Pro Live: https://www.asus.com/3D-Sensor/Xtion_PRO_LIVE/ 3. Blum, M., Springenberg, J.T., Wülfing, J., Riedmiller, M.: A learned feature de- scriptor for object recognition in rgb-d data. In: Proc. IEEE International Confer- ence on Robotics and Automation (ICRA). pp. 1298-1303 (2012)  4. Bruhn, A., Weickert, J., Schnörr, C.: Lucas/kanade meets horn/schunck: Combin- ing local and global optic ﬂow methods. International Journal of Computer Vision (IJCV) 61(3), 211-231 (2005)  5. Chen, L., Lin, H., Li, S.: Depth image enhancement for kinect using region grow- ing and bilateral filter. In: Proc. International Conference on Pattern Recognition (ICPR). pp. 3070-3073 (2012)  6. Dai, A., Chang, A.X., Savva, M., Halber, M., Funkhouser, T., Nießner, M.: Scannet: Richly-annotated 3d reconstructions of indoor scenes. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2432-2443 (2017) 7. Dai, A., Nießner, M., Zollhöfer, M., Izadi, S., Theobalt, C.: Bundlefusion: Real- time globally consistent 3d reconstruction using on-the-ﬂy surface reintegration. ACM Transactions on Graphics (ToG) 36(3), 24 (2017)  8. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: ImageNet: A Large- Scale Hierarchical Image Database. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 248 - 255 (2009)  9. Denton, E.L., Chintala, S., Fergus, R., et al.: Deep generative image models using a laplacian pyramid of adversarial networks. In: Proc. Advances in Neural Infor- mation Processing Systems (NIPS). pp. 1486-1494 (2015)  10. Dong, C., Loy, C.C., He, K., Tang, X.: Learning a deep convolutional network for image super-resolution. In: Proc. European Conference on Computer Vision (ECCV). pp. 184-199 (2014)  11. Eitel, A., Springenberg, J.T., Spinello, L., Riedmiller, M., Burgard, W.: Multi- modal deep learning for robust rgb-d object recognition. In: Proc. IEEE/RSJ In- ternational Conference on Intelligent Robots and Systems (IROS). pp. 681-687 (2015)  12. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville, A., Bengio, Y.: Generative adversarial nets. In: Proc. Advances in Neural Information Processing Systems (NIPS). pp. 2672-2680 (2014)  13. Gu, S., Zuo, W., Guo, S., Chen, Y., Chen, C., Zhang, L.: Learning dynamic guid- ance for depth image enhancement. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 712-721 (2017)  14. Gupta, S., Girshick, R., Arbeláez, P., Malik, J.: Learning rich features from rgb-d images for object detection and segmentation. In: Proc. European Conference on Computer Vision (ECCV). pp. 345-360 (2014)  15. Han, Y., Lee, J.Y., Kweon, I.S.: High quality shape from a single rgb-d image under uncalibrated natural illumination. In: Proc. IEEE International Conference on Computer Vision (ICCV). pp. 1617-1624 (2013)  16. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 770-778 (2016)   16  J. Jeon and S. Lee  17. Hui, T.W., Loy, C.C., Tang, X.: Depth map super-resolution by deep multi-scale guidance. In: Proc. European Conference on Computer Vision (ECCV). pp. 353- 369 (2016)  18. Iizuka, S., Simo-Serra, E., Ishikawa, H.: Globally and Locally Consistent Image  Completion. ACM Transactions on Graphics (ToG) 36(4), 107 (2017)  19. Kiechle, M., Hawe, S., Kleinsteuber, M.: A joint intensity and depth co-sparse analysis model for depth map super-resolution. In: Proc. IEEE International Con- ference on Computer Vision (ICCV). pp. 1545-1552 (2013)  20. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. In: Proc. In-  ternational Conference on Learning Representations (ICLR) (2015)  21. Kopf, J., Cohen, M.F., Lischinski, D., Uyttendaele, M.: Joint bilateral upsampling.  ACM Transactions on Graphics (ToG) 26(3), 96 (2007)  22. Kwon, H., Tai, Y.W., Lin, S.: Data-driven depth map refinement via multi-scale sparse representation. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 159-167 (2015)  23. Lai, W.S., Huang, J.B., Ahuja, N., Yang, M.H.: Deep laplacian pyramid networks for fast and accurate super-resolution. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 624-632 (2017)  24. Le, A.V., Jung, S.W., Won, C.S.: Directional joint bilateral filter for depth images.  Sensors 14(7), 11362-11378 (2014)  25. Ledig, C., Theis, L., Huszar, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A., Tejani, A., Totz, J., Wang, Z., et al.: Photo-realistic single image super- resolution using a generative adversarial network. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 4681-4690 (2017)  26. Lin, D., Fidler, S., Urtasun, R.: Holistic scene understanding for 3d object detection with rgbd cameras. In: Proc. IEEE International Conference on Computer Vision (ICCV). pp. 1417-1424 (2013)  27. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Dollár, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: Proc. European Conference on Computer Vision (ECCV). pp. 740-755 (2014)  28. Lu, J., Forsyth, D.: Sparse depth super resolution. In: Proc. IEEE Conference on  Computer Vision and Pattern Recognition (CVPR). pp. 2245-2253 (2015)  29. Lu, S., Ren, X., Liu, F.: Depth enhancement via low-rank matrix completion. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 3390-3397 (2014)  30. Nah, S., Kim, T.H., Lee, K.M.: Deep multi-scale convolutional neural network for dynamic scene deblurring. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 257-265 (2017)  31. Nathan Silberman, Derek Hoiem, P.K., Fergus, R.: Indoor segmentation and sup- port inference from rgbd images. In: Proc. European Conference on Computer Vision (ECCV). pp. 746-760 (2012)  32. Newcombe, R.A., Izadi, S., Hilliges, O., Molyneaux, D., Kim, D., Davison, A.J., Kohi, P., Shotton, J., Hodges, S., Fitzgibbon, A.: Kinectfusion: Real-time dense surface mapping and tracking. In: Proc. IEEE international Symposium on Mixed and Augmented Reality (ISMAR). pp. 127-136 (2011)  33. Nießner, M., Zollhöfer, M., Izadi, S., Stamminger, M.: Real-time 3d reconstruction at scale using voxel hashing. ACM Transactions on Graphics (ToG) 32(6), 169 (2013)  34. Occipital Structure Sensor: https://structure.io/ 35. Paszke, A., Gross, S., Chintala, S., Chanan, G.: Pytorch: Tensors and dynamic  neural networks in python with strong gpu acceleration (2017)   Reconstruction-based Dataset for Depth Image Enhancement Using CNN36. Pathak, D., Krähenbühl, P., Donahue, J., Darrell, T., Efros, A.: Context encoders: Feature learning by inpainting. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 2536-2544 (2016)  37. Schmeing, M., Jiang, X.: Edge-aware depth image filtering using color segmenta-  tion. Pattern Recognition Letters (PR) 50(C), 63-71 (2014)  38. Shen, X., Zhou, C., Xu, L., Jia, J.: Mutual-structure for joint filtering. In: Proc. IEEE International Conference on Computer Vision (ICCV). pp. 3406-3414 (2015) 39. Song, S., Lichtenberg, S.P., Xiao, J.: Sun rgb-d: A rgb-d scene understanding benchmark suite. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 567-576 (2015)  40. Tomasi, C., Manduchi, R.: Bilateral filtering for gray and color images. In: Proc. IEEE International Conference on Computer Vision (ICCV). pp. 839-846 (1998) 41. Tosic, I., Drewes, S.: Learning joint intensity-depth sparse representations. IEEE  Transactions on Image Processing (TIP) 23(5), 2122-2132 (2014)  42. Wang, Z., Bovik, A.C., Sheikh, H.R., Simoncelli, E.P.: Image quality assessment: from error visibility to structural similarity. IEEE Transactions on Image Process- ing (TIP) 13(4), 600-612 (2004)  43. Wu, C., Zollhöfer, M., Nießner, M., Stamminger, M., Izadi, S., Theobalt, C.: Real- time shading-based refinement for consumer depth cameras. ACM Transactions on Graphics (ToG) 33(6), 200 (2014)  44. Xu, L., Ren, J., Yan, Q., Liao, R., Jia, J.: Deep edge-aware filters. In: Proc. Inter-  national Conference on Machine Learning (ICML). pp. 1669-1678 (2015)  45. Xu, L., Ren, J.S., Liu, C., Jia, J.: Deep convolutional neural network for image de- convolution. In: Proc. Advances in Neural Information Processing Systems (NIPS). pp. 1790-1798 (2014)  46. Yu, L.F., Yeung, S.K., Tai, Y.W., Lin, S.: Shading-based shape refinement of rgb-d images. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR). pp. 1415-1422 (2013)  47. Zhang, L., Shen, P., Zhang, S., Song, J., Zhu, G.: Depth enhancement with im- proved exemplar-based inpainting and joint trilateral guided filtering. In: Proc. IEEE International Conference on Image Processing (ICIP). pp. 4102-4106 (2016) 48. Zhang, Q., Shen, X., Xu, L., Jia, J.: Rolling guidance filter. In: Proc. European  Conference on Computer Vision (ECCV). pp. 815-830 (2014)  49. Zhang, Y., Funkhouser, T.: Deep depth completion of a single rgb-d image. In: Proc. IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2018)"}