{"1": "1. Matterport. https://matterport.com/ 2. Armeni, I., Sener, O., Zamir, A.R., Jiang, H., Brilakis, I., Fischer, M., Savarese, S.: 3d semantic parsing of large-scale indoor spaces. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1534-1543 (2016) 3. Chang, A., Dai, A., Funkhouser, T., Halber, M., Nießner, M., Savva, M., Song, S., Zeng, A., Zhang, Y.: Matterport3d: Learning from rgb-d data in indoor environ- ments. arXiv preprint arXiv:1709.06158 (2017)  4. Dai, A., Chang, A.X., Savva, M., Halber, M., Funkhouser, T., Nießner, M.: Scannet: Richly-annotated 3d reconstructions of indoor scenes. In: Proc. IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). vol. 1 (2017)  5. Furukawa, Y., Curless, B., Seitz, S.M., Szeliski, R.: Manhattan-world stereo. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on. pp. 1422-1429. IEEE (2009)  6. Furukawa, Y., Curless, B., Seitz, S.M., Szeliski, R.: Reconstructing building inte- riors from images. In: Computer Vision, 2009 IEEE 12th International Conference on. pp. 80-87. IEEE (2009)  7. Gao, R., Zhao, M., Ye, T., Ye, F., Luo, G., Wang, Y., Bian, K., Wang, T., Li, X.: Multi-story indoor ﬂoor plan reconstruction via mobile crowdsensing. IEEE Transactions on Mobile Computing 15(6), 1427-1442 (2016)  8. Gao, R., Zhao, M., Ye, T., Ye, F., Wang, Y., Bian, K., Wang, T., Li, X.: Jigsaw: Indoor ﬂoor plan reconstruction via mobile crowdsensing. In: Proceedings of the 20th annual international conference on Mobile computing and networking. pp. 249-260. ACM (2014)  9. Hua, B.S., Pham, Q.H., Nguyen, D.T., Tran, M.K., Yu, L.F., Yeung, S.K.: Sce- nenn: A scene meshes dataset with annotations. In: 3D Vision (3DV), 2016 Fourth International Conference on. pp. 92-101. IEEE (2016)  10. Ikehata, S., Yang, H., Furukawa, Y.: Structured indoor modeling. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 1323-1331 (2015)  11. Inc., G.: Project tango. https://developers.google.com/tango/ 12. Jiang, Y., Xiang, Y., Pan, X., Li, K., Lv, Q., Dick, R.P., Shang, L., Hannigan, M.: Hallway based automatic indoor ﬂoorplan construction using room fingerprints. In: Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. pp. 315-324. ACM (2013)  13. Klokov, R., Lempitsky, V.: Escape from cells: Deep kd-networks for the recognition of 3d point cloud models. In: 2017 IEEE International Conference on Computer Vision (ICCV). pp. 863-872. IEEE (2017) 14. Lee, J., Dugan, R., et al.: Google project tango 15. Li, Y., Pirk, S., Su, H., Qi, C.R., Guibas, L.J.: Fpnn: Field probing neural networks for 3d data. In: Advances in Neural Information Processing Systems. pp. 307-315 (2016)  16. Limberger, F.A., Wilson, R.C., Aono, M., Audebert, N., Boulch, A., Bustos, B., Giachetti, A., Godil, A., Le Saux, B., Li, B., et al.: Shrec’17 track: point-cloud shape retrieval of non-rigid toys. In: 10th Eurographics workshop on 3D Object retrieval. pp. 1-11 (2017)  17. Liu, C., Wu, J., Kohli, P., Furukawa, Y.: Raster-to-vector: Revisiting ﬂoorplan transformation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2195-2203 (2017)   FloorNet: A Unified Framework for Floorplan Reconstruction from 3D ScansReferences  1. Matterport. https://matterport.com/ 2. Armeni, I., Sener, O., Zamir, A.R., Jiang, H., Brilakis, I., Fischer, M., Savarese, S.: 3d semantic parsing of large-scale indoor spaces. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1534-1543 (2016) 3. Chang, A., Dai, A., Funkhouser, T., Halber, M., Nießner, M., Savva, M., Song, S., Zeng, A., Zhang, Y.: Matterport3d: Learning from rgb-d data in indoor environ- ments. arXiv preprint arXiv:1709.06158 (2017)  4. Dai, A., Chang, A.X., Savva, M., Halber, M., Funkhouser, T., Nießner, M.: Scannet: Richly-annotated 3d reconstructions of indoor scenes. In: Proc. IEEE Conf. on Computer Vision and Pattern Recognition (CVPR). vol. 1 (2017)  5. Furukawa, Y., Curless, B., Seitz, S.M., Szeliski, R.: Manhattan-world stereo. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on. pp. 1422-1429. IEEE (2009)  6. Furukawa, Y., Curless, B., Seitz, S.M., Szeliski, R.: Reconstructing building inte- riors from images. In: Computer Vision, 2009 IEEE 12th International Conference on. pp. 80-87. IEEE (2009)  7. Gao, R., Zhao, M., Ye, T., Ye, F., Luo, G., Wang, Y., Bian, K., Wang, T., Li, X.: Multi-story indoor ﬂoor plan reconstruction via mobile crowdsensing. IEEE Transactions on Mobile Computing 15(6), 1427-1442 (2016)  8. Gao, R., Zhao, M., Ye, T., Ye, F., Wang, Y., Bian, K., Wang, T., Li, X.: Jigsaw: Indoor ﬂoor plan reconstruction via mobile crowdsensing. In: Proceedings of the 20th annual international conference on Mobile computing and networking. pp. 249-260. ACM (2014)  9. Hua, B.S., Pham, Q.H., Nguyen, D.T., Tran, M.K., Yu, L.F., Yeung, S.K.: Sce- nenn: A scene meshes dataset with annotations. In: 3D Vision (3DV), 2016 Fourth International Conference on. pp. 92-101. IEEE (2016)  10. Ikehata, S., Yang, H., Furukawa, Y.: Structured indoor modeling. In: Proceedings of the IEEE International Conference on Computer Vision. pp. 1323-1331 (2015)  11. Inc., G.: Project tango. https://developers.google.com/tango/ 12. Jiang, Y., Xiang, Y., Pan, X., Li, K., Lv, Q., Dick, R.P., Shang, L., Hannigan, M.: Hallway based automatic indoor ﬂoorplan construction using room fingerprints. In: Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. pp. 315-324. ACM (2013)  13. Klokov, R., Lempitsky, V.: Escape from cells: Deep kd-networks for the recognition of 3d point cloud models. In: 2017 IEEE International Conference on Computer Vision (ICCV). pp. 863-872. IEEE (2017) 14. Lee, J., Dugan, R., et al.: Google project tango 15. Li, Y., Pirk, S., Su, H., Qi, C.R., Guibas, L.J.: Fpnn: Field probing neural networks for 3d data. In: Advances in Neural Information Processing Systems. pp. 307-315 (2016)  16. Limberger, F.A., Wilson, R.C., Aono, M., Audebert, N., Boulch, A., Bustos, B., Giachetti, A., Godil, A., Le Saux, B., Li, B., et al.: Shrec’17 track: point-cloud shape retrieval of non-rigid toys. In: 10th Eurographics workshop on 3D Object retrieval. pp. 1-11 (2017)  17. Liu, C., Wu, J., Kohli, P., Furukawa, Y.: Raster-to-vector: Revisiting ﬂoorplan transformation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 2195-2203 (2017)   16  Chen Liu, Jiaye Wu  , and Yasutaka Furukawa  ⋆  18. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proceedings of the IEEE conference on computer vision and pattern recognition. pp. 3431-3440 (2015)  19. Luo, H., Zhao, F., Jiang, M., Ma, H., Zhang, Y.: Constructing an indoor ﬂoor plan using crowdsourcing based on magnetic fingerprinting. Sensors 17(11), 2678 (2017)  20. Maturana, D., Scherer, S.: Voxnet: A 3d convolutional neural network for real-time object recognition. In: Intelligent Robots and Systems (IROS), 2015 IEEE/RSJ International Conference on. pp. 922-928. IEEE (2015)  21. Mura, C., Mattausch, O., Pajarola, R.: Piecewise-planar reconstruction of multi- room interiors with arbitrary wall arrangements. In: Computer Graphics Forum. vol. 35, pp. 179-188. Wiley Online Library (2016)  22. Mura, C., Mattausch, O., Villanueva, A.J., Gobbetti, E., Pajarola, R.: Automatic room detection and reconstruction in cluttered indoor environments with complex room layouts. Computers & Graphics 44, 20-32 (2014)  23. Newcombe, R.A., Izadi, S., Hilliges, O., Molyneaux, D., Kim, D., Davison, A.J., Kohi, P., Shotton, J., Hodges, S., Fitzgibbon, A.: Kinectfusion: Real-time dense surface mapping and tracking. In: Mixed and augmented reality (ISMAR), 2011 10th IEEE international symposium on. pp. 127-136. IEEE (2011)  24. Newell, A., Yang, K., Deng, J.: Stacked hourglass networks for human pose es- timation. In: European Conference on Computer Vision. pp. 483-499. Springer (2016)  25. Okorn, B., Xiong, X., Akinci, B., Huber, D.: Toward automated modeling of ﬂoor plans. In: Proceedings of the symposium on 3D data processing, visualization and transmission. vol. 2 (2010)  26. Qi, C.R., Su, H., Mo, K., Guibas, L.J.: Pointnet: Deep learning on point sets for  3d classification and segmentation. arXiv preprint arXiv:1612.00593 (2016)  27. Qi, C.R., Su, H., Nießner, M., Dai, A., Yan, M., Guibas, L.J.: Volumetric and multi-view cnns for object classification on 3d data. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5648-5656 (2016)  28. Qi, C.R., Yi, L., Su, H., Guibas, L.J.: Pointnet++: Deep hierarchical feature learn- ing on point sets in a metric space. In: Advances in Neural Information Processing Systems. pp. 5105-5114 (2017)  29. Riegler, G., Ulusoys, A.O., Geiger, A.: Octnet: Learning deep 3d representations  at high resolutions. arXiv preprint arXiv:1611.05009 (2016)  30. Sch¨ops, T., Sch¨onberger, J.L., Galliani, S., Sattler, T., Schindler, K., Pollefeys, M., Geiger, A.: A multi-view stereo benchmark with high-resolution images and multi-camera videos. In: Proc. CVPR. vol. 3 (2017)  31. Sinha, S., Steedly, D., Szeliski, R.: Piecewise planar stereo for image-based render-  ing (2009)  32. Song, S., Yu, F., Zeng, A., Chang, A.X., Savva, M., Funkhouser, T.: Semantic scene completion from a single depth image. arXiv preprint arXiv:1611.08974 (2016) 33. Song, S., Yu, F., Zeng, A., Chang, A.X., Savva, M., Funkhouser, T.: Semantic scene completion from a single depth image. IEEE Conference on Computer Vision and Pattern Recognition (2017)  34. Su, H., Maji, S., Kalogerakis, E., Learned-Miller, E.: Multi-view convolutional neural networks for 3d shape recognition. In: Proceedings of the IEEE international conference on computer vision. pp. 945-953 (2015)  35. Sui, W., Wang, L., Fan, B., Xiao, H., Wu, H., Pan, C.: Layer-wise ﬂoorplan ex- traction for automatic urban building reconstruction. IEEE transactions on visu- alization and computer graphics 22(3), 1261-1277 (2016)   FloorNet: A Unified Framework for Floorplan Reconstruction from 3D Scans36. Tatarchenko, M., Dosovitskiy, A., Brox, T.: Octree generating networks: Eﬃ- cient convolutional architectures for high-resolution 3d outputs. arXiv preprint arXiv:1703.09438 (2017)  37. Turner, E., Cheng, P., Zakhor, A.: Fast, automated, scalable generation of textured 3d models of indoor environments. IEEE Journal of Selected Topics in Signal Pro- cessing 9(3), 409-421 (2015)  38. Wang, D.Z., Posner, I.: Voting for voting in online point cloud object detection.  In: Robotics: Science and Systems (2015)  39. Wang, P.S., Liu, Y., Guo, Y.X., Sun, C.Y., Tong, X.: O-cnn: Octree-based con- volutional neural networks for 3d shape analysis. ACM Transactions on Graphics (TOG) 36(4), 72 (2017)  40. Whelan, T., Kaess, M., Fallon, M., Johannsson, H., Leonard, J., McDonald, J.:  Kintinuous: Spatially extended kinectfusion (2012)  41. Wu, Z., Song, S., Khosla, A., Yu, F., Zhang, L., Tang, X., Xiao, J.: 3d shapenets: A deep representation for volumetric shapes. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 1912-1920 (2015)  42. Xiao, J., Furukawa, Y.: Reconstructing the worlds museums. International journal  of computer vision 110(3), 243-258 (2014)  43. Xiong, X., Adan, A., Akinci, B., Huber, D.: Automatic creation of semantically rich 3d building models from laser scanner data. Automation in Construction 31, 325-337 (2013)  44. Yu, F., Koltun, V., Funkhouser, T.: Dilated residual networks. In: Computer Vision  and Pattern Recognition. vol. 1 (2017)  45. Zhang, Y., Bai, M., Kohli, P., Izadi, S., Xiao, J.: Deepcontext: Context- encoding neural pathways for 3d holistic scene understanding. arXiv preprint arXiv:1603.04922 (2016)  46. Zhang, Y., Yu, F., Song, S., Xu, P., Seﬀ, A., Xiao, J.: Large-scale scene under-  standing challenge: Room layout estimation. accessed on Sep 15 (2015)  47. Zhao, Y., Zhu, S.C.: Image parsing with stochastic scene grammar. In: Advances  in Neural Information Processing Systems. pp. 73-81 (2011)"}