{"1": "1. AbdAlmageed, W., Wu, Y., Rawls, S., Harel, S., Hassner, T., Masi, I., Choi, J., Lekust, J., Kim, J., Natarajan, P., et al.: Face recognition using deep multi-pose representations. In: IEEE Winter Conference on Applications of Computer Vision (WACV) (2016)  2. Ahonen, T., Hadid, A., Pietikainen, M.: Face description with local binary pat- terns: Application to face recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) (2006)  3. Belhumeur, P.N., Hespanha, J.P., Kriegman, D.J.: Eigenfaces vs. Fisherfaces: recognition using class specific linear projection. IEEE Transactions on Pattern Analysis Machine Intelligence (TPAMI) (2002)  4. Chen, D., Yuan, L., Liao, J., Yu, N., Hua, G.: StyleBank: An explicit representation for neural image style transfer. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  5. Chen, J.C., Patel, V.M., Chellappa, R.: Unconstrained face verification using deep CNN features. In: IEEE Winter Conference on Applications of Computer Vision (WACV) (2016)  6. Chen, J.C., Patel, V., Chellappa, R.: Landmark-based fisher vector representa- tion for video-based face verification. In: IEEE International Conference on Image Processing (ICIP) (2015)  7. Chen, Y., Chen, Y., Wang, X., Tang, X.: Deep learning face representation by joint identification-verification. In: Advances in Neural Information Processing Systems (NIPS) (2014)  8. Ding, C., Tao, D.: Robust face recognition via multimodal deep face representation.  IEEE Transactions on Multimedia (TMM) (2015)  9. Huang, G.B., Learned-Miller, E.: Labeled faces in the wild: Updates and new reporting procedures. In: Dept. Comput. Sci., Univ. Massachusetts Amherst, Amherst, MA, USA, Tech. Rep (2014)  10. Huang, G.B., Mattar, M., Berg, T., Learned-Miller, E.: Labeled faces in the wild: A database for studying face recognition in unconstrained environments (2007) 11. Jia, X., De Brabandere, B., Tuytelaars, T., Gool, L.V.: Dynamic filter networks.  In: NIPS (2016)  lution. In: NIPS (2017)  12. Kang, D., Dhar, D., Chan, A.: Incorporating side information by adaptive convo-  13. Karpathy, A., Toderici, G., Shetty, S., Leung, T., Sukthankar, R., Fei-Fei, L.: Large- scale video classification with convolutional neural networks. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2014)  14. Klare, B.F., Klein, B., Taborsky, E., Blanton, A.: Pushing the frontiers of un- constrained face detection and recognition: Iarpa janus benchmark a. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2015)  15. Klein, B., Wolf, L., Afek, Y.: A dynamic convolutional layer for short range weather  prediction. In: CVPR (2015)  16. Krizhevsky, A., Sutskever, I., Hinton, G.E.: ImageNet classification with deep con- volutional neural networks. In: Advances in Neural Information Processing Systems (NIPS) (2012)  17. Liu, W., Wen, Y., Yu, Z., Li, M., Raj, B., Song, L.: Sphereface: Deep hypersphere embedding for face recognition. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)   Face Recognition with Contrastive ConvolutionReferences  1. AbdAlmageed, W., Wu, Y., Rawls, S., Harel, S., Hassner, T., Masi, I., Choi, J., Lekust, J., Kim, J., Natarajan, P., et al.: Face recognition using deep multi-pose representations. In: IEEE Winter Conference on Applications of Computer Vision (WACV) (2016)  2. Ahonen, T., Hadid, A., Pietikainen, M.: Face description with local binary pat- terns: Application to face recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence (TPAMI) (2006)  3. Belhumeur, P.N., Hespanha, J.P., Kriegman, D.J.: Eigenfaces vs. Fisherfaces: recognition using class specific linear projection. IEEE Transactions on Pattern Analysis Machine Intelligence (TPAMI) (2002)  4. Chen, D., Yuan, L., Liao, J., Yu, N., Hua, G.: StyleBank: An explicit representation for neural image style transfer. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  5. Chen, J.C., Patel, V.M., Chellappa, R.: Unconstrained face verification using deep CNN features. In: IEEE Winter Conference on Applications of Computer Vision (WACV) (2016)  6. Chen, J.C., Patel, V., Chellappa, R.: Landmark-based fisher vector representa- tion for video-based face verification. In: IEEE International Conference on Image Processing (ICIP) (2015)  7. Chen, Y., Chen, Y., Wang, X., Tang, X.: Deep learning face representation by joint identification-verification. In: Advances in Neural Information Processing Systems (NIPS) (2014)  8. Ding, C., Tao, D.: Robust face recognition via multimodal deep face representation.  IEEE Transactions on Multimedia (TMM) (2015)  9. Huang, G.B., Learned-Miller, E.: Labeled faces in the wild: Updates and new reporting procedures. In: Dept. Comput. Sci., Univ. Massachusetts Amherst, Amherst, MA, USA, Tech. Rep (2014)  10. Huang, G.B., Mattar, M., Berg, T., Learned-Miller, E.: Labeled faces in the wild: A database for studying face recognition in unconstrained environments (2007) 11. Jia, X., De Brabandere, B., Tuytelaars, T., Gool, L.V.: Dynamic filter networks.  In: NIPS (2016)  lution. In: NIPS (2017)  12. Kang, D., Dhar, D., Chan, A.: Incorporating side information by adaptive convo-  13. Karpathy, A., Toderici, G., Shetty, S., Leung, T., Sukthankar, R., Fei-Fei, L.: Large- scale video classification with convolutional neural networks. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2014)  14. Klare, B.F., Klein, B., Taborsky, E., Blanton, A.: Pushing the frontiers of un- constrained face detection and recognition: Iarpa janus benchmark a. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2015)  15. Klein, B., Wolf, L., Afek, Y.: A dynamic convolutional layer for short range weather  prediction. In: CVPR (2015)  16. Krizhevsky, A., Sutskever, I., Hinton, G.E.: ImageNet classification with deep con- volutional neural networks. In: Advances in Neural Information Processing Systems (NIPS) (2012)  17. Liu, W., Wen, Y., Yu, Z., Li, M., Raj, B., Song, L.: Sphereface: Deep hypersphere embedding for face recognition. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)   16  C. Han, S. Shan, M. Kan, S. Wu, and X. Chen  18. Liu, W., Wen, Y., Yu, Z., Yang, M.: Large-margin softmax loss for convolutional neural networks. In: International Conference on Machine Learning (ICML) (2016) 19. Luan, T., Yin, X., Liu, X.: Disentangled representation learning GAN for pose- invariant face recognition. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2017)  20. Masi, I., Rawls, S., Medioni, G., Natarajan, P.: Pose-aware face recognition in the wild. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016)  21. Miller, D., Brossard, E., Seitz, S., Kemelmachershlizerman, I.: MegaFace: A million  faces for recognition at scale. arXiv preprint arXiv:1505.02108 (2015)  22. Parkhi, O.M., Vedaldi, A., Zisserman, A.: Deep face recognition. In: British Ma-  chine Vision Conference (BMVC) (2015)  23. Phillips, P.J., Hill, M.Q., Swindle, J.A., O’Toole, A.J.: Human and algorithm per- formance on the pasc face recognition challenge. In: Biometrics Theory, Applica- tions and Systems (BTAS) (2015)  24. Sankaranarayanan, S., Alavi, A., Chellappa, R.: Triplet similarity embedding for  face verification. arXiv preprint arXiv:1602.03418 (2016)  25. Schroﬀ, F., Kalenichenko, D., Philbin, J.: FaceNet: A unified embedding for face recognition and clustering. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2015)  26. Sun, Y., Wang, X., Tang, X.: Deeply learned face representations are sparse, se- lective, and robust. In: IEEE Conference on Computer Vision and Pattern Recog- nition (CVPR) (2015)  27. Taigman, Y., Yang, M., Ranzato, M., Wolf, L.: DeepFace: Closing the gap to human-level performance in face verification. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2014)  28. Turk, M.A., Pentland, A.P.: Face recognition using eigenfaces. In: IEEE Conference  on Computer Vision and Pattern Recognition (CVPR) (2002)  29. Wang, D., Otto, C., Jain, A.K.: Face search at scale. IEEE Transactions on Pattern  Analysis and Machine Intelligence (TPAMI) (2017)  30. Wolf, L., Hassner, T., Maoz, I.: Face recognition in unconstrained videos with matched background similarity. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2011)  31. Wu, S., Kan, M., He, Z., Shan, S., Chen, X.: Funnel-structured cascade for multi-  view face detection with alignment-awareness. Neurocomputing (2017)  32. Wu, W., Kan, M., Liu, X., Yang, Y., Shan, S., Chen, X.: Recursive spatial trans- former (ReST) for alignment-free face recognition. In: IEEE International Confer- ence on Computer Vision (ICCV) (2017)  33. Wu, Y., Liu, H., Li, J., Fu, Y.: Deep face recognition with center invariant loss. In:  ACM Multimedia ThematicWorkshops (2017)  34. Xie, S., Shan, S., Chen, X., Chen, J.: Fusing local patterns of gabor magnitude and phase for face recognition. IEEE Transactions on Image Processing (TIP) (2010) 35. Yi, D., Lei, Z., Liao, S., Li, S.Z.: Learning face representation from scratch. arXiv  preprint arXiv:1411.7923 (2014)  36. Zhang, B., Shan, S., Chen, X., Gao, W.: Histogram of gabor phase patterns (HGPP): A novel object representation approach for face recognition. IEEE Trans- actions on Image Processing (TIP) (2007)  37. Zhang, J., Kan, M., Shan, S., Chen, X.: Leveraging datasets with varying an- notations for face alignment via deep regression network. In: IEEE International Conference on Computer Vision (ICCV) (2015)   Face Recognition with Contrastive Convolution38. Zhang, R., Tang, S., Zhang, Y., Li, J., Yan, S.: Scale-adaptive convolutions for scene parsing. In: IEEE International Conference on Computer Vision (ICCV) (2017)"}