{"1": "1. Andreas, J., Rohrbach, M., Darrell, T., Klein, D.: Learning to compose neural  networks for question answering. In: HLT-NAACL (2016)  2. Andreas, J., Rohrbach, M., Darrell, T., Klein, D.: Neural module networks. CVPR  pp. 39-48 (2016)  3. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein GAN. In: ICML (2017) 4. Chang, B., Zhang, Q., Pan, S., Meng, L.: Generating handwritten chinese char-  acters using cyclegan. In: WACV (2018)  5. Choi, Y., Choi, M., Kim, M., Ha, J.W., Kim, S., Choo, J.: Stargan: Unified generative adversarial networks for multi-domain image-to-image translation. In: CVPR (2018)  6. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair,  S., Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  7. Gulrajani, I., Ahmed, F., Arjovsky, M., Dumoulin, V., Courville, A.: Improved  Training of Wasserstein GANs. In: NIPS (2017)  8. He, K., Zhang, X., Ren, S., Sun, J.: Deep Residual Learning for Image Recogni-  tion. In: CVPR (2016)  9. Huang, X., Li, Y., Poursaeed, O., Hopcroft, J., Belongie, S.: Stacked Generative  Adversarial Networks. In: CVPR (2017)  10. Iizuka, S., Simo-Serra, E., Ishikawa, H.: Globally and locally consistent image  completion. ACM Transactions on Graphics (TOG) (2017)  11. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con-  ditional adversarial networks. CVPR (2016)  12. Johnson, J., Hariharan, B., van der Maaten, L., Hoﬀman, J., fei Li, F., Zitnick, C.L., Girshick, R.B.: Inferring and executing programs for visual reasoning. In: ICCV. pp. 3008-3017 (2017)  13. Johnson, M., Schuster, M., Le, Q.V., Krikun, M., Wu, Y., Chen, Z., Thorat, N., Vi gas, F., Wattenberg, M., Corrado, G., Hughes, M., Dean, J.: Google’s multilingual neural machine translation system: Enabling zero-shot translation. In: TACL (2017)  14. Karacan, L., Akata, Z., Erdem, A., Erdem, E.: Learning to Generate Images of Outdoor Scenes from Attributes and Semantic Layouts. arXiv 1612.00215 (2016)  15. Kingma, D.P., Welling, M.: Auto-encoding variational bayes. In: ICLR (2014) 16. Ledig, C., Theis, L., Huszar, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A., Tejani, A., Totz, J., Wang, Z., Shi, W.: Photo-Realistic Single Im- age Super-Resolution Using a Generative Adversarial Network. In: CVPR (2017) 17. Li, M., Zuo, W., Zhang, D.: Deep Identity-aware Transfer of Facial Attributes.  arXiv 1610.05586 (2016)  18. Li, M., Huang, H., Ma, L., Liu, W., Zhang, T., Jiang, Y.G.: Unsupervised image- to-image translation with stacked cycle-consistent adversarial networks (2018) 19. Liu, Z., Luo, P., Wang, X., Tang, X.: Deep learning face attributes in the wild.  In: ICCV (2015)  (2014)  20. Mirza, M., Osindero, S.: Conditional generative adversarial nets. arXiv:1411.1784  21. Odena, A., Olah, C., Shlens, J.: Conditional Image Synthesis With Auxiliary  Classifier GANs. In: NIPS (2016)  22. Perarnau, G., van de Weijer, J., Raducanu, B., ´Alvarez, J.M.: Invertible Con- ditional GANs for Image Editing. In: NIPS Workshop on Adversarial Training (2016)   Modular Generative Adversarial NetworksReferences  1. Andreas, J., Rohrbach, M., Darrell, T., Klein, D.: Learning to compose neural  networks for question answering. In: HLT-NAACL (2016)  2. Andreas, J., Rohrbach, M., Darrell, T., Klein, D.: Neural module networks. CVPR  pp. 39-48 (2016)  3. Arjovsky, M., Chintala, S., Bottou, L.: Wasserstein GAN. In: ICML (2017) 4. Chang, B., Zhang, Q., Pan, S., Meng, L.: Generating handwritten chinese char-  acters using cyclegan. In: WACV (2018)  5. Choi, Y., Choi, M., Kim, M., Ha, J.W., Kim, S., Choo, J.: Stargan: Unified generative adversarial networks for multi-domain image-to-image translation. In: CVPR (2018)  6. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair,  S., Courville, A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  7. Gulrajani, I., Ahmed, F., Arjovsky, M., Dumoulin, V., Courville, A.: Improved  Training of Wasserstein GANs. In: NIPS (2017)  8. He, K., Zhang, X., Ren, S., Sun, J.: Deep Residual Learning for Image Recogni-  tion. In: CVPR (2016)  9. Huang, X., Li, Y., Poursaeed, O., Hopcroft, J., Belongie, S.: Stacked Generative  Adversarial Networks. In: CVPR (2017)  10. Iizuka, S., Simo-Serra, E., Ishikawa, H.: Globally and locally consistent image  completion. ACM Transactions on Graphics (TOG) (2017)  11. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con-  ditional adversarial networks. CVPR (2016)  12. Johnson, J., Hariharan, B., van der Maaten, L., Hoﬀman, J., fei Li, F., Zitnick, C.L., Girshick, R.B.: Inferring and executing programs for visual reasoning. In: ICCV. pp. 3008-3017 (2017)  13. Johnson, M., Schuster, M., Le, Q.V., Krikun, M., Wu, Y., Chen, Z., Thorat, N., Vi gas, F., Wattenberg, M., Corrado, G., Hughes, M., Dean, J.: Google’s multilingual neural machine translation system: Enabling zero-shot translation. In: TACL (2017)  14. Karacan, L., Akata, Z., Erdem, A., Erdem, E.: Learning to Generate Images of Outdoor Scenes from Attributes and Semantic Layouts. arXiv 1612.00215 (2016)  15. Kingma, D.P., Welling, M.: Auto-encoding variational bayes. In: ICLR (2014) 16. Ledig, C., Theis, L., Huszar, F., Caballero, J., Cunningham, A., Acosta, A., Aitken, A., Tejani, A., Totz, J., Wang, Z., Shi, W.: Photo-Realistic Single Im- age Super-Resolution Using a Generative Adversarial Network. In: CVPR (2017) 17. Li, M., Zuo, W., Zhang, D.: Deep Identity-aware Transfer of Facial Attributes.  arXiv 1610.05586 (2016)  18. Li, M., Huang, H., Ma, L., Liu, W., Zhang, T., Jiang, Y.G.: Unsupervised image- to-image translation with stacked cycle-consistent adversarial networks (2018) 19. Liu, Z., Luo, P., Wang, X., Tang, X.: Deep learning face attributes in the wild.  In: ICCV (2015)  (2014)  20. Mirza, M., Osindero, S.: Conditional generative adversarial nets. arXiv:1411.1784  21. Odena, A., Olah, C., Shlens, J.: Conditional Image Synthesis With Auxiliary  Classifier GANs. In: NIPS (2016)  22. Perarnau, G., van de Weijer, J., Raducanu, B., ´Alvarez, J.M.: Invertible Con- ditional GANs for Image Editing. In: NIPS Workshop on Adversarial Training (2016)   16  B. Zhao, B. Chang, Z. Jie and L. Sigal  23. Reed, S., Akata, Z., Mohan, S., Tenka, S., Schiele, B., Lee, H.: Learning What  and Where to Draw. In: NIPS (2016)  24. Reed, S., Akata, Z., Yan, X., Logeswaran, L., Schiele, B., Lee, H.: Generative  Adversarial Text to Image Synthesis. In: ICML (2016)  25. Sangkloy, P., Lu, J., Fang, C., Yu, F., Hays, J.: Scribbler: Controlling Deep Image  Synthesis with Sketch and Color. In: CVPR (2016)  26. Seo, P.H., Lehrmann, A., Han, B., Sigal, L.: Visual reference resolution using  attention memory for visual dialog. In: NIPS (2017)  27. Shen, W., Liu, R.: Learning Residual Images for Face Attribute Manipulation.  In: CVPR (2017)  28. Sun, Q., Tewari, A., Xu, W., Fritz, M., Theobalt, C., Schiele, B.: A hybrid model  for identity obfuscation by face replacement. arXiv:1804.04779 (2018)  29. Xiao, T., Hong, J., Ma, J.: Elegant: Exchanging latent encodings with gan for  transferring multiple face attributes. arXiv:1803.10562 (2018)  30. Xu, T., Zhang, P., Huang, Q., Zhang, H., Gan, Z., Huang, X., He, X.: Attngan: Fine-grained text to image generation with attentional generative adversarial net- works. In: CVPR (2018)  31. Yan, X., Yang, J., Sohn, K., Lee, H.: Attribute2image: Conditional image gener-  ation from visual attributes. In: ECCV (2016)  32. Zhang, H., Xu, T., Li, H., Zhang, S., Wang, X., Huang, X., Metaxas, D.: Stack- gan: Text to photo-realistic image synthesis with stacked generative adversarial networks. In: ICCV (2017)  33. Zhao, B., Wu, X., Cheng, Z.Q., Liu, H., Jie, Z., Feng, J.: Multi-view image gen-  eration from a single-view. In: MM (2018)  34. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation  using cycle-consistent adversarial networks. ICCV (2017)"}