{"1": "straight lines. 2006.  1. Paul Smith, Ian D Reid, and Andrew J Davison. Real-time monocular slam with  2. Andrew P Gee and Walterio Mayol-Cuevas. Real-time model-based slam using line segments. In International Symposium on Visual Computing, pages 354-363. Springer, 2006.  3. Georg Klein and David Murray. Improving the agility of keyframe-based slam. In  European Conference on Computer Vision, pages 802-815. Springer, 2008.  4. Christian Forster, Zichao Zhang, Michael Gassner, Manuel Werlberger, and Davide Scaramuzza. Svo: Semidirect visual odometry for monocular and multicamera systems. IEEE Transactions on Robotics, 2016.  5. Jakob Engel, Vladlen Koltun, and Daniel Cremers. Direct sparse odometry. IEEE transactions on pattern analysis and machine intelligence, 40(3):611-625, 2018. 6. Rafael Grompone von Gioi, J´er´emie Jakubowicz, Jean-Michel Morel, and Gregory Randall. Lsd: a line segment detector. Image Processing On Line, 2:35-55, 2012. 7. Lilian Zhang and Reinhard Koch. Line matching using appearance similarities and  geometric constraints. Pattern Recognition, pages 236-245, 2012.  8. Yan Lu and Dezhen Song. Robust rgb-d odometry using point and line features. In IEEE International Conference on Computer Vision, pages 3934-3942, 2015. 9. Alexander Vakhitov, Jan Funke, and Francesc Moreno-Noguer. Accurate and linear time pose estimation from points and lines. In European Conference on Computer Vision, pages 583-599. Springer, 2016.  10. Shichao Yang and Sebastian Scherer. Direct monocular odometry using points and In IEEE International Conference on Robotics and Automation (ICRA),  lines. pages 3871-3877. IEEE, 2017.  11. Ruben Gomez-Ojeda, Francisco-Angel Moreno, Davide Scaramuzza, and Javier Gonzalez-Jimenez. Pl-slam: a stereo slam system through the combination of points and line segments. arXiv preprint arXiv:1705.09479, 2017.  12. Thomas Koletschka, Luis Puig, and Kostas Daniilidis. Mevo: Multi-environment In IEEE/RSJ International Conference on Intelligent  stereo visual odometry. Robots and Systems (IROS), pages 4981-4988. IEEE, 2014.  13. Ruben Gomez-Ojeda and Javier Gonzalez-Jimenez. Robust stereo visual odometry through a probabilistic combination of points and line segments. In IEEE Interna- tional Conference on Robotics and Automation (ICRA), pages 2521-2526. IEEE, 2016.  14. Bronislav Pˇribyl, Pavel Zemˇc´ık, and Martin ˇCad´ık. Camera pose estimation from lines using pl¨ucker coordinates. In British Machine Vision Conference (BMVC), pages 1-12, 2015.  15. Guoxuan Zhang, Jin Han Lee, Jongwoo Lim, and Il Hong Suh. Building a 3-d line- based map using stereo slam. IEEE Transactions on Robotics, 31(6):1364-1377, 2015.  16. Albert Pumarola, Alexander Vakhitov, Antonio Agudo, Alberto Sanfeliu, and Francese Moreno-Noguer. Pl-slam: Real-time monocular visual slam with points and lines. In IEEE International Conference on Robotics and Automation (ICRA), pages 4503-4508. IEEE, 2017.  17. Ruben Gomez-Ojeda, Jesus Briales, and Javier Gonzalez-Jimenez. Pl-svo: Semi- direct monocular visual odometry by combining points and line segments. In IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), pages 4211-4216. IEEE, 2016.   Good Line CuttingReferences  straight lines. 2006.  1. Paul Smith, Ian D Reid, and Andrew J Davison. Real-time monocular slam with  2. Andrew P Gee and Walterio Mayol-Cuevas. Real-time model-based slam using line segments. In International Symposium on Visual Computing, pages 354-363. Springer, 2006.  3. Georg Klein and David Murray. Improving the agility of keyframe-based slam. In  European Conference on Computer Vision, pages 802-815. Springer, 2008.  4. Christian Forster, Zichao Zhang, Michael Gassner, Manuel Werlberger, and Davide Scaramuzza. Svo: Semidirect visual odometry for monocular and multicamera systems. IEEE Transactions on Robotics, 2016.  5. Jakob Engel, Vladlen Koltun, and Daniel Cremers. Direct sparse odometry. IEEE transactions on pattern analysis and machine intelligence, 40(3):611-625, 2018. 6. Rafael Grompone von Gioi, J´er´emie Jakubowicz, Jean-Michel Morel, and Gregory Randall. Lsd: a line segment detector. Image Processing On Line, 2:35-55, 2012. 7. Lilian Zhang and Reinhard Koch. Line matching using appearance similarities and  geometric constraints. Pattern Recognition, pages 236-245, 2012.  8. Yan Lu and Dezhen Song. Robust rgb-d odometry using point and line features. In IEEE International Conference on Computer Vision, pages 3934-3942, 2015. 9. Alexander Vakhitov, Jan Funke, and Francesc Moreno-Noguer. Accurate and linear time pose estimation from points and lines. In European Conference on Computer Vision, pages 583-599. Springer, 2016.  10. Shichao Yang and Sebastian Scherer. Direct monocular odometry using points and In IEEE International Conference on Robotics and Automation (ICRA),  lines. pages 3871-3877. IEEE, 2017.  11. Ruben Gomez-Ojeda, Francisco-Angel Moreno, Davide Scaramuzza, and Javier Gonzalez-Jimenez. Pl-slam: a stereo slam system through the combination of points and line segments. arXiv preprint arXiv:1705.09479, 2017.  12. Thomas Koletschka, Luis Puig, and Kostas Daniilidis. Mevo: Multi-environment In IEEE/RSJ International Conference on Intelligent  stereo visual odometry. Robots and Systems (IROS), pages 4981-4988. IEEE, 2014.  13. Ruben Gomez-Ojeda and Javier Gonzalez-Jimenez. Robust stereo visual odometry through a probabilistic combination of points and line segments. In IEEE Interna- tional Conference on Robotics and Automation (ICRA), pages 2521-2526. IEEE, 2016.  14. Bronislav Pˇribyl, Pavel Zemˇc´ık, and Martin ˇCad´ık. Camera pose estimation from lines using pl¨ucker coordinates. In British Machine Vision Conference (BMVC), pages 1-12, 2015.  15. Guoxuan Zhang, Jin Han Lee, Jongwoo Lim, and Il Hong Suh. Building a 3-d line- based map using stereo slam. IEEE Transactions on Robotics, 31(6):1364-1377, 2015.  16. Albert Pumarola, Alexander Vakhitov, Antonio Agudo, Alberto Sanfeliu, and Francese Moreno-Noguer. Pl-slam: Real-time monocular visual slam with points and lines. In IEEE International Conference on Robotics and Automation (ICRA), pages 4503-4508. IEEE, 2017.  17. Ruben Gomez-Ojeda, Jesus Briales, and Javier Gonzalez-Jimenez. Pl-svo: Semi- direct monocular visual odometry by combining points and line segments. In IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), pages 4211-4216. IEEE, 2016.   16  Y. Zhao and P. Vela  18. A.J. Davison. Active search for real-time vision. In IEEE International Conference  on Computer Vision, volume 1, pages 66-73, 2005.  19. Michael Kaess and Frank Dellaert. Covariance recovery from a square root informa- tion matrix for data association. Robotics and Autonomous Systems, 57(12):1198- 1210, 2009.  20. Sen Zhang, Lihua Xie, and Martin David Adams. Entropy based feature selection scheme for real time simultaneous localization and map building. In IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), pages 1175- 1180. IEEE, 2005.  21. Fernando Auat Cheein, Gustavo Scaglia, Fernando di Sciasio, and Ricardo Carelli. Feature selection criteria for real time ekf-slam algorithm. International Journal of Advanced Robotic Systems, 6(3):21, 2009.  22. Ronen Lerner, Ehud Rivlin, and Ilan Shimshoni. Landmark selection for task-  oriented navigation. IEEE transactions on robotics, 23(3):494-505, 2007.  23. Guangcong Zhang and Patricio A Vela. Optimally observable and minimal car- dinality monocular slam. In IEEE International Conference on Robotics and Au- tomation (ICRA), pages 5211-5218. IEEE, 2015.  24. Guangcong Zhang and Patricio A Vela. Good features to track for visual slam. In IEEE Conference on Computer Vision and Pattern Recognition, pages 1373-1382, 2015.  25. Luca Carlone and Sertac Karaman. Attention and anticipation in fast visual- inertial navigation. In IEEE International Conference on Robotics and Automation (ICRA), pages 3886-3893. IEEE, 2017.  26. Joan Sola, Teresa Vidal-Calleja, Javier Civera, and Jos´e Mar´ıa Mart´ınez Montiel. Impact of landmark parametrization on monocular EKF-SLAM with points and lines. International Journal of Computer Vision, 97(3):339-368, 2012.  27. Richard A Waltz, Jos´e Luis Morales, Jorge Nocedal, and Dominique Orban. An interior algorithm for nonlinear optimization that combines line search and trust region steps. Mathematical programming, 107(3):391-408, 2006.  28. Michael JD Powell. A fast algorithm for nonlinearly constrained optimization  calculations. In Numerical analysis, pages 144-157. Springer, 1978.  29. Ethan Rublee, Vincent Rabaud, Kurt Konolige, and Gary Bradski. ORB: an eﬃ- cient alternative to SIFT or SURF. In IEEE International Conference on Computer Vision, pages 2564-2571. IEEE, 2011.  30. Raul Mur-Artal, Jose Maria Martinez Montiel, and Juan D Tardos. Orb-slam: a versatile and accurate monocular slam system. IEEE Transactions on Robotics, 31(5):1147-1163, 2015.  31. J. Sturm, W. Burgard, and D. Cremers. Evaluating egomotion and structure- from-motion approaches using the TUM RGB-D benchmark. In IEEE/RJS In- ternational Conference on Intelligent Robot Systems (IROS), Workshop on Color- Depth Camera Fusion in Robotics, Oct. 2012.  32. Michael Burri, Janosch Nikolic, Pascal Gohl, Thomas Schneider, Joern Rehder, Sammy Omari, Markus W Achtelik, and Roland Siegwart. The euroc micro aerial vehicle datasets. The International Journal of Robotics Research, 2016."}