{"1": "1. Amir, A., Lindenbaum, M.: Grouping-based nonadditive verification. PAMI (1998) 2. Arbelaez, P., Maire, M., Fowlkes, C., Malik, J.: Contour detection and hierarchical image  3. Bertasius, G., Shi, J., Torresani, L.: Semantic segmentation with boundary neural fields. In:  segmentation. TPAMI (2011)  CVPR (2016)  4. Bertasius, G., Torresani, L., Yu, S.X., Shi, J.: Convolutional random walk networks for se-  mantic image segmentation. In: CVPR (2017)  5. Chen, L.C., Barron, J.T., Papandreou, G., Murphy, K., Yuille, A.L.: Semantic image seg- mentation with task-specific edge detection using cnns and a discriminatively trained domain transform. In: CVPR (2016)  6. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Semantic im- age segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  7. Chen, L.C., Papandreou, G., Schroff, F., Adam, H.: Rethinking atrous convolution for se-  mantic image segmentation. arXiv preprint arXiv:1706.05587 (2017)  8. Chen, L.C., Schwing, A., Yuille, A., Urtasun, R.: Learning deep structured models. In: ICML  (2015)  9. Chopra, S., Hadsell, R., LeCun, Y.: Learning a similarity metric discriminatively, with appli-  cation to face verification. In: CVPR (2005)  10. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR (2016)  11. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual  object classes (voc) challenge. IJCV (2010)  12. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville,  A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  13. Hariharan, B., Arbel´aez, P., Bourdev, L., Maji, S., Malik, J.: Semantic contours from inverse  14. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: CVPR  15. Kr¨ahenb¨uhl, P., Koltun, V.: Efficient inference in fully connected crfs with gaussian edge  detectors. In: ICCV (2011)  (2016)  potentials. In: NIPS (2011)  16. Li, X., Liu, Z., Luo, P., Loy, C.C., Tang, X.: Not all pixels are equal: Difficulty-aware seman-  tic segmentation via deep layer cascade. In: CVPR (2017)  17. Lin, G., Shen, C., van den Hengel, A., Reid, I.: Efficient piecewise training of deep structured  models for semantic segmentation. In: CVPR (2016)  18. Liu, S., De Mello, S., Gu, J., Zhong, G., Yang, M.H., Kautz, J.: Learning affinity via spatial  propagation networks. In: NIPS (2017)  19. Liu, Z., Li, X., Luo, P., Loy, C.C., Tang, X.: Semantic image segmentation via deep parsing  network. In: CVPR (2015)  segmentation. TPAMI (2017)  In: CVPR (2015)  works. NIPS Workshop (2016)  20. Liu, Z., Li, X., Luo, P., Loy, C.C., Tang, X.: Deep learning markov random field for semantic  21. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation.  22. Luc, P., Couprie, C., Chintala, S., Verbeek, J.: Semantic segmentation using adversarial net-  23. Maire, M., Narihira, T., Yu, S.X.: Affinity cnn: Learning pixel-centric pairwise relations for  figure/ground embedding. In: CVPR (2016)   Adaptive Affinity FieldsReferences  1. Amir, A., Lindenbaum, M.: Grouping-based nonadditive verification. PAMI (1998) 2. Arbelaez, P., Maire, M., Fowlkes, C., Malik, J.: Contour detection and hierarchical image  3. Bertasius, G., Shi, J., Torresani, L.: Semantic segmentation with boundary neural fields. In:  segmentation. TPAMI (2011)  CVPR (2016)  4. Bertasius, G., Torresani, L., Yu, S.X., Shi, J.: Convolutional random walk networks for se-  mantic image segmentation. In: CVPR (2017)  5. Chen, L.C., Barron, J.T., Papandreou, G., Murphy, K., Yuille, A.L.: Semantic image seg- mentation with task-specific edge detection using cnns and a discriminatively trained domain transform. In: CVPR (2016)  6. Chen, L.C., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.L.: Deeplab: Semantic im- age segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. arXiv preprint arXiv:1606.00915 (2016)  7. Chen, L.C., Papandreou, G., Schroff, F., Adam, H.: Rethinking atrous convolution for se-  mantic image segmentation. arXiv preprint arXiv:1706.05587 (2017)  8. Chen, L.C., Schwing, A., Yuille, A., Urtasun, R.: Learning deep structured models. In: ICML  (2015)  9. Chopra, S., Hadsell, R., LeCun, Y.: Learning a similarity metric discriminatively, with appli-  cation to face verification. In: CVPR (2005)  10. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR (2016)  11. Everingham, M., Van Gool, L., Williams, C.K., Winn, J., Zisserman, A.: The pascal visual  object classes (voc) challenge. IJCV (2010)  12. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., Courville,  A., Bengio, Y.: Generative adversarial nets. In: NIPS (2014)  13. Hariharan, B., Arbel´aez, P., Bourdev, L., Maji, S., Malik, J.: Semantic contours from inverse  14. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: CVPR  15. Kr¨ahenb¨uhl, P., Koltun, V.: Efficient inference in fully connected crfs with gaussian edge  detectors. In: ICCV (2011)  (2016)  potentials. In: NIPS (2011)  16. Li, X., Liu, Z., Luo, P., Loy, C.C., Tang, X.: Not all pixels are equal: Difficulty-aware seman-  tic segmentation via deep layer cascade. In: CVPR (2017)  17. Lin, G., Shen, C., van den Hengel, A., Reid, I.: Efficient piecewise training of deep structured  models for semantic segmentation. In: CVPR (2016)  18. Liu, S., De Mello, S., Gu, J., Zhong, G., Yang, M.H., Kautz, J.: Learning affinity via spatial  propagation networks. In: NIPS (2017)  19. Liu, Z., Li, X., Luo, P., Loy, C.C., Tang, X.: Semantic image segmentation via deep parsing  network. In: CVPR (2015)  segmentation. TPAMI (2017)  In: CVPR (2015)  works. NIPS Workshop (2016)  20. Liu, Z., Li, X., Luo, P., Loy, C.C., Tang, X.: Deep learning markov random field for semantic  21. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation.  22. Luc, P., Couprie, C., Chintala, S., Verbeek, J.: Semantic segmentation using adversarial net-  23. Maire, M., Narihira, T., Yu, S.X.: Affinity cnn: Learning pixel-centric pairwise relations for  figure/ground embedding. In: CVPR (2016)   16  T.-W. Ke, J.-J. Hwang, Z. Liu, and S. X. Yu  24. Mostajabi, M., Maire, M., Shakhnarovich, G.: Regularizing deep networks by modeling and predicting label structure. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. pp. 5629-5638 (2018)  25. Noh, H., Hong, S., Han, B.: Learning deconvolution network for semantic segmentation. In:  CVPR (2015)  26. Poggio, T.: Early vision: From computational structure to algorithms and parallel hardware.  Computer Vision, Graphics, and Image Processing 31(2), 139-155 (1985)  27. Radford, A., Metz, L., Chintala, S.: Unsupervised representation learning with deep convo-  lutional generative adversarial networks. arXiv preprint arXiv:1511.06434 (2015)  28. Richter, S.R., Vineet, V., Roth, S., Koltun, V.: Playing for data: Ground truth from computer  games. In: European Conference on Computer Vision (ECCV) (2016)  29. Ronneberger, O., Fischer, P., Brox, T.: U-net: Convolutional networks for biomedical image  segmentation. In: MICCAI (2015)  30. Russakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., Huang, Z., Karpathy, A., Khosla, A., Bernstein, M., Berg, A.C., Fei-Fei, L.: Imagenet large scale visual recognition challenge. In: IJCV (2015)  31. Shi, J., Malik, J.: Normalized cuts and image segmentation. TPAMI (2000) 32. Simonyan, K., Zisserman, A.: Very deep convolutional networks for large-scale image recog-  nition. arXiv preprint arXiv:1409.1556 (2014)  33. Wu, Z., Shen, C., Hengel, A.v.d.: High-performance semantic segmentation using very deep  fully convolutional networks. arXiv preprint arXiv:1604.04339 (2016)  34. Yu, F., Koltun, V.: Multi-scale context aggregation by dilated convolutions. In: ICLR (2016) 35. Yu, S.X., Shi, J.: Multiclass spectral clustering. In: ICCV (2003) 36. Zhao, H., Shi, J., Qi, X., Wang, X., Jia, J.: Pyramid scene parsing network. In: CVPR (2017) 37. Zheng, S., Jayasumana, S., Romera-Paredes, B., Vineet, V., Su, Z., Du, D., Huang, C., Torr,  P.H.: Conditional random fields as recurrent neural networks. In: ICCV (2015)"}