{"1": "1. Ahmed, Jones, Marks: An improved deep learning architecture for person re-  identification. In: CVPR (2015)  2. Ando, R.K., Zhang, T.: A framework for learning predictive structures from mul-  tiple tasks and unlabeled data. JMLR 6, 1817-1853 (2005)  3. Baltieri, D., Vezzani, R., Cucchiara, R.: 3dpes: 3d people dataset for surveillance  and forensics. In: J-HGBU (2011)  4. Bautista, M.A., Sanakoyeu, A., Ommer, B.: Deep unsupervised similarity learning  using partially ordered sets. In: CVPR (2017)  5. Bautista, M.A., Sanakoyeu, A., Tikhoncheva, E., Ommer, B.: Cliquecnn: Deep  unsupervised exemplar learning. In: NIPS (2016)  6. Chen, D., Xu, D., Li, H., Sebe, N., Wang, X.: Group consistent similarity learning  via deep crf for person re-identification. In: CVPR (2018)  7. Chen, W., Chen, X., Zhang, J., Huang, K.: Beyond triplet loss: a deep quadruplet  network for person re-identification. In: CVPR (2017)  8. Chen, Y., Zhu, X., Gong, S.: Person re-identification by deep learning multi-scale  representations. In: ICCV Workshop (2017)  9. Chen, Y.C., Zhu, X., Zheng, W.S., Lai, J.H.: Person re-identification by camera correlation aware feature augmentation. IEEE TPAMI 40(2), 392-408 (2018) 10. Cheng, D., Gong, Y., Zhou, S., Wang, J., Zheng, N.: Person re-identification by multi-channel parts-based cnn with improved triplet loss function. In: CVPR (2016)  11. Cho, Y.J., Yoon, K.J.: Improving person re-identification via pose-aware multi-shot  matching. In: CVPR (2016)  12. Evgeniou, T., Pontil, M.: Regularized multi-task learning. In: SIGKDD (2004) 13. Fan, H., Zheng, L., Yang, Y.: Unsupervised person re-identification: Clustering and  fine-tuning. arXiv preprint arXiv:1705.10444 (2017)  14. Farenzena, M., Bazzani, L., Perina, A., Murino, V., Cristani, M.: Person re- identification by symmetry-driven accumulation of local features. In: CVPR (2010) 15. Gong, S., Cristani, M., Yan, S., Loy, C.C.: Person re-identification. Springer (2014) 16. Gray, D., Tao, H.: Viewpoint invariant pedestrian recognition with an ensemble of  localized features. In: ECCV (2008)  17. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  18. Hermans, A., Beyer, L., Leibe, B.: In defense of the triplet loss for person re-  identification. arXiv preprint arXiv:1703.07737 (2017)  19. Hirzer, M., Beleznai, C., Roth, P.M., Bischof, H.: Person re-identification by de-  scriptive and discriminative classification. In: SCIA (2011)  20. Jiao, J., Zheng, W.S., Wu, A., Zhu, X., Gong, S.: Deep low-resolution person re-  identification. In: AAAI (2018)  21. Kawanishi, Y., Wu, Y., Mukunoki, M., Minoh, M.: Shinpuhkan2014: A multi- camera pedestrian dataset for tracking people across multiple cameras. In: FCV (2014)  22. Khan, F.M., Bremond, F.: Unsupervised data association for metric learning in  the context of multi-shot person re-identification. In: AVSS (2016)  23. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  24. Kodirov, E., Xiang, T., Fu, Z., Gong, S.: Person re-identification by unsupervised  arXiv:1412.6980 (2014)  l1 graph learning. In: ECCV (2016)   Unsupervised Person Re-ID by Deep Learning Tracklet AssociationReferences  1. Ahmed, Jones, Marks: An improved deep learning architecture for person re-  identification. In: CVPR (2015)  2. Ando, R.K., Zhang, T.: A framework for learning predictive structures from mul-  tiple tasks and unlabeled data. JMLR 6, 1817-1853 (2005)  3. Baltieri, D., Vezzani, R., Cucchiara, R.: 3dpes: 3d people dataset for surveillance  and forensics. In: J-HGBU (2011)  4. Bautista, M.A., Sanakoyeu, A., Ommer, B.: Deep unsupervised similarity learning  using partially ordered sets. In: CVPR (2017)  5. Bautista, M.A., Sanakoyeu, A., Tikhoncheva, E., Ommer, B.: Cliquecnn: Deep  unsupervised exemplar learning. In: NIPS (2016)  6. Chen, D., Xu, D., Li, H., Sebe, N., Wang, X.: Group consistent similarity learning  via deep crf for person re-identification. In: CVPR (2018)  7. Chen, W., Chen, X., Zhang, J., Huang, K.: Beyond triplet loss: a deep quadruplet  network for person re-identification. In: CVPR (2017)  8. Chen, Y., Zhu, X., Gong, S.: Person re-identification by deep learning multi-scale  representations. In: ICCV Workshop (2017)  9. Chen, Y.C., Zhu, X., Zheng, W.S., Lai, J.H.: Person re-identification by camera correlation aware feature augmentation. IEEE TPAMI 40(2), 392-408 (2018) 10. Cheng, D., Gong, Y., Zhou, S., Wang, J., Zheng, N.: Person re-identification by multi-channel parts-based cnn with improved triplet loss function. In: CVPR (2016)  11. Cho, Y.J., Yoon, K.J.: Improving person re-identification via pose-aware multi-shot  matching. In: CVPR (2016)  12. Evgeniou, T., Pontil, M.: Regularized multi-task learning. In: SIGKDD (2004) 13. Fan, H., Zheng, L., Yang, Y.: Unsupervised person re-identification: Clustering and  fine-tuning. arXiv preprint arXiv:1705.10444 (2017)  14. Farenzena, M., Bazzani, L., Perina, A., Murino, V., Cristani, M.: Person re- identification by symmetry-driven accumulation of local features. In: CVPR (2010) 15. Gong, S., Cristani, M., Yan, S., Loy, C.C.: Person re-identification. Springer (2014) 16. Gray, D., Tao, H.: Viewpoint invariant pedestrian recognition with an ensemble of  localized features. In: ECCV (2008)  17. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  In: CVPR (2016)  18. Hermans, A., Beyer, L., Leibe, B.: In defense of the triplet loss for person re-  identification. arXiv preprint arXiv:1703.07737 (2017)  19. Hirzer, M., Beleznai, C., Roth, P.M., Bischof, H.: Person re-identification by de-  scriptive and discriminative classification. In: SCIA (2011)  20. Jiao, J., Zheng, W.S., Wu, A., Zhu, X., Gong, S.: Deep low-resolution person re-  identification. In: AAAI (2018)  21. Kawanishi, Y., Wu, Y., Mukunoki, M., Minoh, M.: Shinpuhkan2014: A multi- camera pedestrian dataset for tracking people across multiple cameras. In: FCV (2014)  22. Khan, F.M., Bremond, F.: Unsupervised data association for metric learning in  the context of multi-shot person re-identification. In: AVSS (2016)  23. Kingma, D.P., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  24. Kodirov, E., Xiang, T., Fu, Z., Gong, S.: Person re-identification by unsupervised  arXiv:1412.6980 (2014)  l1 graph learning. In: ECCV (2016)   16  M. Li, X. Zhu, and S. Gong  25. Kodirov, E., Xiang, T., Gong, S.: Dictionary learning with iterative laplacian reg-  ularisation for unsupervised person re-identification. In: BMVC (2015)  26. Leal-Taix´e, L., Milan, A., Reid, I., Roth, S., Schindler, K.: Motchallenge 2015: Towards a benchmark for multi-target tracking. arXiv preprint arXiv:1504.01942 (2015)  27. Lee, H., Ekanadham, C., Ng, A.Y.: Sparse deep belief net model for visual area  28. Li, W., Zhao, R., Wang, X.: Human reidentification with transferred metric learn-  v2. In: NIPS (2008)  ing. In: ACCV (2012)  29. Li, W., Zhao, R., Xiao, T., Wang, X.: Deepreid: Deep filter pairing neural network  for person re-identification. In: CVPR (2014)  30. Li, W., Zhu, X., Gong, S.: Person re-identification by deep joint learning of multi-  31. Li, W., Zhu, X., Gong, S.: Harmonious attention network for person re-  loss classification. In: IJCAI (2017)  identification. In: CVPR (2018)  32. Lisanti, G., Masi, I., Bagdanov, A.D., Del Bimbo, A.: Person re-identification by iterative re-weighted sparse ranking. IEEE TPAMI 37(8), 1629-1642 (2015) 33. Liu, X., Song, M., Tao, D., Zhou, X., Chen, C., Bu, J.: Semi-supervised coupled  dictionary learning for person re-identification. In: CVPR (2014)  34. Liu, Y., Yan, J., Ouyang, W.: Quality aware network for set to set recognition. In:  35. Liu, Z., Wang, D., Lu, H.: Stepwise metric promotion for unsupervised video person  CVPR (2017)  re-identification. In: ICCV (2017)  36. Loy, C., Xiang, T., Gong, S.: Time-delayed correlation analysis for multi-camera  activity understanding. IJCV 90(1), 106-129 (2010)  37. Ma, X., Zhu, X., Gong, S., Xie, X., Hu, J., Lam, K.M., Zhong, Y.: Person re- identification by unsupervised video matching. Pattern Recognition 65, 197-210 (2017)  38. Peng, P., Xiang, T., Wang, Y., Pontil, M., Gong, S., Huang, T., Tian, Y.: Un- supervised cross-dataset transfer learning for person re-identification. In: CVPR (2016)  39. Prosser, B.J., Zheng, W.S., Gong, S., Xiang, T.: Person re-identification by support  vector ranking. In: BMVC (2010)  40. Qin, C., Song, S., Huang, G., Zhu, L.: Unsupervised neighborhood component  analysis for clustering. Neurocomputing 168, 609-617 (2015)  41. Ristani, E., Solera, F., Zou, R., Cucchiara, R., Tomasi, C.: Performance measures and a data set for multi-target, multi-camera tracking. In: ECCV Workshop (2016) 42. Ristani, E., Solera, F., Zou, R., Cucchiara, R., Tomasi, C.: Performance measures and a data set for multi-target, multi-camera tracking. In: ECCV Workshop (2016) 43. Su, C., Zhang, S., Xing, J., Gao, W., Tian, Q.: Deep attributes driven multi-camera  person re-identification. In: ECCV (2016)  44. Subramaniam, Chatterjee, Mittal: Deep neural networks with inexact matching for  person re-identification. In: NIPS (2016)  45. Ustinova, E., Lempitsky, V.: Learning deep embeddings with histogram loss. In:  NIPS (2016)  46. Wang, F., Zuo, W., Lin, L., Zhang, D., Zhang, L.: Joint learning of single-image and cross-image representations for person re-identification. In: CVPR (2016) 47. Wang, H., Gong, S., Xiang, T.: Unsupervised learning of generative topic saliency  for person re-identification. In: BMVC (2014)  48. Wang, H., Zhu, X., Gong, S., Xiang, T.: Person re-identification in identity regres-  sion space. IJCV (2018)   Unsupervised Person Re-ID by Deep Learning Tracklet Association49. Wang, H., Zhu, X., Xiang, T., Gong, S.: Towards unsupervised open-set person  re-identification. In: ICIP (2016)  50. Wang, J., Zhu, X., Gong, S., Li, W.: Transferable joint attribute-identity deep  learning for unsupervised person re-identification. In: CVPR (2018)  51. Wang, T., Gong, S., Zhu, X., Wang, S.: Person re-identification by video ranking.  In: ECCV (2014)  52. Wang, T., Gong, S., Zhu, X., Wang, S.: Person re-identification by discriminative  selection in video ranking. IEEE TPAMI 38(12), 2501-2514 (2016)  53. Xiao, T., Li, H., Ouyang, W., Wang, X.: Learning deep feature representations  with domain guided dropout for person re-identification. In: CVPR (2016)  54. Ye, J., Zhao, Z., Liu, H.: Adaptive distance metric learning for clustering. In: CVPR  (2007)  (2018)  55. Ye, M., Ma, A.J., Zheng, L., Li, J., Yuen, P.C.: Dynamic label graph matching for  unsupervised video re-identification. In: ICCV (2017)  56. Yu, H.X., Wu, A., Zheng, W.S.: Cross-view asymmetric metric learning for unsu-  pervised person re-identification. In: ICCV (2017)  57. Zhang, S., Benenson, R., Omran, M., Hosang, J., Schiele, B.: How far are we from  solving pedestrian detection? In: CVPR (2016)  58. Zhang, Y., Xiang, T., Hospedales, T.M., Lu, H.: Deep mutual learning. In: CVPR  59. Zhao, R., Oyang, W., Wang, X.: Person re-identification by saliency learning. IEEE  TPAMI 39(2), 356-370 (2017)  60. Zheng, L., Bie, Z., Sun, Y., Wang, J., Su, C., Wang, S., Tian, Q.: Mars: A video  benchmark for large-scale person re-identification. In: ECCV (2016)  61. Zheng, L., Shen, L., Tian, L., Wang, S., Wang, J., Tian, Q.: Scalable person re-  identification: A benchmark. In: CVPR (2015)  62. Zheng, Z., Zheng, L., Yang, Y.: Unlabeled samples generated by gan improve the  person re-identification baseline in vitro. In: ICCV (2017)  63. Zhu, X., Wu, B., Huang, D., Zheng, W.S.: Fast openworld person re-identification.  IEEE TIP pp. 2286-2300 (2017)"}