{"1": "1. Chen, L., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.: Deeplab: Semantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. TPAMI (2017)  2. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR (2016)  3. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. In: ICCV (2017)  4. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: CVPR (2009)  5. Dumoulin, V., Shlens, J., Kudlur, M.: A learned representation for artistic style.  In: ICLR (2017)  6. Ghifary, M., Bastiaan Kleijn, W., Zhang, M., Balduzzi, D.: Domain generalization  for object recognition with multi-task autoencoders. In: ICCV (2015)  7. Gross,  S., Wilber, M.: Training  and  investigating  residual  nets.  https://github.com/ facebook/fb.resnet.torch (2016)  8. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  9. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks.  In: CVPR (2016)  In: ECCV (2016)  10. Hoﬀman, J., Tzeng, E., Park, T., Zhu, J.Y., Isola, P., Saenko, K., Efros, A.A., Dar- rell, T.: Cycada: Cycle-consistent adversarial domain adaptation. arXiv preprint arXiv:1711.03213 (2017)  11. Hoﬀman, J., Wang, D., Yu, F., Darrell, T.: Fcns in the wild: Pixel-level adversarial  and constraint-based adaptation. arXiv preprint arXiv:1612.02649 (2016)  12. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks. arXiv preprint  arXiv:1709.01507 (2017)  13. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected  convolutional networks. In: CVPR (2017)  14. Huang, X., Belongie, S.: Arbitrary style transfer in real-time with adaptive instance  normalization. In: ICCV (2017)  15. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. In: ICML (2015)  16. Khosla, A., Zhou, T., Malisiewicz, T., Efros, A.A., Torralba, A.: Undoing the  damage of dataset bias. In: ECCV (2012)  17. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS (2012)  18. Long, M., Cao, Y., Wang, J., Jordan, M.: Learning transferable features with deep  19. Muandet, K., Balduzzi, D., Sch¨olkopf, B.: Domain generalization via invariant  adaptation networks. In: ICML (2015)  feature representation. In: ICML (2013)  20. Pan, X., Shi, J., Luo, P., Wang, X., Tang, X.: Spatial as deep: Spatial cnn for  traﬃc scene understanding. In: AAAI (2018)  21. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de-  tection with region proposal networks. In: NIPS (2015)  22. Richter, S.R., Vineet, V., Roth, S., Koltun, V.: Playing for data: Ground truth  from computer games. In: ECCV (2016)   IBN-NetReferences  1. Chen, L., Papandreou, G., Kokkinos, I., Murphy, K., Yuille, A.: Deeplab: Semantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. TPAMI (2017)  2. Cordts, M., Omran, M., Ramos, S., Rehfeld, T., Enzweiler, M., Benenson, R., Franke, U., Roth, S., Schiele, B.: The cityscapes dataset for semantic urban scene understanding. In: CVPR (2016)  3. Dai, J., Qi, H., Xiong, Y., Li, Y., Zhang, G., Hu, H., Wei, Y.: Deformable convo-  lutional networks. In: ICCV (2017)  4. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale  hierarchical image database. In: CVPR (2009)  5. Dumoulin, V., Shlens, J., Kudlur, M.: A learned representation for artistic style.  In: ICLR (2017)  6. Ghifary, M., Bastiaan Kleijn, W., Zhang, M., Balduzzi, D.: Domain generalization  for object recognition with multi-task autoencoders. In: ICCV (2015)  7. Gross,  S., Wilber, M.: Training  and  investigating  residual  nets.  https://github.com/ facebook/fb.resnet.torch (2016)  8. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition.  9. He, K., Zhang, X., Ren, S., Sun, J.: Identity mappings in deep residual networks.  In: CVPR (2016)  In: ECCV (2016)  10. Hoﬀman, J., Tzeng, E., Park, T., Zhu, J.Y., Isola, P., Saenko, K., Efros, A.A., Dar- rell, T.: Cycada: Cycle-consistent adversarial domain adaptation. arXiv preprint arXiv:1711.03213 (2017)  11. Hoﬀman, J., Wang, D., Yu, F., Darrell, T.: Fcns in the wild: Pixel-level adversarial  and constraint-based adaptation. arXiv preprint arXiv:1612.02649 (2016)  12. Hu, J., Shen, L., Sun, G.: Squeeze-and-excitation networks. arXiv preprint  arXiv:1709.01507 (2017)  13. Huang, G., Liu, Z., Weinberger, K.Q., van der Maaten, L.: Densely connected  convolutional networks. In: CVPR (2017)  14. Huang, X., Belongie, S.: Arbitrary style transfer in real-time with adaptive instance  normalization. In: ICCV (2017)  15. Ioﬀe, S., Szegedy, C.: Batch normalization: Accelerating deep network training by  reducing internal covariate shift. In: ICML (2015)  16. Khosla, A., Zhou, T., Malisiewicz, T., Efros, A.A., Torralba, A.: Undoing the  damage of dataset bias. In: ECCV (2012)  17. Krizhevsky, A., Sutskever, I., Hinton, G.E.: Imagenet classification with deep con-  volutional neural networks. In: NIPS (2012)  18. Long, M., Cao, Y., Wang, J., Jordan, M.: Learning transferable features with deep  19. Muandet, K., Balduzzi, D., Sch¨olkopf, B.: Domain generalization via invariant  adaptation networks. In: ICML (2015)  feature representation. In: ICML (2013)  20. Pan, X., Shi, J., Luo, P., Wang, X., Tang, X.: Spatial as deep: Spatial cnn for  traﬃc scene understanding. In: AAAI (2018)  21. Ren, S., He, K., Girshick, R., Sun, J.: Faster r-cnn: Towards real-time object de-  tection with region proposal networks. In: NIPS (2015)  22. Richter, S.R., Vineet, V., Roth, S., Koltun, V.: Playing for data: Ground truth  from computer games. In: ECCV (2016)   16  X. Pan, P. Luo, J. Shi, and X. Tang  23. Sankaranarayanan, S., Balaji, Y., Jain, A., Lim, S.N., Chellappa, R.: Unsuper- vised domain adaptation for semantic segmentation with gans. arXiv preprint arXiv:1711.06969 (2017)  24. Srivastava, N., Hinton, G., Krizhevsky, A., Sutskever, I., Salakhutdinov, R.: Dropout: A simple way to prevent neural networks from overfitting. The Jour- nal of Machine Learning Research (2014)  25. Sun, B., Saenko, K.: Deep coral: Correlation alignment for deep domain adaptation.  In: ECCV (2016)  26. Szegedy, C., Liu, W., Jia, Y., Sermanet, P., Reed, S., Anguelov, D., Erhan, D., Vanhoucke, V., Rabinovich, A., et al.: Going deeper with convolutions. In: CVPR (2015)  27. Tzeng, E., Hoﬀman, J., Saenko, K., Darrell, T.: Adversarial discriminative domain  adaptation. In: CVPR (2017)  28. Tzeng, E., Hoﬀman, J., Zhang, N., Saenko, K., Darrell, T.: Deep domain confusion:  Maximizing for domain invariance. arXiv preprint arXiv:1412.3474 (2014)  29. Ulyanov, D., Vedaldi, A., Lempitsky, V.: Improved texture networks: Maximizing quality and diversity in feed-forward stylization and texture synthesis. In: CVPR (2017)  30. Xie, S., Girshick, R., Doll´ar, P., Tu, Z., He, K.: Aggregated residual transformations  for deep neural networks. In: CVPR (2017)  31. Zhang, Y., David, P., Gong, B.: Curriculum domain adaptation for semantic seg-  mentation of urban scenes. In: ICCV (2017)  32. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation  using cycle-consistent adversarial networks. In: ICCV (2017)"}