{"1": "1. Absil, P.A., Baker, C.G., Gallivan, K.A.: Trust-region methods on riemannian man-  ifolds. Foundations of Computational Mathematics 7(3), 303-330 (2007)  2. Absil, P.A., Mahony, R., Sepulchre, R.: Optimization algorithms on matrix mani-  folds. Princeton University Press (2009)  3. Anguelov, D., Srinivasan, P., Koller, D., Thrun, S., Rodgers, J., Davis, J.: Scape: shape completion and animation of people. In: ACM transactions on graphics (TOG). vol. 24, pp. 408-416. ACM (2005)  4. Arya, S., Mount, D.M., Netanyahu, N.S., Silverman, R., Wu, A.Y.: An optimal algorithm for approximate nearest neighbor searching fixed dimensions. Journal of the ACM (JACM) 45(6), 891-923 (1998)  5. Berner, A., Bokeloh, M., Wand, M., Schilling, A., Seidel, H.P.: Generalized intrinsic  symmetry detection (2009)  6. Berner, A., Wand, M., Mitra, N.J., Mewes, D., Seidel, H.P.: Shape analysis with subspace symmetries. In: Computer Graphics Forum. vol. 30, pp. 277-286. Wiley Online Library (2011)  7. Boumal, N., Mishra, B., Absil, P.A., Sepulchre, R.: Manopt, a matlab toolbox for optimization on manifolds. The Journal of Machine Learning Research 15(1), 1455-1459 (2014)  8. Bronstein, A.M., Bronstein, M.M., Kimmel, R.: Numerical geometry of non-rigid  shapes. Springer Science & Business Media (2008)  9. Cosmo, L., Rodol`a, E., Bronstein, M., Torsello, A., Cremers, D., Sahillioglu, Y.: Shrec16: Partial matching of deformable shapes. Proc. 3DOR 2(9), 12 (2016) 10. Dessein, A., Smith, W.A.P., Wilson, R.C., Hancock, E.R.: Symmetry-aware mesh segmentation into uniform overlapping patches. In: Computer Graphics Forum. vol. 36, pp. 95-107. Wiley Online Library (2017)  11. Gallier, J., Quaintance, J.: Notes on diﬀerential geometry and Lie groups. Univer-  sity of Pennsylvania (2018)  12. Ghosh, D., Amenta, N., Kazhdan, M.: Closed-form blending of local symmetries. In: Computer Graphics Forum. vol. 29, pp. 1681-1688. Wiley Online Library (2010) 13. Jiang, W., Xu, K., Cheng, Z.Q., Zhang, H.: Skeleton-based intrinsic symmetry  detection on point clouds. Graphical Models 75(4), 177-188 (2013)  14. Kazhdan, M., Funkhouser, T., Rusinkiewicz, S.: Symmetry descriptors and 3d shape matching. In: Proceedings of the 2004 Eurographics/ACM SIGGRAPH sym- posium on Geometry processing. pp. 115-123. ACM (2004)  15. Kerber, J., Bokeloh, M., Wand, M., Seidel, H.P.: Scalable symmetry detection for urban scenes. In: Computer Graphics Forum. vol. 32, pp. 3-15. Wiley Online Library (2013)  16. Kim, V.G., Lipman, Y., Chen, X., Funkhouser, T.: M¨obius transformations for global intrinsic symmetry analysis. In: Computer Graphics Forum. vol. 29, pp. 1689-1700. Wiley Online Library (2010)  17. Kim, V.G., Lipman, Y., Funkhouser, T.: Blended intrinsic maps. In: ACM Trans-  actions on Graphics (TOG). vol. 30, p. 79. ACM (2011)  18. Korman, S., Litman, R., Avidan, S., Bronstein, A.M.: Probably approximately symmetric: Fast 3d symmetry detection with global guarantees. CoRR abs 1403, 2 (2014)  19. Kovnatsky, A., Bronstein, M.M., Bronstein, A.M., Glashoﬀ, K., Kimmel, R.: Cou- pled quasi-harmonic bases. In: Computer Graphics Forum. vol. 32, pp. 439-448. Wiley Online Library (2013)   Fast and Accurate Intrinsic Symmetry DetectionReferences  1. Absil, P.A., Baker, C.G., Gallivan, K.A.: Trust-region methods on riemannian man-  ifolds. Foundations of Computational Mathematics 7(3), 303-330 (2007)  2. Absil, P.A., Mahony, R., Sepulchre, R.: Optimization algorithms on matrix mani-  folds. Princeton University Press (2009)  3. Anguelov, D., Srinivasan, P., Koller, D., Thrun, S., Rodgers, J., Davis, J.: Scape: shape completion and animation of people. In: ACM transactions on graphics (TOG). vol. 24, pp. 408-416. ACM (2005)  4. Arya, S., Mount, D.M., Netanyahu, N.S., Silverman, R., Wu, A.Y.: An optimal algorithm for approximate nearest neighbor searching fixed dimensions. Journal of the ACM (JACM) 45(6), 891-923 (1998)  5. Berner, A., Bokeloh, M., Wand, M., Schilling, A., Seidel, H.P.: Generalized intrinsic  symmetry detection (2009)  6. Berner, A., Wand, M., Mitra, N.J., Mewes, D., Seidel, H.P.: Shape analysis with subspace symmetries. In: Computer Graphics Forum. vol. 30, pp. 277-286. Wiley Online Library (2011)  7. Boumal, N., Mishra, B., Absil, P.A., Sepulchre, R.: Manopt, a matlab toolbox for optimization on manifolds. The Journal of Machine Learning Research 15(1), 1455-1459 (2014)  8. Bronstein, A.M., Bronstein, M.M., Kimmel, R.: Numerical geometry of non-rigid  shapes. Springer Science & Business Media (2008)  9. Cosmo, L., Rodol`a, E., Bronstein, M., Torsello, A., Cremers, D., Sahillioglu, Y.: Shrec16: Partial matching of deformable shapes. Proc. 3DOR 2(9), 12 (2016) 10. Dessein, A., Smith, W.A.P., Wilson, R.C., Hancock, E.R.: Symmetry-aware mesh segmentation into uniform overlapping patches. In: Computer Graphics Forum. vol. 36, pp. 95-107. Wiley Online Library (2017)  11. Gallier, J., Quaintance, J.: Notes on diﬀerential geometry and Lie groups. Univer-  sity of Pennsylvania (2018)  12. Ghosh, D., Amenta, N., Kazhdan, M.: Closed-form blending of local symmetries. In: Computer Graphics Forum. vol. 29, pp. 1681-1688. Wiley Online Library (2010) 13. Jiang, W., Xu, K., Cheng, Z.Q., Zhang, H.: Skeleton-based intrinsic symmetry  detection on point clouds. Graphical Models 75(4), 177-188 (2013)  14. Kazhdan, M., Funkhouser, T., Rusinkiewicz, S.: Symmetry descriptors and 3d shape matching. In: Proceedings of the 2004 Eurographics/ACM SIGGRAPH sym- posium on Geometry processing. pp. 115-123. ACM (2004)  15. Kerber, J., Bokeloh, M., Wand, M., Seidel, H.P.: Scalable symmetry detection for urban scenes. In: Computer Graphics Forum. vol. 32, pp. 3-15. Wiley Online Library (2013)  16. Kim, V.G., Lipman, Y., Chen, X., Funkhouser, T.: M¨obius transformations for global intrinsic symmetry analysis. In: Computer Graphics Forum. vol. 29, pp. 1689-1700. Wiley Online Library (2010)  17. Kim, V.G., Lipman, Y., Funkhouser, T.: Blended intrinsic maps. In: ACM Trans-  actions on Graphics (TOG). vol. 30, p. 79. ACM (2011)  18. Korman, S., Litman, R., Avidan, S., Bronstein, A.M.: Probably approximately symmetric: Fast 3d symmetry detection with global guarantees. CoRR abs 1403, 2 (2014)  19. Kovnatsky, A., Bronstein, M.M., Bronstein, A.M., Glashoﬀ, K., Kimmel, R.: Cou- pled quasi-harmonic bases. In: Computer Graphics Forum. vol. 32, pp. 439-448. Wiley Online Library (2013)   16  R. Nagar and S. Raman  20. Kurz, C., Wu, X., Wand, M., Thorm¨ahlen, T., Kohli, P., Seidel, H.P.: Symmetry- aware template deformation and fitting. In: Computer Graphics Forum. vol. 33, pp. 205-219. Wiley Online Library (2014)  21. Li, B., Johan, H., Ye, Y., Lu, Y.: Eﬃcient 3d reﬂection symmetry detection: A  view-based approach. Graphical Models 83, 2-14 (2016)  22. Li, C., Wand, M., Wu, X., Seidel, H.P.: Approximate 3d partial symmetry detection using co-occurrence analysis. In: 3D Vision (3DV), 2015 International Conference on. pp. 425-433. IEEE (2015)  23. Lipman, Y., Chen, X., Daubechies, I., Funkhouser, T.: Symmetry factored em- bedding and distance. In: ACM Transactions on Graphics (TOG). vol. 29, p. 103. ACM (2010)  24. Liu, X., Li, S., Liu, R., Wang, J., Wang, H., Cao, J.: Properly constrained or- thonormal functional maps for intrinsic symmetries. Computers & Graphics 46, 198-208 (2015)  25. Liu, Y., Hel-Or, H., Kaplan, C.S., Van Gool, L., et al.: Computational symmetry in computer vision and computer graphics. Foundations and Trends R(cid:13) in Computer Graphics and Vision 5(1-2), 1-195 (2010)  26. Loy, G., Eklundh, J.O.: Detecting symmetry and symmetric constellations of fea- tures. In: European Conference on Computer Vision. pp. 508-521. Springer (2006) 27. Luk´aˇc, M., S`ykora, D., Sunkavalli, K., Shechtman, E., Jamriˇska, O., Carr, N., Pa- jdla, T.: Nautilus: recovering regional symmetry transformations for image editing. ACM Transactions on Graphics (TOG) 36(4), 108 (2017)  28. Martinet, A., Soler, C., Holzschuch, N., Sillion, F.X.: Accurate detection of symme- tries in 3d shapes. ACM Transactions on Graphics (TOG) 25(2), 439-464 (2006) 29. Mitra, N.J., Guibas, L.J., Pauly, M.: Partial and approximate symmetry detection for 3d geometry. ACM Transactions on Graphics (TOG) 25(3), 560-568 (2006) 30. Mitra, N.J., Guibas, L.J., Pauly, M.: Symmetrization. In: ACM Transactions on  Graphics (TOG). vol. 26, p. 63. ACM (2007)  31. Mitra, N.J., Pauly, M.: Symmetry for architectural design. Advances in Architec-  tural Geometry pp. 13-16 (2008)  32. Mitra, N.J., Pauly, M., Wand, M., Ceylan, D.: Symmetry in 3d geometry: Ex- traction and applications. In: Computer Graphics Forum. vol. 32, pp. 1-23. Wiley Online Library (2013)  33. Mitra, N.J., Wand, M., Zhang, H., Cohen-Or, D., Kim, V., Huang, Q.X.: Structure- aware shape processing. In: ACM SIGGRAPH 2014 Courses. p. 13. ACM (2014) 34. Mitra, N.J., Yang, Y., Yan, D., Li, W., Agrawala, M.: Illustrating how mechanical  assemblies work. ACM Transactions on Graphics (2010)  35. O’neill, B.: Semi-Riemannian geometry with applications to relativity, vol. 103.  Academic press (1983)  36. Ovsjanikov, M., Ben-Chen, M., Solomon, J., Butscher, A., Guibas, L.: Functional maps: a ﬂexible representation of maps between shapes. ACM Transactions on Graphics (TOG) 31(4), 30 (2012)  37. Ovsjanikov, M., Sun, J., Guibas, L.: Global intrinsic symmetries of shapes. In: Computer graphics forum. vol. 27, pp. 1341-1348. Wiley Online Library (2008) 38. Panozzo, D., Lipman, Y., Puppo, E., Zorin, D.: Fields on symmetric surfaces. ACM  Transactions on Graphics (TOG) 31(4), 111 (2012)  39. Pinkall, U., Polthier, K.: Computing discrete minimal surfaces and their conjugates.  Experimental mathematics 2(1), 15-36 (1993)  40. Podolak, J., Shilane, P., Golovinskiy, A., Rusinkiewicz, S., Funkhouser, T.: A planar-reﬂective symmetry transform for 3d shapes. ACM Transactions on Graph- ics (TOG) 25(3), 549-559 (2006)   Fast and Accurate Intrinsic Symmetry Detection41. Raviv, D., Bronstein, A.M., Bronstein, M.M., Kimmel, R.: Full and partial sym- metries of non-rigid shapes. International journal of computer vision 89(1), 18-39 (2010)  42. Raviv, D., Bronstein, A.M., Bronstein, M.M., Kimmel, R., Sapiro, G.: Diﬀusion  symmetries of non-rigid shapes. In: Proc. 3DPVT. vol. 2. Citeseer (2010)  43. Reuter, M., Biasotti, S., Giorgi, D., Patan`e, G., Spagnuolo, M.: Discrete laplace- beltrami operators for shape analysis and segmentation. Computers & Graphics 33(3), 381-390 (2009)  44. Shehu, A., Brunton, A., Wuhrer, S., Wand, M.: Characterization of partial intrinsic symmetries. In: European Conference on Computer Vision. pp. 267-282. Springer (2014)  45. Shi, Z., Alliez, P., Desbrun, M., Bao, H., Huang, J.: Symmetry and orbit detection via lie-algebra voting. In: Computer Graphics Forum. vol. 35, pp. 217-227. Wiley Online Library (2016)  46. Sipiran, I., Gregor, R., Schreck, T.: Approximate symmetry detection in partial 3d meshes. In: Computer Graphics Forum. vol. 33, pp. 131-140. Wiley Online Library (2014)  47. Speciale, P., Oswald, M.R., Cohen, A., Pollefeys, M.: A symmetry prior for convex variational 3d reconstruction. In: European Conference on Computer Vision. pp. 313-328. Springer (2016)  48. Sun, J., Ovsjanikov, M., Guibas, L.: A concise and provably informative multi- scale signature based on heat diﬀusion. In: Computer graphics forum. vol. 28, pp. 1383-1392. Wiley Online Library (2009)  49. Sung, M., Kim, V.G., Angst, R., Guibas, L.: Data-driven structural priors for shape  completion. ACM Transactions on Graphics (TOG) 34(6), 175 (2015)  50. Surazhsky, V., Surazhsky, T., Kirsanov, D., Gortler, S.J., Hoppe, H.: Fast exact and approximate geodesics on meshes. In: ACM transactions on graphics (TOG). vol. 24, pp. 553-560. Acm (2005)  51. Thomas, D.M., Natarajan, V.: Detecting symmetry in scalar fields using aug- mented extremum graphs. IEEE transactions on visualization and computer graph- ics 19(12), 2663-2672 (2013)  52. Wang, H., Huang, H.: Group representation of global intrinsic symmetries. In: Computer Graphics Forum. vol. 36, pp. 51-61. Wiley Online Library (2017) 53. Wang, Y., Xu, K., Li, J., Zhang, H., Shamir, A., Liu, L., Cheng, Z., Xiong, Y.: Symmetry hierarchy of man-made objects. In: Computer Graphics Forum. vol. 30, pp. 287-296. Wiley Online Library (2011)  54. Wu, X., Wand, M., Hildebrandt, K., Kohli, P., Seidel, H.P.: Real-time symmetry- preserving deformation. In: Computer Graphics Forum. vol. 33, pp. 229-238. Wiley Online Library (2014)  55. Xiao, C., Jin, L., Nie, Y., Wang, R., Sun, H., Ma, K.L.: Content-aware model resizing with symmetry-preservation. The Visual Computer 31(2), 155-167 (2015) 56. Xu, K., Zhang, H., Jiang, W., Dyer, R., Cheng, Z., Liu, L., Chen, B.: Multi-scale partial intrinsic symmetry detection. ACM Transactions on Graphics (TOG) 31(6), 181 (2012)  57. Xu, K., Zhang, H., Tagliasacchi, A., Liu, L., Li, G., Meng, M., Xiong, Y.: Partial intrinsic reﬂectional symmetry of 3d shapes. In: ACM Transactions on Graphics (TOG). vol. 28, p. 138. ACM (2009)  58. Yoshiyasu, Y., Yoshida, E., Guibas, L.: Symmetry aware embedding for shape  correspondence. Computers & Graphics 60, 9-22 (2016)  59. Zelditch, S.: Eigenfunctions and nodal sets. Surveys in Diﬀerential Geometry 18(1),  237-308 (2013)   18  R. Nagar and S. Raman  60. Zheng, Q., Hao, Z., Huang, H., Xu, K., Zhang, H., Cohen-Or, D., Chen, B.: Skeleton-intrinsic symmetrization of shapes. In: Computer Graphics Forum. vol. 34, pp. 275-286. Wiley Online Library (2015)"}