{"1": "1. Cremers, D., Soatto, S.: Motion competition: A variational approach to piecewise parametric motion segmentation. International Journal of Computer Vision 62(3) (2005) 249-265  2. Ochs, P., Malik, J., Brox, T.: Segmentation of moving objects by long term video analysis. IEEE transactions on pattern analysis and machine intelligence 36(6) (2014) 1187-1200  3. Yang, Y., Sundaramoorthi, G., Soatto, S.: Self-occlusions and disocclusions in causal video object segmentation. In: Proceedings of the IEEE International Con- ference on Computer Vision. (2015) 4408-4416  4. Keuper, M., Andres, B., Brox, T.: Motion trajectory segmentation via minimum cost multicuts. In: Computer Vision (ICCV), 2015 IEEE International Conference on, IEEE (2015) 3271-3279  5. Tokmakov, P., Alahari, K., Schmid, C.: Learning video object segmentation with  visual memory. arXiv preprint arXiv:1704.05737 (2017)  6. Jain, S., Xiong, B., Grauman, K.: Fusionseg: Learning to combine motion and appearance for fully automatic segmention of generic objects in videos. arXiv preprint arXiv:1701.05384 (2017)  7. Wang, J.Y., Adelson, E.H.: Representing moving images with layers. IEEE Trans-  actions on Image Processing 3(5) (1994) 625-638  8. Darrell, T., Pentland, A.: Robust estimation of a multi-layered motion represen- tation. In: Visual Motion, 1991., Proceedings of the IEEE Workshop on, IEEE (1991) 173-178  9. Hsu, S., Anandan, P., Peleg, S.: Accurate computation of optical ﬂow by using layered motion representations. In: Pattern Recognition, 1994. Vol. 1-Conference A: Computer Vision & Image Processing., Proceedings of the 12th IAPR International Conference on. Volume 1., IEEE (1994) 743-746  10. Ayer, S., Sawhney, H.S.: Layered representation of motion video using robust maximum-likelihood estimation of mixture models and mdl encoding. In: Com- puter Vision, 1995. Proceedings., Fifth International Conference on, IEEE (1995) 777-784  11. Bergen, L., Meyer, F.: Motion segmentation and depth ordering based on mor- phological segmentation. In: European Conference on Computer Vision, Springer (1998) 531-547  12. Jojic, N., Frey, B.J.: Learning ﬂexible sprites in video layers. In: Computer Vi- sion and Pattern Recognition, 2001. CVPR 2001. Proceedings of the 2001 IEEE Computer Society Conference on. Volume 1., IEEE (2001) I-I  13. Smith, P., Drummond, T., Cipolla, R.: Layered motion segmentation and depth ordering by tracking edges. IEEE Transactions on Pattern Analysis and Machine Intelligence 26(4) (2004) 479-494  14. Kumar, M.P., Torr, P.H., Zisserman, A.: Learning layered motion segmentations  of video. International Journal of Computer Vision 76(3) (2008) 301-319  15. Schoenemann, T., Cremers, D.: A coding-cost framework for super-resolution mo- tion layer decomposition. IEEE Transactions on Image Processing 21(3) (2012) 1097-1110  16. Jackson, J.D., Yezzi, A.J., Soatto, S.: Dynamic shape and appearance modeling via moving and deforming layers. International Journal of Computer Vision 79(1) (2008) 71-84   Extending Layered Models to 3D MotionReferences  1. Cremers, D., Soatto, S.: Motion competition: A variational approach to piecewise parametric motion segmentation. International Journal of Computer Vision 62(3) (2005) 249-265  2. Ochs, P., Malik, J., Brox, T.: Segmentation of moving objects by long term video analysis. IEEE transactions on pattern analysis and machine intelligence 36(6) (2014) 1187-1200  3. Yang, Y., Sundaramoorthi, G., Soatto, S.: Self-occlusions and disocclusions in causal video object segmentation. In: Proceedings of the IEEE International Con- ference on Computer Vision. (2015) 4408-4416  4. Keuper, M., Andres, B., Brox, T.: Motion trajectory segmentation via minimum cost multicuts. In: Computer Vision (ICCV), 2015 IEEE International Conference on, IEEE (2015) 3271-3279  5. Tokmakov, P., Alahari, K., Schmid, C.: Learning video object segmentation with  visual memory. arXiv preprint arXiv:1704.05737 (2017)  6. Jain, S., Xiong, B., Grauman, K.: Fusionseg: Learning to combine motion and appearance for fully automatic segmention of generic objects in videos. arXiv preprint arXiv:1701.05384 (2017)  7. Wang, J.Y., Adelson, E.H.: Representing moving images with layers. IEEE Trans-  actions on Image Processing 3(5) (1994) 625-638  8. Darrell, T., Pentland, A.: Robust estimation of a multi-layered motion represen- tation. In: Visual Motion, 1991., Proceedings of the IEEE Workshop on, IEEE (1991) 173-178  9. Hsu, S., Anandan, P., Peleg, S.: Accurate computation of optical ﬂow by using layered motion representations. In: Pattern Recognition, 1994. Vol. 1-Conference A: Computer Vision & Image Processing., Proceedings of the 12th IAPR International Conference on. Volume 1., IEEE (1994) 743-746  10. Ayer, S., Sawhney, H.S.: Layered representation of motion video using robust maximum-likelihood estimation of mixture models and mdl encoding. In: Com- puter Vision, 1995. Proceedings., Fifth International Conference on, IEEE (1995) 777-784  11. Bergen, L., Meyer, F.: Motion segmentation and depth ordering based on mor- phological segmentation. In: European Conference on Computer Vision, Springer (1998) 531-547  12. Jojic, N., Frey, B.J.: Learning ﬂexible sprites in video layers. In: Computer Vi- sion and Pattern Recognition, 2001. CVPR 2001. Proceedings of the 2001 IEEE Computer Society Conference on. Volume 1., IEEE (2001) I-I  13. Smith, P., Drummond, T., Cipolla, R.: Layered motion segmentation and depth ordering by tracking edges. IEEE Transactions on Pattern Analysis and Machine Intelligence 26(4) (2004) 479-494  14. Kumar, M.P., Torr, P.H., Zisserman, A.: Learning layered motion segmentations  of video. International Journal of Computer Vision 76(3) (2008) 301-319  15. Schoenemann, T., Cremers, D.: A coding-cost framework for super-resolution mo- tion layer decomposition. IEEE Transactions on Image Processing 21(3) (2012) 1097-1110  16. Jackson, J.D., Yezzi, A.J., Soatto, S.: Dynamic shape and appearance modeling via moving and deforming layers. International Journal of Computer Vision 79(1) (2008) 71-84   16  D. Lao and G. Sundaramoorthi  17. Sun, D., Sudderth, E.B., Black, M.J.: Layered segmentation and optical ﬂow es- timation over time. In: Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on, IEEE (2012) 1768-1775  18. Sun, D., Wulﬀ, J., Sudderth, E.B., Pfister, H., Black, M.J.: A fully-connected layered model of foreground and background ﬂow. In: Computer Vision and Pattern Recognition (CVPR), 2013 IEEE Conference on, IEEE (2013) 2451-2458  19. Taylor, B., Karasev, V., Soatto, S.: Causal video object segmentation from persis- tence of occlusions. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 4268-4276  20. Horn, B.K., Schunck, B.G.: Determining optical ﬂow. Artificial intelligence 17(1-3)  (1981) 185-203  21. Black, M.J., Anandan, P.: The robust estimation of multiple motions: Parametric and piecewise-smooth ﬂow fields. Computer vision and image understanding 63(1) (1996) 75-104  22. Brox, T., Bruhn, A., Papenberg, N., Weickert, J.: High accuracy optical ﬂow estimation based on a theory for warping. In: European conference on computer vision, Springer (2004) 25-36  23. Sun, D., Roth, S., Black, M.J.: Secrets of optical ﬂow estimation and their princi- ples. In: Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Confer- ence on, IEEE (2010) 2432-2439  24. Ilg, E., Mayer, N., Saikia, T., Keuper, M., Dosovitskiy, A., Brox, T.: Flownet 2.0: Evolution of optical ﬂow estimation with deep networks. In: IEEE Conference on Computer Vision and Pattern Recognition (CVPR). Volume 2. (2017)  25. Mumford, D., Shah, J.: Optimal approximations by piecewise smooth functions and associated variational problems. Communications on pure and applied math- ematics 42(5) (1989) 577-685  26. Tsai, A., Yezzi, A., Willsky, A.S.: Curve evolution implementation of the mumford- shah functional for image segmentation, denoising, interpolation, and magnifica- tion. IEEE transactions on Image Processing 10(8) (2001) 1169-1186  27. Vese, L.A., Chan, T.F.: A multiphase level set framework for image segmentation using the mumford and shah model. International journal of computer vision 50(3) (2002) 271-293  28. Pock, T., Cremers, D., Bischof, H., Chambolle, A.: An algorithm for minimizing the mumford-shah functional. In: Computer Vision, 2009 IEEE 12th International Conference on, IEEE (2009) 1133-1140  29. Sun, D., Liu, C., Pfister, H.: Local layering for joint motion estimation and occlu-  sion detection. (2014)  30. Sevilla-Lara, L., Sun, D., Jampani, V., Black, M.J.: Optical ﬂow with semantic In: Proceedings of the IEEE Conference on  segmentation and localized layers. Computer Vision and Pattern Recognition. (2016) 3889-3898  31. Yang, Y., Sundaramoorthi, G.: Modeling self-occlusions in dynamic shape and In: Proceedings of the IEEE International Conference on  appearance tracking. Computer Vision. (2013) 201-208  32. Zhu, S.C., Yuille, A.: Region competition: Unifying snakes, region growing, and bayes/mdl for multiband image segmentation. IEEE transactions on pattern anal- ysis and machine intelligence 18(9) (1996) 884-900  33. Yang, Y., Sundaramoorthi, G.: Shape tracking with occlusions via coarse-to-fine region-based sobolev descent. IEEE transactions on pattern analysis and machine intelligence 37(5) (2015) 1053-1066   Extending Layered Models to 3D Motion34. Sundaramoorthi, G., Yezzi, A., Mennucci, A.: Coarse-to-fine segmentation and tracking using sobolev active contours. IEEE Trans. Pattern Anal. Mach. Intell. 30(5) (2008) 851-864  35. Doll´ar, P., Zitnick, C.L.: Fast edge detection using structured forests. IEEE trans- actions on pattern analysis and machine intelligence 37(8) (2015) 1558-1570 36. Liu, C., Freeman, W.T., Adelson, E.H., Weiss, Y.: Human-assisted motion anno- tation. In: Computer Vision and Pattern Recognition, 2008. CVPR 2008. IEEE Conference on, IEEE (2008) 1-8  37. Perazzi, F., Pont-Tuset, J., McWilliams, B., Van Gool, L., Gross, M., Sorkine- Hornung, A.: A benchmark dataset and evaluation methodology for video object segmentation. In: Computer Vision and Pattern Recognition. (2016)  38. Wehrwein, S., Szeliski, R.: Video segmentation with background motion models.  In: British Machine Vision Conference. (2017)  39. Ayvaci, A., Soatto, S.: Detachable object detection: Segmentation and depth order- ing from short-baseline video. IEEE transactions on pattern analysis and machine intelligence 34(10) (2012) 1942-1951"}