{"1": "1. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 3431-3440  2. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con-  ditional adversarial networks. arXiv preprint arXiv:1611.07004 (2016)  3. Karacan, L., Akata, Z., Erdem, A., Erdem, E.: Learning to generate images of out- door scenes from attributes and semantic layouts. arXiv preprint arXiv:1612.00215 (2016)  4. Sangkloy, P., Lu, J., Fang, C., Yu, F., Hays, J.: Scribbler: Controlling deep image  synthesis with sketch and color. arXiv preprint arXiv:1612.00835 (2016)  5. Dong, C., Loy, C.C., He, K., Tang, X.: Image super-resolution using deep convo- lutional networks. IEEE transactions on pattern analysis and machine intelligence 38(2) (2016) 295-307  6. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., In: Advances in neural  Courville, A., Bengio, Y.: Generative adversarial nets. information processing systems. (2014) 2672-2680  7. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation using cycle-consistent adversarial networks. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  8. Kim, T., Cha, M., Kim, H., Lee, J.K., Kim, J.: Learning to discover cross-domain relations with generative adversarial networks. In: Proceedings of the 34th Inter- national Conference on Machine Learning, ICML 2017, Sydney, NSW, Australia, 6-11 August 2017. (2017) 1857-1865  9. Yi, Z., Zhang, H., Tan, P., Gong, M.: Dualgan: Unsupervised dual learning for image-to-image translation. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  10. Taigman, Y., Polyak, A., Wolf, L.: Unsupervised cross-domain image generation.  CoRR abs/1611.02200 (2016)  11. Benaim, S., Wolf, L.: One-sided unsupervised domain mapping. In: Advances in Neural Information Processing Systems 30: Annual Conference on Neural Informa- tion Processing Systems 2017, 4-9 December 2017, Long Beach, CA, USA. (2017) 752-762  12. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on, IEEE (2009) 248-255  13. Denton, E.L., Chintala, S., Fergus, R., et al.: Deep generative image models using a laplacian pyramid of adversarial networks. In: Advances in neural information processing systems. (2015) 1486-1494 14. Radford, A., Metz, L., Chintala, S.:  Unsupervised representation learn- arXiv preprint  ing with deep convolutional generative adversarial networks. arXiv:1511.06434 (2015)  15. Wang, C., Wang, C., Xu, C., Tao, D.: Tag disentangled generative adversarial network for object image re-rendering. In: Proceedings of the Twenty-Sixth Inter- national Joint Conference on Artificial Intelligence, IJCAI-17. (2017) 2901-2907  16. Im, D.J., Kim, C.D., Jiang, H., Memisevic, R.: Generating images with recurrent  adversarial networks. arXiv preprint arXiv:1602.05110 (2016)  17. Kwak, H., Zhang, B.T.: Generating images part by part with composite generative  adversarial networks. arXiv preprint arXiv:1607.05387 (2016)   Attention-GAN for Object Transfiguration in Wild ImagesReferences  1. Long, J., Shelhamer, E., Darrell, T.: Fully convolutional networks for semantic segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 3431-3440  2. Isola, P., Zhu, J.Y., Zhou, T., Efros, A.A.: Image-to-image translation with con-  ditional adversarial networks. arXiv preprint arXiv:1611.07004 (2016)  3. Karacan, L., Akata, Z., Erdem, A., Erdem, E.: Learning to generate images of out- door scenes from attributes and semantic layouts. arXiv preprint arXiv:1612.00215 (2016)  4. Sangkloy, P., Lu, J., Fang, C., Yu, F., Hays, J.: Scribbler: Controlling deep image  synthesis with sketch and color. arXiv preprint arXiv:1612.00835 (2016)  5. Dong, C., Loy, C.C., He, K., Tang, X.: Image super-resolution using deep convo- lutional networks. IEEE transactions on pattern analysis and machine intelligence 38(2) (2016) 295-307  6. Goodfellow, I., Pouget-Abadie, J., Mirza, M., Xu, B., Warde-Farley, D., Ozair, S., In: Advances in neural  Courville, A., Bengio, Y.: Generative adversarial nets. information processing systems. (2014) 2672-2680  7. Zhu, J.Y., Park, T., Isola, P., Efros, A.A.: Unpaired image-to-image translation using cycle-consistent adversarial networks. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  8. Kim, T., Cha, M., Kim, H., Lee, J.K., Kim, J.: Learning to discover cross-domain relations with generative adversarial networks. In: Proceedings of the 34th Inter- national Conference on Machine Learning, ICML 2017, Sydney, NSW, Australia, 6-11 August 2017. (2017) 1857-1865  9. Yi, Z., Zhang, H., Tan, P., Gong, M.: Dualgan: Unsupervised dual learning for image-to-image translation. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  10. Taigman, Y., Polyak, A., Wolf, L.: Unsupervised cross-domain image generation.  CoRR abs/1611.02200 (2016)  11. Benaim, S., Wolf, L.: One-sided unsupervised domain mapping. In: Advances in Neural Information Processing Systems 30: Annual Conference on Neural Informa- tion Processing Systems 2017, 4-9 December 2017, Long Beach, CA, USA. (2017) 752-762  12. Deng, J., Dong, W., Socher, R., Li, L.J., Li, K., Fei-Fei, L.: Imagenet: A large-scale hierarchical image database. In: Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on, IEEE (2009) 248-255  13. Denton, E.L., Chintala, S., Fergus, R., et al.: Deep generative image models using a laplacian pyramid of adversarial networks. In: Advances in neural information processing systems. (2015) 1486-1494 14. Radford, A., Metz, L., Chintala, S.:  Unsupervised representation learn- arXiv preprint  ing with deep convolutional generative adversarial networks. arXiv:1511.06434 (2015)  15. Wang, C., Wang, C., Xu, C., Tao, D.: Tag disentangled generative adversarial network for object image re-rendering. In: Proceedings of the Twenty-Sixth Inter- national Joint Conference on Artificial Intelligence, IJCAI-17. (2017) 2901-2907  16. Im, D.J., Kim, C.D., Jiang, H., Memisevic, R.: Generating images with recurrent  adversarial networks. arXiv preprint arXiv:1602.05110 (2016)  17. Kwak, H., Zhang, B.T.: Generating images part by part with composite generative  adversarial networks. arXiv preprint arXiv:1607.05387 (2016)   16  X. Chen et al.  18. Yang, J., Kannan, A., Batra, D., Parikh, D.: Lr-gan: Layered recursive generative In: 5th International Conference on  adversarial networks for image generation. Learning Representations (ICLR). (2017)  19. Wang, C., Xu, C., Wang, C., Tao, D.: Perceptual adversarial networks for image- to-image transformation. IEEE Transactions on Image Processing 27(8) (2018) 4066-4079  20. Balcan, M., Weinberger, K.Q., eds.: Proceedings of the 33nd International Con- ference on Machine Learning, ICML 2016, New York City, NY, USA, June 19-24, 2016. Volume 48 of JMLR Workshop and Conference Proceedings., JMLR.org (2016)  21. Zhang, H., Xu, T., Li, H., Zhang, S., Wang, X., Huang, X., Metaxas, D.N.: Stack- gan: Text to photo-realistic image synthesis with stacked generative adversarial networks. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)  22. Liang, X., Zhang, H., Xing, E.P.: Generative semantic manipulation with contrast-  ing gan. arXiv preprint arXiv:1708.00315 (2017)  23. Rensink, R.A.: The dynamic representation of scenes. Visual cognition 7(1-3)  (2000) 17-42  24. Mnih, V., Heess, N., Graves, A., et al.: Recurrent models of visual attention. In:  Advances in neural information processing systems. (2014) 2204-2212  25. Zhou, B., Khosla, A., Lapedriza, A., Oliva, A., Torralba, A.: Learning deep fea- tures for discriminative localization. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 2921-2929  26. Xiao, T., Xu, Y., Yang, K., Zhang, J., Peng, Y., Zhang, Z.: The application of two-level attention models in deep convolutional neural network for fine-grained image classification. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2015) 842-850  27. Xu, K., Ba, J., Kiros, R., Cho, K., Courville, A., Salakhudinov, R., Zemel, R., Bengio, Y.: Show, attend and tell: Neural image caption generation with visual attention. In: International Conference on Machine Learning. (2015) 2048-2057 28. Xu, H., Saenko, K.: Ask, attend and answer: Exploring question-guided spatial attention for visual question answering. In: European Conference on Computer Vision, Springer (2016) 451-466  29. Chen, L.C., Yang, Y., Wang, J., Xu, W., Yuille, A.L.: Attention to scale: Scale- aware semantic image segmentation. In: Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. (2016) 3640-3649  30. Bahdanau, D., Cho, K., Bengio, Y.: Neural machine translation by jointly learning to align and translate. In: 3th International Conference on Learning Representa- tions (ICLR). (April 2015)  31. Yao, L., Torabi, A., Cho, K., Ballas, N., Pal, C., Larochelle, H., Courville, A.: Describing videos by exploiting temporal structure. In: Proceedings of the IEEE international conference on computer vision. (2015) 4507-4515  32. Gregor, K., Danihelka, I., Graves, A., Rezende, D., Wierstra, D.: Draw: A recurrent neural network for image generation. In Bach, F., Blei, D., eds.: Proceedings of the 32nd International Conference on Machine Learning. Volume 37 of Proceedings of Machine Learning Research., Lille, France, PMLR (07-09 Jul 2015) 1462-1471 33. Mao, X., Li, Q., Xie, H., Lau, R.Y., Wang, Z., Paul Smolley, S.: Least squares gen- erative adversarial networks. In: The IEEE International Conference on Computer Vision (ICCV). (Oct 2017)   Attention-GAN for Object Transfiguration in Wild Images34. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Doll´ar, P., Zitnick, C.L.: Microsoft coco: Common objects in context. In: European conference on computer vision, Springer (2014) 740-755  35. Kingma, D., Ba, J.: Adam: A method for stochastic optimization. arXiv preprint  arXiv:1412.6980 (2014)  36. Shrivastava, A., Pfister, T., Tuzel, O., Susskind, J., Wang, W., Webb, R.: Learning from simulated and unsupervised images through adversarial training. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017)  37. Johnson, J., Alahi, A., Fei-Fei, L.: Perceptual losses for real-time style transfer and super-resolution. In: European Conference on Computer Vision, Springer (2016) 694-711  38. Li, C., Wand, M.: Precomputed real-time texture synthesis with markovian gener- ative adversarial networks. In: European Conference on Computer Vision, Springer (2016) 702-716  39. Chen, Q., Koltun, V.: Photographic image synthesis with cascaded refinement networks. In: The IEEE International Conference on Computer Vision (ICCV). Volume 1. (2017)  40. Wang, T.C., Liu, M.Y., Zhu, J.Y., Tao, A., Kautz, J., Catanzaro, B.: High- resolution image synthesis and semantic manipulation with conditional gans. arXiv preprint arXiv:1711.11585 (2017)  41. Han, X., Wu, Z., Wu, Z., Yu, R., Davis, L.S.: Viton: An image-based virtual try-on network. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (June 2018)  42. Upchurch, P., Gardner, J., Pleiss, G., Pless, R., Snavely, N., Bala, K., Weinberger, K.: Deep feature interpolation for image content changes. In: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). (July 2017)"}