{"1": "(2001)  1. Kak, A.C., Slaney, M.: Principles of computerized tomographic imaging. SIAM  2. Herman, G.T.: Fundamentals of computerized tomography: image reconstruction  from projections. Springer Science & Business Media (2009)  3. Clinthorne, N.H., Pan, T.S., Chiao, P.C., Rogers, W., Stamos, J.: Preconditioning methods for improved convergence rates in iterative reconstructions. IEEE Trans. Med. Img. 12(1) (1993)  4. Elbakri, I.A., Fessler, J.A.: Eﬃcient and accurate likelihood for iterative image reconstruction in x-ray computed tomography. In: Medical Imaging, International Society for Optics and Photonics (2003) 1839-1850  5. Xu, J., Tsui, B.M.: Quantifying the importance of the statistical assumption in statistical x-ray ct image reconstruction. IEEE Trans. Med. Img. 33(1) (2014) 6. Sidky, E.Y., Jørgensen, J.H., Pan, X.: Convex optimization problem prototyp- ing for image reconstruction in computed tomography with the chambolle-pock algorithm. Physics in medicine and biology 57(10) (2012) 3065  7. Rudin, L.I., Osher, S., Fatemi, E.: Nonlinear total variation based noise removal  algorithms. Physica D: Nonlinear Phenomena 60(1) (1992) 259-268  8. Boyd, S., Parikh, N., Chu, E., Peleato, B., Eckstein, J.: Distributed optimiza- tion and statistical learning via the alternating direction method of multipliers. in Machine Learning (2011) Foundations and Trends R (cid:13)  9. Parikh, N., Boyd, S.: Proximal algorithms. Foundations and Trends in Optimiza-  tion (2013)  10. Zang, G., Idoughi, R., Tao, R., Lubineau, G., Wonka, P., Heidrich, W.: Space-time tomography for continuously deforming objects. ACM Trans. Graph. 37(4) (2018) 100  11. Mory, C., Zhang, B., Auvray, V., Grass, M., Schafer, D., Peyrin, F., Rit, S., Douek, P., Boussel, L.: Ecg-gated c-arm computed tomography using l1 regularization. In: EUSIPCO, IEEE (2012)  12. Rit, S., Oliva, M.V., Brousmiche, S., Labarbe, R., Sarrut, D., Sharp, G.C.: The reconstruction toolkit (rtk), an open-source cone-beam ct reconstruction toolkit based on the insight toolkit (itk). In: Journal of Physics: Conference Series. (2014) 13. Andersen, A., Kak, A.C.: Simultaneous algebraic reconstruction technique (sart):  a superior implementation of the art algorithm. Ultrasonic imaging (1984)  14. Andersen, A.H.: Algebraic reconstruction in ct from limited views. IEEE Trans.  Med. Img. (1989)  15. Mueller, K., Yagel, R., Wheller, J.J.: Fast implementations of algebraic methods for three-dimensional reconstruction from cone-beam data. IEEE Trans. Med. Img. 18(6) (1999)  16. Mueller, K., Yagel, R.: Rapid 3-d cone-beam reconstruction with the simultane- ous algebraic reconstruction technique (sart) using 2-d texture mapping hardware. IEEE Trans. Med. Img. (2000)  17. Feldkamp, L., Davis, L., Kress, J.: Practical cone-beam algorithm. Journal of the  Optical Society of America 1(6) (1984) 612-619  18. Pan, X., Sidky, E.Y., Vannier, M.: Why do commercial ct scanners still employ traditional, filtered back-projection for image reconstruction? Inverse problems 25(12) (2009) 123009  19. Gordon, R., Bender, R., Herman, G.T.: Algebraic reconstruction techniques (art) for three-dimensional electron microscopy and x-ray photography. Journal of the- oretical Biology 29(3) (1970) 471-481   Super-Resolution and Sparse View CT ReconstructionReferences  (2001)  1. Kak, A.C., Slaney, M.: Principles of computerized tomographic imaging. SIAM  2. Herman, G.T.: Fundamentals of computerized tomography: image reconstruction  from projections. Springer Science & Business Media (2009)  3. Clinthorne, N.H., Pan, T.S., Chiao, P.C., Rogers, W., Stamos, J.: Preconditioning methods for improved convergence rates in iterative reconstructions. IEEE Trans. Med. Img. 12(1) (1993)  4. Elbakri, I.A., Fessler, J.A.: Eﬃcient and accurate likelihood for iterative image reconstruction in x-ray computed tomography. In: Medical Imaging, International Society for Optics and Photonics (2003) 1839-1850  5. Xu, J., Tsui, B.M.: Quantifying the importance of the statistical assumption in statistical x-ray ct image reconstruction. IEEE Trans. Med. Img. 33(1) (2014) 6. Sidky, E.Y., Jørgensen, J.H., Pan, X.: Convex optimization problem prototyp- ing for image reconstruction in computed tomography with the chambolle-pock algorithm. Physics in medicine and biology 57(10) (2012) 3065  7. Rudin, L.I., Osher, S., Fatemi, E.: Nonlinear total variation based noise removal  algorithms. Physica D: Nonlinear Phenomena 60(1) (1992) 259-268  8. Boyd, S., Parikh, N., Chu, E., Peleato, B., Eckstein, J.: Distributed optimiza- tion and statistical learning via the alternating direction method of multipliers. in Machine Learning (2011) Foundations and Trends R (cid:13)  9. Parikh, N., Boyd, S.: Proximal algorithms. Foundations and Trends in Optimiza-  tion (2013)  10. Zang, G., Idoughi, R., Tao, R., Lubineau, G., Wonka, P., Heidrich, W.: Space-time tomography for continuously deforming objects. ACM Trans. Graph. 37(4) (2018) 100  11. Mory, C., Zhang, B., Auvray, V., Grass, M., Schafer, D., Peyrin, F., Rit, S., Douek, P., Boussel, L.: Ecg-gated c-arm computed tomography using l1 regularization. In: EUSIPCO, IEEE (2012)  12. Rit, S., Oliva, M.V., Brousmiche, S., Labarbe, R., Sarrut, D., Sharp, G.C.: The reconstruction toolkit (rtk), an open-source cone-beam ct reconstruction toolkit based on the insight toolkit (itk). In: Journal of Physics: Conference Series. (2014) 13. Andersen, A., Kak, A.C.: Simultaneous algebraic reconstruction technique (sart):  a superior implementation of the art algorithm. Ultrasonic imaging (1984)  14. Andersen, A.H.: Algebraic reconstruction in ct from limited views. IEEE Trans.  Med. Img. (1989)  15. Mueller, K., Yagel, R., Wheller, J.J.: Fast implementations of algebraic methods for three-dimensional reconstruction from cone-beam data. IEEE Trans. Med. Img. 18(6) (1999)  16. Mueller, K., Yagel, R.: Rapid 3-d cone-beam reconstruction with the simultane- ous algebraic reconstruction technique (sart) using 2-d texture mapping hardware. IEEE Trans. Med. Img. (2000)  17. Feldkamp, L., Davis, L., Kress, J.: Practical cone-beam algorithm. Journal of the  Optical Society of America 1(6) (1984) 612-619  18. Pan, X., Sidky, E.Y., Vannier, M.: Why do commercial ct scanners still employ traditional, filtered back-projection for image reconstruction? Inverse problems 25(12) (2009) 123009  19. Gordon, R., Bender, R., Herman, G.T.: Algebraic reconstruction techniques (art) for three-dimensional electron microscopy and x-ray photography. Journal of the- oretical Biology 29(3) (1970) 471-481   16  Guangming Zang et al  20. Lent, A.: A convergent algorithm for maximum entropy image restoration, with a  medical x-ray application. Image Analysis and Evaluation (1977) 249-257  21. Shepp, L.A., Vardi, Y.: Maximum likelihood reconstruction for emission tomogra-  phy. IEEE Trans. Med. Img. 1(2) (1982) 113-122  22. Censor, Y.: Finite series-expansion reconstruction methods. Proceedings of the  23. Bauschke, H.H., Combettes, P.L.: Convex analysis and monotone operator theory  in Hilbert spaces. Springer Science & Business Media (2011)  24. Combettes, P.L., Pesquet, J.C.: Proximal splitting methods in signal processing.  In: Fixed-point algorithms for inverse problems in science and engineering  25. Nocedal, J., Wright, S.: Numerical optimization. Springer Science & Business  IEEE (1983)  Media (2006)  26. Chambolle, A., Pock, T.: A first-order primal-dual algorithm for convex problems with applications to imaging. Journal of Mathematical Imaging and Vision (2011) 27. Ramani, S., Fessler, J.A.: A splitting-based iterative algorithm for accelerated  statistical x-ray ct reconstruction. IEEE Trans. Med. Img. (2012)  28. Nien, H., Fessler, J.: Fast x-ray ct image reconstruction using a linearized aug- mented lagrangian method with ordered subsets. IEEE Trans. Med. Img. (2015) 29. Esser, E., Zhang, X., Chan, T.F.: A general framework for a class of first order primal-dual algorithms for convex optimization in imaging science. SIAM Journal on Imaging Sciences 3(4) (2010) 1015-1046  30. Erdogan, H., Fessler, J.A.: Ordered subsets algorithms for transmission tomogra-  phy. Physics in medicine and biology 44(11) (1999) 2835  31. Beck, A., Teboulle, M.: A fast iterative shrinkage-thresholding algorithm for linear  inverse problems. SIAM Journal on Imaging Sciences (2009)  32. Adler, J., ¨Oktem, O.: Learned primal-dual reconstruction. IEEE Trans. Med. Img.  37(6) (2018)  33. Bai, T., Yan, H., Jia, X., Jiang, S., Wang, G., Mou, X.: Z-index parameterization for volumetric ct image reconstruction via 3-d dictionary learning. IEEE Trans. Med. Img. 36(12) (2017)  34. Chen, H., Zhang, Y., Chen, Y., Zhang, J., Zhang, W., Sun, H., Lv, Y., Liao, P., Zhou, J., Wang, G.: Learn: Learned experts assessment-based reconstruction network for sparse-data ct. IEEE Trans. Med. Img. (2018)  35. Wu, D., Kim, K., El Fakhri, G., Li, Q.: Iterative low-dose ct reconstruction with priors trained by artificial neural network. IEEE Trans. Med. Img. 36(12) (2017) 36. Klukowska, J., Davidi, R., Herman, G.T.: Snark09-a software package for recon- struction of 2d images from 1d projections. Computer methods and programs in biomedicine 110(3) (2013) 424-440  37. Palenstijn, W.J., Batenburg, K.J., Sijbers, J.: The astra tomography toolbox. In: 13th International Conference on Computational and Mathematical Methods in Science and Engineering, CMMSE. Volume 2013. (2013)  38. Boyd, S., Vandenberghe, L.: Convex optimization. Cambridge university press  39. Bj¨orck, A.: Numerical methods for least squares problems. SIAM Journal on  (2004)  Imaging Sciences (1996)  40. Aly, M., Zang, G., Heidrich, W., Wonka, P.: Trex: A tomography reconstruction proximal framework for robust sparse view x-ray applications. arXiv preprint arXiv:1606.03601 (2016)  41. Golub, G.H., Van Loan, C.F.: Matrix computations. third (1996) 42. Boyd, S.: Ee364b: Convex optimization ii. Course Notes, http://www. stanford.  edu/class/ee364b (2012)   Super-Resolution and Sparse View CT Reconstruction43. Weickert, J.: Anisotropic diﬀusion in image processing. Volume 1. Teubner  Stuttgart (1998)  44. Lefkimmiatis, S., Roussos, A., Unser, M., Maragos, P.: Convex generalizations of total variation based on the structure tensor with applications to inverse problems. In: International Conference on Scale Space and Variational Methods in Computer Vision. (2013)  45. Lefkimmiatis, S., Roussos, A., Maragos, P., Unser, M.: Structure tensor total  variation. SIAM Journal on Imaging Sciences (2015)  46. Lefkimmiatis, S., Ward, J.P., Unser, M.: Hessian schatten-norm regularization for  linear inverse problems. IEEE Trans. Image Proc. 22(5) (2013)  47. Gregson, J., Krimerman, M., Hullin, M.B., Heidrich, W.: Stochastic tomography and its applications in 3d imaging of mixing ﬂuids. ACM Trans. Graph. (2012) 48. Forsyth, D., Ponce, J.: Computer Vision: A modern approach. Prentice Hall (2002)"}